Public Types | Public Member Functions | Public Attributes | Protected Attributes | List of all members
CArgsRhinoGetPlane Class Reference
RhinoGet
Input to the RhinoGetPlane() and RhinoGetRectangle() functions. More...
#include <rhinoSdkGetPlane.h>
 Inheritance diagram for CArgsRhinoGetPlane:
 Public Types
enum  | { mode_corners, mode_3point, mode_vertical, mode_center }
enum  | { corner_arc = 0, corner_conic = 1, corner_chamfer = 2 }
enum  | { plane_type = 0, box_type = 1, plane_type_ex = 2 }
 Public Member Functions
CArgsRhinoGetPlane ()
CArgsRhinoGetPlane (const CArgsRhinoGetPlane &src)
virtual  | ~CArgsRhinoGetPlane ()
void  | AcceptNothing (bool bAcceptNothing=true)
Like CRhinoGet::AcceptNothing(). More...
virtual void  | AddExtraOptions (CRhinoGetPoint &gp)
Allows for adding extra command options during RhinoGetRectangle. More...
BOOL  | Allow3Point ()
BOOL  | AllowCenter ()
BOOL  | AllowCorners ()
BOOL  | AllowDeformable () const
BOOL  | AllowForceAspectRatio ()
BOOL  | AllowRounded ()
BOOL  | AllowVertical ()
int  | ArgsType () const
return type of args class plane or derived box More...
int  | CornerMode ()
double  | CornerRadius ()
double  | CornerRho ()
int  | CurrentMode ()
BOOL  | Deformable () const
bool  | DrawPicture ()
std::function< void(const ON_3dPoint[4])>  | DynamicRectangleCallback () const
virtual bool  | ExtraOptionsAtStart () const
ON_Color  | FeedbackColor () const
color used to draw feedback line More...
int  | FirstDirectionCount () const
number of faces in first direction More...
int  | FirstDirectionMinCount () const
const CRhinoCommandOptionName &  | FirstMeshDensityDirectionPrompt () const
prompt for number of faces in first direction More...
const ON_3dPoint &  | FirstPoint () const
const wchar_t *  | FirstPointPrompt3Point () const
prompt when getting first corner More...
const wchar_t *  | FirstPointPromptCenter () const
prompt when getting center in center mode More...
const wchar_t *  | FirstPointPromptCorners () const
prompt when getting first corner More...
const wchar_t *  | FirstPointPromptVertical () const
prompt when getting first corner More...
double  | ForcedAspectRatio ()
virtual void  | HandleExtraOptions (const CRhinoGetPoint &gp)
BOOL  | HaveFirstPoint () const
BOOL  | HavePlane () const
BOOL  | HaveSecondPoint () const
BOOL  | HaveThirdPoint () const
double  | Length ()
CArgsRhinoGetPlane &  | operator= (const CArgsRhinoGetPlane &src)
const wchar_t *  | PictureFileName () const
const ON_Plane &  | Plane () const
bool  | PromptForMeshDensity () const
BOOL  | Rounded ()
int  | SecondDirectionCount () const
number of faces in second direction More...
int  | SecondDirectionMinCount () const
const CRhinoCommandOptionName &  | SecondMeshDensityDirectionPrompt () const
prompt for number of faces in second direction More...
const ON_3dPoint &  | SecondPoint () const
const wchar_t *  | SecondPointPrompt3Point () const
prompt when getting second point in 3 point mode More...
const wchar_t *  | SecondPointPromptCenter () const
prompt when getting corner in center mode More...
const wchar_t *  | SecondPointPromptCorners () const
prompt when getting opposite corner More...
const wchar_t *  | SecondPointPromptVertical () const
prompt when getting second point in vertical mode More...
void  | SetAllow3Point (BOOL allow=TRUE)
void  | SetAllowCenter (BOOL allow=TRUE)
void  | SetAllowCorners (BOOL allow=TRUE)
void  | SetAllowDeformable (BOOL b=TRUE)
void  | SetAllowForceAspectRatio (BOOL allow=TRUE)
void  | SetAllowRounded (BOOL allow=FALSE)
void  | SetAllowVertical (BOOL allow=TRUE)
void  | SetCornerMode (int mode=corner_arc)
void  | SetCornerRadius (double radius)
void  | SetCornerRho (double rho)
void  | SetCurrentMode (int mode=mode_corners)
void  | SetDeformable (BOOL bDeformable=TRUE)
void  | SetDynamicRectangleCallback (std::function< void(const ON_3dPoint[4])> callback)
void  | SetFeedbackColor (COLORREF color)
void  | SetFirstDirectionCount (int count)
void  | SetFirstDirectionMinCount (int count)
void  | SetFirstMeshDensityDirectionPrompt (const CRhinoCommandOptionName &)
void  | SetFirstPoint (const ON_3dPoint &base)
void  | SetFirstPointPrompt3Point (const wchar_t *prompt)
void  | SetFirstPointPromptCenter (const wchar_t *prompt)
void  | SetFirstPointPromptCorners (const wchar_t *prompt)
void  | SetFirstPointPromptVertical (const wchar_t *prompt)
void  | SetForcedAspectRatio (double forced_aspect_ratio)
void  | SetHaveFirstPoint (BOOL b=TRUE)
void  | SetHavePlane (BOOL b=TRUE)
void  | SetHaveSecondPoint (BOOL b=TRUE)
void  | SetHaveThirdPoint (BOOL b=TRUE)
void  | SetLength (double length)
void  | SetPictureFileNameAndSize (const wchar_t *filename, int width, int height)
void  | SetPlane (const ON_Plane &plane)
void  | SetPromptForMeshDensity (bool bMeshDensity=true)
void  | SetRounded (BOOL allow=FALSE)
void  | SetSecondDirectionCount (int count)
void  | SetSecondDirectionMinCount (int count)
void  | SetSecondMeshDensityDirectionPrompt (const CRhinoCommandOptionName &)
void  | SetSecondPoint (const ON_3dPoint &point)
void  | SetSecondPointPrompt3Point (const wchar_t *prompt)
void  | SetSecondPointPromptCenter (const wchar_t *prompt)
void  | SetSecondPointPromptCorners (const wchar_t *prompt)
void  | SetSecondPointPromptVertical (const wchar_t *prompt)
void  | SetThirdDirectionCount (int count)
void  | SetThirdDirectionMinCount (int count)
void  | SetThirdMeshDensityDirectionPrompt (const CRhinoCommandOptionName &)
void  | SetThirdPoint (const ON_3dPoint &point)
void  | SetThirdPointPrompt3Point (const wchar_t *prompt)
void  | SetThirdPointPromptVertical (const wchar_t *prompt)
void  | SetUDegree (int degree)
void  | SetUPointCount (int count)
void  | SetVDegree (int degree)
void  | SetVPointCount (int count)
void  | SetWidth (double width)
int  | ThirdDirectionCount () const
number of faces in third direction More...
int  | ThirdDirectionMinCount () const
const CRhinoCommandOptionName &  | ThirdMeshDensityDirectionPrompt () const
prompt for number of faces in third direction More...
const ON_3dPoint &  | ThirdPoint () const
const wchar_t *  | ThirdPointPrompt3Point () const
prompt when getting opposite side in 3point mode More...
const wchar_t *  | ThirdPointPromptVertical () const
prompt when getting opposite side in vertical mode More...
int  | UDegree () const
int  | UPointCount () const
int  | VDegree () const
int  | VPointCount () const
double  | Width ()
 Public Attributes
bool  | m_bAcceptNothing
int  | m_simple_option_index
ON_ClassArray< CRhinoCommandOptionName >  | m_simple_options
input - simple options to add to the first prompt; More...
 Protected Attributes
BOOL  | m_allow_3point
BOOL  | m_allow_center
BOOL  | m_allow_corners
allow switching to respective modes for interactive input More...
BOOL  | m_allow_deformable
BOOL  | m_allow_rounded
BOOL  | m_allow_vertical
int  | m_ArgsType
int  | m_corner_mode
double  | m_corner_radius
double  | m_corner_rho
int  | m_current_mode
starting mode - corners, 3pt, vertical More...
BOOL  | m_deformable
ON_Color  | m_dynamic_line_color
color to use when drawing dynamic line while getting second corner More...
std::function< void(const ON_3dPoint[4])>  | m_dynamicRectangleCallback
ON_3dPoint  | m_firstpoint
called-supplied first corner ot the rectangle More...
BOOL  | m_force_aspect_ratio
double  | m_forced_aspect_ratio
BOOL  | m_havefirstpoint
BOOL  | m_haveplane
BOOL  | m_havesecondpoint
BOOL  | m_havethirdpoint
double  | m_length
int  | m_mesh_density_1stDirection
int  | m_mesh_density_2ndDirection
int  | m_mesh_density_3rdDirection
CRhinoCommandOptionName  | m_mesh_density_first_direction
int  | m_mesh_density_Min1stDirection
int  | m_mesh_density_Min2ndDirection
int  | m_mesh_density_Min3rdDirection
CRhinoCommandOptionName  | m_mesh_density_second_direction
CRhinoCommandOptionName  | m_mesh_density_third_direction
ON_wString  | m_picture_filename
file used to draw picture or bitmap image dynamically More...
ON_Plane  | m_plane
plane on which the rectangle will lie More...
ON_wString  | m_prompt_first_point_3point
prompt when getting first corner in 3 point mode More...
ON_wString  | m_prompt_first_point_center
prompt when getting center in center mode More...
ON_wString  | m_prompt_first_point_corners
prompt when getting first corner in corners mode More...
ON_wString  | m_prompt_first_point_vertical
prompt when getting first corner in vertical mode More...
ON_wString  | m_prompt_second_point_3point
prompt when getting opposite corner or second end of first edge More...
ON_wString  | m_prompt_second_point_center
prompt when getting corner in center mode More...
ON_wString  | m_prompt_second_point_corners
prompt when getting opposite corner or second end of first edge More...
ON_wString  | m_prompt_second_point_vertical
prompt when getting the second point in vertical mode More...
ON_wString  | m_prompt_third_point_3point
prompt when getting point on opposite side in 3 point mode More...
ON_wString  | m_prompt_third_point_vertical
prompt when getting point on opposite side in 3 point mode More...
bool  | m_PromptForMeshDensity
BOOL  | m_rounded
ON_3dPoint  | m_secondpoint
called-supplied second end of first edge More...
ON_3dPoint  | m_thirdpoint
called-supplied third point in rect3pt mode More...
int  | m_ucount
int  | m_udegree
int  | m_vcount
int  | m_vdegree
double  | m_width
Detailed Description
Input to the RhinoGetPlane() and RhinoGetRectangle() functions.
Copyright (c) 1993-2017 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Definition at line 21 of file rhinoSdkGetPlane.h.
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
mode_corners
mode_3point
mode_vertical
mode_center
Definition at line 24 of file rhinoSdkGetPlane.h.
◆ anonymous enum
 anonymous enum
Enumerator
corner_arc
corner_conic
corner_chamfer
Definition at line 31 of file rhinoSdkGetPlane.h.
◆ anonymous enum
 anonymous enum
Enumerator
plane_type
box_type
plane_type_ex
Definition at line 37 of file rhinoSdkGetPlane.h.
Constructor & Destructor Documentation
◆ CArgsRhinoGetPlane() [1/2]
 CArgsRhinoGetPlane::CArgsRhinoGetPlane  |  ( |   | )
◆ ~CArgsRhinoGetPlane()
 virtual CArgsRhinoGetPlane::~CArgsRhinoGetPlane  |  ( |   | )
virtual
◆ CArgsRhinoGetPlane() [2/2]
 CArgsRhinoGetPlane::CArgsRhinoGetPlane  |  ( |  const CArgsRhinoGetPlane &  |  src | )
Member Function Documentation
◆ AcceptNothing()
 void CArgsRhinoGetPlane::AcceptNothing  |  ( |  bool  |  bAcceptNothing = true | )
Like CRhinoGet::AcceptNothing().
◆ AddExtraOptions()
 virtual void CArgsRhinoGetPlane::AddExtraOptions  |  ( |  CRhinoGetPoint &  |  gp | )
virtual
Allows for adding extra command options during RhinoGetRectangle.
Reimplemented in CArgsRhinoGetPicture.
◆ Allow3Point()
 BOOL CArgsRhinoGetPlane::Allow3Point  |  ( |   | )
◆ AllowCenter()
 BOOL CArgsRhinoGetPlane::AllowCenter  |  ( |   | )
◆ AllowCorners()
 BOOL CArgsRhinoGetPlane::AllowCorners  |  ( |   | )
◆ AllowDeformable()
 BOOL CArgsRhinoGetPlane::AllowDeformable  |  ( |   | ) |   const
◆ AllowForceAspectRatio()
 BOOL CArgsRhinoGetPlane::AllowForceAspectRatio  |  ( |   | )
◆ AllowRounded()
 BOOL CArgsRhinoGetPlane::AllowRounded  |  ( |   | )
◆ AllowVertical()
 BOOL CArgsRhinoGetPlane::AllowVertical  |  ( |   | )
◆ ArgsType()
 int CArgsRhinoGetPlane::ArgsType  |  ( |   | ) |   const
return type of args class plane or derived box
◆ CornerMode()
 int CArgsRhinoGetPlane::CornerMode  |  ( |   | )
◆ CornerRadius()
 double CArgsRhinoGetPlane::CornerRadius  |  ( |   | )
◆ CornerRho()
 double CArgsRhinoGetPlane::CornerRho  |  ( |   | )
◆ CurrentMode()
 int CArgsRhinoGetPlane::CurrentMode  |  ( |   | )
◆ Deformable()
 BOOL CArgsRhinoGetPlane::Deformable  |  ( |   | ) |   const
◆ DrawPicture()
 bool CArgsRhinoGetPlane::DrawPicture  |  ( |   | )
◆ DynamicRectangleCallback()
 std::function<void(const ON_3dPoint[4])> CArgsRhinoGetPlane::DynamicRectangleCallback  |  ( |   | ) |   const
Description: Get callback function for doing custom dynamic drawing Returns: Callback function Remarks: Good for custom drawing when calling RhinoGetRectangle
◆ ExtraOptionsAtStart()
 virtual bool CArgsRhinoGetPlane::ExtraOptionsAtStart  |  ( |   | ) |   const
virtual
Interface for subclasses adding extra options. Return true if you want to add extra options to the start of the command option list false for options at the end Default is false
◆ FeedbackColor()
 ON_Color CArgsRhinoGetPlane::FeedbackColor  |  ( |   | ) |   const
color used to draw feedback line
◆ FirstDirectionCount()
 int CArgsRhinoGetPlane::FirstDirectionCount  |  ( |   | ) |   const
number of faces in first direction
◆ FirstDirectionMinCount()
 int CArgsRhinoGetPlane::FirstDirectionMinCount  |  ( |   | ) |   const
◆ FirstMeshDensityDirectionPrompt()
 const CRhinoCommandOptionName& CArgsRhinoGetPlane::FirstMeshDensityDirectionPrompt  |  ( |   | ) |   const
prompt for number of faces in first direction
◆ FirstPoint()
 const ON_3dPoint& CArgsRhinoGetPlane::FirstPoint  |  ( |   | ) |   const
◆ FirstPointPrompt3Point()
 const wchar_t* CArgsRhinoGetPlane::FirstPointPrompt3Point  |  ( |   | ) |   const
prompt when getting first corner
◆ FirstPointPromptCenter()
 const wchar_t* CArgsRhinoGetPlane::FirstPointPromptCenter  |  ( |   | ) |   const
prompt when getting center in center mode
◆ FirstPointPromptCorners()
 const wchar_t* CArgsRhinoGetPlane::FirstPointPromptCorners  |  ( |   | ) |   const
prompt when getting first corner
◆ FirstPointPromptVertical()
 const wchar_t* CArgsRhinoGetPlane::FirstPointPromptVertical  |  ( |   | ) |   const
prompt when getting first corner
◆ ForcedAspectRatio()
 double CArgsRhinoGetPlane::ForcedAspectRatio  |  ( |   | )
◆ HandleExtraOptions()
 virtual void CArgsRhinoGetPlane::HandleExtraOptions  |  ( |  const CRhinoGetPoint &  |  gp | )
virtual
Reimplemented in CArgsRhinoGetPicture.
◆ HaveFirstPoint()
 BOOL CArgsRhinoGetPlane::HaveFirstPoint  |  ( |   | ) |   const
◆ HavePlane()
 BOOL CArgsRhinoGetPlane::HavePlane  |  ( |   | ) |   const
◆ HaveSecondPoint()
 BOOL CArgsRhinoGetPlane::HaveSecondPoint  |  ( |   | ) |   const
◆ HaveThirdPoint()
 BOOL CArgsRhinoGetPlane::HaveThirdPoint  |  ( |   | ) |   const
◆ Length()
 double CArgsRhinoGetPlane::Length  |  ( |   | )
◆ operator=()
 CArgsRhinoGetPlane& CArgsRhinoGetPlane::operator=  |  ( |  const CArgsRhinoGetPlane &  |  src | )
◆ PictureFileName()
 const wchar_t* CArgsRhinoGetPlane::PictureFileName  |  ( |   | ) |   const
◆ Plane()
 const ON_Plane& CArgsRhinoGetPlane::Plane  |  ( |   | ) |   const
Set or get a plane to which the rectangle is constrained If none is set, the construction plane of the current viewport is used The base point is snapped to this plane
◆ PromptForMeshDensity()
 bool CArgsRhinoGetPlane::PromptForMeshDensity  |  ( |   | ) |   const
◆ Rounded()
 BOOL CArgsRhinoGetPlane::Rounded  |  ( |   | )
◆ SecondDirectionCount()
 int CArgsRhinoGetPlane::SecondDirectionCount  |  ( |   | ) |   const
number of faces in second direction
◆ SecondDirectionMinCount()
 int CArgsRhinoGetPlane::SecondDirectionMinCount  |  ( |   | ) |   const
◆ SecondMeshDensityDirectionPrompt()
 const CRhinoCommandOptionName& CArgsRhinoGetPlane::SecondMeshDensityDirectionPrompt  |  ( |   | ) |   const
prompt for number of faces in second direction
◆ SecondPoint()
 const ON_3dPoint& CArgsRhinoGetPlane::SecondPoint  |  ( |   | ) |   const
◆ SecondPointPrompt3Point()
 const wchar_t* CArgsRhinoGetPlane::SecondPointPrompt3Point  |  ( |   | ) |   const
prompt when getting second point in 3 point mode
◆ SecondPointPromptCenter()
 const wchar_t* CArgsRhinoGetPlane::SecondPointPromptCenter  |  ( |   | ) |   const
prompt when getting corner in center mode
◆ SecondPointPromptCorners()
 const wchar_t* CArgsRhinoGetPlane::SecondPointPromptCorners  |  ( |   | ) |   const
prompt when getting opposite corner
◆ SecondPointPromptVertical()
 const wchar_t* CArgsRhinoGetPlane::SecondPointPromptVertical  |  ( |   | ) |   const
prompt when getting second point in vertical mode
◆ SetAllow3Point()
 void CArgsRhinoGetPlane::SetAllow3Point  |  ( |  BOOL  |  allow = TRUE | )
◆ SetAllowCenter()
 void CArgsRhinoGetPlane::SetAllowCenter  |  ( |  BOOL  |  allow = TRUE | )
◆ SetAllowCorners()
 void CArgsRhinoGetPlane::SetAllowCorners  |  ( |  BOOL  |  allow = TRUE | )
Set or Get whether to allow the respective interactive modes Default is to allow them all
◆ SetAllowDeformable()
 void CArgsRhinoGetPlane::SetAllowDeformable  |  ( |  BOOL  |  b = TRUE | )
◆ SetAllowForceAspectRatio()
 void CArgsRhinoGetPlane::SetAllowForceAspectRatio  |  ( |  BOOL  |  allow = TRUE | )
◆ SetAllowRounded()
 void CArgsRhinoGetPlane::SetAllowRounded  |  ( |  BOOL  |  allow = FALSE | )
◆ SetAllowVertical()
 void CArgsRhinoGetPlane::SetAllowVertical  |  ( |  BOOL  |  allow = TRUE | )
◆ SetCornerMode()
 void CArgsRhinoGetPlane::SetCornerMode  |  ( |  int  |  mode = corner_arc | )
◆ SetCornerRadius()
 void CArgsRhinoGetPlane::SetCornerRadius  |  ( |  double  |  radius | )
◆ SetCornerRho()
 void CArgsRhinoGetPlane::SetCornerRho  |  ( |  double  |  rho | )
◆ SetCurrentMode()
 void CArgsRhinoGetPlane::SetCurrentMode  |  ( |  int  |  mode = mode_corners | )
Set or get the starting mode for getting input Default is start_corners
◆ SetDeformable()
 void CArgsRhinoGetPlane::SetDeformable  |  ( |  BOOL  |  bDeformable = TRUE | )
◆ SetDynamicRectangleCallback()
 void CArgsRhinoGetPlane::SetDynamicRectangleCallback  |  ( |  std::function< void(const ON_3dPoint[4])>  |  callback | )
Description: Set callback function for doing custom dynamic drawing Parameters: callback [in] Callback function for dynamic drawing Remarks: Good for custom drawing when calling RhinoGetRectangle
◆ SetFeedbackColor()
 void CArgsRhinoGetPlane::SetFeedbackColor  |  ( |  COLORREF  |  color | )
◆ SetFirstDirectionCount()
 void CArgsRhinoGetPlane::SetFirstDirectionCount  |  ( |  int  |  count | )
◆ SetFirstDirectionMinCount()
 void CArgsRhinoGetPlane::SetFirstDirectionMinCount  |  ( |  int  |  count | )
◆ SetFirstMeshDensityDirectionPrompt()
 void CArgsRhinoGetPlane::SetFirstMeshDensityDirectionPrompt  |  ( |  const CRhinoCommandOptionName &  |   | )
◆ SetFirstPoint()
 void CArgsRhinoGetPlane::SetFirstPoint  |  ( |  const ON_3dPoint &  |  base | )
Set or get the basepoint used for the first corner of the rectangle If one isn't supplied, the user is prompted for one
◆ SetFirstPointPrompt3Point()
 void CArgsRhinoGetPlane::SetFirstPointPrompt3Point  |  ( |  const wchar_t *  |  prompt | )
◆ SetFirstPointPromptCenter()
 void CArgsRhinoGetPlane::SetFirstPointPromptCenter  |  ( |  const wchar_t *  |  prompt | )
◆ SetFirstPointPromptCorners()
 void CArgsRhinoGetPlane::SetFirstPointPromptCorners  |  ( |  const wchar_t *  |  prompt | )
◆ SetFirstPointPromptVertical()
 void CArgsRhinoGetPlane::SetFirstPointPromptVertical  |  ( |  const wchar_t *  |  prompt | )
◆ SetForcedAspectRatio()
 void CArgsRhinoGetPlane::SetForcedAspectRatio  |  ( |  double  |  forced_aspect_ratio | )
◆ SetHaveFirstPoint()
 void CArgsRhinoGetPlane::SetHaveFirstPoint  |  ( |  BOOL  |  b = TRUE | )
◆ SetHavePlane()
 void CArgsRhinoGetPlane::SetHavePlane  |  ( |  BOOL  |  b = TRUE | )
◆ SetHaveSecondPoint()
 void CArgsRhinoGetPlane::SetHaveSecondPoint  |  ( |  BOOL  |  b = TRUE | )
◆ SetHaveThirdPoint()
 void CArgsRhinoGetPlane::SetHaveThirdPoint  |  ( |  BOOL  |  b = TRUE | )
◆ SetLength()
 void CArgsRhinoGetPlane::SetLength  |  ( |  double  |  length | )
◆ SetPictureFileNameAndSize()
 void CArgsRhinoGetPlane::SetPictureFileNameAndSize  |  ( |  const wchar_t *  |  filename,
|  int  |  width,
|  int  |  height
)
Description: Dynamically draws a picture or bitmap image. Parameters: filename [in] - Path to the picture or bitmap image file (e.g. png, jpg, bmp, etc.) width [in] - Width of the bitmap image in pixels. height [in] - Height of the bitmap image in pixels. Remarks: Picture drawing only works in 2Point (Default), 3Point, Center, and Vertical modes. The width and height arguments will be used to set the forced aspect ratio. See Also: CArgsRhinoGetPlane::SetAllowForceAspectRatio CArgsRhinoGetPlane::SetForcedAspectRatio
◆ SetPlane()
 void CArgsRhinoGetPlane::SetPlane  |  ( |  const ON_Plane &  |  plane | )
◆ SetPromptForMeshDensity()
 void CArgsRhinoGetPlane::SetPromptForMeshDensity  |  ( |  bool  |  bMeshDensity = true | )
Interface to allow primitive mesh creation to use RhinoGetPlane, RhinoGetBox, etc.
◆ SetRounded()
 void CArgsRhinoGetPlane::SetRounded  |  ( |  BOOL  |  allow = FALSE | )
◆ SetSecondDirectionCount()
 void CArgsRhinoGetPlane::SetSecondDirectionCount  |  ( |  int  |  count | )
◆ SetSecondDirectionMinCount()
 void CArgsRhinoGetPlane::SetSecondDirectionMinCount  |  ( |  int  |  count | )
◆ SetSecondMeshDensityDirectionPrompt()
 void CArgsRhinoGetPlane::SetSecondMeshDensityDirectionPrompt  |  ( |  const CRhinoCommandOptionName &  |   | )
◆ SetSecondPoint()
 void CArgsRhinoGetPlane::SetSecondPoint  |  ( |  const ON_3dPoint &  |  point | )
Set or get the second end of the first edge If one isn't supplied, the user is prompted for one
◆ SetSecondPointPrompt3Point()
 void CArgsRhinoGetPlane::SetSecondPointPrompt3Point  |  ( |  const wchar_t *  |  prompt | )
◆ SetSecondPointPromptCenter()
 void CArgsRhinoGetPlane::SetSecondPointPromptCenter  |  ( |  const wchar_t *  |  prompt | )
◆ SetSecondPointPromptCorners()
 void CArgsRhinoGetPlane::SetSecondPointPromptCorners  |  ( |  const wchar_t *  |  prompt | )
◆ SetSecondPointPromptVertical()
 void CArgsRhinoGetPlane::SetSecondPointPromptVertical  |  ( |  const wchar_t *  |  prompt | )
◆ SetThirdDirectionCount()
 void CArgsRhinoGetPlane::SetThirdDirectionCount  |  ( |  int  |  count | )
◆ SetThirdDirectionMinCount()
 void CArgsRhinoGetPlane::SetThirdDirectionMinCount  |  ( |  int  |  count | )
◆ SetThirdMeshDensityDirectionPrompt()
 void CArgsRhinoGetPlane::SetThirdMeshDensityDirectionPrompt  |  ( |  const CRhinoCommandOptionName &  |   | )
◆ SetThirdPoint()
 void CArgsRhinoGetPlane::SetThirdPoint  |  ( |  const ON_3dPoint &  |  point | )
Set or get the third point in rect3pt mode If one isn't supplied, the user is prompted for one
◆ SetThirdPointPrompt3Point()
 void CArgsRhinoGetPlane::SetThirdPointPrompt3Point  |  ( |  const wchar_t *  |  prompt | )
◆ SetThirdPointPromptVertical()
 void CArgsRhinoGetPlane::SetThirdPointPromptVertical  |  ( |  const wchar_t *  |  prompt | )
◆ SetUDegree()
 void CArgsRhinoGetPlane::SetUDegree  |  ( |  int  |  degree | )
◆ SetUPointCount()
 void CArgsRhinoGetPlane::SetUPointCount  |  ( |  int  |  count | )
◆ SetVDegree()
 void CArgsRhinoGetPlane::SetVDegree  |  ( |  int  |  degree | )
◆ SetVPointCount()
 void CArgsRhinoGetPlane::SetVPointCount  |  ( |  int  |  count | )
◆ SetWidth()
 void CArgsRhinoGetPlane::SetWidth  |  ( |  double  |  width | )
◆ ThirdDirectionCount()
 int CArgsRhinoGetPlane::ThirdDirectionCount  |  ( |   | ) |   const
number of faces in third direction
◆ ThirdDirectionMinCount()
 int CArgsRhinoGetPlane::ThirdDirectionMinCount  |  ( |   | ) |   const
◆ ThirdMeshDensityDirectionPrompt()
 const CRhinoCommandOptionName& CArgsRhinoGetPlane::ThirdMeshDensityDirectionPrompt  |  ( |   | ) |   const
prompt for number of faces in third direction
◆ ThirdPoint()
 const ON_3dPoint& CArgsRhinoGetPlane::ThirdPoint  |  ( |   | ) |   const
◆ ThirdPointPrompt3Point()
 const wchar_t* CArgsRhinoGetPlane::ThirdPointPrompt3Point  |  ( |   | ) |   const
prompt when getting opposite side in 3point mode
◆ ThirdPointPromptVertical()
 const wchar_t* CArgsRhinoGetPlane::ThirdPointPromptVertical  |  ( |   | ) |   const
prompt when getting opposite side in vertical mode
◆ UDegree()
 int CArgsRhinoGetPlane::UDegree  |  ( |   | ) |   const
◆ UPointCount()
 int CArgsRhinoGetPlane::UPointCount  |  ( |   | ) |   const
◆ VDegree()
 int CArgsRhinoGetPlane::VDegree  |  ( |   | ) |   const
◆ VPointCount()
 int CArgsRhinoGetPlane::VPointCount  |  ( |   | ) |   const
◆ Width()
 double CArgsRhinoGetPlane::Width  |  ( |   | )
Member Data Documentation
◆ m_allow_3point
 BOOL CArgsRhinoGetPlane::m_allow_3point
protected
Definition at line 327 of file rhinoSdkGetPlane.h.
◆ m_allow_center
 BOOL CArgsRhinoGetPlane::m_allow_center
protected
Definition at line 329 of file rhinoSdkGetPlane.h.
◆ m_allow_corners
 BOOL CArgsRhinoGetPlane::m_allow_corners
protected
allow switching to respective modes for interactive input
Definition at line 326 of file rhinoSdkGetPlane.h.
◆ m_allow_deformable
 BOOL CArgsRhinoGetPlane::m_allow_deformable
protected
Definition at line 331 of file rhinoSdkGetPlane.h.
◆ m_allow_rounded
 BOOL CArgsRhinoGetPlane::m_allow_rounded
protected
Definition at line 339 of file rhinoSdkGetPlane.h.
◆ m_allow_vertical
 BOOL CArgsRhinoGetPlane::m_allow_vertical
protected
Definition at line 328 of file rhinoSdkGetPlane.h.
◆ m_ArgsType
 int CArgsRhinoGetPlane::m_ArgsType
protected
This variable is to distinguish whether this class is really a CArgsRhinoGetPlane or the derived class CArgsRhinoGetBox. It is set to plane_type in the constructor for the plane, which is called first, and box_type in the constructor for the box. ArgsType() returns the value of m_ArgsType
Definition at line 369 of file rhinoSdkGetPlane.h.
◆ m_bAcceptNothing
 bool CArgsRhinoGetPlane::m_bAcceptNothing
Definition at line 377 of file rhinoSdkGetPlane.h.
◆ m_corner_mode
 int CArgsRhinoGetPlane::m_corner_mode
protected
Definition at line 341 of file rhinoSdkGetPlane.h.
◆ m_corner_radius
 double CArgsRhinoGetPlane::m_corner_radius
protected
Definition at line 343 of file rhinoSdkGetPlane.h.
◆ m_corner_rho
 double CArgsRhinoGetPlane::m_corner_rho
protected
Definition at line 342 of file rhinoSdkGetPlane.h.
◆ m_current_mode
 int CArgsRhinoGetPlane::m_current_mode
protected
starting mode - corners, 3pt, vertical
Definition at line 323 of file rhinoSdkGetPlane.h.
◆ m_deformable
 BOOL CArgsRhinoGetPlane::m_deformable
protected
Definition at line 332 of file rhinoSdkGetPlane.h.
◆ m_dynamic_line_color
 ON_Color CArgsRhinoGetPlane::m_dynamic_line_color
protected
color to use when drawing dynamic line while getting second corner
Definition at line 303 of file rhinoSdkGetPlane.h.
◆ m_dynamicRectangleCallback
 std::function<void(const ON_3dPoint[4])> CArgsRhinoGetPlane::m_dynamicRectangleCallback
protected
Definition at line 374 of file rhinoSdkGetPlane.h.
◆ m_firstpoint
 ON_3dPoint CArgsRhinoGetPlane::m_firstpoint
protected
called-supplied first corner ot the rectangle
Definition at line 310 of file rhinoSdkGetPlane.h.
◆ m_force_aspect_ratio
 BOOL CArgsRhinoGetPlane::m_force_aspect_ratio
protected
Definition at line 348 of file rhinoSdkGetPlane.h.
◆ m_forced_aspect_ratio
 double CArgsRhinoGetPlane::m_forced_aspect_ratio
protected
Definition at line 349 of file rhinoSdkGetPlane.h.
◆ m_havefirstpoint
 BOOL CArgsRhinoGetPlane::m_havefirstpoint
protected
Definition at line 311 of file rhinoSdkGetPlane.h.
◆ m_haveplane
 BOOL CArgsRhinoGetPlane::m_haveplane
protected
Definition at line 307 of file rhinoSdkGetPlane.h.
◆ m_havesecondpoint
 BOOL CArgsRhinoGetPlane::m_havesecondpoint
protected
Definition at line 315 of file rhinoSdkGetPlane.h.
◆ m_havethirdpoint
 BOOL CArgsRhinoGetPlane::m_havethirdpoint
protected
Definition at line 319 of file rhinoSdkGetPlane.h.
◆ m_length
 double CArgsRhinoGetPlane::m_length
protected
Definition at line 345 of file rhinoSdkGetPlane.h.
◆ m_mesh_density_1stDirection
 int CArgsRhinoGetPlane::m_mesh_density_1stDirection
protected
Definition at line 355 of file rhinoSdkGetPlane.h.
◆ m_mesh_density_2ndDirection
 int CArgsRhinoGetPlane::m_mesh_density_2ndDirection
protected
Definition at line 358 of file rhinoSdkGetPlane.h.
◆ m_mesh_density_3rdDirection
 int CArgsRhinoGetPlane::m_mesh_density_3rdDirection
protected
Definition at line 361 of file rhinoSdkGetPlane.h.
◆ m_mesh_density_first_direction
 CRhinoCommandOptionName CArgsRhinoGetPlane::m_mesh_density_first_direction
protected
Definition at line 354 of file rhinoSdkGetPlane.h.
◆ m_mesh_density_Min1stDirection
 int CArgsRhinoGetPlane::m_mesh_density_Min1stDirection
protected
Definition at line 356 of file rhinoSdkGetPlane.h.
◆ m_mesh_density_Min2ndDirection
 int CArgsRhinoGetPlane::m_mesh_density_Min2ndDirection
protected
Definition at line 359 of file rhinoSdkGetPlane.h.
◆ m_mesh_density_Min3rdDirection
 int CArgsRhinoGetPlane::m_mesh_density_Min3rdDirection
protected
Definition at line 362 of file rhinoSdkGetPlane.h.
◆ m_mesh_density_second_direction
 CRhinoCommandOptionName CArgsRhinoGetPlane::m_mesh_density_second_direction
protected
Definition at line 357 of file rhinoSdkGetPlane.h.
◆ m_mesh_density_third_direction
 CRhinoCommandOptionName CArgsRhinoGetPlane::m_mesh_density_third_direction
protected
Definition at line 360 of file rhinoSdkGetPlane.h.
◆ m_picture_filename
 ON_wString CArgsRhinoGetPlane::m_picture_filename
protected
file used to draw picture or bitmap image dynamically
Definition at line 372 of file rhinoSdkGetPlane.h.
◆ m_plane
 ON_Plane CArgsRhinoGetPlane::m_plane
protected
plane on which the rectangle will lie
Definition at line 306 of file rhinoSdkGetPlane.h.
◆ m_prompt_first_point_3point
 ON_wString CArgsRhinoGetPlane::m_prompt_first_point_3point
protected
prompt when getting first corner in 3 point mode
Definition at line 278 of file rhinoSdkGetPlane.h.
◆ m_prompt_first_point_center
 ON_wString CArgsRhinoGetPlane::m_prompt_first_point_center
protected
prompt when getting center in center mode
Definition at line 296 of file rhinoSdkGetPlane.h.
◆ m_prompt_first_point_corners
 ON_wString CArgsRhinoGetPlane::m_prompt_first_point_corners
protected
prompt when getting first corner in corners mode
Definition at line 272 of file rhinoSdkGetPlane.h.
◆ m_prompt_first_point_vertical
 ON_wString CArgsRhinoGetPlane::m_prompt_first_point_vertical
protected
prompt when getting first corner in vertical mode
Definition at line 287 of file rhinoSdkGetPlane.h.
◆ m_prompt_second_point_3point
 ON_wString CArgsRhinoGetPlane::m_prompt_second_point_3point
protected
prompt when getting opposite corner or second end of first edge
Definition at line 281 of file rhinoSdkGetPlane.h.
◆ m_prompt_second_point_center
 ON_wString CArgsRhinoGetPlane::m_prompt_second_point_center
protected
prompt when getting corner in center mode
Definition at line 299 of file rhinoSdkGetPlane.h.
◆ m_prompt_second_point_corners
 ON_wString CArgsRhinoGetPlane::m_prompt_second_point_corners
protected
prompt when getting opposite corner or second end of first edge
Definition at line 275 of file rhinoSdkGetPlane.h.
◆ m_prompt_second_point_vertical
 ON_wString CArgsRhinoGetPlane::m_prompt_second_point_vertical
protected
prompt when getting the second point in vertical mode
Definition at line 290 of file rhinoSdkGetPlane.h.
◆ m_prompt_third_point_3point
 ON_wString CArgsRhinoGetPlane::m_prompt_third_point_3point
protected
prompt when getting point on opposite side in 3 point mode
Definition at line 284 of file rhinoSdkGetPlane.h.
◆ m_prompt_third_point_vertical
 ON_wString CArgsRhinoGetPlane::m_prompt_third_point_vertical
protected
prompt when getting point on opposite side in 3 point mode
Definition at line 293 of file rhinoSdkGetPlane.h.
◆ m_PromptForMeshDensity
 bool CArgsRhinoGetPlane::m_PromptForMeshDensity
protected
Interface to allow primitive mesh creation to use RhinoGetPlane, RhinoGetBox, etc.
Definition at line 353 of file rhinoSdkGetPlane.h.
◆ m_rounded
 BOOL CArgsRhinoGetPlane::m_rounded
protected
Definition at line 340 of file rhinoSdkGetPlane.h.
◆ m_secondpoint
 ON_3dPoint CArgsRhinoGetPlane::m_secondpoint
protected
called-supplied second end of first edge
Definition at line 314 of file rhinoSdkGetPlane.h.
◆ m_simple_option_index
 int CArgsRhinoGetPlane::m_simple_option_index
output - if >= 0, one of the simpple options above was picked.
Definition at line 267 of file rhinoSdkGetPlane.h.
◆ m_simple_options
 ON_ClassArray<CRhinoCommandOptionName> CArgsRhinoGetPlane::m_simple_options
input - simple options to add to the first prompt;
Definition at line 264 of file rhinoSdkGetPlane.h.
◆ m_thirdpoint
 ON_3dPoint CArgsRhinoGetPlane::m_thirdpoint
protected
called-supplied third point in rect3pt mode
Definition at line 318 of file rhinoSdkGetPlane.h.
◆ m_ucount
 int CArgsRhinoGetPlane::m_ucount
protected
Definition at line 336 of file rhinoSdkGetPlane.h.
◆ m_udegree
 int CArgsRhinoGetPlane::m_udegree
protected
Definition at line 334 of file rhinoSdkGetPlane.h.
◆ m_vcount
 int CArgsRhinoGetPlane::m_vcount
protected
Definition at line 337 of file rhinoSdkGetPlane.h.
◆ m_vdegree
 int CArgsRhinoGetPlane::m_vdegree
protected
Definition at line 335 of file rhinoSdkGetPlane.h.
◆ m_width
 double CArgsRhinoGetPlane::m_width
protected
Definition at line 346 of file rhinoSdkGetPlane.h.