Public Types | List of all members
CRhinoExtend Class Reference
Rhino
#include <rhinoSdkUtilities.h>
 Public Types
enum  | Type { Line, Arc, Smooth, Natural }
Detailed Description
Definition at line 1744 of file rhinoSdkUtilities.h.
Member Enumeration Documentation
◆ Type
 enum CRhinoExtend::Type
Enumerator
Line
Arc
Smooth
Natural
Line for linear curves, Arc for arcs, and Smooth for others.
Definition at line 1746 of file rhinoSdkUtilities.h.