Public Member Functions | Public Attributes | List of all members
CRhinoGripDirections Class Reference
Rhino
#include <rhinoSdkGrips.h>
 Public Member Functions
bool  | IsSet () const
void  | Unset ()
 Public Attributes
ON_3dVector  | m_X
ON_3dVector  | m_Y
ON_3dVector  | m_Z
Detailed Description
Copyright (c) 1993-2017 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Definition at line 18 of file rhinoSdkGrips.h.
Member Function Documentation
◆ IsSet()
 bool CRhinoGripDirections::IsSet  |  ( |   | ) |   const
◆ Unset()
 void CRhinoGripDirections::Unset  |  ( |   | )
Member Data Documentation
◆ m_X
 ON_3dVector CRhinoGripDirections::m_X
Definition at line 24 of file rhinoSdkGrips.h.
◆ m_Y
 ON_3dVector CRhinoGripDirections::m_Y
Definition at line 25 of file rhinoSdkGrips.h.
◆ m_Z
 ON_3dVector CRhinoGripDirections::m_Z
Definition at line 26 of file rhinoSdkGrips.h.