Public Member Functions | Public Attributes | List of all members
CRhRdkUiScrollBarInfo Class Referencefinal
RDK
#include <RhRdkUiSdk.h>
 Public Member Functions
CRhRdkUiScrollBarInfo ()
 Public Attributes
UINT_PTR  | m_uReserved
SCROLLINFO  | siH
SCROLLINFO  | siV
Detailed Description
Definition at line 1106 of file RhRdkUiSdk.h.
Constructor & Destructor Documentation
◆ CRhRdkUiScrollBarInfo()
 CRhRdkUiScrollBarInfo::CRhRdkUiScrollBarInfo  |  ( |   | )
Member Data Documentation
◆ m_uReserved
 UINT_PTR CRhRdkUiScrollBarInfo::m_uReserved
Definition at line 1116 of file RhRdkUiSdk.h.
◆ siH
 SCROLLINFO CRhRdkUiScrollBarInfo::siH
Definition at line 1113 of file RhRdkUiSdk.h.
◆ siV
 SCROLLINFO CRhRdkUiScrollBarInfo::siV
Definition at line 1114 of file RhRdkUiSdk.h.