Public Member Functions | Public Attributes | List of all members
CRhinoGripStatus Class Reference
Rhino
#include <rhinoSdkGrips.h>
 Public Member Functions
CRhinoGripStatus ()
~CRhinoGripStatus ()
bool  | IsVisible () const
 Public Attributes
bool  | m_bCulled
volitile and view dependent More...
bool  | m_bHighlighted
bool  | m_bLocked
bool  | m_bMoved
bool  | m_bVisible
CRhinoGripDirections  | m_directions
Detailed Description
Definition at line 29 of file rhinoSdkGrips.h.
Constructor & Destructor Documentation
◆ CRhinoGripStatus()
 CRhinoGripStatus::CRhinoGripStatus  |  ( |   | )
◆ ~CRhinoGripStatus()
 CRhinoGripStatus::~CRhinoGripStatus  |  ( |   | )
Member Function Documentation
◆ IsVisible()
 bool CRhinoGripStatus::IsVisible  |  ( |   | ) |   const
Member Data Documentation
◆ m_bCulled
 bool CRhinoGripStatus::m_bCulled
volitile and view dependent
Definition at line 38 of file rhinoSdkGrips.h.
◆ m_bHighlighted
 bool CRhinoGripStatus::m_bHighlighted
Definition at line 35 of file rhinoSdkGrips.h.
◆ m_bLocked
 bool CRhinoGripStatus::m_bLocked
Definition at line 36 of file rhinoSdkGrips.h.
◆ m_bMoved
 bool CRhinoGripStatus::m_bMoved
Definition at line 37 of file rhinoSdkGrips.h.
◆ m_bVisible
 bool CRhinoGripStatus::m_bVisible
Definition at line 34 of file rhinoSdkGrips.h.
◆ m_directions
 CRhinoGripDirections CRhinoGripStatus::m_directions
Definition at line 40 of file rhinoSdkGrips.h.