Friends | List of all members
ON_Internal_FontGlyphPool Class Reference
OpenNURBS
#include <opennurbs_internal_glyph.h>
 Inheritance diagram for ON_Internal_FontGlyphPool:
 Friends
class  | ON_FontGlyph
class  | ON_GlyphMap
Detailed Description
/ / Copyright (c) 1993-2017 Robert McNeel & Associates. All rights reserved. / OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert / McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete openNURBS copyright information see http://www.opennurbs.org. / //////////////////////////////////////////////////////////////
Definition at line 21 of file opennurbs_internal_glyph.h.
Friends And Related Function Documentation
◆ ON_FontGlyph
 friend class ON_FontGlyph
friend
Definition at line 24 of file opennurbs_internal_glyph.h.
◆ ON_GlyphMap
 friend class ON_GlyphMap
friend
Definition at line 25 of file opennurbs_internal_glyph.h.