Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoDimensionHistoryEnabler Class Reference
Rhino
#include <RhinoSdkDimension.h>
 Public Member Functions
CRhinoDimensionHistoryEnabler (unsigned int doc_sn)
~CRhinoDimensionHistoryEnabler ()
 Public Attributes
unsigned int  | m_doc_sn = 0
bool  | m_history_on = false
 Static Public Attributes
static bool  | m_force_dimension_history
Detailed Description
Copyright (c) 1993-2017 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.Putting one of these on the stack before checking if history is on and writing a history record will turn history on temporarily if it's not already on, and then turn it back off if it was off when this is destructed It's here so history can easily be turned on whenever dimensions are made
Constructor & Destructor Documentation
◆ CRhinoDimensionHistoryEnabler()
 CRhinoDimensionHistoryEnabler::CRhinoDimensionHistoryEnabler  |  ( |  unsigned int  |  doc_sn | )
◆ ~CRhinoDimensionHistoryEnabler()
 CRhinoDimensionHistoryEnabler::~CRhinoDimensionHistoryEnabler  |  ( |   | )
Member Data Documentation
◆ m_doc_sn
 unsigned int CRhinoDimensionHistoryEnabler::m_doc_sn = 0
◆ m_force_dimension_history
 bool CRhinoDimensionHistoryEnabler::m_force_dimension_history
static
◆ m_history_on
 bool CRhinoDimensionHistoryEnabler::m_history_on = false