Public Member Functions | List of all members
CRhRdkPreviewLighting Class Referenceabstract
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkPreviewLighting:
 Public Member Functions
virtual const wchar_t *  | ElementKind (void) const final override
virtual void  | SetUpPreview (CRhRdkPreviewSceneServer &ss) const =0
 Public Member Functions inherited from CRhRdkPreviewSceneElement
CRhRdkPreviewSceneElement ()
virtual  | ~CRhRdkPreviewSceneElement ()
virtual CRhRdkPreviewSceneElement *  | Duplicate (void) const =0
virtual UUID  | TypeId (void) const =0
virtual const wchar_t *  | XmlTag (void) const =0
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Detailed Description
Definition at line 540 of file RhRdkUiSdk.h.
Member Function Documentation
◆ ElementKind()
 virtual const wchar_t* CRhRdkPreviewLighting::ElementKind  |  ( |  void  |   | ) |   const
finaloverridevirtual
Implements CRhRdkPreviewSceneElement.
◆ SetUpPreview()
 virtual void CRhRdkPreviewLighting::SetUpPreview  |  ( |  CRhRdkPreviewSceneServer &  |  ss | ) |   const
pure virtual