Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoPropListProfileContext Class Reference
Rhino
#include <RhinoSdkMacUiProfileContext.h>
 Inheritance diagram for CRhinoPropListProfileContext:
 Public Member Functions
CRhinoPropListProfileContext (CRhinoProfileContext::context_location ct)
virtual  | ~CRhinoPropListProfileContext ()
CRhinoProfileContextIterator *  | GetNewIterator (const wchar_t *section)
bool  | LoadProfileBinary (LPCTSTR lpszSection, LPCTSTR lpszEntry, void *pValue, ULONG &nBytesOut) const
bool  | LoadProfileBool (LPCTSTR lpszSection, LPCTSTR lpszEntry, BOOL *) const
bool  | LoadProfileColor (LPCTSTR lpszSection, LPCTSTR lpszEntry, ON_Color *) const
bool  | LoadProfileDouble (LPCTSTR lpszSection, LPCTSTR lpszEntry, double *) const
bool  | LoadProfileInt (LPCTSTR lpszSection, LPCTSTR lpszEntry, int *) const
bool  | LoadProfileInt (LPCTSTR lpszSection, LPCTSTR lpszEntry, BOOL *) const
bool  | LoadProfileMultiString (LPCTSTR lpszSection, LPCTSTR lpszEntry, ON_ClassArray< ON_String > &) const
bool  | LoadProfileMultiString (LPCTSTR lpszSection, LPCTSTR lpszEntry, ON_ClassArray< ON_wString > &) const
bool  | LoadProfileRGBA (LPCTSTR lpszSection, LPCTSTR lpszEntry, ON_Color &) const
bool  | LoadProfileString (LPCTSTR lpszSection, LPCTSTR lpszEntry, CString &) const
bool  | LoadProfileString (LPCTSTR lpszSection, LPCTSTR lpszEntry, char *, int) const
bool  | LoadProfileString (LPCTSTR lpszSection, LPCTSTR lpszEntry, wchar_t *, int) const
bool  | LoadProfileString (LPCTSTR lpszSection, LPCTSTR lpszEntry, ON_String &) const
bool  | LoadProfileString (LPCTSTR lpszSection, LPCTSTR lpszEntry, ON_wString &) const
virtual MRPropertyList *  | PropertyList () const
bool  | SaveProfileBinary (LPCTSTR lpszSection, LPCTSTR lpszEntry, const void *pValue, ULONG nBytes) const
void  | SaveProfileBool (LPCTSTR lpszSection, LPCTSTR lpszEntry, BOOL) const
void  | SaveProfileColor (LPCTSTR lpszSection, LPCTSTR lpszEntry, ON_Color) const
void  | SaveProfileDouble (LPCTSTR lpszSection, LPCTSTR lpszEntry, double) const
void  | SaveProfileInt (LPCTSTR lpszSection, LPCTSTR lpszEntry, int) const
void  | SaveProfileRGBA (LPCTSTR lpszSection, LPCTSTR lpszEntry, const ON_Color &) const
bool  | SaveProfileString (LPCTSTR lpszSection, LPCTSTR lpszEntry, const char *) const
bool  | SaveProfileString (LPCTSTR lpszSection, LPCTSTR lpszEntry, const wchar_t *) const
bool  | SaveProfileString (LPCTSTR lpszSection, LPCTSTR lpszEntry, const ON_ClassArray< ON_String > &) const
bool  | SaveProfileString (LPCTSTR lpszSection, LPCTSTR lpszEntry, const ON_ClassArray< ON_wString > &) const
void  | SetPropListFileName (const wchar_t *)
 Public Member Functions inherited from CRhinoProfileContext
CRhinoProfileContext (context_location ct)
virtual  | ~CRhinoProfileContext ()
virtual bool  | IsSynchronizing () const
virtual bool  | LoadProfile3dPoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dPoint *) const
virtual bool  | LoadProfile3dPoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dPoint *value, const ON_3dPoint &defaultValue) const
virtual bool  | LoadProfile3dVector (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dVector *) const
virtual bool  | LoadProfile3dVector (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dVector *value, const ON_3dVector &defaultValue) const
virtual bool  | LoadProfileBinary (const wchar_t *lpszSection, const wchar_t *lpszEntry, void *pValue, ULONG &nBytesOut) const
virtual bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, bool *) const
virtual bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, bool *value, bool defaultValue) const
virtual bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, BOOL *) const
virtual bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, BOOL *value, BOOL defaultValue) const
virtual bool  | LoadProfileColor (const wchar_t *lpszSection, const wchar_t *lpszEntry, COLORREF *) const
virtual bool  | LoadProfileColor (const wchar_t *lpszSection, const wchar_t *lpszEntry, COLORREF *value, COLORREF defaultValue) const
virtual bool  | LoadProfileDouble (const wchar_t *lpszSection, const wchar_t *lpszEntry, double *) const
virtual bool  | LoadProfileDouble (const wchar_t *lpszSection, const wchar_t *lpszEntry, double *value, double defaultValue) const
virtual bool  | LoadProfileInt (const wchar_t *lpszSection, const wchar_t *lpszEntry, int *) const
virtual bool  | LoadProfileInt (const wchar_t *lpszSection, const wchar_t *lpszEntry, int *value, int defaultValue) const
bool  | LoadProfileLegacyPlugMeshParameters (const wchar_t *lpszSection, const wchar_t *plugin_prefix, ON_MeshParameters *mp, int *mesh_ui_style) const
virtual bool  | LoadProfileMeshParameters (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_MeshParameters *) const
virtual bool  | LoadProfileMeshParameters (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_MeshParameters *value, const ON_MeshParameters &defaultValue) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_String > &) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_String > &value, const ON_ClassArray< ON_String > &defaultValue) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_wString > &value) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_wString > &value, const ON_ClassArray< ON_wString > &defaultValue) const
virtual bool  | LoadProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, POINT *) const
virtual bool  | LoadProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, POINT *value, const POINT &defaultValue) const
virtual bool  | LoadProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, RECT *) const
virtual bool  | LoadProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, RECT *value, const RECT &defaultValue) const
virtual bool  | LoadProfileRGBA (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Color &) const
virtual bool  | LoadProfileRGBA (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Color &value, const ON_Color &defaultValue) const
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_wString &) const =0
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_wString &value, const wchar_t *defaultValue) const
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, char *, int) const
The following version of LoadProfileString() all call the above version and convert the CString. More...
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, wchar_t *, int) const
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_String &) const
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_String &value, const char *defaultValue) const
virtual bool  | LoadProfileStringDictionary (const wchar_t *lpszSection, const wchar_t *lpszEntry, CRhinoStringDictionary &value) const
virtual bool  | LoadProfileStringDictionary (const wchar_t *lpszSection, const wchar_t *lpszEntry, CRhinoStringDictionary &value, const CRhinoStringDictionary &defaultValue) const
virtual bool  | LoadProfileUuid (const wchar_t *lpszSection, const wchar_t *lpszEntry, UUID *) const
virtual bool  | LoadProfileUuid (const wchar_t *lpszSection, const wchar_t *lpszEntry, UUID *value, const UUID &defaultValue) const
virtual bool  | LoadProfileXform (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Xform *) const
virtual bool  | LoadProfileXform (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Xform *value, const ON_Xform &defaultValue) const
context_location  | ProfileContextLocation () const
virtual void  | SaveProfile3dPoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_3dPoint &) const
virtual void  | SaveProfile3dVector (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_3dVector &) const
virtual bool  | SaveProfileBinary (const wchar_t *lpszSection, const wchar_t *lpszEntry, const void *pValue, ULONG nBytes) const
virtual void  | SaveProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, bool) const
virtual void  | SaveProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, BOOL) const
virtual void  | SaveProfileColor (const wchar_t *lpszSection, const wchar_t *lpszEntry, COLORREF) const
virtual void  | SaveProfileDouble (const wchar_t *lpszSection, const wchar_t *lpszEntry, double) const
virtual void  | SaveProfileInt (const wchar_t *lpszSection, const wchar_t *lpszEntry, int) const
void  | SaveProfileLegacyPlugInMeshParameters (const wchar_t *lpszSection, const wchar_t *plugin_prefix, const ON_MeshParameters &mp, int mesh_ui_style) const
virtual void  | SaveProfileMeshParameters (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_MeshParameters &) const
virtual void  | SaveProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_2iPoint &) const
virtual void  | SaveProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, const POINT &) const
virtual void  | SaveProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_4iRect &) const
virtual void  | SaveProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, const RECT &) const
virtual void  | SaveProfileRGBA (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_Color &) const
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const char *) const =0
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const wchar_t *) const =0
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_ClassArray< ON_String > &) const
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_ClassArray< ON_wString > &) const
virtual bool  | SaveProfileStringDictioary (const wchar_t *lpszSection, const wchar_t *lpszEntry, const CRhinoStringDictionary &value) const
virtual bool  | SaveProfileUuid (const wchar_t *lpszSection, const wchar_t *lpszEntry, const UUID &uuid) const
virtual void  | SaveProfileXform (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_Xform &) const
 Protected Member Functions
bool  | DeleteProfileSection (LPCTSTR lpszSection) const
id  | ProfileKeyFor (LPCTSTR lpszSection, LPCTSTR lpszEntry=NULL) const
bool  | RegWriteProfileString (LPCTSTR lpszSection, LPCTSTR lpszEntry, const CString &sValue, CRhinoProfileContext::context_location nProfile) const
 Protected Attributes
MRPropertyList *  | m_pPropertyList
ON_wString  | m_wFileName
 Friends
class  | CRhinoPropListProfileContextIterator
 Additional Inherited Members
 Public Types inherited from CRhinoProfileContext
enum  | context_location : unsigned int {
 cl_global_current_user = 0, cl_scheme_current_user, cl_root_local_machine, cl_plugins_current_user,
 cl_plugins_local_machine
 }
Detailed Description
class CRhinoPropListProfileContext
Constructor & Destructor Documentation
◆ CRhinoPropListProfileContext()
 CRhinoPropListProfileContext::CRhinoPropListProfileContext  |  ( |  CRhinoProfileContext::context_location  |  ct | )
◆ ~CRhinoPropListProfileContext()
 virtual CRhinoPropListProfileContext::~CRhinoPropListProfileContext  |  ( |   | )
virtual
Member Function Documentation
◆ DeleteProfileSection()
 bool CRhinoPropListProfileContext::DeleteProfileSection  |  ( |  LPCTSTR  |  lpszSection | ) |   const
protected
◆ GetNewIterator()
 CRhinoProfileContextIterator* CRhinoPropListProfileContext::GetNewIterator  |  ( |  const wchar_t *  |  section | )
virtual
Required CRhinoProfileContext overrides
Implements CRhinoProfileContext.
◆ LoadProfileBinary()
 bool CRhinoPropListProfileContext::LoadProfileBinary  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  void *  |  pValue,
|  ULONG &  |  nBytesOut
) |   |  const
◆ LoadProfileBool()
 bool CRhinoPropListProfileContext::LoadProfileBool  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  BOOL *
) |   |  const
◆ LoadProfileColor()
 bool CRhinoPropListProfileContext::LoadProfileColor  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  ON_Color *
) |   |  const
◆ LoadProfileDouble()
 bool CRhinoPropListProfileContext::LoadProfileDouble  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  double *
) |   |  const
◆ LoadProfileInt() [1/2]
 bool CRhinoPropListProfileContext::LoadProfileInt  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  int *
) |   |  const
◆ LoadProfileInt() [2/2]
 bool CRhinoPropListProfileContext::LoadProfileInt  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  BOOL *
) |   |  const
◆ LoadProfileMultiString() [1/2]
 bool CRhinoPropListProfileContext::LoadProfileMultiString  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  ON_ClassArray< ON_String > &
) |   |  const
Optional CRhinoProfileContext overrides
◆ LoadProfileMultiString() [2/2]
 bool CRhinoPropListProfileContext::LoadProfileMultiString  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  ON_ClassArray< ON_wString > &
) |   |  const
◆ LoadProfileRGBA()
 bool CRhinoPropListProfileContext::LoadProfileRGBA  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  ON_Color &
) |   |  const
◆ LoadProfileString() [1/5]
 bool CRhinoPropListProfileContext::LoadProfileString  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  CString &
) |   |  const
◆ LoadProfileString() [2/5]
 bool CRhinoPropListProfileContext::LoadProfileString  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  char *  |  ,
|  int
) |   |  const
When you override the LoadProfileString(...) above the compiler can not find the other overloaded methods so you must override them and call the base class
◆ LoadProfileString() [3/5]
 bool CRhinoPropListProfileContext::LoadProfileString  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  wchar_t *  |  ,
|  int
) |   |  const
◆ LoadProfileString() [4/5]
 bool CRhinoPropListProfileContext::LoadProfileString  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  ON_String &
) |   |  const
◆ LoadProfileString() [5/5]
 bool CRhinoPropListProfileContext::LoadProfileString  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  ON_wString &
) |   |  const
◆ ProfileKeyFor()
 id CRhinoPropListProfileContext::ProfileKeyFor  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry = NULL
) |   |  const
protected
◆ PropertyList()
 virtual MRPropertyList* CRhinoPropListProfileContext::PropertyList  |  ( |   | ) |   const
virtual
Reimplemented in CRhinoPropListFileProfileContext.
◆ RegWriteProfileString()
 bool CRhinoPropListProfileContext::RegWriteProfileString  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  const CString &  |  sValue,
|  CRhinoProfileContext::context_location  |  nProfile
) |   |  const
protected
Local protected methods
◆ SaveProfileBinary()
 bool CRhinoPropListProfileContext::SaveProfileBinary  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  const void *  |  pValue,
|  ULONG  |  nBytes
) |   |  const
◆ SaveProfileBool()
 void CRhinoPropListProfileContext::SaveProfileBool  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  BOOL
) |   |  const
◆ SaveProfileColor()
 void CRhinoPropListProfileContext::SaveProfileColor  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  ON_Color
) |   |  const
◆ SaveProfileDouble()
 void CRhinoPropListProfileContext::SaveProfileDouble  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  double
) |   |  const
◆ SaveProfileInt()
 void CRhinoPropListProfileContext::SaveProfileInt  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  int
) |   |  const
◆ SaveProfileRGBA()
 void CRhinoPropListProfileContext::SaveProfileRGBA  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  const ON_Color &
) |   |  const
The LoadProfileColor/SaveProfileColor functions ignore aplha. If you want to save a color with alpha information, use the following RGBA functions
◆ SaveProfileString() [1/4]
 bool CRhinoPropListProfileContext::SaveProfileString  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  const char *
) |   |  const
◆ SaveProfileString() [2/4]
 bool CRhinoPropListProfileContext::SaveProfileString  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  const wchar_t *
) |   |  const
◆ SaveProfileString() [3/4]
 bool CRhinoPropListProfileContext::SaveProfileString  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  const ON_ClassArray< ON_String > &
) |   |  const
When you override the SaveProfileString(...) above the compiler can not find the other overloaded methods so you must override them, Reg overrides them anyhow to use the registry multi-string writing stuff
◆ SaveProfileString() [4/4]
 bool CRhinoPropListProfileContext::SaveProfileString  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  const ON_ClassArray< ON_wString > &
) |   |  const
◆ SetPropListFileName()
 void CRhinoPropListProfileContext::SetPropListFileName  |  ( |  const wchar_t *  |   | )
Local public methods
Friends And Related Function Documentation
◆ CRhinoPropListProfileContextIterator
 friend class CRhinoPropListProfileContextIterator
friend
Member Data Documentation
◆ m_pPropertyList
 MRPropertyList* CRhinoPropListProfileContext::m_pPropertyList
protected
◆ m_wFileName
 ON_wString CRhinoPropListProfileContext::m_wFileName
protected