Public Attributes | List of all members
CRhinoObjRef::CNestedIRef Class Reference
#include <rhinoSdkObject.h>
 Public Attributes
const class CRhinoInstanceObject *  | m_iref
instance reference More...
ON_Xform  | m_xform
Transformation from ba. More...
Detailed Description
Definition at line 2827 of file rhinoSdkObject.h.
Member Data Documentation
◆ m_iref
 const class CRhinoInstanceObject* CRhinoObjRef::CNestedIRef::m_iref
instance reference
Definition at line 2831 of file rhinoSdkObject.h.
◆ m_xform
 ON_Xform CRhinoObjRef::CNestedIRef::m_xform
Transformation from ba.
Definition at line 2834 of file rhinoSdkObject.h.