Public Member Functions | Public Attributes | List of all members
ON_DimStyle::DimstyleField Class Reference
#include <opennurbs_dimensionstyle.h>
 Public Member Functions
DimstyleField ()
~DimstyleField ()
 Public Attributes
ON_DimStyle::field  | m_field_id
DimstyleField *  | m_next
union {
 bool b_val
 unsigned int c_val
 double d_val
 int i_val
 const ON_wString * s_val
 unsigned char uc_val
}  | m_val
Detailed Description
Colors of Text ON_Color TextColor() const; void SetTextColor(ON_Color color);
Combines a field id and a field value Dimensions will have an array of DimstyleField's to record dimension style overrides for individual dimensions
Definition at line 1370 of file opennurbs_dimensionstyle.h.
Constructor & Destructor Documentation
◆ DimstyleField()
 ON_DimStyle::DimstyleField::DimstyleField  |  ( |   | )
inline
Definition at line 1373 of file opennurbs_dimensionstyle.h.
◆ ~DimstyleField()
 ON_DimStyle::DimstyleField::~DimstyleField  |  ( |   | )
inline
Definition at line 1379 of file opennurbs_dimensionstyle.h.
Member Data Documentation
◆ b_val
 bool ON_DimStyle::DimstyleField::b_val
Definition at line 1397 of file opennurbs_dimensionstyle.h.
◆ c_val
 unsigned int ON_DimStyle::DimstyleField::c_val
Definition at line 1401 of file opennurbs_dimensionstyle.h.
◆ d_val
 double ON_DimStyle::DimstyleField::d_val
Definition at line 1400 of file opennurbs_dimensionstyle.h.
◆ i_val
 int ON_DimStyle::DimstyleField::i_val
Definition at line 1398 of file opennurbs_dimensionstyle.h.
◆ m_field_id
 ON_DimStyle::field ON_DimStyle::DimstyleField::m_field_id
Definition at line 1394 of file opennurbs_dimensionstyle.h.
◆ m_next
 DimstyleField* ON_DimStyle::DimstyleField::m_next
Definition at line 1393 of file opennurbs_dimensionstyle.h.
◆ m_val
 union { ... } ON_DimStyle::DimstyleField::m_val
◆ s_val
 const ON_wString* ON_DimStyle::DimstyleField::s_val
Definition at line 1402 of file opennurbs_dimensionstyle.h.
◆ uc_val
 unsigned char ON_DimStyle::DimstyleField::uc_val
Definition at line 1399 of file opennurbs_dimensionstyle.h.