Public Member Functions | List of all members
ON_RtfFirstChar::TextRun Class Reference
#include <opennurbs_textiterator.h>
 Public Member Functions
TextRun ()
void  | AddText (const wchar_t *str)
int  | FontIndex ()
void  | InitRun ()
bool  | IsBold () const
bool  | IsItalic () const
bool  | IsStrikeThrough () const
bool  | IsUnderlined () const
void  | SetBold (bool b)
void  | SetFontIndex (int index)
void  | SetItalic (bool b)
void  | SetStrikeThrough (bool b)
void  | SetType (ON_TextRun::RunType type)
void  | SetUnderlined (bool b)
const ON_wString &  | Text ()
ON_TextRun::RunType  | Type () const
Detailed Description
Definition at line 612 of file opennurbs_textiterator.h.
Constructor & Destructor Documentation
◆ TextRun()
 ON_RtfFirstChar::TextRun::TextRun  |  ( |   | )
inline
Definition at line 615 of file opennurbs_textiterator.h.
Member Function Documentation
◆ AddText()
 void ON_RtfFirstChar::TextRun::AddText  |  ( |  const wchar_t *  |  str | )
inline
Definition at line 678 of file opennurbs_textiterator.h.
◆ FontIndex()
 int ON_RtfFirstChar::TextRun::FontIndex  |  ( |   | )
inline
Definition at line 635 of file opennurbs_textiterator.h.
◆ InitRun()
 void ON_RtfFirstChar::TextRun::InitRun  |  ( |   | )
inline
Definition at line 625 of file opennurbs_textiterator.h.
◆ IsBold()
 bool ON_RtfFirstChar::TextRun::IsBold  |  ( |   | ) |   const
inline
Definition at line 645 of file opennurbs_textiterator.h.
◆ IsItalic()
 bool ON_RtfFirstChar::TextRun::IsItalic  |  ( |   | ) |   const
inline
Definition at line 649 of file opennurbs_textiterator.h.
◆ IsStrikeThrough()
 bool ON_RtfFirstChar::TextRun::IsStrikeThrough  |  ( |   | ) |   const
inline
Definition at line 657 of file opennurbs_textiterator.h.
◆ IsUnderlined()
 bool ON_RtfFirstChar::TextRun::IsUnderlined  |  ( |   | ) |   const
inline
Definition at line 653 of file opennurbs_textiterator.h.
◆ SetBold()
 void ON_RtfFirstChar::TextRun::SetBold  |  ( |  bool  |  b | )
inline
Definition at line 661 of file opennurbs_textiterator.h.
◆ SetFontIndex()
 void ON_RtfFirstChar::TextRun::SetFontIndex  |  ( |  int  |  index | )
inline
Definition at line 639 of file opennurbs_textiterator.h.
◆ SetItalic()
 void ON_RtfFirstChar::TextRun::SetItalic  |  ( |  bool  |  b | )
inline
Definition at line 665 of file opennurbs_textiterator.h.
◆ SetStrikeThrough()
 void ON_RtfFirstChar::TextRun::SetStrikeThrough  |  ( |  bool  |  b | )
inline
Definition at line 673 of file opennurbs_textiterator.h.
◆ SetType()
 void ON_RtfFirstChar::TextRun::SetType  |  ( |  ON_TextRun::RunType  |  type | )
inline
Definition at line 621 of file opennurbs_textiterator.h.
◆ SetUnderlined()
 void ON_RtfFirstChar::TextRun::SetUnderlined  |  ( |  bool  |  b | )
inline
Definition at line 669 of file opennurbs_textiterator.h.
◆ Text()
 const ON_wString& ON_RtfFirstChar::TextRun::Text  |  ( |   | )
inline
Definition at line 687 of file opennurbs_textiterator.h.
◆ Type()
 ON_TextRun::RunType ON_RtfFirstChar::TextRun::Type  |  ( |   | ) |   const
inline
Definition at line 617 of file opennurbs_textiterator.h.