Public Attributes | List of all members
ON_MeshXPointPair Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Attributes
class ON_MeshXPoint *  | m_mxpoint [2]
Detailed Description
Definition at line 6110 of file opennurbs_mesh.h.
Member Data Documentation
◆ m_mxpoint
 class ON_MeshXPoint* ON_MeshXPointPair::m_mxpoint[2]
Definition at line 6113 of file opennurbs_mesh.h.