Public Attributes | List of all members
CRhinoOnBeforePostReadViewUpdate::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
const CRhinoFileReadOptions *  | m_fro
File reading information. More...
Detailed Description
Definition at line 1880 of file rhinoSdkEventWatcher.h.
Member Data Documentation
◆ m_fro
 const CRhinoFileReadOptions* CRhinoOnBeforePostReadViewUpdate::CParameters::m_fro
File reading information.
Definition at line 1884 of file rhinoSdkEventWatcher.h.