Public Attributes | List of all members
CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO Struct Reference
#include <RhinoSdkUiTabbedSheetCtrl.h>
 Public Attributes
bool  | m_bool
HWND  | m_hWnd
Event source. More...
int  | m_iItem
Zero based index for tab generating the message. More...
LPCTSTR  | m_lpsText
UINT  | m_nMsg
Event (selection change, item deleted, etc ) More...
int  | m_nPrevSel
POINT  | m_pt
Mouse event point. More...
Detailed Description
Definition at line 346 of file RhinoSdkUiTabbedSheetCtrl.h.
Member Data Documentation
◆ m_bool
 bool CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_bool
Message dependant: mid_begin_tab_drag = If true then drag operation will continue as normal otherwise it will be aborted.
Definition at line 355 of file RhinoSdkUiTabbedSheetCtrl.h.
◆ m_hWnd
 HWND CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_hWnd
Event source.
Definition at line 348 of file RhinoSdkUiTabbedSheetCtrl.h.
◆ m_iItem
 int CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_iItem
Zero based index for tab generating the message.
Definition at line 350 of file RhinoSdkUiTabbedSheetCtrl.h.
◆ m_lpsText
 LPCTSTR CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_lpsText
Pointer to string used by mid_begin_label_edit and mid_end_label_edit messages.
Definition at line 353 of file RhinoSdkUiTabbedSheetCtrl.h.
◆ m_nMsg
 UINT CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_nMsg
Event (selection change, item deleted, etc )
Definition at line 349 of file RhinoSdkUiTabbedSheetCtrl.h.
◆ m_nPrevSel
 int CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_nPrevSel
Zero based index for previous current tab, only valid for mid_sel_changing and mid_sel_changed messages.
Definition at line 351 of file RhinoSdkUiTabbedSheetCtrl.h.
◆ m_pt
 POINT CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_pt
Mouse event point.
Definition at line 358 of file RhinoSdkUiTabbedSheetCtrl.h.