Grasshopper SDK
GH_ValueProxy<T>.Value Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public T Value { get; set; }
Public Property Value As T
	Get
	Set
Property Value
Type: T
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ValueProxy`1.Value"]
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace