Grasshopper SDK
GH_PersistentDataAction<T> Constructor
Initializes a new instance of the GH_PersistentDataAction<T> class
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PersistentDataAction(
	GH_PersistentParam<T> obj
)
Public Sub New (
	obj As GH_PersistentParam(Of T)
)
Parameters
obj
Type: Grasshopper.Kernel.GH_PersistentParam<T>
See Also
Reference
GH_PersistentDataAction<T> Class
Grasshopper.Kernel.Undo.Actions Namespace