Grasshopper SDK
GH_PersistentParam<T>.Menu_CreateMultilineTextEditItem Method
 This function returns a ToolstripMenuItem that embeds a multi-line textbox for editing persistent data. Only call this method if you know that your parameter type supports proxies.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected ToolStripMenuItem Menu_CreateMultilineTextEditItem()
Protected Function Menu_CreateMultilineTextEditItem As ToolStripMenuItem
Return Value
Type: ToolStripMenuItem
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace