Grasshopper SDK
IGH_Param.HasProxySources Property
 Gets a value indicating whether or not this parameter maintains proxy sources. Proxy sources are used during file IO, when actual sources might not be available yet. Once an IO operation has been completed there should be no more proxy sources.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool HasProxySources { get; }
ReadOnly Property HasProxySources As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.HasProxySources"]
Return Value
Type: Boolean
True if the parameter has at least one proxy source, false if not.
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace