Grasshopper SDK
GH_AssemblyInfo Constructor
Initializes a new instance of the GH_AssemblyInfo class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_AssemblyInfo()
Protected Sub New
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace