Grasshopper SDK
GH_SettingsServer.GetValue Method (String, Int32)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int GetValue(
	string key,
	int default
)
Public Function GetValue (
	key As String,
	default As Integer
) As Integer
Parameters
key
Type: System.String
default
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
GH_SettingsServer Class
GetValue Overload
Grasshopper.Kernel Namespace