Grasshopper SDK
GH_RhinoScriptInterface.AssignDataToParameter Method
 Find a parameter and assign some persistent data.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AssignDataToParameter(
	string parameterID,
	Object data
)
Public Function AssignDataToParameter (
	parameterID As String,
	data As Object
) As Boolean
Parameters
parameterID
Type: System.String
Instance ID of parameter or parameter name.
data
Type: System.Object
Data to assign.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace