Grasshopper SDK
GH_Document.GH_UndoUtil.RecordEvent Method (String, IGH_UndoAction)
 Add a new record to the undo stack of the owner document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid RecordEvent(
	string name,
	IGH_UndoAction action
)
Public Function RecordEvent (
	name As String,
	action As IGH_UndoAction
) As Guid
Parameters
name
Type: System.String
Name of undo record.
action
Type: Grasshopper.Kernel.Undo.IGH_UndoAction
Undo action.
Return Value
Type: Guid
The ID of the newly added undo record or Guid.Empty on failure.
See Also
Reference
GH_Document.GH_UndoUtil Class
RecordEvent Overload
Grasshopper.Kernel Namespace