Grasshopper SDK
GH_Document.PreviewBoundingBox Property
 Gets the boundingbox used for previews.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public BoundingBox PreviewBoundingBox { get; }
Public ReadOnly Property PreviewBoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.PreviewBoundingBox"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace