Grasshopper SDK
GH_MeshingParameters.RhMesherSettings_Proxy.IsParsable Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool IsParsable { get; }
Public Overrides ReadOnly Property IsParsable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_MeshingParameters.RhMesherSettings_Proxy.IsParsable"]
See Also
Reference
GH_MeshingParameters.RhMesherSettings_Proxy Class
Grasshopper.Kernel.Types Namespace