Grasshopper SDK
GH_DocumentEditor.EditorFoldStateChangedEventHandler Delegate
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void EditorFoldStateChangedEventHandler(
	GH_DocumentEditor sender,
	EventArgs e
)
Public Delegate Sub EditorFoldStateChangedEventHandler (
	sender As GH_DocumentEditor,
	e As EventArgs
)
Parameters
sender
Type: Grasshopper.GUI.GH_DocumentEditor
e
Type: System.EventArgs
See Also
Reference
Grasshopper.GUI Namespace