Grasshopper SDK
GH_DocumentAssociations.GetRhinoAssociations Method
 Find all the Rhino 3dm files that have been associated with a given Grasshopper file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string> GetRhinoAssociations(
	string grasshopperFile
)
Public Function GetRhinoAssociations (
	grasshopperFile As String
) As List(Of String)
Parameters
grasshopperFile
Type: System.String
Grasshopper file path.
Return Value
Type: List<String>
A list of files, ordered chronologically (most recent association first)
See Also
Reference
GH_DocumentAssociations Class
Grasshopper.Kernel Namespace