Grasshopper SDK
GH_ColourPicker Class
 Provides the standard Grasshopper Colour picker as a winforms Control.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Grasshopper.GUI.GH_ColourPicker
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ColourPicker : UserControl
Public Class GH_ColourPicker
	Inherits UserControl
The GH_ColourPicker type exposes the following members.
Constructors
Name | Description
GH_ColourPicker
Initializes a new instance of the GH_ColourPicker class
Top
Properties
Name | Description
AllowNumericInput
 Gets or sets whether this colour picker pops up a textbox on channel slider double clicks.
Colour
 Gets or sets the colour currently specified in the picker.
DesiredHeight
 Gets the ideal height for this control given the current width and UI settings.
ShowAlphaSlider
 Gets or sets whether the alpha channel slider is included.
ShowChannelSliders
 Gets or sets whether the channel sliders are included.
SliceRectangle
 Gets the rectangle that outlines the colour cube slice.
Top
Methods
Name | Description
Dispose
Releases the unmanaged resources used by the GH_ColourPicker and optionally releases the managed resources
 (Overrides ContainerControl.Dispose(Boolean).)
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
Top
Events
Name | Description
ColourChanged
 Raised whenever the value of the slider is changed via GUI interaction.
Top
See Also
Reference
Grasshopper.GUI Namespace