Grasshopper SDK
GH_ComponentAttributes Class
 These Attributes are the default for GH_Components.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_Attributes<IGH_Component>
 Grasshopper.Kernel.Attributes.GH_ComponentAttributes
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ComponentAttributes : GH_Attributes<IGH_Component>
Public Class GH_ComponentAttributes
	Inherits GH_Attributes(Of IGH_Component)
The GH_ComponentAttributes type exposes the following members.
Constructors
Name | Description
GH_ComponentAttributes
Initializes a new instance of the GH_ComponentAttributes class
Top
Properties
Name | Description
ContentBox
 Gets the bounds of the component area of the attributes.
HasInputGrip |  (Overrides GH_Attributes<T>.HasInputGrip.)
HasOutputGrip |  (Overrides GH_Attributes<T>.HasOutputGrip.)
PathName |  (Overrides GH_Attributes<T>.PathName.)
Top
Methods
Name | Description
AppendToAttributeTree |  (Overrides GH_Attributes<T>.AppendToAttributeTree(List<IGH_Attributes>).)
ExpireLayout |  (Overrides GH_Attributes<T>.ExpireLayout().)
InvalidateCanvas
 The canvas must be invalidated when the mouse is near enough and this component has variable parameters.
 (Overrides GH_Attributes<T>.InvalidateCanvas(GH_Canvas, GH_CanvasMouseEvent).)
Layout |  (Overrides GH_Attributes<T>.Layout().)
LayoutBounds
LayoutComponentBox
 Utility layout method for GH_Component style UI.
LayoutInputParams
LayoutOutputParams
Render |  (Overrides GH_Attributes<T>.Render(GH_Canvas, Graphics, GH_CanvasChannel).)
RenderComponentCapsule(GH_Canvas, Graphics)
 Utility function, draws the complete component capsule including all parameter data.
RenderComponentCapsule(GH_Canvas, Graphics, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Utility function, draws the component capsule including all specified elements.
RenderComponentParameters
 Utility method for rendering all component parameters.
RenderVariableParameterUI
RespondToMouseDown |  (Overrides GH_Attributes<T>.RespondToMouseDown(GH_Canvas, GH_CanvasMouseEvent).)
SetupTooltip |  (Overrides GH_Attributes<T>.SetupTooltip(PointF, GH_TooltipDisplayEventArgs).)
Top
Fields
Name | Description
m_innerBounds
 Represents the Rectangle that contains the component black box.
Top
See Also
Reference
Grasshopper.Kernel.Attributes Namespace