Grasshopper SDK
GH_CanvasWireValidator.CanDeleteObject Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CanDeleteObject(
	IGH_DocumentObject object
)
Public Overrides Function CanDeleteObject (
	object As IGH_DocumentObject
) As Boolean
Parameters
object
Type: Grasshopper.Kernel.IGH_DocumentObject
Return Value
Type: Boolean
See Also
Reference
GH_CanvasWireValidator Class
Grasshopper.GUI.Canvas Namespace