Grasshopper SDK
GH_Capsule.Dispose Method
Releases all resources used by the GH_Capsule
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
GH_Capsule Class
Dispose Overload
Grasshopper.GUI.Canvas Namespace