Grasshopper SDK
GH_ActiveObject.DependsOn Method
 Returns a boolean indicating whether or not the current object somehow inherits from the PotenialSource object
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract bool DependsOn(
	IGH_ActiveObject PotentialSource
)
Public MustOverride Function DependsOn (
	PotentialSource As IGH_ActiveObject
) As Boolean
Parameters
PotentialSource
Type: Grasshopper.Kernel.IGH_ActiveObject
Return Value
Type: Boolean
Implements
IGH_ActiveObject.DependsOn(IGH_ActiveObject)
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace