Grasshopper SDK
IRcpAwareObject.PublishRcpItem Method
 Emit a new object to be inserted on a Remote Control Panel.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IRcpItem PublishRcpItem()
Function PublishRcpItem As IRcpItem
Return Value
Type: IRcpItem
See Also
Reference
IRcpAwareObject Interface
Grasshopper.Kernel Namespace