Grasshopper SDK
GH_Surface.Face Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public BrepFace Face { get; }
Public ReadOnly Property Face As BrepFace
	Get
Property Value
Type: BrepFace
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Surface.Face"]
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace