Grasshopper SDK
GH_RelevantObjectData.Parameter Property
 Gets the cast of the DocObject to IGH_Param. If the DocObject is not of type IGH_Param, the attributes of the object will be perused to find a nested IGH_Param at the point.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Param Parameter { get; }
Public ReadOnly Property Parameter As IGH_Param
	Get
Property Value
Type: IGH_Param
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RelevantObjectData.Parameter"]
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace