Grasshopper SDK
GH_DebugDescriptionWriter.WriteLine Method (String)
 Write a new line to the log.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void WriteLine(
	string line
)
Public Sub WriteLine (
	line As String
)
Parameters
line
Type: System.String
Line to write.
See Also
Reference
GH_DebugDescriptionWriter Class
WriteLine Overload
Grasshopper.Kernel Namespace