Grasshopper SDK
GH_DocumentObject.DisplayExpired Event
 Raised whenever the display (on the Canvas) of a certain object becomes invalid.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event IGH_DocumentObject.DisplayExpiredEventHandler DisplayExpired
Public Event DisplayExpired As IGH_DocumentObject.DisplayExpiredEventHandler
Value
Type: Grasshopper.Kernel.IGH_DocumentObject.DisplayExpiredEventHandler
Implements
IGH_DocumentObject.DisplayExpired
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace