Grasshopper SDK
GH_GHXHarvester.HarvestPivots Method (GH_IReader)
 Harvest all attribute pivots from a GHX/GH node.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<PointF> HarvestPivots(
	GH_IReader node
)
Public Shared Function HarvestPivots (
	node As GH_IReader
) As List(Of PointF)
Parameters
node
Type: GH_IO.Serialization.GH_IReader
Node to parse.
Return Value
Type: List<PointF>
A list of all attribute pivots or null on failure.
See Also
Reference
GH_GHXHarvester Class
HarvestPivots Overload
Grasshopper.Kernel Namespace