Grasshopper SDK
GH_ObjectSpecies Enumeration
 Contains all object species.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[FlagsAttribute]
public enum GH_ObjectSpecies
<FlagsAttribute>
Public Enumeration GH_ObjectSpecies
Members
Member name | Value | Description
none | 0 |  Indicates no object type
doc_object | 1 |  Represents any object that implements IGH_DocumentObject
parameter | 16 |  Indicates classes that implement IGH_Param
component | 32 |  Indicates classes that implement IGH_Component
group | 64 |  Indicates classes of type GH_Group
wire | 128 |  Currently this is not yet an object type.
grip_in | 256 |  Represents an input grip.
grip_out | 512 |  Represents an output grip.
grip | 768 |  Represents an input or output grip.
balloon | 1024 |  Represents an attribute balloon.
any | 4294967295 |  Indicates all object types.
See Also
Reference
Grasshopper.Kernel Namespace