Grasshopper SDK
GH_VerticalSeparator Constructor
Initializes a new instance of the GH_VerticalSeparator class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_VerticalSeparator()
Public Sub New
See Also
Reference
GH_VerticalSeparator Class
Grasshopper.GUI Namespace