Grasshopper SDK
GH_GooProxy<T>.StringToNumber Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected double StringToNumber(
	string text
)
Protected Function StringToNumber (
	text As String
) As Double
Parameters
text
Type: System.String
Return Value
Type: Double
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace