Grasshopper SDK
GH_PreviewWireArgs Constructor
Initializes a new instance of the GH_PreviewWireArgs class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PreviewWireArgs(
	RhinoViewport vp,
	DisplayPipeline pl,
	Color col,
	int thickness
)
Public Sub New (
	vp As RhinoViewport,
	pl As DisplayPipeline,
	col As Color,
	thickness As Integer
)
Parameters
vp
Type: RhinoViewport
pl
Type: DisplayPipeline
col
Type: System.Drawing.Color
thickness
Type: System.Int32
See Also
Reference
GH_PreviewWireArgs Class
Grasshopper.Kernel Namespace