Grasshopper SDK
GH_UndoRecord Constructor (String, IEnumerable<IGH_UndoAction>)
Initializes a new instance of the GH_UndoRecord class
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoRecord(
	string name,
	IEnumerable<IGH_UndoAction> actions
)
Public Sub New (
	name As String,
	actions As IEnumerable(Of IGH_UndoAction)
)
Parameters
name
Type: System.String
actions
Type: System.Collections.Generic.IEnumerable<IGH_UndoAction>
See Also
Reference
GH_UndoRecord Class
GH_UndoRecord Overload
Grasshopper.Kernel.Undo Namespace