Grasshopper SDK
GH_StateTag.RenderTagBlankIcon Method (Graphics)
 Render a blank rectangle icon.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void RenderTagBlankIcon(
	Graphics graphics
)
Protected Sub RenderTagBlankIcon (
	graphics As Graphics
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
See Also
Reference
GH_StateTag Class
RenderTagBlankIcon Overload
Grasshopper.Kernel Namespace