Grasshopper SDK
GH_MemoryBitmap.Filter_DropShadow Method
 Add a drop-shadow to the image. Image is not grown, so if you want the drop shadow to extend beyond the image boundaries, you have to add padding to the image first.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_DropShadow(
	Size offset,
	int blur,
	double darkness
)
Public Sub Filter_DropShadow (
	offset As Size,
	blur As Integer,
	darkness As Double
)
Parameters
offset
Type: System.Drawing.Size
Number of pixels (x and y) to offset the drop shadow.
blur
Type: System.Int32
Amount of blurring for the shadow.
darkness
Type: System.Double
Darkness factor for the shadow.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace