Grasshopper SDK
IGH_Attributes.InputGrip Property
 Gets the input grip location for these attributes. If HasInputGrip equals False, this point is meaningless.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
PointF InputGrip { get; }
ReadOnly Property InputGrip As PointF
	Get
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.InputGrip"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace