Grasshopper SDK
GH_CapsuleRenderEngine.CreateJaggedRectangle Method
 Static (Shared in VB) method for creating rectangles with rounded corners.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath CreateJaggedRectangle(
	RectangleF rec,
	float R0,
	float R1,
	float R2,
	float R3,
	bool jaggedLeft,
	bool jaggedRight
)
Public Shared Function CreateJaggedRectangle (
	rec As RectangleF,
	R0 As Single,
	R1 As Single,
	R2 As Single,
	R3 As Single,
	jaggedLeft As Boolean,
	jaggedRight As Boolean
) As GraphicsPath
Parameters
rec
Type: System.Drawing.RectangleF
Rectangle to fillet. Rectangles smaller than 3 pixels wide/high will be grown.
R0
Type: System.Single
Radius of upper left corner. Zero or negative values omit fillets.
R1
Type: System.Single
Radius of upper right corner. Zero or negative values omit fillets.
R2
Type: System.Single
Radius of lower right corner. Zero or negative values omit fillets.
R3
Type: System.Single
Radius of lower left corner. Zero or negative values omit fillets.
jaggedLeft
Type: System.Boolean
If true, the left edge of the rectangle will be jagged and R0 and R3 will be ignored.
jaggedRight
Type: System.Boolean
If true, the right edge of the rectangle will be jagged and R1 and R2 will be ignored.
Return Value
Type: GraphicsPath
Graphics path that describes the rounded rectangle.
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace