Grasshopper SDK
GH_Document.FilterUnselected Method
 Filter a list of objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<IGH_DocumentObject> FilterUnselected(
	List<IGH_DocumentObject> in
)
Public Shared Function FilterUnselected (
	in As List(Of IGH_DocumentObject)
) As List(Of IGH_DocumentObject)
Parameters
in
Type: System.Collections.Generic.List<IGH_DocumentObject>
The object list to filter
Return Value
Type: List<IGH_DocumentObject>
A list containing only the unselected objects
Remarks
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace