Grasshopper SDK
GH_CanvasValidator.CanAcceptObject Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool CanAcceptObject(
	Guid id
)
Public Overridable Function CanAcceptObject (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
Return Value
Type: Boolean
Implements
IGH_CanvasValidator.CanAcceptObject(Guid)
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace