Grasshopper SDK
GH_ExpressionParser.Evaluate Method (Queue<GH_ParserSymbol>)
 Evaluate the expression queue without overriding any local caches. You can obtain an expression queue by calling CachedSymbols()
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant Evaluate(
	Queue<GH_ParserSymbol> qHint
)
Public Function Evaluate (
	qHint As Queue(Of GH_ParserSymbol)
) As GH_Variant
Parameters
qHint
Type: System.Collections.Generic.Queue<GH_ParserSymbol>
Return Value
Type: GH_Variant
See Also
Reference
GH_ExpressionParser Class
Evaluate Overload
Grasshopper.Kernel.Expressions Namespace