Grasshopper SDK
GH_Skin.wire_empty Field
 Specifies the colour for empty (null) wires.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color wire_empty
Public Shared wire_empty As Color
Field Value
Type: Color
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace