Grasshopper SDK
GH_ComponentParamServer.CreateDuplicate Method
 Attempts to duplicate a parameter. Attributes will be ignored. Warning! The duplicate will have the same ID as the original!
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static IGH_Param CreateDuplicate(
	IGH_Param original
)
Public Shared Function CreateDuplicate (
	original As IGH_Param
) As IGH_Param
Parameters
original
Type: Grasshopper.Kernel.IGH_Param
Parameter to duplicate.
Return Value
Type: IGH_Param
A dupicate of the original or null on failure.
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace