Grasshopper SDK
Scale Class
 Implements a scaling transformation.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.Transforms.Scale
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class Scale : ITransform
Public Class Scale
	Implements ITransform
The Scale type exposes the following members.
Constructors
Name | Description
Scale()
Initializes a new instance of the Scale class
Scale(Plane, Double)
Initializes a new instance of the Scale class
Scale(Point3d, Double)
Initializes a new instance of the Scale class
Scale(Plane, Double, Double, Double)
Initializes a new instance of the Scale class
Top
Properties
Name | Description
Name
ScaleXFactor
ScaleYFactor
ScaleZFactor
ScalingFrame
Top
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Grasshopper.Kernel.Types.Transforms Namespace