Grasshopper SDK
GH_ScriptVariant.m_type Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_ScriptVariantType m_type
Protected m_type As GH_ScriptVariantType
Field Value
Type: GH_ScriptVariantType
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace