Grasshopper SDK
GH_IndexRange.AdjacentTo Method
 Tests whether this range is adjacent to another.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AdjacentTo(
	GH_IndexRange range
)
Public Function AdjacentTo (
	range As GH_IndexRange
) As Boolean
Parameters
range
Type: Grasshopper.Kernel.Data.GH_IndexRange
Range to test.
Return Value
Type: Boolean
True if the ranges are adjacent and not intersecting.
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace