Grasshopper SDK
IGH_BakeAwareObject.IsBakeCapable Property
 Gets a value indicating whether or not the object can potentially Bake data in its current state.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsBakeCapable { get; }
ReadOnly Property IsBakeCapable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_BakeAwareObject.IsBakeCapable"]
See Also
Reference
IGH_BakeAwareObject Interface
Grasshopper.Kernel Namespace