Grasshopper SDK
IGH_DataAccess.SetDataList Method (Int32, IEnumerable)
 Stores a list of data in an output parameter during GH_Component.SolveInstance().
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool SetDataList(
	int paramIndex,
	IEnumerable data
)
Function SetDataList (
	paramIndex As Integer,
	data As IEnumerable
) As Boolean
Parameters
paramIndex
Type: System.Int32
Index of the output parameter at which to store the list.
data
Type: System.Collections.IEnumerable
Data to store. Data will be converted if necessary, but it will not be duplicated automatically.
Return Value
Type: Boolean
See Also
Reference
IGH_DataAccess Interface
SetDataList Overload
Grasshopper.Kernel Namespace