Grasshopper SDK
GH_ObjectChangedEventArgs Class
 Event arguments passed during ObjectChanged events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_ObjectChangedEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ObjectChangedEventArgs : EventArgs
Public Class GH_ObjectChangedEventArgs
	Inherits EventArgs
The GH_ObjectChangedEventArgs type exposes the following members.
Constructors
Name | Description
GH_ObjectChangedEventArgs(IGH_DocumentObject, GH_ObjectEventType)
Initializes a new instance of the GH_ObjectChangedEventArgs class
GH_ObjectChangedEventArgs(IGH_DocumentObject, String)
Initializes a new instance of the GH_ObjectChangedEventArgs class
GH_ObjectChangedEventArgs(IGH_DocumentObject, GH_ObjectEventType, Object)
Initializes a new instance of the GH_ObjectChangedEventArgs class
GH_ObjectChangedEventArgs(IGH_DocumentObject, String, Object)
Initializes a new instance of the GH_ObjectChangedEventArgs class
Top
Properties
Name | Description
CustomType
 Gets the customised type description of this event. This field is only set when the Type is GH_ObjectEventType.Custom.
Sender
 Gets the object which raised this event.
Tag
 Gets the tag for this event.
Type
 Gets the type of this event.
Top
Fields
Name | Description
m_custom
m_sender
m_tag
m_type
Top
See Also
Reference
Grasshopper.Kernel Namespace