Grasshopper SDK
GH_ConnectivityDiagram.Nodes Property
 Gets a proxy for all the Nodes in this diagram.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public ReadOnlyCollection<Guid> Nodes { get; }
Public ReadOnly Property Nodes As ReadOnlyCollection(Of Guid)
	Get
Property Value
Type: ReadOnlyCollection<Guid>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ConnectivityDiagram.Nodes"]
See Also
Reference
GH_ConnectivityDiagram Class
Grasshopper.Kernel Namespace