Grasshopper SDK
IGH_PreviewMeshData.GetPreviewMeshes Method
 Gets all the preview meshes associated with this data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Mesh[] GetPreviewMeshes()
Function GetPreviewMeshes As Mesh()
Return Value
Type: Mesh[]
An array of meshes that represent the preview meshes of this data.
See Also
Reference
IGH_PreviewMeshData Interface
Grasshopper.Kernel Namespace