Grasshopper SDK
Node3d<T>.AddRange Method
 Insert a collection of items into the tree. The items should all be within the region of this node.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddRange(
	IEnumerable<T> items
)
Public Sub AddRange (
	items As IEnumerable(Of T)
)
Parameters
items
Type: System.Collections.Generic.IEnumerable<T>
Items to add.
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace