Grasshopper SDK
GH_ColourPickerBase.BaseColour Property
 Gets the original base colour for this picker. Use SetupColourPicker to assign this colour.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color BaseColour { get; }
Public ReadOnly Property BaseColour As Color
	Get
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.BaseColour"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace