Grasshopper SDK
GH_ResizeBorder.Solve Method
 Solve a resizing step.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Solve(
	PointF nCursor,
	out RectangleF new_shape,
	out PointF new_pivot
)
Public Sub Solve (
	nCursor As PointF,
	<OutAttribute> ByRef new_shape As RectangleF,
	<OutAttribute> ByRef new_pivot As PointF
)
Parameters
nCursor
Type: System.Drawing.PointF
The new cursor location.
new_shape
Type: System.Drawing.RectangleF
The resized shape bounding box.
new_pivot
Type: System.Drawing.PointF
The adjusted shape pivot.
See Also
Reference
GH_ResizeBorder Class
Grasshopper.GUI.Canvas Namespace