Grasshopper SDK
GH_State.ClearStates Method
 Removes all items from the state database.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearStates()
Public Sub ClearStates
See Also
Reference
GH_State Class
Grasshopper.Kernel Namespace