Grasshopper SDK
DataTree<T>.ToString Method
 Creates a brief description of the tree.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A String representing the current state of the data tree.
See Also
Reference
DataTree<T> Class
Grasshopper Namespace