Grasshopper SDK
GH_Goo<T>.Write Method
 Default behaviour is to return True.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool Write(
	GH_IWriter writer
)
Public Overridable Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
Implements
GH_ISerializable.Write(GH_IWriter)
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace