Grasshopper SDK
GH_DataMapping Enumeration
 Enumerates all parameter data mapping types.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_DataMapping
Public Enumeration GH_DataMapping
Members
Member name | Value | Description
None | 0 |  Data is not mapped.
Flatten | 1 |  Data is flattened inside this parameter.
Graft | 2 |  Data is grafted inside this parameter.
See Also
Reference
Grasshopper.Kernel Namespace