Grasshopper SDK
GH_DocumentEditor Class
 The Grasshopper main window.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Grasshopper.GUI.GH_DocumentEditor
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocumentEditor : Form
Public Class GH_DocumentEditor
	Inherits Form
The GH_DocumentEditor type exposes the following members.
Constructors
Name | Description
GH_DocumentEditor
Initializes a new instance of the GH_DocumentEditor class
Top
Properties
Name | Description
Collapsed
 Gets a value indicating whether or not the form is currently collapsed.
FormShepard
 Gets the form shepard for this window. Register your modeless dialogs with this shepard if you want to be popular.
Top
Methods
Name | Description
ClearStatusBar
 Clear the Grasshopper status-bar.
CloseForReal
 Really, really close the window.
CollapseForm
 Collapses the form into the title bar area.
DisableUI
 Disable all modifier UI.
Dispose
Releases the unmanaged resources used by the GH_DocumentEditor and optionally releases the managed resources
 (Overrides Form.Dispose(Boolean).)
EnableUI
 Enable all modifier UI.
ExpandForm
 Expands the form if it is currenly collapsed.
FadeIn
 Call this method if the prompt switches back to Grasshopper.
FadeOut
 Call this method if the prompt switches to Rhino.
FixCanvasToolbarState
 Enabled/Disables the appropriate buttons depending on whether there is a document loaded on the canvas.
ScriptAccess_CloseAllDocuments
 Closes all documents in the Document Queue.
ScriptAccess_CloseDocument
 Closes the currently active document and loads the next available document into the canvas. Changes will not be saved.
ScriptAccess_IsDocument
 Returns true if there is an active document.
ScriptAccess_IsDocumentModified
 Gets the modified flag of the currently loaded document.
ScriptAccess_NewDocument
 Creates a new document and loads it into the Canvas.
ScriptAccess_OpenDocument()
 Displays a command line interface for File Open... then loads that file into the Canvas.
ScriptAccess_OpenDocument(String)
 Loads a specific file off the hard disk into the Canvas.
ScriptAccess_SaveDocument
 Saves the document currently loaded in the Canvas. If the document hasn't been saved before then a Save... dialog box will be shown.
ScriptAccess_SaveDocumentAs()
 Saves the currently active document to disk.
ScriptAccess_SaveDocumentAs(String)
 Saves the currently active document to disk.
SetStatusBarEvent
 Set a new message on the Grasshopper status bar.
ToggleForm
 Collapses the form if it's currently expanded or expands the form if it's currently collapsed.
WndProc
 WndProc is overridden in order to allow for title-bar double-click (un)folding.
 (Overrides Form.WndProc(Message).)
Top
Events
Name | Description
AggregateShortcutMenuItems
 This event is raised whenever a GH_DocumentEditor collects all shortcuttable menu items. If you added items to the menu and you want to be able to have custom shortcuts on these items, you must handle this event and insert your own items.
EditorFoldStateChanged
 This event is raised whenever the main windows folds or unfolds.
Top
See Also
Reference
Grasshopper.GUI Namespace