Grasshopper SDK
GH_DocumentObject.RecordUndoEvent Method (String, IGH_UndoAction)
 Record a specific object change undo event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid RecordUndoEvent(
	string name,
	IGH_UndoAction action
)
Public Function RecordUndoEvent (
	name As String,
	action As IGH_UndoAction
) As Guid
Parameters
name
Type: System.String
Name of undo record.
action
Type: Grasshopper.Kernel.Undo.IGH_UndoAction
Undo action to record.
Return Value
Type: Guid
The ID of the newly added record or Guid.Empty on failure.
Implements
IGH_DocumentObject.RecordUndoEvent(String, IGH_UndoAction)
See Also
Reference
GH_DocumentObject Class
RecordUndoEvent Overload
Grasshopper.Kernel Namespace