Grasshopper SDK
GH_Surface.DestroyPreviewMeshes Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DestroyPreviewMeshes()
Public Sub DestroyPreviewMeshes
Implements
IGH_PreviewMeshData.DestroyPreviewMeshes()
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace