Grasshopper SDK
GH_DocumentEditor.ScriptAccess_CloseDocument Method
 Closes the currently active document and loads the next available document into the canvas. Changes will not be saved.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ScriptAccess_CloseDocument()
Public Function ScriptAccess_CloseDocument As Boolean
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace