Grasshopper SDK
GH_Capsule.RenderEngine Property
 Gets the RenderEngine associated with this capsule. You typically don't need to go this far, just use one of the Render() overloads on GH_Capsule directly.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CapsuleRenderEngine RenderEngine { get; }
Public ReadOnly Property RenderEngine As GH_CapsuleRenderEngine
	Get
Property Value
Type: GH_CapsuleRenderEngine
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.RenderEngine"]
Remarks
Do not store pointers to the RenderEngine, always call this property anew.
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace