Grasshopper SDK
GH_ExternalFileConflictDialog Constructor
Initializes a new instance of the GH_ExternalFileConflictDialog class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ExternalFileConflictDialog()
Public Sub New
See Also
Reference
GH_ExternalFileConflictDialog Class
Grasshopper.GUI Namespace