Grasshopper SDK
GH_AssemblyFolderInfo Constructor
Initializes a new instance of the GH_AssemblyFolderInfo class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_AssemblyFolderInfo(
	string folder,
	GH_PluginFolderType type
)
Public Sub New (
	folder As String,
	type As GH_PluginFolderType
)
Parameters
folder
Type: System.String
type
Type: Grasshopper.Kernel.GH_PluginFolderType
See Also
Reference
GH_AssemblyFolderInfo Structure
Grasshopper.Kernel Namespace