Grasshopper SDK
GH_ComponentAttributes.RenderVariableParameterUI Method
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void RenderVariableParameterUI(
	GH_Canvas canvas,
	Graphics graphics
)
Protected Sub RenderVariableParameterUI (
	canvas As GH_Canvas,
	graphics As Graphics
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
graphics
Type: System.Drawing.Graphics
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace