Grasshopper SDK
GH_DocumentObject Constructor (String, String, String, String)
Initializes a new instance of the GH_DocumentObject class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_DocumentObject(
	string name,
	string nickname,
	string description,
	string category
)
Protected Sub New (
	name As String,
	nickname As String,
	description As String,
	category As String
)
Parameters
name
Type: System.String
nickname
Type: System.String
description
Type: System.String
category
Type: System.String
See Also
Reference
GH_DocumentObject Class
GH_DocumentObject Overload
Grasshopper.Kernel Namespace