Grasshopper SDK
GH_IndexRanges.RemoveRange Method
 Remove an index range from the collection.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RemoveRange(
	GH_IndexRange range
)
Public Function RemoveRange (
	range As GH_IndexRange
) As Boolean
Parameters
range
Type: Grasshopper.Kernel.Data.GH_IndexRange
Range to remove.
Return Value
Type: Boolean
True if the collection was meaningfully modified.
See Also
Reference
GH_IndexRanges Class
Grasshopper.Kernel.Data Namespace