Grasshopper SDK
Identity.ToString Method
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
Implements
ITransform.ToString()
See Also
Reference
Identity Class
Grasshopper.Kernel.Types.Transforms Namespace