Grasshopper SDK
GH_CanvasWireValidator.CanDeleteWire Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CanDeleteWire(
	IGH_Param source,
	IGH_Param target
)
Public Overrides Function CanDeleteWire (
	source As IGH_Param,
	target As IGH_Param
) As Boolean
Parameters
source
Type: Grasshopper.Kernel.IGH_Param
target
Type: Grasshopper.Kernel.IGH_Param
Return Value
Type: Boolean
See Also
Reference
GH_CanvasWireValidator Class
Grasshopper.GUI.Canvas Namespace