Grasshopper SDK
GH_CodeString Constructor
Initializes a new instance of the GH_CodeString class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CodeString(
	string input
)
Public Sub New (
	input As String
)
Parameters
input
Type: System.String
See Also
Reference
GH_CodeString Class
Grasshopper.Kernel.Expressions Namespace