Grasshopper SDK
GH_StandardIcons.ClusterIcon_24x24 Property
 Gets the icon used for clusters.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Bitmap ClusterIcon_24x24 { get; }
Public Shared ReadOnly Property ClusterIcon_24x24 As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.GH_StandardIcons.ClusterIcon_24x24"]
See Also
Reference
GH_StandardIcons Class
Grasshopper.GUI Namespace