Grasshopper SDK
GH_ColourPickerBase.HSVSpaceBox Property
 Gets the rectangle containing the base colour space.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle HSVSpaceBox { get; }
Public ReadOnly Property HSVSpaceBox As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.HSVSpaceBox"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace