Grasshopper SDK
DataTree<T> Constructor (DataTree<T>, DataTree<T>.DuplicateT)
 Create a true duplicate of another data tree.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DataTree(
	DataTree<T> other,
	DataTree<T>.DuplicateT copyDelegate
)
Public Sub New (
	other As DataTree(Of T),
	copyDelegate As DataTree<T>.DuplicateT
)
Parameters
other
Type: Grasshopper.DataTree<T>
Tree to duplicate
copyDelegate
Type: Grasshopper.DataTree<T>.DuplicateT
Delegate function used to duplicate individual items.
See Also
Reference
DataTree<T> Class
DataTree<T> Overload
Grasshopper Namespace