Grasshopper SDK
GH_WireSettings.SelectedColour0 Property
 Gets or sets the colour of a wire at the selected extreme.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color SelectedColour0 { get; set; }
Public Property SelectedColour0 As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_WireSettings.SelectedColour0"]
See Also
Reference
GH_WireSettings Class
Grasshopper.GUI.Theme Namespace