Grasshopper SDK
GH_Box.Value Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override Box Value { get; set; }
Public Overrides Property Value As Box
	Get
	Set
Property Value
Type: Box
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Box.Value"]
See Also
Reference
GH_Box Class
Grasshopper.Kernel.Types Namespace