Grasshopper SDK
GH_DataMatchingAction Class
 Records a single Component DataComparison event.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ObjectUndoAction
 Grasshopper.Kernel.Undo.Actions.GH_DataMatchingAction
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DataMatchingAction : GH_ObjectUndoAction
Public Class GH_DataMatchingAction
	Inherits GH_ObjectUndoAction
The GH_DataMatchingAction type exposes the following members.
Constructors
Name | Description
GH_DataMatchingAction
Initializes a new instance of the GH_DataMatchingAction class
Top
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
Methods
Name | Description
Object_Redo |  (Overrides GH_ObjectUndoAction.Object_Redo(GH_Document, IGH_DocumentObject).)
Object_Undo |  (Overrides GH_ObjectUndoAction.Object_Undo(GH_Document, IGH_DocumentObject).)
Top
See Also
Reference
Grasshopper.Kernel.Undo.Actions Namespace