Grasshopper SDK
GH_Animator<T>.Phase Property
 Gets the current animation phase.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_AnimationPhase Phase { get; }
Public ReadOnly Property Phase As GH_AnimationPhase
	Get
Property Value
Type: GH_AnimationPhase
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Animator`1.Phase"]
See Also
Reference
GH_Animator<T> Class
Grasshopper.GUI Namespace