Grasshopper SDK
IGH_FieldElement.Limits Property
 Gets or sets the limits of this region. Unless IsLimited equals true, the Limits property is ignored.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Box Limits { get; set; }
Property Limits As Box
	Get
	Set
Property Value
Type: Box
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_FieldElement.Limits"]
See Also
Reference
IGH_FieldElement Interface
Grasshopper.Kernel.Types Namespace