Grasshopper SDK
GH_Format.FormatLine Method (Line)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatLine(
	Line data
)
Public Shared Function FormatLine (
	data As Line
) As String
Parameters
data
Type: Line
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatLine Overload
Grasshopper.Kernel Namespace