Grasshopper SDK
GH_DocumentTree.Root Property
 Gets the root node for this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentTreeNode Root { get; }
Public ReadOnly Property Root As GH_DocumentTreeNode
	Get
Property Value
Type: GH_DocumentTreeNode
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentTree.Root"]
See Also
Reference
GH_DocumentTree Class
Grasshopper.Kernel Namespace