Grasshopper SDK
GH_Format.FormatLineValidity Method
 If the line is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatLineValidity(
	Line val,
	string identifier = "Line"
)
Public Shared Function FormatLineValidity (
	val As Line,
	Optional identifier As String = "Line"
) As String
Parameters
val
Type: Line
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the line is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace