Grasshopper SDK
GH_Convert.GetCurveFromDocument Method
 Harvest a curve object from a Rhino document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool GetCurveFromDocument(
	RhinoDoc doc,
	Guid id,
	out Curve crv
)
Public Shared Function GetCurveFromDocument (
	doc As RhinoDoc,
	id As Guid,
	<OutAttribute> ByRef crv As Curve
) As Boolean
Parameters
doc
Type: RhinoDoc
Document to search.
id
Type: System.Guid
ID of curve object.
crv
Type: Curve
Curve result.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace