Grasshopper SDK
Node3d<T>.NearestItems Method (Double, Double, Double, Int32, Double, Double)
 Find the N nearest items.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Index3d<T>> NearestItems(
	double x,
	double y,
	double z,
	int groupSize,
	double minimumDistance,
	double maximumDistance
)
Public Function NearestItems (
	x As Double,
	y As Double,
	z As Double,
	groupSize As Integer,
	minimumDistance As Double,
	maximumDistance As Double
) As List(Of Index3d(Of T))
Parameters
x
Type: System.Double
x coordinate to search from.
y
Type: System.Double
y coordinate to search from.
z
Type: System.Double
z coordinate to search from.
groupSize
Type: System.Int32
Number of nearest items to return.
minimumDistance
Type: System.Double
Minimum distance for nearest items. Items closer than minimumDistance will be ignored.
maximumDistance
Type: System.Double
Maximum distance for nearest items. Items further than maximumDistance will be ignored.
Return Value
Type: List<Index3d<T>>
A list of nearest items, sorted from nearest to furthest.
See Also
Reference
Node3d<T> Class
NearestItems Overload
Grasshopper.Kernel.Geometry.SpatialTrees Namespace