Grasshopper SDK
GH_Attributes<T>.Pivot Property
 Gets or sets the pivot for these attributes. The pivot controls the general placement of the attributes. If you want to move the attributes, change the pivot location.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual PointF Pivot { get; set; }
Public Overridable Property Pivot As PointF
	Get
	Set
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.Pivot"]
Implements
IGH_Attributes.Pivot
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace