Grasshopper SDK
GH_Capsule.Text Property
 Gets or sets the text to render in the content box.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.Text"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace