Grasshopper SDK
GH_RuntimeFile.TagComponent Field
 String tag used to identify Component IDs in documentation source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagComponent = "COMPONENT"
Public Const TagComponent As String = "COMPONENT"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace