Grasshopper SDK
GH_GraphicsUtil.Distance Method
 Compute the distance between two points.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static float Distance(
	PointF a,
	PointF b
)
Public Shared Function Distance (
	a As PointF,
	b As PointF
) As Single
Parameters
a
Type: System.Drawing.PointF
First point.
b
Type: System.Drawing.PointF
Second point.
Return Value
Type: Single
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace