Grasshopper SDK
GH_Document.PreviewMode Property
 Gets or sets the preview display mode and makes sure the conduit instance of this class is set to match.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PreviewMode PreviewMode { get; set; }
Public Property PreviewMode As GH_PreviewMode
	Get
	Set
Property Value
Type: GH_PreviewMode
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.PreviewMode"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace