Grasshopper SDK
GH_TextBoxInputBase.RespondToEnter Method
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ToolstripItemKeyHandlerResult RespondToEnter()
Public Function RespondToEnter As GH_ToolstripItemKeyHandlerResult
Return Value
Type: GH_ToolstripItemKeyHandlerResult
See Also
Reference
GH_TextBoxInputBase Class
Grasshopper.GUI.Base Namespace