Grasshopper SDK
GH_TreeIndex.Path Property
 Gets or sets the Path identifier.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Path Path { get; set; }
Public Property Path As GH_Path
	Get
	Set
Property Value
Type: GH_Path
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_TreeIndex.Path"]
See Also
Reference
GH_TreeIndex Structure
Grasshopper.Kernel.Data Namespace