Grasshopper SDK
GH_CanvasWidgetListEventArgs.AddWidget Method
 Append a widget to the canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddWidget(
	IGH_Widget widget
)
Public Sub AddWidget (
	widget As IGH_Widget
)
Parameters
widget
Type: IGH_Widget
Widget to append.
See Also
Reference
GH_CanvasWidgetListEventArgs Class
Grasshopper.GUI.Canvas Namespace