Grasshopper SDK
GH_RuntimeFile.TagCategory Field
 String tag used to identify Category fields in documentation source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagCategory = "CATEGORY"
Public Const TagCategory As String = "CATEGORY"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace