Grasshopper SDK
IGH_DataAccess.Util_CountNonNullRefs<T> Method
 Count all object references in L
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int Util_CountNonNullRefs<T>(
	List<T> L
)
Function Util_CountNonNullRefs(Of T) (
	L As List(Of T)
) As Integer
Parameters
L
Type: System.Collections.Generic.List<T>
List to parse
Type Parameters
T
Type of list
Return Value
Type: Int32
Number of proper objects in L
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace