Grasshopper SDK
GH_Theme Class
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Theme.GH_Theme
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Theme : GH_ISerializable
Public Class GH_Theme
	Implements GH_ISerializable
The GH_Theme type exposes the following members.
Constructors
Name | Description
GH_Theme()
 Create a new default theme.
GH_Theme(GH_Theme)
 Make a duplicate of another theme.
Top
Properties
Name | Description
BackGround
 Gets the theme background settings.
DefaultTheme
Objects
 Gets the theme objects and ZUI settings.
Page
 Gets the theme page and grid settings.
Palettes
 Gets the theme palette settings.
Wires
 Gets the theme wire settings.
Top
Methods
Name | Description
LoadTheme
 Instantiate all palette and gui defaults. This function reads the colour values out of grasshopper_gui.xml settings database if it exists.
Read
SaveTheme
 Store all palette and gui defaults. This function writes the colour values out to grasshopper_gui.xml settings database.
Write
Top
See Also
Reference
Grasshopper.GUI.Theme Namespace