Grasshopper SDK
GH_ExpressionParser.CachedSymbols Method
 Retrieve a copy of the Queue of cached symbols. You can use the cached symbols as an uber-optimization to speed up successive calls to Evaluate() with an identical expression string
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Queue<GH_ParserSymbol> CachedSymbols()
Public Function CachedSymbols As Queue(Of GH_ParserSymbol)
Return Value
Type: Queue<GH_ParserSymbol>
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace