Grasshopper SDK
GH_Material Constructor (GH_Material)
 Copy another GH_Material instance.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Material(
	GH_Material other
)
Public Sub New (
	other As GH_Material
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Material
Material to mimic.
See Also
Reference
GH_Material Class
GH_Material Overload
Grasshopper.Kernel.Types Namespace