Grasshopper SDK
SliderSnapRange.Max Property
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Max { get; }
Public ReadOnly Property Max As Decimal
	Get
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.SliderSnapRange.Max"]
See Also
Reference
SliderSnapRange Structure
Grasshopper.GUI.Base Namespace