Grasshopper SDK
GH_ResourceGate.WhiteIcon Property
 Returns a 24x24 square white icon.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Bitmap WhiteIcon { get; }
Public Shared ReadOnly Property WhiteIcon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Plugin.GH_ResourceGate.WhiteIcon"]
See Also
Reference
GH_ResourceGate Class
Grasshopper.Plugin Namespace