Grasshopper SDK
GH_CodeString.ParseNewString Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ParseNewString(
	string input
)
Public Sub ParseNewString (
	input As String
)
Parameters
input
Type: System.String
See Also
Reference
GH_CodeString Class
Grasshopper.Kernel.Expressions Namespace