Grasshopper SDK
GH_DocumentTreeNode.SubNodes Property
 Gets a collection of subnodes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<GH_DocumentTreeNode> SubNodes { get; }
Public ReadOnly Property SubNodes As List(Of GH_DocumentTreeNode)
	Get
Property Value
Type: List<GH_DocumentTreeNode>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentTreeNode.SubNodes"]
See Also
Reference
GH_DocumentTreeNode Class
Grasshopper.Kernel Namespace