Grasshopper SDK
GH_Tooltip.Tag Property
 Gets or sets the tag object for the tooltip
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Object Tag { get; set; }
Public Shared Property Tag As Object
	Get
	Set
Property Value
Type: Object
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Tooltip.Tag"]
Return Value
Type: Object
Remarks
See Also
Reference
GH_Tooltip Class
Grasshopper.GUI Namespace