Grasshopper SDK
GH_ObjectWrapper.DuplicateObject Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ObjectWrapper DuplicateObject()
Public Function DuplicateObject As GH_ObjectWrapper
Return Value
Type: GH_ObjectWrapper
See Also
Reference
GH_ObjectWrapper Class
Grasshopper.Kernel.Types Namespace