Grasshopper SDK
GH_FadeAnimation.Phase Property
 Gets the current animation phase.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_FadePhase Phase { get; }
Public ReadOnly Property Phase As GH_FadePhase
	Get
Property Value
Type: GH_FadePhase
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FadeAnimation.Phase"]
See Also
Reference
GH_FadeAnimation Class
Grasshopper.GUI Namespace