Grasshopper SDK
GH_Document.ClearReferenceTable Method
 Destroys the Referenced object table in the Rhino event watcher. You must call this function if you either add or remove a reference to a Rhino object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearReferenceTable()
Public Sub ClearReferenceTable
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace