Grasshopper SDK
GH_AssemblyInfoStub Class
 Provides basic properties for a GHA assembly that does not expose a type that derives from GH_AssemblyInfo. This type is created automatically when a GH_AssemblyInfo type is not found in an assembly.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_AssemblyInfo
 Grasshopper.Kernel.GH_AssemblyInfoStub
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_AssemblyInfoStub : GH_AssemblyInfo
Public NotInheritable Class GH_AssemblyInfoStub
	Inherits GH_AssemblyInfo
The GH_AssemblyInfoStub type exposes the following members.
Constructors
Name | Description
GH_AssemblyInfoStub
Initializes a new instance of the GH_AssemblyInfoStub class
Top
Properties
Name | Description
AssemblyName |  (Overrides GH_AssemblyInfo.AssemblyName.)
AssemblyVersion |  (Overrides GH_AssemblyInfo.AssemblyVersion.)
Top
See Also
Reference
Grasshopper.Kernel Namespace