Grasshopper SDK
IGH_Attributes.IsMenuRegion Method
 Determines whether a point is available for context menu popups. By default, IsMenuRegion calls IsPickRegion(PointF).
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsMenuRegion(
	PointF point
)
Function IsMenuRegion (
	point As PointF
) As Boolean
Parameters
point
Type: System.Drawing.PointF
Point location to test.
Return Value
Type: Boolean
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace