Grasshopper SDK
GH_Plane.GH_PlaneProxy Class
 Proxy description of GH_Plane class. This class is used by the Generic Multivalue interfaces.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Plane>
 Grasshopper.Kernel.Types.GH_Plane.GH_PlaneProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PlaneProxy : GH_GooProxy<GH_Plane>
Public Class GH_PlaneProxy
	Inherits GH_GooProxy(Of GH_Plane)
The GH_Plane.GH_PlaneProxy type exposes the following members.
Constructors
Name | Description
GH_Plane.GH_PlaneProxy
Initializes a new instance of the GH_Plane.GH_PlaneProxy class
Top
Properties
Name | Description
Origin
XAxis
YAxis
ZAxis
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace