Grasshopper SDK
GH_Document.Read Method
 Standard archiving function. Will deserialize the entire document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Read(
	GH_IReader reader
)
Public Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Return Value
Type: Boolean
Implements
GH_ISerializable.Read(GH_IReader)
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace