Grasshopper SDK
GH_ComponentParamServer.IsParam Method
 Returns True if this parameter is a child of the component
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsParam(
	IGH_Param param
)
Public Function IsParam (
	param As IGH_Param
) As Boolean
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
Parameter to test.
Return Value
Type: Boolean
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace