Grasshopper SDK
GH_Convert.ToRelativePath Method
Note: This API is now obsolete.
 Create a relative path from two absolute paths.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("Do not use this method, it is lame")]
public static string ToRelativePath(
	string anchor_path,
	string target_path
)
<ObsoleteAttribute("Do not use this method, it is lame")>
Public Shared Function ToRelativePath (
	anchor_path As String,
	target_path As String
) As String
Parameters
anchor_path
Type: System.String
Anchor path, the relative path result will be based on this location. Must be absolute.
target_path
Type: System.String
Target path, this is the path that will be converted. Must be absolute and must have the same root as the Anchor.
Return Value
Type: String
The relative path on success or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | Thrown if anchor_path is a null reference.
ArgumentNullException | Thrown if target_path is a null reference.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace