Grasshopper SDK
GH_PointRefData.m_RefID Field
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid m_RefID
Public m_RefID As Guid
Field Value
Type: Guid
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace