Grasshopper SDK
GH_Document.NonBlankFilter Method
 This delegate can be used in the FindAllDownstreamObjects(...) methods. Only includes objects that are non-blank and non-failed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool NonBlankFilter(
	IGH_ActiveObject iObj
)
Public Shared Function NonBlankFilter (
	iObj As IGH_ActiveObject
) As Boolean
Parameters
iObj
Type: Grasshopper.Kernel.IGH_ActiveObject
Return Value
Type: Boolean
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace