Grasshopper SDK
GH_ComponentAttributes.ContentBox Property
 Gets the bounds of the component area of the attributes.
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RectangleF ContentBox { get; }
Public ReadOnly Property ContentBox As RectangleF
	Get
Property Value
Type: RectangleF
[Missing <value> documentation for "P:Grasshopper.Kernel.Attributes.GH_ComponentAttributes.ContentBox"]
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace