Grasshopper SDK
GH_RuleRange Constructor
Initializes a new instance of the GH_RuleRange class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RuleRange(
	int min,
	int max,
	bool negate
)
Public Sub New (
	min As Integer,
	max As Integer,
	negate As Boolean
)
Parameters
min
Type: System.Int32
max
Type: System.Int32
negate
Type: System.Boolean
See Also
Reference
GH_RuleRange Class
Grasshopper.Kernel.Data Namespace