Grasshopper SDK
GH_Slider Constructor
Initializes a new instance of the GH_Slider class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Slider()
Public Sub New
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace