Grasshopper SDK
IGH_Param.AddVolatileDataTree Method
 Insert an entire data tree into this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool AddVolatileDataTree(
	IGH_Structure tree
)
Function AddVolatileDataTree (
	tree As IGH_Structure
) As Boolean
Parameters
tree
Type: Grasshopper.Kernel.Data.IGH_Structure
Data tree to insert.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace