Grasshopper SDK
GH_DocumentIO.OpenDocumentDialog Method
 Display the Open GH/GHX dialog.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string OpenDocumentDialog(
	string path = null,
	string title = "Open…"
)
Public Function OpenDocumentDialog (
	Optional path As String = Nothing,
	Optional title As String = "Open…"
) As String
Parameters
path (Optional)
Type: System.String
Optional default path.
title (Optional)
Type: System.String
Title of dialog.
Return Value
Type: String
FileName specified via the Open dialog or null if the dialog was cancelled.
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace