Grasshopper SDK
GH_Convert.CreatePureTime Method (Int32, Int32, Int32)
 Create a pure time instance. If the total number of hours, minutes and seconds exceeds a full year then it is not possible to create a pure time and the largest possible pure time will be returned instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static DateTime CreatePureTime(
	int hours,
	int minutes,
	int seconds
)
Public Shared Function CreatePureTime (
	hours As Integer,
	minutes As Integer,
	seconds As Integer
) As DateTime
Parameters
hours
Type: System.Int32
minutes
Type: System.Int32
seconds
Type: System.Int32
Return Value
Type: DateTime
See Also
Reference
GH_Convert Class
CreatePureTime Overload
Grasshopper.Kernel Namespace