Grasshopper SDK
GH_RuleSequence.Notation Property
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Notation { get; }
Public ReadOnly Property Notation As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_RuleSequence.Notation"]
Implements
IGH_Rule.Notation
See Also
Reference
GH_RuleSequence Class
Grasshopper.Kernel.Data Namespace