Grasshopper SDK
IGH_Structure.AllData Method
 Gets an enumerator for all the data items in this structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_StructureEnumerator AllData(
	bool skipNulls
)
Function AllData (
	skipNulls As Boolean
) As IGH_StructureEnumerator
Parameters
skipNulls
Type: System.Boolean
If True, null items will be skipped.
Return Value
Type: IGH_StructureEnumerator
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace