Grasshopper SDK
GH_Colour.DuplicateColour Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Colour DuplicateColour()
Public Function DuplicateColour As GH_Colour
Return Value
Type: GH_Colour
See Also
Reference
GH_Colour Class
Grasshopper.Kernel.Types Namespace