Grasshopper SDK
GH_GripType Enumeration
 Enumerates the possible grip types.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_GripType
Public Enumeration GH_GripType
Members
Member name | Value | Description
Continuous | 0 |  Grip has the same colour coming in and going out.
Discontinuous | 1 |  Grip has a different colour coming in and going out.
See Also
Reference
Grasshopper.GUI.Gradient Namespace