Grasshopper SDK
GH_ColourPickerBase.IsTextInput Property
 Gets whether any of the slider is currently displaying a text input box.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsTextInput { get; }
Public ReadOnly Property IsTextInput As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.IsTextInput"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace