Grasshopper SDK
GH_WireDisplayAction Constructor
Initializes a new instance of the GH_WireDisplayAction class
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_WireDisplayAction(
	IGH_Param obj
)
Public Sub New (
	obj As IGH_Param
)
Parameters
obj
Type: Grasshopper.Kernel.IGH_Param
See Also
Reference
GH_WireDisplayAction Class
Grasshopper.Kernel.Undo.Actions Namespace