Grasshopper SDK
GH_GeometryGroup.CastFrom Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool CastFrom(
	Object source
)
Public Function CastFrom (
	source As Object
) As Boolean
Parameters
source
Type: System.Object
Return Value
Type: Boolean
Implements
IGH_Goo.CastFrom(Object)
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace