Grasshopper SDK
GH_FontScroller.PostPaintDelegate Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_FontScroller.PostPaint PostPaintDelegate { get; set; }
Public Property PostPaintDelegate As GH_FontScroller.PostPaint
	Get
	Set
Property Value
Type: GH_FontScroller.PostPaint
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FontScroller.PostPaintDelegate"]
See Also
Reference
GH_FontScroller Class
Grasshopper.GUI Namespace