Grasshopper SDK
GH_Slider_Obsolete.IsIntermediate Property
 Gets the intermediate flag. If True, the user is currently dragging the slider.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsIntermediate { get; }
Public ReadOnly Property IsIntermediate As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider_Obsolete.IsIntermediate"]
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace