Grasshopper SDK
GH_FontServer.StandardFamilyChanged Event
 Raised whenever the StandardFamily is changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_FontServer.StandardFamilyChangedEventHandler StandardFamilyChanged
Public Shared Event StandardFamilyChanged As GH_FontServer.StandardFamilyChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_FontServer.StandardFamilyChangedEventHandler
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace