Grasshopper SDK
GH_Material Constructor (Guid)
 Create a new Material from an RDK shader ID.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Material(
	Guid rdkMaterialId
)
Public Sub New (
	rdkMaterialId As Guid
)
Parameters
rdkMaterialId
Type: System.Guid
ID of RDK Shader.
See Also
Reference
GH_Material Class
GH_Material Overload
Grasshopper.Kernel.Types Namespace