Grasshopper SDK
GH_MenuTextBox.OriginalText Property
 Gets or sets the original text that was visible when the control was first displayed.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string OriginalText { get; set; }
Public Property OriginalText As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MenuTextBox.OriginalText"]
See Also
Reference
GH_MenuTextBox Class
Grasshopper.GUI Namespace