Grasshopper SDK
GH_RuntimeMessage.HasSource Property
 Gets a value indicating whether or not this message has a source.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool HasSource { get; }
Public ReadOnly Property HasSource As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RuntimeMessage.HasSource"]
See Also
Reference
GH_RuntimeMessage Class
Grasshopper.Kernel Namespace