Grasshopper SDK
GH_Rectangle.GH_RectangleProxy Class
 Proxy description of GH_Rectangle class. This class is used by the Generic Multivalue interfaces.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Rectangle>
 Grasshopper.Kernel.Types.GH_Rectangle.GH_RectangleProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_RectangleProxy : GH_GooProxy<GH_Rectangle>
Public Class GH_RectangleProxy
	Inherits GH_GooProxy(Of GH_Rectangle)
The GH_Rectangle.GH_RectangleProxy type exposes the following members.
Constructors
Name | Description
GH_Rectangle.GH_RectangleProxy
Initializes a new instance of the GH_Rectangle.GH_RectangleProxy class
Top
Properties
Name | Description
Area
Circumference
Height
Origin
Width
XAxis
YAxis
ZAxis
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace