Grasshopper SDK
GH_Animator.PointAnimator Method (Point, Point, DateTime, DateTime)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<Point> PointAnimator(
	Point A,
	Point B,
	DateTime time0,
	DateTime time1
)
Public Shared Function PointAnimator (
	A As Point,
	B As Point,
	time0 As DateTime,
	time1 As DateTime
) As GH_Animator(Of Point)
Parameters
A
Type: System.Drawing.Point
B
Type: System.Drawing.Point
time0
Type: System.DateTime
time1
Type: System.DateTime
Return Value
Type: GH_Animator<Point>
See Also
Reference
GH_Animator Class
PointAnimator Overload
Grasshopper.GUI Namespace