Grasshopper SDK
GH_Transform.ClearCaches Method
 Erase the compound transformation caches.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearCaches()
Public Sub ClearCaches
See Also
Reference
GH_Transform Class
Grasshopper.Kernel.Types Namespace