Grasshopper SDK
GH_ObjectSettings.GroupColour Property
 Gets or sets the default fill colour for group objects.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color GroupColour { get; set; }
Public Property GroupColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_ObjectSettings.GroupColour"]
See Also
Reference
GH_ObjectSettings Class
Grasshopper.GUI.Theme Namespace