Grasshopper SDK
GH_DigitScroller.Amplify Property
 Gets or sets whether vertical mouse movement ought to be amplified.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Amplify { get; set; }
Public Property Amplify As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DigitScroller.Amplify"]
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace