Grasshopper SDK
GH_DocDiagramPainter.MapX Method (Single)
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float MapX(
	float x
)
Public Function MapX (
	x As Single
) As Single
Parameters
x
Type: System.Single
Return Value
Type: Single
See Also
Reference
GH_DocDiagramPainter Class
MapX Overload
Grasshopper.GUI.Canvas Namespace