Grasshopper SDK
GH_Filter Enumeration
 Enumerates all object Search filters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_Filter
Public Enumeration GH_Filter
Members
Member name | Value | Description
DontCare | 0 |  Property is ignored.
Include | 1 |  Objects are requires to have this state in order to be included.
Exclude | 2 |  Objects are not allowed to have this state in order to be included.
See Also
Reference
Grasshopper.Kernel Namespace