Grasshopper SDK
GH_AssemblyPriority Class
 Derive from this class if you wish to perform additional steps before any of your components are loaded. Any class in your project which inherits from GH_AssemblyPriority and which has an empty constructor will be instantiated prior to any GH_Component or IGH_DocumentObject classes.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_AssemblyPriority
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_AssemblyPriority
Public MustInherit Class GH_AssemblyPriority
The GH_AssemblyPriority type exposes the following members.
Constructors
Name | Description
GH_AssemblyPriority
Initializes a new instance of the GH_AssemblyPriority class
Top
Methods
Name | Description
PriorityLoad
 This method will be called exactly once before any of the Components in your project are loaded.
Top
See Also
Reference
Grasshopper.Kernel Namespace