Grasshopper SDK
GH_MouseTracker.MaximumDuration Property
 Gets or sets the maximum allowed duration of the entire record. When new frames are recorded, old frames that are more distant than MaximumDuration will be dropped. The default duration is 10 seconds.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public TimeSpan MaximumDuration { get; set; }
Public Property MaximumDuration As TimeSpan
	Get
	Set
Property Value
Type: TimeSpan
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MouseTracker.MaximumDuration"]
See Also
Reference
GH_MouseTracker Class
Grasshopper.GUI Namespace