Grasshopper SDK
IGH_Param.Recipients Property
 Gets a list of all the recipients of this parameter. I.e. a recipient has this parameter as one of the sources. The Recipient list is maintained by the parameter, do not modify it yourself.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IList<IGH_Param> Recipients { get; }
ReadOnly Property Recipients As IList(Of IGH_Param)
	Get
Property Value
Type: IList<IGH_Param>
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.Recipients"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace