Grasshopper SDK
GH_AsynchFileData Properties
The GH_AsynchFileData type exposes the following members.
Properties
Name | Description
CallbackDelegate
 Gets or sets the callback delegate to be used when properties are updated.
FileCreated
 Gets the date at which the file was created.
FileDataAge
 Gets the time from which the current file data stems.
FileExists
 Gets whether the file exists. Note that this property returns false if DataExists=False, regardless of whether the file exists.
FileLastChanged
 Gets the date at which the file was last changed.
FileSize
 Gets the size of the file.
FileThumbnail
 Gets the thumbnail bitmap associated with the file.
IsFileData
 Gets whether the data has been retrieved at least once.
ReadThumbnail
 Gets or sets whether the thumbnail ought to be parsed. At the moment this only makes sense for GH/GHX files.
Top
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace