Grasshopper SDK
GH_State.StateData Property
 Gets a pointer to the internal database of states.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public SortedList<Guid, string> StateData { get; }
Public ReadOnly Property StateData As SortedList(Of Guid, String)
	Get
Property Value
Type: SortedList<Guid, String>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_State.StateData"]
See Also
Reference
GH_State Class
Grasshopper.Kernel Namespace