Grasshopper SDK
GH_Param<T>.Reverse Property
 Gets or sets the data reverse modifier of this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Reverse { get; set; }
Public Property Reverse As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.Reverse"]
Implements
IGH_Param.Reverse
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace