Grasshopper SDK
GH_DocumentEditor.ScriptAccess_IsDocument Method
 Returns true if there is an active document.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ScriptAccess_IsDocument()
Public Function ScriptAccess_IsDocument As Boolean
Return Value
Type: Boolean
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace