Grasshopper SDK
GH_Viewport.ProjectPoint Method
 Project a point from canvas coordinates into control coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF ProjectPoint(
	PointF pt
)
Public Function ProjectPoint (
	pt As PointF
) As PointF
Parameters
pt
Type: System.Drawing.PointF
The point in canvas coordinates.
Return Value
Type: PointF
The associated point in control pixel coordinates.
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace