Grasshopper SDK
GH_CodeString.Flatten Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Flatten()
Public Function Flatten As String
Return Value
Type: String
See Also
Reference
GH_CodeString Class
Grasshopper.Kernel.Expressions Namespace