Grasshopper SDK
IGH_GeometricGoo.ReferenceID Property
 Gets or sets the Guid of the object that is referenced. Not all IGH_GeometricGoo implementations support referenced geometry.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid ReferenceID { get; set; }
Property ReferenceID As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_GeometricGoo.ReferenceID"]
See Also
Reference
IGH_GeometricGoo Interface
Grasshopper.Kernel.Types Namespace