Grasshopper SDK
IGH_ValueProxy.ProxyName Property
 Gets a human-friendly name description of the template type
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string ProxyName { get; }
ReadOnly Property ProxyName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ValueProxy.ProxyName"]
See Also
Reference
IGH_ValueProxy Interface
Grasshopper.Kernel Namespace