Grasshopper SDK
CentralSettings.AuthorNameChanged Event
 Raised whenever the AuthorName field is changed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.AuthorNameChangedEventHandler AuthorNameChanged
Public Shared Event AuthorNameChanged As CentralSettings.AuthorNameChangedEventHandler
Value
Type: Grasshopper.CentralSettings.AuthorNameChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace