Grasshopper SDK
GH_PreviewUtil.AddPlane Method
 Add a plane to the temporary Preview lists.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddPlane(
	Plane plane
)
Public Sub AddPlane (
	plane As Plane
)
Parameters
plane
Type: Plane
Plane to add. Invalid planes will be ignored.
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace