Grasshopper SDK
GH_Component.InConstructor Property
 Gets the constructor flag for this instance. If InConstructor = True, it means the component is still registering parameters and the layout is not yet complete.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool InConstructor { get; }
Public ReadOnly Property InConstructor As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.InConstructor"]
Implements
IGH_Component.InConstructor
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace