Grasshopper SDK
GH_List.Items Property
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_Content> Items { get; }
Public ReadOnly Property Items As List(Of IGH_Content)
	Get
Property Value
Type: List<IGH_Content>
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_List.Items"]
See Also
Reference
GH_List Class
Grasshopper.Documentation Namespace