Grasshopper SDK
GH_Canvas.ScheduleInactive Field
 Defines the delay used to indicate the absence of a schedule.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int ScheduleInactive = -1
Public Const ScheduleInactive As Integer = -1
Field Value
Type: Int32
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace