Grasshopper SDK
GH_ExternalFile.FileType Property
 Gets the file type as indicated by the extension.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ExternalFileType FileType { get; }
Public ReadOnly Property FileType As GH_ExternalFileType
	Get
Property Value
Type: GH_ExternalFileType
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ExternalFile.FileType"]
See Also
Reference
GH_ExternalFile Class
Grasshopper.Kernel Namespace