Grasshopper SDK
GH_ParserOperator.m_type Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_OperatorType m_type
Public m_type As GH_OperatorType
Field Value
Type: GH_OperatorType
See Also
Reference
GH_ParserOperator Class
Grasshopper.Kernel.Expressions Namespace