Grasshopper SDK
GH_Viewport.SolveUnit Method
 Utility function for calculating graphics dimensions in a zoom-aware environment. This function can be used for example to compute the linewidth of a pen which always needs to appear as 3 pixels thick on the screen regardless of zoom values.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float SolveUnit(
	float desired,
	float no_less_than,
	float no_more_than
)
Public Function SolveUnit (
	desired As Single,
	no_less_than As Single,
	no_more_than As Single
) As Single
Parameters
desired
Type: System.Single
Desired value in pixel units.
no_less_than
Type: System.Single
Minimum allowed size in graphics coordinates.
no_more_than
Type: System.Single
Maximum allowed size in graphics coordinates.
Return Value
Type: Single
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace