Grasshopper SDK
GH_ArchivedUndoAction Constructor
Initializes a new instance of the GH_ArchivedUndoAction class
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_ArchivedUndoAction()
Protected Sub New
See Also
Reference
GH_ArchivedUndoAction Class
Grasshopper.Kernel.Undo Namespace