Grasshopper SDK
GH_FadeAnimation.TriggerUpdate Property
 Gets or sets whether this animator triggers canvas updates.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool TriggerUpdate { get; set; }
Public Property TriggerUpdate As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FadeAnimation.TriggerUpdate"]
See Also
Reference
GH_FadeAnimation Class
Grasshopper.GUI Namespace