Grasshopper SDK
GH_Version Operators
The GH_Version type exposes the following members.
Operators
Name | Description
Equality
 Compares two version structures for equality.
GreaterThan
 Compares versions for larger than relationships.
GreaterThanOrEqual
 Compares versions for larger than or equal to relationships.
Inequality
 Compares two version structures for inequality.
LessThan
 Compares versions for smaller than relationships.
LessThanOrEqual
 Compares versions for smaller than or equal to relationships.
Top
See Also
Reference
GH_Version Structure
GH_IO.Types Namespace