Grasshopper SDK
GH_IndexRange.Contains Method (GH_IndexRange)
 Tests whether a specified range is entirely contained within this range.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Contains(
	GH_IndexRange range
)
Public Function Contains (
	range As GH_IndexRange
) As Boolean
Parameters
range
Type: Grasshopper.Kernel.Data.GH_IndexRange
Range to test.
Return Value
Type: Boolean
True if the range is inside this one.
See Also
Reference
GH_IndexRange Structure
Contains Overload
Grasshopper.Kernel.Data Namespace