Grasshopper SDK
GH_ExpressionSyntaxWriter.RewriteForGraphicInterface Method (String)
 Rewrite the expression so that tags are replaced by the complex characters that make up the esoteric operators, functions and constants. The expression should become more readable
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string RewriteForGraphicInterface(
	string expression
)
Public Shared Function RewriteForGraphicInterface (
	expression As String
) As String
Parameters
expression
Type: System.String
Return Value
Type: String
See Also
Reference
GH_ExpressionSyntaxWriter Class
RewriteForGraphicInterface Overload
Grasshopper.Kernel.Expressions Namespace