Grasshopper SDK
GH_TrackerFrame Structure
 Represents a single frame in a mouse-tracker history. A frame represents all relevant mouse and keyboard data at a given time.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public struct GH_TrackerFrame
Public Structure GH_TrackerFrame
The GH_TrackerFrame type exposes the following members.
Constructors
Name | Description
GH_TrackerFrame
Initializes a new instance of the GH_TrackerFrame class
Top
Fields
Name | Description
Buttons
 The state of the mouse buttons of the frame.
Keys
 The state of the modifier keys (Contro, Shift and Alt) of the frame.
PositionControl
 The position (in control coordinates) of the frame.
PositionScreen
 The position (in screen coordinates) of the frame.
Tag
 Optional Tag object (to be supplied by user).
Time
 The time at which this frame was recorded.
Top
See Also
Reference
Grasshopper.GUI Namespace