Grasshopper SDK
GH_Convert.StringToDate Method
 Convert a string representing a date into an actual date. If a pure date is possible it will be returned. If the input is a pure time this method will fail, you need to use StringToTime instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool StringToDate(
	string text,
	ref DateTime date
)
Public Shared Function StringToDate (
	text As String,
	ByRef date As DateTime
) As Boolean
Parameters
text
Type: System.String
String to parse.
date
Type: System.DateTime
If the string could be parsed, the pure date will be returned here.
Return Value
Type: Boolean
True if string was successfully parsed, false if not.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace