Grasshopper SDK
GH_Viewport Constructor
Initializes a new instance of the GH_Viewport class
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Viewport()
Public Sub New
See Also
Reference
GH_Viewport Class
GH_Viewport Overload
Grasshopper.GUI.Canvas Namespace