Grasshopper SDK
GH_TypeLib.id_rc_curve Field
Rhino.Geometry.Curve
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Guid id_rc_curve
Public Shared id_rc_curve As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace