Grasshopper SDK
IGH_DocumentObject Interface
 Base interface for objects that want to play on the Canvas. Do not implement this interface from scratch. Either inherit from GH_DocumentObject or one of the other partially finished types such as GH_ActiveObject, GH_Param(Of T) or GH_Component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_DocumentObject : IGH_InstanceDescription
Public Interface IGH_DocumentObject
	Inherits IGH_InstanceDescription
The IGH_DocumentObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes that are associated with this object. Only set custom attributes if you know what you are doing.
ComponentGuid
 Returns a consistent ID for this object type. Every object must supply a unique and unchanging ID that is used to identify objects of the same type.
Exposure
 Gets the exposure of this object in the Graphical User Interface.
Icon_24x24
 The icon associated with this object.
Icon_24x24_Locked
 The greyscale icon of this object.
IconDisplayMode
 Gets the current display mode of the object.
Obsolete
 Gets whether this object is Obsolete.
Top
Methods
Name | Description
AddedToDocument
 This method will be called when an object is added to a document.
AppendMenuItems
 This function is called when a context menu is about to be displayed. Override it to set custom items.
CreateAttributes
 Create new default attributes for this object. You should only call this function when the Attributes() field is null.
DocumentContextChanged
 This method will be called when the document that owns this object moves into a different context.
ExpirePreview
 Call this function when you suspect that the preview has expired for this object. This will cause the display cache to be eradicated.
ExpireSolution
 Call this function whenever you do something which expires the current solution. This will make sure all caches are erased, all downstream objects are expired and that the event is raised. The default implementation merely places a call to OnSolutionExpired(), override this function in derived classes to make sure you clear local data caches and expire downstream objects.
IsolateObject
 Destroy all connections to other objects.
MovedBetweenDocuments
 This method will be called when an object is moved from one document to another.
OnAttributesChanged
 Raises the AttributesChanged event on the toplevel object.
OnDisplayExpired
 Raises the DisplayExpired event on the toplevel object.
OnObjectChanged(String)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnObjectChanged(GH_ObjectChangedEventArgs)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnObjectChanged(GH_ObjectEventType)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnObjectChanged(String, Object)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnObjectChanged(GH_ObjectEventType, Object)
 Raises the ObjectChanged event on the current (!not the top level!) object.
OnPingDocument
 Raise the PingDocument Event on the toplevel object and try to find the document which owns this object.
OnPreviewExpired
 Raises the PreviewExpired event on the toplevel object.
OnSolutionExpired
 Raises the SolutionExpired event on the toplevel object.
RecordUndoEvent(String)
 Record a generic object change undo event.
RecordUndoEvent(GH_UndoRecord)
 Record an entire undo record.
RecordUndoEvent(String, IGH_UndoAction)
 Record a specific object change undo event.
RemovedFromDocument
 This method will be called when an object is removed from a document.
TriggerAutoSave()
 Triggers the AutoSave function on the owner document with the object_changed flag.
TriggerAutoSave(Guid)
 Triggers the AutoSave function on the owner document with the object_changed flag.
TriggerAutoSave(GH_AutoSaveTrigger)
 Triggers the AutoSave function on the owner document with a custom flag.
TriggerAutoSave(GH_AutoSaveTrigger, Guid)
 Triggers the AutoSave function on the owner document with a custom flag.
Top
Events
Name | Description
AttributesChanged
 Raised whenever the number or kind of attributes changes. This event is handled by GH_Documents who subsequently wipe their attribute caches.
DisplayExpired
 Raised whenever the display (on the Canvas) of a certain object becomes invalid.
ObjectChanged
 Raised whenever some property of the object changes that would affect remote instances.
PingDocument
 Raised whenever an object needs to know which GH_Document it belongs to.
PreviewExpired
 Raised whenever the display (in the Rhino viewports) of a certain object becomes invalid.
SolutionExpired
 Raised whenever the solution of a certain object becomes invalid.
Top
See Also
Reference
Grasshopper.Kernel Namespace