Grasshopper SDK
GH_GHALoadingEventArgs.Icon Property
 Gets the official icon of the GHA file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap Icon { get; }
Public ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_GHALoadingEventArgs.Icon"]
See Also
Reference
GH_GHALoadingEventArgs Class
Grasshopper.Kernel Namespace