Grasshopper SDK
Utility.LikeOperator Method
 Exposes the VB.NET Like operator as a static method.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool LikeOperator(
	string text,
	string pattern
)
Public Shared Function LikeOperator (
	text As String,
	pattern As String
) As Boolean
Parameters
text
Type: System.String
pattern
Type: System.String
Return Value
Type: Boolean
See Also
Reference
Utility Class
Grasshopper Namespace