Grasshopper SDK
GH_Structure<T>.TrimExcess Method
 Trims the excess allocated memory in all branches.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void TrimExcess()
Public Sub TrimExcess
Implements
IGH_Structure.TrimExcess()
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace