Grasshopper SDK
IGH_Tooltip.Palette Property
 Gets or sets the tooltip colour palette.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_TooltipPalette Palette { get; set; }
Property Palette As GH_TooltipPalette
	Get
	Set
Property Value
Type: GH_TooltipPalette
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_Tooltip.Palette"]
See Also
Reference
IGH_Tooltip Interface
Grasshopper.GUI Namespace