Grasshopper SDK
GH_PersistentGeometryParam<T>.ClearData Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void ClearData()
Public Overrides Sub ClearData
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace