Grasshopper SDK
GH_GlossaryItem.ParseFile Method
 Parse a *.glossary file and return a glossary entry.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_GlossaryItem ParseFile(
	string path
)
Public Shared Function ParseFile (
	path As String
) As GH_GlossaryItem
Parameters
path
Type: System.String
File to parse.
Return Value
Type: GH_GlossaryItem
The glossary entry defined by the file. This function always returns a valid glossary or it throws an exception.
See Also
Reference
GH_GlossaryItem Class
Grasshopper.Documentation Namespace