Grasshopper SDK
GH_Viewport.Width Property
 Gets or sets the width of the viewport. Typically this is tied to the dimensions of the canvas. Width is not allowed to go below 5 pixels.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Width { get; set; }
Public Property Width As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.Width"]
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace