Grasshopper SDK
GH_CodeString.DoubleQuote Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected const char DoubleQuote = '"'
Protected Const DoubleQuote As Char = """C
Field Value
Type: Char
See Also
Reference
GH_CodeString Class
Grasshopper.Kernel.Expressions Namespace