Grasshopper SDK
GH_DigitScrollerBase.ValueChanged Event
 Raised whenever the value of this scroller is changed due to User-Interface methods.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_DigitScrollerBase.ValueChangedEventHandler ValueChanged
Public Event ValueChanged As GH_DigitScrollerBase.ValueChangedEventHandler
Value
Type: Grasshopper.GUI.Base.GH_DigitScrollerBase.ValueChangedEventHandler
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace