Grasshopper SDK
GH_CursorServer Class
 Class used to cache and set cursors.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_CursorServer
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_CursorServer
Public NotInheritable Class GH_CursorServer
The GH_CursorServer type exposes the following members.
Properties
Name | Description
Count
 Gets the number of cached cursors.
Top
Methods
Name | Description
AttachCursor
 Attach a cursor to a control.
Cursor
 Gets a cursor from the cache.
IsCursor
 Test for the existence of a cursor.
ReferenceCursors
 Reference all the cursor files in a given directory.
ResetCursor
 Reset the cursor of the given control to default.
Top
See Also
Reference
Grasshopper.GUI Namespace