Grasshopper SDK
GH_DigitNumber.IsSecondaryDigitSignificant Property
 Gets whether the secondary digit at the given index is significant.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool this[
	int index
] { get; }
Public ReadOnly Property IsSecondaryDigitSignificant (
	index As Integer
) As Boolean
	Get
Parameters
index
Type: System.Int32
Index of digit to test.
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitNumber.IsSecondaryDigitSignificant(System.Int32)"]
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace