Grasshopper SDK
GH_Gradient.MouseUp Method
 Terminate grip drag.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool MouseUp(
	RectangleF dest,
	PointF pt
)
Public Function MouseUp (
	dest As RectangleF,
	pt As PointF
) As Boolean
Parameters
dest
Type: System.Drawing.RectangleF
Destination rectangle of gradient
pt
Type: System.Drawing.PointF
Mouse location in destination coordinates
Return Value
Type: Boolean
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace