Grasshopper SDK
GH_GraphicsUtil.HighlightPen Method
 Gets a new pen object that can be used to draw the edges of hover and focus rectangles. Caller is responsible for disposing the pen.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Pen HighlightPen()
Public Shared Function HighlightPen As Pen
Return Value
Type: Pen
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace