Grasshopper SDK
IGH_VariableParameterComponent.CreateParameter Method
 This function will be called when a new parameter is about to be inserted. You must provide a valid parameter or insertion will be skipped. You do not, repeat not, need to insert the parameter yourself.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_Param CreateParameter(
	GH_ParameterSide side,
	int index
)
Function CreateParameter (
	side As GH_ParameterSide,
	index As Integer
) As IGH_Param
Parameters
side
Type: Grasshopper.Kernel.GH_ParameterSide
Parameter side.
index
Type: System.Int32
Insertion index of parameter. Index=0 means the parameter will be in the topmost spot.
Return Value
Type: IGH_Param
A valid IGH_Param instance to be inserted.
See Also
Reference
IGH_VariableParameterComponent Interface
Grasshopper.Kernel Namespace