Grasshopper SDK
GH_ComponentParamServer.SortOutput Method (Int32[])
 Sort the output parameter order based on a numeric key array.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SortOutput(
	int[] keys
)
Public Sub SortOutput (
	keys As Integer()
)
Parameters
keys
Type: System.Int32[]
Array of integer precision numbers to function as sorting keys.
See Also
Reference
GH_ComponentParamServer Class
SortOutput Overload
Grasshopper.Kernel Namespace