Grasshopper SDK
GH_Animator.PointFAnimator Method (PointF, PointF, DateTime, DateTime)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<PointF> PointFAnimator(
	PointF A,
	PointF B,
	DateTime time0,
	DateTime time1
)
Public Shared Function PointFAnimator (
	A As PointF,
	B As PointF,
	time0 As DateTime,
	time1 As DateTime
) As GH_Animator(Of PointF)
Parameters
A
Type: System.Drawing.PointF
B
Type: System.Drawing.PointF
time0
Type: System.DateTime
time1
Type: System.DateTime
Return Value
Type: GH_Animator<PointF>
See Also
Reference
GH_Animator Class
PointFAnimator Overload
Grasshopper.GUI Namespace