Grasshopper SDK
IGH_Goo.ToString Method
 Creates a string description of the current instance value
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string ToString()
Function ToString As String
Return Value
Type: String
See Also
Reference
IGH_Goo Interface
Grasshopper.Kernel.Types Namespace