Grasshopper SDK
GH_ScriptVariant Explicit Conversion (GH_ScriptVariant to Int32)
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static explicit operator int (
	GH_ScriptVariant in
)
Public Shared Narrowing Operator CType (
	in As GH_ScriptVariant
) As Integer
Parameters
in
Type: Grasshopper.Kernel.Expressions.GH_ScriptVariant
Return Value
Type: Int32
See Also
Reference
GH_ScriptVariant Class
Explicit Overload
Grasshopper.Kernel.Expressions Namespace