Grasshopper SDK
Folders.Desktop Property
 Gets the desktop directory of the current user profile.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string Desktop { get; }
Public Shared ReadOnly Property Desktop As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.Desktop"]
See Also
Reference
Folders Class
Grasshopper Namespace