Grasshopper SDK
GH_Document.GH_UndoUtil.RecordWireEvent Method (String, IEnumerable<IGH_Param>)
 Create and Record a new WiresChanged undo record.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid RecordWireEvent(
	string name,
	IEnumerable<IGH_Param> params
)
Public Function RecordWireEvent (
	name As String,
	params As IEnumerable(Of IGH_Param)
) As Guid
Parameters
name
Type: System.String
Name of undo record.
params
Type: System.Collections.Generic.IEnumerable<IGH_Param>
Target parameters for undo record.
Return Value
Type: Guid
The ID of the newly added undo record or Guid.Empty on failure.
See Also
Reference
GH_Document.GH_UndoUtil Class
RecordWireEvent Overload
Grasshopper.Kernel Namespace