Grasshopper SDK
GH_DocumentObject.Menu_AppendColourPicker Method
 Add a colour picker to a menu.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_ColourPicker Menu_AppendColourPicker(
	ToolStripDropDown menu,
	Color colour,
	GH_DocumentObject.ColourEventHandler colourChanged
)
Public Shared Function Menu_AppendColourPicker (
	menu As ToolStripDropDown,
	colour As Color,
	colourChanged As GH_DocumentObject.ColourEventHandler
) As GH_ColourPicker
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
Menu to add to.
colour
Type: System.Drawing.Color
Default colour.
colourChanged
Type: Grasshopper.Kernel.GH_DocumentObject.ColourEventHandler
Handler for Colour picker changed events.
Return Value
Type: GH_ColourPicker
Menu item representing the colour picker.
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace