Grasshopper SDK
GH_Component.GH_OutputParamManager.AddComplexNumberParameter Method
 Add a Complex Number parameter to the output list of this component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int AddComplexNumberParameter(
	string name,
	string nickname,
	string description,
	GH_ParamAccess access
)
Public Function AddComplexNumberParameter (
	name As String,
	nickname As String,
	description As String,
	access As GH_ParamAccess
) As Integer
Parameters
name
Type: System.String
The name of the parameter. Keep it short, single words are best.
nickname
Type: System.String
The nickname of the parameter. Keep it short, single characters are best.
description
Type: System.String
The description of the parameter. Be succinct but clear, single sentences are best.
access
Type: Grasshopper.Kernel.GH_ParamAccess
Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.
Return Value
Type: Int32
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace