Grasshopper SDK
GH_TooltipComponent.IsTag Method
 Test whether the current Tooltip tag matches the object.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsTag(
	Object object
)
Public Function IsTag (
	object As Object
) As Boolean
Parameters
object
Type: System.Object
Object to test against tag.
Return Value
Type: Boolean
True if the Tag and object are the same.
See Also
Reference
GH_TooltipComponent Class
Grasshopper.GUI Namespace