Grasshopper SDK
GH_UndoServer.ClearRedo Method
 Clear the undo list.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearRedo()
Public Sub ClearRedo
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace