Grasshopper SDK
IGH_Attributes.NewInstanceGuid Method
 Generate a new instance GUID for the owner object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void NewInstanceGuid()
Sub NewInstanceGuid
See Also
Reference
IGH_Attributes Interface
NewInstanceGuid Overload
Grasshopper.Kernel Namespace