Grasshopper SDK
Node3d<T>.NearestItems Method (Double, Double, Double, Int32)
 Find the N nearest items.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Index3d<T>> NearestItems(
	double x,
	double y,
	double z,
	int groupSize
)
Public Function NearestItems (
	x As Double,
	y As Double,
	z As Double,
	groupSize As Integer
) As List(Of Index3d(Of T))
Parameters
x
Type: System.Double
x coordinate to search from.
y
Type: System.Double
y coordinate to search from.
z
Type: System.Double
z coordinate to search from.
groupSize
Type: System.Int32
Number of nearest items to return.
Return Value
Type: List<Index3d<T>>
A list of nearest items, sorted from nearest to furthest.
See Also
Reference
Node3d<T> Class
NearestItems Overload
Grasshopper.Kernel.Geometry.SpatialTrees Namespace