Grasshopper SDK
GH_Document.RemoveObject Method (IGH_Attributes, Boolean)
 Remove the top-level object in the attribute tree from the document. This method does not add an Undo event, that is the responsibility of the caller.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RemoveObject(
	IGH_Attributes attribute,
	bool update
)
Public Function RemoveObject (
	attribute As IGH_Attributes,
	update As Boolean
) As Boolean
Parameters
attribute
Type: Grasshopper.Kernel.IGH_Attributes
update
Type: System.Boolean
Return Value
Type: Boolean
See Also
Reference
GH_Document Class
RemoveObject Overload
Grasshopper.Kernel Namespace