Grasshopper SDK
GH_Rectangle.GH_RectangleProxy Constructor
Initializes a new instance of the GH_Rectangle.GH_RectangleProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RectangleProxy(
	GH_Rectangle nOwner
)
Public Sub New (
	nOwner As GH_Rectangle
)
Parameters
nOwner
Type: Grasshopper.Kernel.Types.GH_Rectangle
See Also
Reference
GH_Rectangle.GH_RectangleProxy Class
Grasshopper.Kernel.Types Namespace