Grasshopper SDK
GH_Document Constructor
 Constructor for GH_Document. Makes sure all important members are initialized.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document()
Public Sub New
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace