Grasshopper SDK
GH_Author.CompanyReadonly Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string CompanyReadonly { get; }
Public ReadOnly Property CompanyReadonly As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Author.CompanyReadonly"]
Implements
IGH_Author.Company
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace