Grasshopper SDK
GH_LonLatCoordinate.SphereUParameter Property
 Gets the spherical U parameter.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double SphereUParameter { get; }
Public ReadOnly Property SphereUParameter As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_LonLatCoordinate.SphereUParameter"]
See Also
Reference
GH_LonLatCoordinate Class
Grasshopper.Kernel.Types Namespace