Grasshopper SDK
GH_Slider_Obsolete.SendMessage Method
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static IntPtr SendMessage(
	IntPtr hWnd,
	int msg,
	int wParam,
	IntPtr lParam
)
Public Shared Function SendMessage (
	hWnd As IntPtr,
	msg As Integer,
	wParam As Integer,
	lParam As IntPtr
) As IntPtr
Parameters
hWnd
Type: System.IntPtr
msg
Type: System.Int32
wParam
Type: System.Int32
lParam
Type: System.IntPtr
Return Value
Type: IntPtr
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace