Grasshopper SDK
GH_DocumentServer.Document Property
 Gets the document at the given index.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document this[
	int index
] { get; }
Public ReadOnly Default Property Document (
	index As Integer
) As GH_Document
	Get
Parameters
index
Type: System.Int32
Index of document to retrieve.
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentServer.Document(System.Int32)"]
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace