Grasshopper SDK
IGH_ResponsiveObject Interface
 If you wish to participate in Canvas UI events, you must implement this interface.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_ResponsiveObject
Public Interface IGH_ResponsiveObject
The IGH_ResponsiveObject type exposes the following members.
Methods
Name | Description
RespondToKeyDown
RespondToKeyUp
RespondToMouseDoubleClick
 This function will be called whenever the left button is double-clicked over the canvas. If you are active, you will be the only object who gets called.
RespondToMouseDown
 This function will be called whenever a mouse button is pressed over the canvas. If you are active, you will be the only object who gets called. If you are inactive, you might get called if nobody on top of you decides to become active.
RespondToMouseMove
 This function will be called when the mouse moves across the canvas. If you are active, you will be the only object who gets called. If you are inactive, you might get called if nobody on top of you decides to become active.
RespondToMouseUp
 This function will be called whenever a mouse button is released over the canvas. If you are active, you will be the only object who gets called. If you are inactive, you will not be called at all for MouseUp events.
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace