Grasshopper SDK
GH_Viewport.ProjectY Method
 Project a value along constant Y from canvas coordinates into control coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float ProjectY(
	float y
)
Public Function ProjectY (
	y As Single
) As Single
Parameters
y
Type: System.Single
The constant Y value in canvas coordinates.
Return Value
Type: Single
The associated Y value in control pixel coordinates.
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace