Grasshopper SDK
GH_Canvas.WidgetListCreated Event
 This event is raised once for every GH_Canvas object that is created anew. The event is Shared (static) because it is raised inside the constructor of a GH_Canvas object and therefor cannot be registered on an instance.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_Canvas.WidgetListCreatedEventHandler WidgetListCreated
Public Shared Event WidgetListCreated As GH_Canvas.WidgetListCreatedEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.WidgetListCreatedEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace