Grasshopper SDK
GH_StateTag.RenderTagBlankIcon Method (Graphics, GH_StateTag.DrawCallback)
 Render a blank rectangle icon.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void RenderTagBlankIcon(
	Graphics graphics,
	GH_StateTag.DrawCallback drawCallBack
)
Protected Sub RenderTagBlankIcon (
	graphics As Graphics,
	drawCallBack As GH_StateTag.DrawCallback
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
drawCallBack
Type: Grasshopper.Kernel.GH_StateTag.DrawCallback
Callback (can be null) that will be called between background and foreground shapes.
See Also
Reference
GH_StateTag Class
RenderTagBlankIcon Overload
Grasshopper.Kernel Namespace