Grasshopper SDK
GH_RuntimeFile.TagIntermediate Field
 String tag used t o identify Intermediate Level Help Content in documentation source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagIntermediate = "INTERMEDIATE"
Public Const TagIntermediate As String = "INTERMEDIATE"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace