Grasshopper SDK
GH_GraphicsUtil.ColourARGB Method (Double, Double, Double)
 Create a colour from floating ARGB channels (0.0~1.0). Channels are clipped to valid ranges.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color ColourARGB(
	double r,
	double g,
	double b
)
Public Shared Function ColourARGB (
	r As Double,
	g As Double,
	b As Double
) As Color
Parameters
r
Type: System.Double
g
Type: System.Double
b
Type: System.Double
Return Value
Type: Color
The colour implied by the RGB channel values.
See Also
Reference
GH_GraphicsUtil Class
ColourARGB Overload
Grasshopper.GUI Namespace