Grasshopper SDK
GH_SettingsServer Constructor (String, Boolean)
 Create a new instance of the GH_SettingsServer class. The server will be associated with a settings xml file in the %ApplicationData%\Grasshopper\ directory.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SettingsServer(
	string databaseName,
	bool loadSettings
)
Public Sub New (
	databaseName As String,
	loadSettings As Boolean
)
Parameters
databaseName
Type: System.String
The name of the settings server (equals the name of the xml file so it must adhere to FAT, FAT32 and NTFS naming conventions).
loadSettings
Type: System.Boolean
When true and a file with the same name already exists, its settings will be automatically loaded.
See Also
Reference
GH_SettingsServer Class
GH_SettingsServer Overload
Grasshopper.Kernel Namespace