Grasshopper SDK
GH_DocUndoEventArgs.Record Property
 Gets the UndoRecord pertaining to this event. Not every Event type has a single record associated with it so be sure to test for null.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoRecord Record { get; }
Public ReadOnly Property Record As GH_UndoRecord
	Get
Property Value
Type: GH_UndoRecord
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocUndoEventArgs.Record"]
See Also
Reference
GH_DocUndoEventArgs Class
Grasshopper.Kernel Namespace