Grasshopper SDK
IGH_StateTag.Name Property
 Gets the name field of this state tag.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Name { get; }
ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_StateTag.Name"]
See Also
Reference
IGH_StateTag Interface
Grasshopper.Kernel Namespace