Grasshopper SDK
GH_Document.AutoSave Method (GH_AutoSaveTrigger)
 Creates a new autosave file on the disk. The previous autosave file (assuming it exists) will be temporarily renamed and eventually deleted entirely. Note: AutoSave is only possible on Documents that have TopLevel Rank and a valid FilePath.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AutoSave(
	GH_AutoSaveTrigger trigger
)
Public Function AutoSave (
	trigger As GH_AutoSaveTrigger
) As Boolean
Parameters
trigger
Type: Grasshopper.Kernel.GH_AutoSaveTrigger
Reason for autosave. User can choose to ignore certain autosave reasons.
Return Value
Type: Boolean
See Also
Reference
GH_Document Class
AutoSave Overload
Grasshopper.Kernel Namespace