Grasshopper SDK
GH_PreviewUtil.AddLine Method
 Add a line to the temporary Preview lists.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddLine(
	Line line
)
Public Sub AddLine (
	line As Line
)
Parameters
line
Type: Line
Line to add. Invalid lines will be ignored.
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace