Grasshopper SDK
GH_Surface.Untrim Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Untrim()
Public Function Untrim As Boolean
Return Value
Type: Boolean
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace