Grasshopper SDK
CentralSettings.CanvasObjectIcons Property
 Gets or sets the global default for icon display.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool CanvasObjectIcons { get; set; }
Public Shared Property CanvasObjectIcons As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CanvasObjectIcons"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace