Grasshopper SDK
GH_Format.FormatGeometry Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatGeometry(
	IGH_GeometricGoo data
)
Public Shared Function FormatGeometry (
	data As IGH_GeometricGoo
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.IGH_GeometricGoo
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace