Grasshopper SDK
IGH_Param.Sources Property
 Gets a list of source parameters. Do not modify this list, if you wish to add or remove sources, use dedicated functions like AddSource() and RemoveSource instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IList<IGH_Param> Sources { get; }
ReadOnly Property Sources As IList(Of IGH_Param)
	Get
Property Value
Type: IList<IGH_Param>
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.Sources"]
Return Value
Type: IList<IGH_Param>
The sources for this parameter.
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace