Grasshopper SDK
GH_Gradient.Traffic Method
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Gradient Traffic()
Public Shared Function Traffic As GH_Gradient
Return Value
Type: GH_Gradient
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace