Grasshopper SDK
GH_RotationalTuningData<T>.FrameCount Property
 Gets the total number of recorded frames.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int FrameCount { get; }
Public ReadOnly Property FrameCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_RotationalTuningData`1.FrameCount"]
See Also
Reference
GH_RotationalTuningData<T> Class
Grasshopper.GUI Namespace