Grasshopper SDK
GH_RhinoScriptInterface.CloseDocument Method
 Close the currently active Grasshopper document. If there is not active document, nothing will happen.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool CloseDocument()
Public Function CloseDocument As Boolean
Return Value
Type: Boolean
True on success, false on failure.
Examples
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
  Dim GH
  Set GH = Rhino.GetPlugInObject("Grasshopper")
  Call GH.CloseDocument()
  Set GH = Nothing
End Sub
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace