Grasshopper SDK
IGH_Goo.TypeName Property
 Gets the name of the type of the implementation.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string TypeName { get; }
ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_Goo.TypeName"]
See Also
Reference
IGH_Goo Interface
Grasshopper.Kernel.Types Namespace