Grasshopper SDK
GH_Capsule.AddInputGrip Method (Single)
 Add an input grip to this UI Box. This is the recommended overload.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddInputGrip(
	float Y
)
Public Sub AddInputGrip (
	Y As Single
)
Parameters
Y
Type: System.Single
Y coordinate of grip.
See Also
Reference
GH_Capsule Class
AddInputGrip Overload
Grasshopper.GUI.Canvas Namespace