Grasshopper SDK
GH_MemoryBitmap.Sample Method (Double, Double, Color)
 Top level sampling function for interpolated sampling.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Sample(
	double x,
	double y,
	ref Color col
)
Public Function Sample (
	x As Double,
	y As Double,
	ByRef col As Color
) As Boolean
Parameters
x
Type: System.Double
floating point coordinate in pixel space.
y
Type: System.Double
floating point coordinate in pixel space.
col
Type: System.Drawing.Color
Resulting colour
Return Value
Type: Boolean
See Also
Reference
GH_MemoryBitmap Class
Sample Overload
Grasshopper.Kernel Namespace