Grasshopper SDK
GH_ActiveObject Class
 Basic implementation of IGH_ActiveObject interface. Derive from this class rather than implementing IGH_ActiveObject to make your life easier.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Component
 Grasshopper.Kernel.GH_Param<T>
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_ActiveObject : GH_DocumentObject,
	IGH_ActiveObject
Public MustInherit Class GH_ActiveObject
	Inherits GH_DocumentObject
	Implements IGH_ActiveObject
The GH_ActiveObject type exposes the following members.
Constructors
Name | Description
GH_ActiveObject(IGH_InstanceDescription)
Initializes a new instance of the GH_ActiveObject class
GH_ActiveObject(String, String, String, String, String)
Initializes a new instance of the GH_ActiveObject class
Top
Properties
Name | Description
IconCapableUI
 By default the NickName menu item supports the Icon Mode override toggle. If your UI is not capable of displaying icons, then override this property and return False.
IsDataProvider
 Returns a boolean indicating whether or not the current object can seed data.
Locked
 Gets or sets the enabled flag of this object. Disabled objects are ignored during solutions.
MutableNickName
 Gets or sets a value that enables Nick name changes through the menu. The default is TRUE.
Phase
 Gets or sets the solution phase this object is currenly in.
ProcessorTime
 Gets the most recent processor time profiler value.
RuntimeMessageLevel
 Returns the worst case flag for the current object
If the object contains at least 1 error, the result is Error.
If the object contains at least 1 warning, the result is Warning.
If the object contains at least 1 message, the result is Remark.
If the object contains no errors, no warnings and no messages, the result is Blank.
Top
Methods
Name | Description
AddRuntimeMessage
 Add a new message to this object. Valid message type flags are Warning and Error. If the Message string is empty or zero-length no message is added.
AppendAdditionalMenuItems
 Override this function if you want to add additional items to the object context menu. Default items already included in the menu toolstrip are:
1. Name
2. Preview
3. Warnings
4. Errors
5. [additional items will be inserted here]
6. Help
AppendMenuItems
 This function is called when a context menu is about to be displayed. Override it to set custom items. GH_ActiveObject will already populate the menu with default items, if you merely wish to insert object-specific menu item, consider overriding AppendAdditionalMenuItems instead.
 (Overrides GH_DocumentObject.AppendMenuItems(ToolStripDropDown).)
ClearData
 This function is called whenever the object needs to clear all solution data. Override this function if you need to perform custom clensing.
ClearRuntimeMessages
 Destroy all warning and error lists
CollectData
 This function is called whenever the object is required to collect all data. Either from Persistent records, from source params or whatever.
ComputeData
 This function is called whenever the object is required to generate new data.
DependsOn
 Returns a boolean indicating whether or not the current object somehow inherits from the PotenialSource object
ExpireDownStreamObjects
 This function is called whenever the solution for this object expires. Override this function if objects depend on you.
ExpireSolution
 Informs the document that owns this object that the solution has expired. The current object will be set to BLANK as a result. This method is recursive, it will also expire any and all objects which depend on this object. If you want a less destructive expiration, consider using ClearData(). If this object is already Blank, you should consider not expiring it.
 (Overrides GH_DocumentObject.ExpireSolution(Boolean).)
Menu_AppendBakeItem
 Append the default Bake menu item.
Menu_AppendEnableItem
 Append the default Enable/Disable menu item.
Menu_AppendPreviewItem
 Append the default Show/Hide preview menu item.
Menu_AppendRuntimeMessages
 Append the default warnings and errors menu items.
Menu_AppendWarningsAndErrors |  Obsolete.
 This method is obsolete and has been replaced with Menu_AppendRuntimeMessages().
Read |  (Overrides GH_DocumentObject.Read(GH_IReader).)
RegisterRemoteIDs
 Override this function if you want object changes in the Rhino document to trigger a new solution.
RuntimeMessages
 Gets the list of cached runtime messages that were recorded during solver-time processes.
SDKCompliancy
 Test whether this object is compliant with a given Rhino version.
Write |  (Overrides GH_DocumentObject.Write(GH_IWriter).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel Namespace