Grasshopper SDK
Rotation.RotationCenter Property
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point3d RotationCenter { get; set; }
Public Property RotationCenter As Point3d
	Get
	Set
Property Value
Type: Point3d
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Transforms.Rotation.RotationCenter"]
See Also
Reference
Rotation Class
Grasshopper.Kernel.Types.Transforms Namespace