Grasshopper SDK
GH_Document.SolutionDepth Property
 Gets the number of nested solutions currently running. If no solutions are running, the depth should be zero. If one solution is runnnig, the depth should be one. Higher depths are only possible if a new solution was scheduled from within an existing solution with delay=0ms.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int SolutionDepth { get; }
Public ReadOnly Property SolutionDepth As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.SolutionDepth"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace