Grasshopper SDK
GH_Format.FormatMeshValidity Method
 If the mesh is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatMeshValidity(
	Mesh val,
	string identifier = "Mesh"
)
Public Shared Function FormatMeshValidity (
	val As Mesh,
	Optional identifier As String = "Mesh"
) As String
Parameters
val
Type: Mesh
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the mesh is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace