Grasshopper SDK
GH_Document.GH_UndoUtil.CreateReplaceStateEvent Method
 Create a new undo record for a single solution state addition.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoRecord CreateReplaceStateEvent(
	string name,
	int stateIndex,
	GH_State oldState,
	GH_State newState
)
Public Function CreateReplaceStateEvent (
	name As String,
	stateIndex As Integer,
	oldState As GH_State,
	newState As GH_State
) As GH_UndoRecord
Parameters
name
Type: System.String
Name of undo record.
stateIndex
Type: System.Int32
Index of state.
oldState
Type: Grasshopper.Kernel.GH_State
Solution state to remove.
newState
Type: Grasshopper.Kernel.GH_State
Solution state to insert.
Return Value
Type: GH_UndoRecord
A newly created undo record.
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace