Grasshopper SDK
GH_DocumentTreeNode Constructor
 Create a new node instance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentTreeNode(
	GH_Document node
)
Public Sub New (
	node As GH_Document
)
Parameters
node
Type: Grasshopper.Kernel.GH_Document
Node base document.
See Also
Reference
GH_DocumentTreeNode Class
Grasshopper.Kernel Namespace