Grasshopper SDK
GH_WindowsFormUtil.CenterFormOnScreen Method
 Positions a Form so that it is centered on the current screen. The current screen being defined as the screen containing the cursor.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void CenterFormOnScreen(
	Form F,
	bool limitToScreen
)
Public Shared Sub CenterFormOnScreen (
	F As Form,
	limitToScreen As Boolean
)
Parameters
F
Type: System.Windows.Forms.Form
The Form to adjust
limitToScreen
Type: System.Boolean
If True, the Form won't be allowed to extend beyond the limits of the active screen.
See Also
Reference
GH_WindowsFormUtil Class
Grasshopper.GUI Namespace