Grasshopper SDK
GH_Canvas.CanvasOldSchoolMenu Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public ToolStripDropDownMenu CanvasOldSchoolMenu()
Public Function CanvasOldSchoolMenu As ToolStripDropDownMenu
Return Value
Type: ToolStripDropDownMenu
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace