Grasshopper SDK
GH_SliderBase.KeyDown Method
 Respond to a KeyDown event.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool KeyDown(
	KeyEventArgs args
)
Public Function KeyDown (
	args As KeyEventArgs
) As Boolean
Parameters
args
Type: System.Windows.Forms.KeyEventArgs
KeyDown event arguments.
Return Value
Type: Boolean
True if something changed, false if not.
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace