Grasshopper SDK
IGH_PreviewObject.ClippingBox Property
 Gets the clipping box for this object. The clipping box is typically the union of the boundingboxes of all the geometry that is drawn by this object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
BoundingBox ClippingBox { get; }
ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_PreviewObject.ClippingBox"]
Return Value
Type: BoundingBox
The clipping box for this object.
See Also
Reference
IGH_PreviewObject Interface
Grasshopper.Kernel Namespace