Grasshopper SDK
GH_CanvasMouseEvent.CanvasY Property
 Gets the y-coordinate of the cursor location in canvas unit coordinates.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float CanvasY { get; }
Public ReadOnly Property CanvasY As Single
	Get
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasMouseEvent.CanvasY"]
See Also
Reference
GH_CanvasMouseEvent Class
Grasshopper.GUI Namespace