Grasshopper SDK
GH_Transform Constructor (Transform)
Initializes a new instance of the GH_Transform class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Transform(
	Transform transform
)
Public Sub New (
	transform As Transform
)
Parameters
transform
Type: Transform
See Also
Reference
GH_Transform Class
GH_Transform Overload
Grasshopper.Kernel.Types Namespace