Grasshopper SDK
GH_FontList.DisplayText Property
 Gets or sets the placeholder string.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string DisplayText { get; set; }
Public Property DisplayText As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FontList.DisplayText"]
See Also
Reference
GH_FontList Class
Grasshopper.GUI Namespace