Grasshopper SDK
GH_DocumentServer.ModifiedDocumentCount Property
 Gets the total number of modified (unsaved) documents.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ModifiedDocumentCount { get; }
Public ReadOnly Property ModifiedDocumentCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentServer.ModifiedDocumentCount"]
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace