Grasshopper SDK
GH_Document.SolutionProgress Method
 Returns the progress of the current solution.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int SolutionProgress(
	out int objectIndex,
	out int maximumIndex
)
Public Function SolutionProgress (
	<OutAttribute> ByRef objectIndex As Integer,
	<OutAttribute> ByRef maximumIndex As Integer
) As Integer
Parameters
objectIndex
Type: System.Int32
The index of the object currently being solved.
maximumIndex
Type: System.Int32
The highest index.
Return Value
Type: Int32
Percentage of solution as a number between 1 and 99 inclusive.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace