Grasshopper SDK
Folders.DefaultUserObjectFolder Property
 Gets the standard directory in windows ApplicationData that contains GHUSER files.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string DefaultUserObjectFolder { get; }
Public Shared ReadOnly Property DefaultUserObjectFolder As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.DefaultUserObjectFolder"]
Return Value
Type: String
A directory path.
See Also
Reference
Folders Class
Grasshopper Namespace