Grasshopper SDK
GH_Convert.ToInt32 Method
 Convert data into Int32s.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToInt32(
	Object data,
	out int destination,
	GH_Conversion conversion_level
)
Public Shared Function ToInt32 (
	data As Object,
	<OutAttribute> ByRef destination As Integer,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
destination
Type: System.Int32
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace