Grasshopper SDK
GH_Canvas.MarkovSuggestions Property
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_ObjectProxy> MarkovSuggestions { get; }
Public ReadOnly Property MarkovSuggestions As List(Of IGH_ObjectProxy)
	Get
Property Value
Type: List<IGH_ObjectProxy>
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.MarkovSuggestions"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace