Grasshopper SDK
GH_CanvasDocumentChangedEventArgs Constructor
Initializes a new instance of the GH_CanvasDocumentChangedEventArgs class
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CanvasDocumentChangedEventArgs(
	GH_Document newDoc,
	GH_Document oldDoc
)
Public Sub New (
	newDoc As GH_Document,
	oldDoc As GH_Document
)
Parameters
newDoc
Type: Grasshopper.Kernel.GH_Document
oldDoc
Type: Grasshopper.Kernel.GH_Document
See Also
Reference
GH_CanvasDocumentChangedEventArgs Class
Grasshopper.GUI.Canvas Namespace