Grasshopper SDK
GH_Component Class
 Inherit from this class if you wish to create a custom component. Note that you must provide a public, empty constructor which calls the base class constructor.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Component
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_Component : GH_ActiveObject,
	IGH_Component, IGH_RenderAwareObject
Public MustInherit Class GH_Component
	Inherits GH_ActiveObject
	Implements IGH_Component, IGH_RenderAwareObject
The GH_Component type exposes the following members.
Properties
Name | Description
ClippingBox
 Gets the clipping box for all preview geometry drawn by this component and all associated parameters.
DataComparison
 Gets or sets the data matching algorithm for this component
HelpDescription
 Override this method if you want the help topic content to be more than the Component description.
Hidden
 Gets or sets the hidden flag for this component. Does not affect Hidden flags on parameters associated with this component.
InConstructor
 Gets the constructor flag for this instance. If InConstructor = True, it means the component is still registering parameters and the layout is not yet complete.
InstanceDescription |  (Overrides GH_InstanceDescription.InstanceDescription.)
IsBakeCapable
IsDataProvider
 Components are never Data providers. Only the output parameters can be considered to be providers.
 (Overrides GH_ActiveObject.IsDataProvider.)
IsPreviewCapable
 If a single parameter is PreviewCapable, so is the component. Override this property if you need special Preview flags.
IsValidPrincipalParameterIndex
 Gets whether the MasterParameterIndex property identifies a valid parameter.
Locked
 Gets or sets the Locked state for this Component. This also sets locked states for all input and output parameters.
 (Overrides GH_ActiveObject.Locked.)
Message
 Gets or sets a custom message to be displayed underneath the component. This message is not serialized and should be assigned on every solution anew.
Params
 Gets the parameter manager object for this component.
PrincipalParameterIndex
 Gets or sets the principal parameter index override. Negative indices or indices larger than or equal to the input parameter count will be ignored and regular principal parameter detection will kick in.
ProcessorTime
 Gets the total processor time (profiler) spend by this component and all input parameters.
 (Overrides GH_ActiveObject.ProcessorTime.)
RunCount
 Gets a value indicating how many times the SolveInstance method was called on this component during the last solution. This property will return -1 if no valid runcount is available.
RuntimeMessageLevel
 Returns the worst case runtime warning level of me and all my parameters
 (Overrides GH_ActiveObject.RuntimeMessageLevel.)
Top
Methods
Name | Description
AddedToDocument
 Overrides the AddedToDocument method and delegates the call to all parameters.
 (Overrides GH_DocumentObject.AddedToDocument(GH_Document).)
AfterSolveInstance
 Override this method if you want to be called after the last call to SolveInstance.
AppendAdditionalComponentMenuItems
 Override this function if you want to insert some custom menu items in your derived Component class. Items will be added between List Matching items and parameter menus.
AppendAdditionalMenuItems
 Adds typical component type items to the context menu: 1. Data comparison types 2. Custom (overridden) items 3. Nested input parameter context menu items 4. Nested output parameter context menu items
 (Overrides GH_ActiveObject.AppendAdditionalMenuItems(ToolStripDropDown).)
AppendRenderGeometry
 Append all geometry associated with this component to a render queue.
AssignInitCodeToInputParameter
 Utility function for parsing and assigning init codes. This only works for standard parameter types.
BakeGeometry(RhinoDoc, List<Guid>)
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
BeforeSolveInstance
 Override this method if you want to be called before the first call to SolveInstance.
ClearData
 Clear the data inside this component and all output parameters.
 (Overrides GH_ActiveObject.ClearData().)
ClearRuntimeMessages
 Clears all runtime messages in me and my parameters
 (Overrides GH_ActiveObject.ClearRuntimeMessages().)
CollectData
 Calls CollectData on all input parameters and makes sure the Component and all associated parameters are left in a valid state.
 (Overrides GH_ActiveObject.CollectData().)
ComputeData
 Compute all data and fill out all output parameters.
 (Overrides GH_ActiveObject.ComputeData().)
CreateAttributes
 Create new attributes.
 (Overrides GH_DocumentObject.CreateAttributes().)
DependsOn
 Returns True is any one of my input parameters depends on the source.
 (Overrides GH_ActiveObject.DependsOn(IGH_ActiveObject).)
DocumentAngleTolerance
 Gets the Angle tolerance (in radians) for the currently active Rhino document.
DocumentContextChanged
 Overrides the DocumentContextChanged method and delegates the call to all parameters.
 (Overrides GH_DocumentObject.DocumentContextChanged(GH_Document, GH_DocumentContext).)
DocumentTolerance
 Gets the Absolute tolerance for the currently active Rhino document.
DrawViewportMeshes
 Draw preview meshes for this component and all associated parameters.
DrawViewportWires
 Draw preview wires for this component and all associated parameters.
ExpireDownStreamObjects
 Expire all objects that depend on any of the output parameters.
 (Overrides GH_ActiveObject.ExpireDownStreamObjects().)
GenerateDefaultHTML
 Creates the default component help topic, including all parameter lists.
GenerateParameterHelp()
 Create an HTML string that lists names and descriptions for input and output parameters.
GenerateParameterHelp(IGH_Param)
 Generate HTML string for a single parameter.
HtmlHelp_Source
 Return a String which contains HTML formatted source for the help topic. If you want to pass a URL that points to a remote page, then prefix the URL with a GOTO: tag, like so: GOTO:http://www.YourWebAddressHere.com
 (Overrides GH_DocumentObject.HtmlHelp_Source().)
IsolateObject
 Sever the connections of all input and output parameters.
 (Overrides GH_DocumentObject.IsolateObject().)
MovedBetweenDocuments
 Overrides the MovedBetweenDocuments method and delegates the call to all parameters.
 (Overrides GH_DocumentObject.MovedBetweenDocuments(GH_Document, GH_Document).)
PostConstructor
 The PostConstructor is called from within each constructor. DO NOT OVERRIDE THIS unless you know what you are doing.
Read
 Read all required data for deserialization from an IO archive.
 (Overrides GH_ActiveObject.Read(GH_IReader).)
RegisterInputParams
 Declare all your input parameters here.
RegisterOutputParams
 Declare all your output parameters here.
RegisterRemoteIDs
 Registers all my input parameters with the UUID_LookUpTable
 (Overrides GH_ActiveObject.RegisterRemoteIDs(GH_GuidTable).)
RemovedFromDocument
 Overrides the RemovedFromDocument method and delegates the call to all parameters.
 (Overrides GH_DocumentObject.RemovedFromDocument(GH_Document).)
RuntimeMessages
 Gets the list of cached runtime messages that were recorded during solver-time processes. For components, the set of runtime messages also includes input and output parameters.
 (Overrides GH_ActiveObject.RuntimeMessages(GH_RuntimeMessageLevel).)
SolveInstance
 This function will be called (successively) from within the ComputeData method of this component.
Write
 Write all required data for deserialization to an IO archive.
 (Overrides GH_ActiveObject.Write(GH_IWriter).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel Namespace