Grasshopper SDK
GH_UndoServer.PushUndoRecord Method (String, GH_UndoAction)
 Add a new undo record to the undo stack, this function clears the Redo stack.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid PushUndoRecord(
	string name,
	GH_UndoAction action
)
Public Function PushUndoRecord (
	name As String,
	action As GH_UndoAction
) As Guid
Parameters
name
Type: System.String
Name of undo record.
action
Type: Grasshopper.Kernel.Undo.GH_UndoAction
Undo action.
Return Value
Type: Guid
The ID of the newly created undo record.
See Also
Reference
GH_UndoServer Class
PushUndoRecord Overload
Grasshopper.Kernel.Undo Namespace