Grasshopper SDK
GH_ComponentServer.FindAssemblyByObject Method (IGH_DocumentObject)
 Gets the assembly that corresponds to the given library ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_AssemblyInfo FindAssemblyByObject(
	IGH_DocumentObject object
)
Public Function FindAssemblyByObject (
	object As IGH_DocumentObject
) As GH_AssemblyInfo
Parameters
object
Type: Grasshopper.Kernel.IGH_DocumentObject
Object.
Return Value
Type: GH_AssemblyInfo
The library info, or null if the ID is not registered.
See Also
Reference
GH_ComponentServer Class
FindAssemblyByObject Overload
Grasshopper.Kernel Namespace