Grasshopper SDK
GH_FormShepard Class
 A Form shepard is used to herde a bunch of floating forms. Important forms that potentially spout child forms might choose to implement one.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_FormShepard
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_FormShepard
Public Class GH_FormShepard
The GH_FormShepard type exposes the following members.
Constructors
Name | Description
GH_FormShepard
 Create a new form shepard.
Top
Properties
Name | Description
Sheep
Top
Methods
Name | Description
RegisterForm
 Add a sheep form to the flock. This form will be affected by the location and size of the main form.
UnregisterForm
 Remove a sheep from the flock.
Top
See Also
Reference
Grasshopper.GUI Namespace