Grasshopper SDK
GH_ParserOperator Constructor
Initializes a new instance of the GH_ParserOperator class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ParserOperator(
	string name,
	char symbol,
	GH_ParserPrecedence precedence,
	GH_OperatorType type,
	string description
)
Public Sub New (
	name As String,
	symbol As Char,
	precedence As GH_ParserPrecedence,
	type As GH_OperatorType,
	description As String
)
Parameters
name
Type: System.String
symbol
Type: System.Char
precedence
Type: Grasshopper.Kernel.Expressions.GH_ParserPrecedence
type
Type: Grasshopper.Kernel.Expressions.GH_OperatorType
description
Type: System.String
See Also
Reference
GH_ParserOperator Class
Grasshopper.Kernel.Expressions Namespace