Grasshopper SDK
GH_Param<T>.AddSource Method (IGH_Param)
 Append a new Source parameter to the end of the Sources list. Sources provide this parameter with data at runtime.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void AddSource(
	IGH_Param source
)
Public Overridable Sub AddSource (
	source As IGH_Param
)
Parameters
source
Type: Grasshopper.Kernel.IGH_Param
Source to append.
Implements
IGH_Param.AddSource(IGH_Param)
See Also
Reference
GH_Param<T> Class
AddSource Overload
Grasshopper.Kernel Namespace