Grasshopper SDK
GH_ResizableAttributes<T>.MinimumSize Property
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected abstract Size MinimumSize { get; }
Protected MustOverride ReadOnly Property MinimumSize As Size
	Get
Property Value
Type: Size
[Missing <value> documentation for "P:Grasshopper.Kernel.Attributes.GH_ResizableAttributes`1.MinimumSize"]
See Also
Reference
GH_ResizableAttributes<T> Class
Grasshopper.Kernel.Attributes Namespace