Grasshopper SDK
GH_TextBoxInputBase Class
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Base.GH_TextBoxInputBase
 Grasshopper.GUI.Base.GH_DigitScrollerBase
 Grasshopper.GUI.Base.GH_SliderBase
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_TextBoxInputBase
Public MustInherit Class GH_TextBoxInputBase
The GH_TextBoxInputBase type exposes the following members.
Constructors
Name | Description
GH_TextBoxInputBase
Initializes a new instance of the GH_TextBoxInputBase class
Top
Properties
Name | Description
Bounds
 Gets or sets the Bounds of this control.
Font
 Gets or sets the Font to use in this control.
IsTextInput
 Gets whether the text input box is currently on screen.
Top
Methods
Name | Description
HandleTextInputAccepted
HideTextInputBox
 Hides the text-input override form (if it is displayed).
RespondToEnter
RespondToEscape
ShowTextInputBox(Control, String, Boolean)
 Display a floating text-box on top of the owner control.
ShowTextInputBox(Control, String, Boolean, Boolean)
 Display a floating text-box on top of the owner control.
ShowTextInputBox(Control, String, Boolean, Boolean, Matrix)
 Display a floating text-box on top of the owner control.
Top
See Also
Reference
Grasshopper.GUI.Base Namespace