Grasshopper SDK
GH_Theme.BackGround Property
 Gets the theme background settings.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_BackgroundSettings BackGround { get; }
Public ReadOnly Property BackGround As GH_BackgroundSettings
	Get
Property Value
Type: GH_BackgroundSettings
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_Theme.BackGround"]
See Also
Reference
GH_Theme Class
Grasshopper.GUI.Theme Namespace