Grasshopper SDK
GH_ActiveObject.Phase Property
 Gets or sets the solution phase this object is currenly in.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SolutionPhase Phase { get; set; }
Public Property Phase As GH_SolutionPhase
	Get
	Set
Property Value
Type: GH_SolutionPhase
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ActiveObject.Phase"]
Implements
IGH_ActiveObject.Phase
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace