Grasshopper SDK
GH_CanvasValidator.CanDeleteObject Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool CanDeleteObject(
	IGH_DocumentObject object
)
Public Overridable Function CanDeleteObject (
	object As IGH_DocumentObject
) As Boolean
Parameters
object
Type: Grasshopper.Kernel.IGH_DocumentObject
Return Value
Type: Boolean
Implements
IGH_CanvasValidator.CanDeleteObject(IGH_DocumentObject)
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace