Grasshopper SDK
CentralSettings.TemplateFile Property
 Gets or sets the template file path. Use String.Empty or Nothing to disable the template file.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string TemplateFile { get; set; }
Public Shared Property TemplateFile As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.CentralSettings.TemplateFile"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace