Grasshopper SDK
GH_Alias.Alias Property
 Gets or sets the alias string.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Alias { get; set; }
Public Property Alias As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Alias.Alias"]
See Also
Reference
GH_Alias Class
Grasshopper.Kernel Namespace