Grasshopper SDK
IGH_GooProxy.Construct Method
 This method will be called when a new instance of this type is constructed. It allows implementers to supply a customized UI to be shown during construction. This method should never throw exceptions.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void Construct()
Sub Construct
See Also
Reference
IGH_GooProxy Interface
Grasshopper.Kernel.Types Namespace