Grasshopper SDK
GH_Convert.ToSize Method
 Convert a floating point GDI size structure to an integer rounded size.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Size ToSize(
	SizeF in
)
Public Shared Function ToSize (
	in As SizeF
) As Size
Parameters
in
Type: System.Drawing.SizeF
SizeF to convert.
Return Value
Type: Size
Integer accuracy size.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace