Grasshopper SDK
Scale Constructor (Point3d, Double)
Initializes a new instance of the Scale class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Scale(
	Point3d point,
	double scale
)
Public Sub New (
	point As Point3d,
	scale As Double
)
Parameters
point
Type: Point3d
scale
Type: System.Double
See Also
Reference
Scale Class
Scale Overload
Grasshopper.Kernel.Types.Transforms Namespace