Grasshopper SDK
GH_Painter.DrawStateFlags Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DrawStateFlags(
	GH_Document doc
)
Public Sub DrawStateFlags (
	doc As GH_Document
)
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace