Grasshopper SDK
GH_FontServer.Script Property
 FontFamily.GenericSansSerif, 10pt, italic
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font Script { get; }
Public Shared ReadOnly Property Script As Font
	Get
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FontServer.Script"]
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace