Grasshopper SDK
GH_DocumentObject.ObjectChanged Event
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event IGH_DocumentObject.ObjectChangedEventHandler ObjectChanged
Public Event ObjectChanged As IGH_DocumentObject.ObjectChangedEventHandler
Value
Type: Grasshopper.Kernel.IGH_DocumentObject.ObjectChangedEventHandler
Implements
IGH_DocumentObject.ObjectChanged
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace