Grasshopper SDK
GH_GraftMode Enumeration
 Enumerates all predefined grafting modes.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[FlagsAttribute]
public enum GH_GraftMode
<FlagsAttribute>
Public Enumeration GH_GraftMode
Members
Member name | Value | Description
None | 0 |  Don't include null items or empty lists.
GraftNullItems | 1 |  Null items are included in the grafted tree.
GraftEmptyLists | 2 |  Empty lists are included in the grafted tree.
GraftAll | 3 |  Null items and empty lists are both included in the grafted tree.
See Also
Reference
Grasshopper.Kernel.Data Namespace