Grasshopper SDK
GH_RotationalTuningData<T>.TotalTurns Method
 Compute the total number of full turns from the first to the last frame.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double TotalTurns()
Public Function TotalTurns As Double
Return Value
Type: Double
See Also
Reference
GH_RotationalTuningData<T> Class
Grasshopper.GUI Namespace