Grasshopper SDK
GH_CodeStringSegment Constructor
Initializes a new instance of the GH_CodeStringSegment class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CodeStringSegment(
	string nString,
	bool bIsCode
)
Public Sub New (
	nString As String,
	bIsCode As Boolean
)
Parameters
nString
Type: System.String
bIsCode
Type: System.Boolean
See Also
Reference
GH_CodeStringSegment Class
Grasshopper.Kernel.Expressions Namespace