Grasshopper SDK
GH_Animator<T>.AdjustAnimation Method (T, Int32)
 Adjust the animation.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AdjustAnimation(
	T newTarget,
	int duration
)
Public Sub AdjustAnimation (
	newTarget As T,
	duration As Integer
)
Parameters
newTarget
Type: T
New B value.
duration
Type: System.Int32
Duration of adjusted animation in milliseconds.
See Also
Reference
GH_Animator<T> Class
AdjustAnimation Overload
Grasshopper.GUI Namespace