Grasshopper SDK
GH_Capsule.AddInputGrip Method (Point)
 Add an input grip to this UI Box.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddInputGrip(
	Point P
)
Public Sub AddInputGrip (
	P As Point
)
Parameters
P
Type: System.Drawing.Point
Coordinate of grip.
See Also
Reference
GH_Capsule Class
AddInputGrip Overload
Grasshopper.GUI.Canvas Namespace