Grasshopper SDK
GH_FontControl Constructor
Initializes a new instance of the GH_FontControl class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_FontControl()
Public Sub New
See Also
Reference
GH_FontControl Class
Grasshopper.GUI Namespace