Grasshopper SDK
GH_DigitNumber.AssignOffset Method
 Assign an offset to a given digit and recursively adjust all leftwards offsets if needed.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AssignOffset(
	int index,
	decimal offset
)
Public Function AssignOffset (
	index As Integer,
	offset As Decimal
) As Boolean
Parameters
index
Type: System.Int32
Index of digit to offset.
offset
Type: System.Decimal
New offset for digit.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace