Grasshopper SDK
GH_ScriptVariant Explicit Conversion (GH_ScriptVariant to Boolean)
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static explicit operator bool (
	GH_ScriptVariant in
)
Public Shared Narrowing Operator CType (
	in As GH_ScriptVariant
) As Boolean
Parameters
in
Type: Grasshopper.Kernel.Expressions.GH_ScriptVariant
Return Value
Type: Boolean
See Also
Reference
GH_ScriptVariant Class
Explicit Overload
Grasshopper.Kernel.Expressions Namespace