Grasshopper SDK
IGH_Goo.ScriptVariable Method
 This function will be called when the local IGH_Goo instance disapears into a user Script. This would be an excellent place to cast your IGH_Goo type to a simple data type.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Object ScriptVariable()
Function ScriptVariable As Object
Return Value
Type: Object
The object that represents this IGH_Goo instance in a script.
See Also
Reference
IGH_Goo Interface
Grasshopper.Kernel.Types Namespace