Grasshopper SDK
GH_AssemblyInfo.Assembly Property
 Gets the actual assembly that this info object describes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Assembly Assembly { get; }
Public ReadOnly Property Assembly As Assembly
	Get
Property Value
Type: Assembly
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.Assembly"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace