Grasshopper SDK
GH_Param<T>.Kind Property
 Gets the parameter kind. The kind is evaluated lazily and cached.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual GH_ParamKind Kind { get; }
Public Overridable ReadOnly Property Kind As GH_ParamKind
	Get
Property Value
Type: GH_ParamKind
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.Kind"]
Implements
IGH_Param.Kind
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace