Grasshopper SDK
GH_RhinoScriptInterface.SaveDocumentAs Method
 Save the currently active Grasshopper document in a specific location. If there is no active document, nothing will happen.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool SaveDocumentAs(
	string filename
)
Public Function SaveDocumentAs (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
Path of file to save to (must be a *.gh or *ghx extension).
Return Value
Type: Boolean
True on success, false on failure.
Examples
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
  Dim GH
  Set GH = Rhino.GetPlugInObject("Grasshopper")
  Call GH.SaveDocumentAs("C:\GrasshopperBackup\[" & Hour(Now()) & "][" & Minute(Now()) & "][" & Second(Now()) & "].ghx")
  Set GH = Nothing
End Sub
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace