Grasshopper SDK
Tracing Class
 Class that provides useful static methods for debugging, tracing and messaging.
Inheritance Hierarchy
System.Object
 Grasshopper.Tracing
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class Tracing
Public NotInheritable Class Tracing
The Tracing type exposes the following members.
Methods
Name | Description
Assert(Guid)
 Display a typical ASSERT dialog with stack information.
Assert(Guid, Exception)
 Display a typical assert dialog with stack information.
Assert(Guid, String)
 Display a typical assert dialog with stack information.
Assert(Guid, String, Exception)
 Display a typical assert dialog with stack information.
DebugLogAddEntry
 Add a message to the debug log. If the debug log doesn't exist yet, it will be created. This function will only work if the Grasshopper window exists. This method is threadsafe.
DebugLogBeginBlock
 Start a new block in the debug data. You must end all your own blocks. This function will only work if the Grasshopper window exists. This method is threadsafe.
DebugLogEndBlock
 Start a new block in the debug data. You must end all your own blocks. This function will only work if the Grasshopper window exists. This method is threadsafe.
Top
See Also
Reference
Grasshopper Namespace