Grasshopper SDK
GH_Convert.ToMatrix_Secondary Method
 Attempts to convert other data types into a Matrix. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToMatrix_Secondary(
	Object data,
	ref Matrix rc
)
Public Shared Function ToMatrix_Secondary (
	data As Object,
	ByRef rc As Matrix
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Matrix
[out] Matrix cast.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace