Grasshopper SDK
GH_PingDocumentEventArgs.m_document Field
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_Document m_document
Protected m_document As GH_Document
Field Value
Type: GH_Document
See Also
Reference
GH_PingDocumentEventArgs Class
Grasshopper.Kernel Namespace