Grasshopper SDK
IGH_ActiveObject.Locked Property
 Gets or sets the locked flag of this object. Locked objects are ignored during solutions.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool Locked { get; set; }
Property Locked As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ActiveObject.Locked"]
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace