Grasshopper SDK
GH_ColourCube Class
 Maintains a collection of graphical shapes and coordinates that specify important features of the Colour Space Cube graphics.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Base.GH_ColourCube
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ColourCube
Public Class GH_ColourCube
The GH_ColourCube type exposes the following members.
Constructors
Name | Description
GH_ColourCube
 Create a new instance of this class.
Top
Properties
Name | Description
BackFace
 Gets a graphics path describing the back face of the cube. Caller is responsible for disposing of this path instance.
BottomFace
 Gets a graphics path describing the bottom face of the cube. Caller is responsible for disposing of this path instance.
C0
 Gets the first point in the corner point list.
C1
 Gets the second point in the corner point list.
C2
 Gets the third point in the corner point list.
C3
 Gets the fourth point in the corner point list.
C4
 Gets the fifth point in the corner point list.
C5
 Gets the sixth point in the corner point list.
C6
 Gets the seventh point in the corner point list.
C7
 Gets the eighth point in the corner point list.
Grip
 Gets the rectangle that describes the slice grip.
LeftFace
 Gets a graphics path describing the left face of the cube. Caller is responsible for disposing of this path instance.
Pivot
 Gets the point that describes the center of the pivot on the slice.
S0
 Gets the first point in the shadow point list. This point is coincident with C0.
S1
 Gets the second point in the shadow point list. This is the corner of the drop-shadow on the bottom face.
S2
 Gets the third point in the shadow point list. This point is the kink of the drop-shadow on the edge connecting C2 and C3.
S3
 Gets the fourth point in the shadow point list. This point is coincident with C7.
S4
 Gets the fifth point in the shadow point list. This point is coincident with C4.
Shadow
 Gets a graphics path describing the outline of the drop shadow. Caller is responsible for disposing of this path instance.
Silhouette
 Gets a graphics path describing the silhouette of the cube. Caller is responsible for disposing of this path instance.
Slice
 Gets the rectangle that describes the cutting slide through the current colour space.
Top
Methods
Name | Description
Average(Color, Color)
 Compute the average of two colours.
Average(Color, Color, Color, Color)
 Compute the average of four colours.
Blend
 Inteprolate between two colours.
ColorAtRail
 Get the color at a position along the depth rail.
ColorAtSlice
 Get the color at a position on the slice.
RenderAll
 Call all render methods in the correct order.
RenderBackEdges
 Render the edges of the back face creases.
RenderBackFaces
 Render the fills of the backfaces.
RenderDropShadow
 Render the drop shadow of the cube.
RenderEdgeShadows
 Render the edge shadows of the cube due to GI.
RenderForeEdges
 Render the edges of the fore face creases.
RenderGrip
 Render the slice grip.
RenderPivot
 Render the colour pivot on the current slice.
RenderSilhouetteEdges
 Render the edges of the cube silhouettes.
RenderSlice
 Render the square slice with colour gradients.
RenderSliceDropShadow
 Render the drop shadow onto the slice.
RenderSliceEdgeShadows
 Render the edge shadows of the slice due to GI.
RenderSliceSilhouetteEdges
 Render the silhouette edges of the slice.
Top
See Also
Reference
Grasshopper.GUI.Base Namespace