Grasshopper SDK
GH_DigitScrollerBase.ScrollBoxes Property
 Gets all scroll boxes (from left to right) for this control, not including the radix box.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Rectangle> ScrollBoxes { get; }
Public ReadOnly Property ScrollBoxes As List(Of Rectangle)
	Get
Property Value
Type: List<Rectangle>
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.ScrollBoxes"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace