Grasshopper SDK
Utility.InvokeDownloader Method
 Start an asynchronous download operation. The download runs in a separate appdomain. After triggering that process this method returns immediately.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void InvokeDownloader(
	string sourceUri,
	string targetUri,
	bool silent
)
Public Shared Sub InvokeDownloader (
	sourceUri As String,
	targetUri As String,
	silent As Boolean
)
Parameters
sourceUri
Type: System.String
Uri of data to download.
targetUri
Type: System.String
Uri of file on local disk where to store downloaded data.
silent
Type: System.Boolean
If true the download will not display any user interface.
See Also
Reference
Utility Class
Grasshopper Namespace