Grasshopper SDK
GH_PreviewUtil Class
 This class exposes functionality that makes it easy to draw temporary geometry in Rhino viewports.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_PreviewUtil
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_PreviewUtil : IDisposable
Public NotInheritable Class GH_PreviewUtil
	Implements IDisposable
The GH_PreviewUtil type exposes the following members.
Constructors
Name | Description
GH_PreviewUtil()
Initializes a new instance of the GH_PreviewUtil class
GH_PreviewUtil(Boolean)
Initializes a new instance of the GH_PreviewUtil class
Top
Properties
Name | Description
Enabled
 Gets or sets the enabled state of this Preview util.
WireColour
 Gets or sets the colour to use for Preview geometry.
Top
Methods
Name | Description
AddBox
 Add a box to the temporary Preview lists.
AddBrep
 Add a brep to the temporary Preview lists.
AddCurve
 Add a curve to the temporary Preview lists.
AddLine
 Add a line to the temporary Preview lists.
AddMesh
 Add a mesh to the temporary Preview lists.
AddPlane
 Add a plane to the temporary Preview lists.
AddPoint
 Add a point to the temporary Preview lists.
AddVector
 Add a vector to the temporary Preview lists.
Clear
 Clear all temporary geometry.
Dispose
Releases all resources used by the GH_PreviewUtil
Redraw
 Forces a redraw the the viewports.
Top
See Also
Reference
Grasshopper.Kernel Namespace