Grasshopper SDK
GH_Document.SetEnabledFlags Method (Boolean)
 Set the enabled flags of all selected objects to true or false
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetEnabledFlags(
	bool bEnable
)
Public Sub SetEnabledFlags (
	bEnable As Boolean
)
Parameters
bEnable
Type: System.Boolean
See Also
Reference
GH_Document Class
SetEnabledFlags Overload
Grasshopper.Kernel Namespace