Grasshopper SDK
GH_Gradient.GradientChanged Event
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Gradient.GradientChangedEventHandler GradientChanged
Public Event GradientChanged As GH_Gradient.GradientChangedEventHandler
Value
Type: Grasshopper.GUI.Gradient.GH_Gradient.GradientChangedEventHandler
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace