Grasshopper SDK
GH_FloatingParamAttributes Constructor
Initializes a new instance of the GH_FloatingParamAttributes class
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_FloatingParamAttributes(
	IGH_Param param
)
Public Sub New (
	param As IGH_Param
)
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
See Also
Reference
GH_FloatingParamAttributes Class
Grasshopper.Kernel.Attributes Namespace