Grasshopper SDK
GH_PreviewExpiredEventArgs.ForceRedraw Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ForceRedraw { get; }
Public ReadOnly Property ForceRedraw As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewExpiredEventArgs.ForceRedraw"]
See Also
Reference
GH_PreviewExpiredEventArgs Class
Grasshopper.Kernel Namespace