Grasshopper SDK
GH_Mesh Constructor (Guid)
Initializes a new instance of the GH_Mesh class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Mesh(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
GH_Mesh Class
GH_Mesh Overload
Grasshopper.Kernel.Types Namespace