Grasshopper SDK
GH_DocumentServer.AddDocument Method (String, Boolean)
 Add a new document to the global list. If there already is a document with the given path, it will be made active.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document AddDocument(
	string filepath,
	bool makeActive
)
Public Function AddDocument (
	filepath As String,
	makeActive As Boolean
) As GH_Document
Parameters
filepath
Type: System.String
Filepath to document.
makeActive
Type: System.Boolean
If true, the document will be loaded into the main canvas.
Return Value
Type: GH_Document
The document that was added or activated, or null on failure.
See Also
Reference
GH_DocumentServer Class
AddDocument Overload
Grasshopper.Kernel Namespace