Grasshopper SDK
GH_ExpressionSyntaxWriter.RewriteAll Method
 Apply all syntax rulesets to the expression.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string RewriteAll(
	string Expression
)
Public Shared Function RewriteAll (
	Expression As String
) As String
Parameters
Expression
Type: System.String
Return Value
Type: String
See Also
Reference
GH_ExpressionSyntaxWriter Class
Grasshopper.Kernel.Expressions Namespace