Grasshopper SDK
GH_Transform Class
 Represents a collection of transformations.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Transform>
 Grasshopper.Kernel.Types.GH_Transform
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Transform : GH_Goo<Transform>
Public Class GH_Transform
	Inherits GH_Goo(Of Transform)
The GH_Transform type exposes the following members.
Constructors
Name | Description
GH_Transform()
Initializes a new instance of the GH_Transform class
GH_Transform(Transform)
Initializes a new instance of the GH_Transform class
GH_Transform(GH_Transform)
Initializes a new instance of the GH_Transform class
GH_Transform(ITransform)
Initializes a new instance of the GH_Transform class
Top
Properties
Name | Description
CompoundTransforms
 Gets the internal set of transforms. If you modify the compound transformations, you must call ClearCaches().
IsValid |  (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_Goo<T>.Value.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<Q>(Q) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
ClearCaches
 Erase the compound transformation caches.
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
EmitProxy
 Returns a proxy that represents this transform. Do not call this function unless you're
 (Overrides GH_Goo<T>.EmitProxy().)
GetInverse
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace