Grasshopper SDK
GH_ComponentParamServer.SortOutput Method (Double[])
 Sort the input parameter order based on a numeric key array.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SortOutput(
	double[] keys
)
Public Sub SortOutput (
	keys As Double()
)
Parameters
keys
Type: System.Double[]
Array of double precision numbers to function as sorting keys.
See Also
Reference
GH_ComponentParamServer Class
SortOutput Overload
Grasshopper.Kernel Namespace