Grasshopper SDK
DataTree<T>.RemovePath Method (Int32[])
 Removes a path and all associated data from the structure. If the path doesn't exist, nothing will happen.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RemovePath(
	params int[] path
)
Public Sub RemovePath (
	ParamArray path As Integer()
)
Parameters
path
Type: System.Int32[]
Path to remove.
See Also
Reference
DataTree<T> Class
RemovePath Overload
Grasshopper Namespace