Grasshopper SDK
GH_IndexRange Constructor (Int32, Int32)
 Create a new range.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_IndexRange(
	int index0,
	int index1
)
Public Sub New (
	index0 As Integer,
	index1 As Integer
)
Parameters
index0
Type: System.Int32
First index in range.
index1
Type: System.Int32
Last index in range.
See Also
Reference
GH_IndexRange Structure
GH_IndexRange Overload
Grasshopper.Kernel.Data Namespace