Grasshopper SDK
GH_DigitScroller.Value Property
 Gets or sets the value of this scroller.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Value { get; set; }
Public Property Value As Decimal
	Get
	Set
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DigitScroller.Value"]
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace