Grasshopper SDK
GH_GeometricGoo<T> Constructor
 Blank constructor, m_value will be set to default (null for reference types, zeroes for value types)
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_GeometricGoo()
Protected Sub New
See Also
Reference
GH_GeometricGoo<T> Class
GH_GeometricGoo<T> Overload
Grasshopper.Kernel.Types Namespace