Grasshopper SDK
Complex.Infinity Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Complex Infinity { get; }
Public Shared ReadOnly Property Infinity As Complex
	Get
Property Value
Type: Complex
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Complex.Infinity"]
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace