Grasshopper SDK
GH_ColourPicker Constructor
Initializes a new instance of the GH_ColourPicker class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ColourPicker()
Public Sub New
See Also
Reference
GH_ColourPicker Class
Grasshopper.GUI Namespace