Grasshopper SDK
GH_MatchLevel Enumeration
 All possible string matching schemes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[FlagsAttribute]
public enum GH_MatchLevel
<FlagsAttribute>
Public Enumeration GH_MatchLevel
Members
Member name | Value | Description
None | 0 |  No match is performed.
Exact | 1 |  String must match the key exactly.
Start | 2 |  String must start with the key.
WordExact | 4 |  String must contain word that is an exact match with the key.
WordStart | 8 |  String must contain a word that starts with the key.
Contains | 16 |  String must contain the key.
Fuzzy | 32 |  String must contain word that is somewhat similar to the key.
AllClean | 31 |  Represents all match types except fuzzy matching.
All | 63 |  Represents all match types.
See Also
Reference
Grasshopper.Kernel Namespace