Grasshopper SDK
GH_TextBoxInputBase.HideTextInputBox Method
 Hides the text-input override form (if it is displayed).
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void HideTextInputBox()
Public Sub HideTextInputBox
See Also
Reference
GH_TextBoxInputBase Class
Grasshopper.GUI.Base Namespace