Grasshopper SDK
GH_Param<T>.OnVolatileDataCollected Method
 Once volatile data has been collected this method will be calles. The basic implementation does nothing, but you can add code here to post-process or analyze the volatile data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void OnVolatileDataCollected()
Protected Overridable Sub OnVolatileDataCollected
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace