Grasshopper SDK
GH_SpinForce.BoundingBox Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override BoundingBox BoundingBox { get; }
Public Overrides ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_SpinForce.BoundingBox"]
See Also
Reference
GH_SpinForce Class
Grasshopper.Kernel.Types Namespace