Grasshopper SDK
GH_Curve.GH_CurveProxy Constructor
Initializes a new instance of the GH_Curve.GH_CurveProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CurveProxy(
	GH_Curve owner
)
Public Sub New (
	owner As GH_Curve
)
Parameters
owner
Type: Grasshopper.Kernel.Types.GH_Curve
See Also
Reference
GH_Curve.GH_CurveProxy Class
Grasshopper.Kernel.Types Namespace