Grasshopper SDK
GH_Arc Class
 Represents a 3D circular arc. GH_Arc re-implements the OpenNURBS OnArc class.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Arc>
 Grasshopper.Kernel.Types.GH_GeometricGoo<Arc>
 Grasshopper.Kernel.Types.GH_Arc
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Arc : GH_GeometricGoo<Arc>,
	IGH_BakeAwareData, IGH_PreviewData
Public Class GH_Arc
	Inherits GH_GeometricGoo(Of Arc)
	Implements IGH_BakeAwareData, IGH_PreviewData
The GH_Arc type exposes the following members.
Constructors
Name | Description
GH_Arc()
 Default constructor
GH_Arc(Arc)
 Create a duplicate of another arc
GH_Arc(GH_Arc)
 Create a duplicate of another arc
Top
Properties
Name | Description
Boundingbox
 Gets the boundingbox for this geometry.
 (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsValid
 Gets the validity of this instance.
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
BakeGeometry
CastFrom |  (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateArc
 Create a duplicate of this arc.
DuplicateGeometry
 Create a duplicate of this arc.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
EmitProxy
 Returns a proxy that represents this arc. Do not call this function unless you're
 (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace