Grasshopper SDK
GH_Mesh.GH_MeshProxy.Construct Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void Construct()
Public Overrides Sub Construct
See Also
Reference
GH_Mesh.GH_MeshProxy Class
Grasshopper.Kernel.Types Namespace