Grasshopper SDK
GH_PersistentParam<T>.AppendAdditionalMenuItems Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void AppendAdditionalMenuItems(
	ToolStripDropDown menu
)
Public Overrides Sub AppendAdditionalMenuItems (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace