Grasshopper SDK
GH_PersistentParam<T> Class
 Implementation of GH_Param(Of T) that supports persistent data.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<T>
 Grasshopper.Kernel.GH_PersistentParam<T>
 Grasshopper.Kernel.GH_PersistentGeometryParam<T>
 Grasshopper.Kernel.Parameters.Param_MeshParameters
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_PersistentParam<T> : GH_Param<T>
where T : class, IGH_Goo
Public MustInherit Class GH_PersistentParam(Of T As {Class, IGH_Goo})
	Inherits GH_Param(Of T)
Type Parameters
T
Data type for this parameter.
The GH_PersistentParam<T> type exposes the following members.
Constructors
Name | Description
GH_PersistentParam<T>(GH_InstanceDescription)
Initializes a new instance of the GH_PersistentParam<T> class
GH_PersistentParam<T>(GH_InstanceDescription, Boolean) |  Obsolete.
Initializes a new instance of the GH_PersistentParam<T> class
GH_PersistentParam<T>(String, String, String, String, String)
Initializes a new instance of the GH_PersistentParam<T> class
Top
Properties
Name | Description
DataType
 Gets the type of data stored in this parameter.
 (Overrides GH_Param<T>.DataType.)
PersistentData
 Gets the persistent data stored in this parameter. If you modify the persistent data, be sure to call the: OnObjectChanged(GH_ObjectEventType.PersistentData) event.
PersistentDataCount
 Gets the number of persistent data items stored in this parameter.
Top
Methods
Name | Description
AddPersistentData(Object) |  Obsolete.
 Utility function to add a new persistent data item. If the data is null or cannot be converted into T, this method will fail. You should probably use the PersistentData property to add type-safe data if you can.
AddPersistentData(T) |  Obsolete.
 Utility function to add a new persistent data item. If the data is null or cannot be converted into T, this method will fail. You should probably use the PersistentData property to add type-safe data if you can.
AppendAdditionalMenuItems |  (Overrides GH_Param<T>.AppendAdditionalMenuItems(ToolStripDropDown).)
CollectVolatileData_Custom |  (Overrides GH_Param<T>.CollectVolatileData_Custom().)
Menu_AppendDestroyPersistent
Menu_AppendExtractParameter
Menu_AppendInternaliseData
Menu_AppendManageCollection
Menu_AppendPromptMore
Menu_AppendPromptOne
Menu_CreateMultilineTextEditItem
 This function returns a ToolstripMenuItem that embeds a multi-line textbox for editing persistent data. Only call this method if you know that your parameter type supports proxies.
Menu_CustomMultiValueItem
Menu_CustomSingleValueItem
PrepareForPrompt
Prompt_ManageCollection
Prompt_Plural
Prompt_Singular
Read |  (Overrides GH_Param<T>.Read(GH_IReader).)
RecordPersistentDataEvent
 Add an undo record that stores changes to persistent data.
RecoverFromPrompt
Script_AddPersistentData
 Method used primarily for COM_Access code.
Script_ClearPersistentData
 Method used primarily for COM_Access code.
SetPersistentData(IEnumerable<T>)
 Assign a list of items to the persistent data. This method will erase any existing data, record an undo event, raise the OnObjectChanged event for PersistentData flags and place a call to ExpireSolution(False). If you want to add a tree of data, you should use the appropriate overload for this method.
SetPersistentData(Object[])
 Add a collection of values to the persistent data.
SetPersistentData(T)
 Add a single item to the persistent data. This method will record an undo event, raise the OnObjectChanged event for PersistentData flags and place a call to ExpireSolution(False). If you want to add more than one piece of data, you should use the appropriate overload for this method.
SetPersistentData(GH_Structure<T>)
 Assign a tree of items to the persistent data. This method will erase any existing data, record an undo event, raise the OnObjectChanged event for PersistentData flags and place a call to ExpireSolution(False). If you want to add a tree of data, you should use the appropriate overload for this method.
Write |  (Overrides GH_Param<T>.Write(GH_IWriter).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel Namespace