Grasshopper SDK
GH_GraphicsUtil.ShadowVertical Method (Graphics, Single, Single, Single, Single, Boolean, Int32)
 Draws a vertical shadow edge.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void ShadowVertical(
	Graphics g,
	float x,
	float y0,
	float y1,
	float size = 10f,
	bool right = true,
	int darkness = 50
)
Public Shared Sub ShadowVertical (
	g As Graphics,
	x As Single,
	y0 As Single,
	y1 As Single,
	Optional size As Single = 10F,
	Optional right As Boolean = true,
	Optional darkness As Integer = 50
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
x
Type: System.Single
Offset of shadow edge.
y0
Type: System.Single
Start of shadow edge.
y1
Type: System.Single
End of shadow edge.
size (Optional)
Type: System.Single
Length of cast shadow.
right (Optional)
Type: System.Boolean
If true, shadow is drawn to the right of the elevated line.
darkness (Optional)
Type: System.Int32
Alpha component of darkness directly underneath the edge.
See Also
Reference
GH_GraphicsUtil Class
ShadowVertical Overload
Grasshopper.GUI Namespace