Grasshopper SDK
GH_DigitScroller.MaximumValue Property
 Gets or sets the upper bound of the scroll value.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal MaximumValue { get; set; }
Public Property MaximumValue As Decimal
	Get
	Set
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DigitScroller.MaximumValue"]
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace