Grasshopper SDK
GH_Param<T>.VolatileDataDescription Method
 This method is called to populate the Tooltip data description field.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual string VolatileDataDescription()
Protected Overridable Function VolatileDataDescription As String
Return Value
Type: String
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace