Grasshopper SDK
GH_DigitScrollerBase Fields
The GH_DigitScrollerBase type exposes the following members.
Fields
Name | Description
DigitBoxWidth
SymbolBoxWidth
Top
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace