Grasshopper SDK
GH_Rectangle Constructor
 Default constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Rectangle()
Public Sub New
See Also
Reference
GH_Rectangle Class
GH_Rectangle Overload
Grasshopper.Kernel.Types Namespace