Grasshopper SDK
GH_TagArtist_WirePainter.Paint Method
Namespace: Grasshopper.GUI.Canvas.TagArtists
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void Paint(
	GH_Canvas canvas,
	GH_CanvasChannel channel
)
Public Overrides Sub Paint (
	canvas As GH_Canvas,
	channel As GH_CanvasChannel
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
channel
Type: Grasshopper.GUI.Canvas.GH_CanvasChannel
See Also
Reference
GH_TagArtist_WirePainter Class
Grasshopper.GUI.Canvas.TagArtists Namespace