Grasshopper SDK
GH_MemoryBitmap.Filter_Tint Method
 Colorize the image using Hue and Saturation from a base colour.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_Tint(
	Color tint,
	double lum_factor,
	double sat_factor
)
Public Sub Filter_Tint (
	tint As Color,
	lum_factor As Double,
	sat_factor As Double
)
Parameters
tint
Type: System.Drawing.Color
Colour of colorize operation.
lum_factor
Type: System.Double
Luminance blend factor. 0.0 equals no luminance adjustment, 1.0 equals complete luminance adjustment.
sat_factor
Type: System.Double
Saturation blend factor. 0.0 equals no saturation adjustment, 1.0 equals complete saturation adjustment.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace