Grasshopper SDK
IGH_GeometricGoo.GetBoundingBox Method
 Compute an aligned boundingbox.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
BoundingBox GetBoundingBox(
	Transform xform
)
Function GetBoundingBox (
	xform As Transform
) As BoundingBox
Parameters
xform
Type: Transform
Transformation to apply to geometry for BoundingBox computation.
Return Value
Type: BoundingBox
The world aligned boundingbox of the transformed geometry.
See Also
Reference
IGH_GeometricGoo Interface
Grasshopper.Kernel.Types Namespace