Grasshopper SDK
GH_Skin.canvas_mono_color Field
 If canvas_mono is set to true, this colour specified the solid background fill for the canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color canvas_mono_color
Public Shared canvas_mono_color As Color
Field Value
Type: Color
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace