Grasshopper SDK
GH_ScriptVariant.Object Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Object Object { get; }
Public ReadOnly Property Object As Object
	Get
Property Value
Type: Object
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ScriptVariant.Object"]
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace