Grasshopper SDK
GH_Capsule.Dispose Method (Boolean)
Releases the unmanaged resources used by the GH_Capsule and optionally releases the managed resources
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
GH_Capsule Class
Dispose Overload
Grasshopper.GUI.Canvas Namespace