Grasshopper SDK
GH_FieldElement Constructor
Initializes a new instance of the GH_FieldElement class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_FieldElement()
Protected Sub New
See Also
Reference
GH_FieldElement Class
Grasshopper.Kernel.Types Namespace