Grasshopper SDK
GH_SliderBase.TickCount Property
 Gets or sets the number of ticks displayed.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int TickCount { get; set; }
Public Property TickCount As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.TickCount"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace