Grasshopper SDK
GH_PathOffset.ItemWrap Property
 Gets or sets the ItemWrap flag.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ItemWrap { get; set; }
Public Property ItemWrap As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_PathOffset.ItemWrap"]
See Also
Reference
GH_PathOffset Class
Grasshopper.Kernel.Data Namespace