Grasshopper SDK
GH_Point.ReferenceCurve Method (RhinoObject)
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Curve ReferenceCurve(
	RhinoObject ref
)
Public Function ReferenceCurve (
	ref As RhinoObject
) As Curve
Parameters
ref
Type: RhinoObject
Return Value
Type: Curve
See Also
Reference
GH_Point Class
ReferenceCurve Overload
Grasshopper.Kernel.Types Namespace