Grasshopper SDK
GH_Point.ReferenceParam Method (Int32)
 Retrieve the indexed param of the point reference data.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double ReferenceParam(
	int index
)
Public Function ReferenceParam (
	index As Integer
) As Double
Parameters
index
Type: System.Int32
Index of parameter. Only 0 and 1 are valid values.
Return Value
Type: Double
The indexed param of the reference data.
Remarks
If there exists no reference data, NaN is returned.
See Also
Reference
GH_Point Class
ReferenceParam Overload
Grasshopper.Kernel.Types Namespace