Grasshopper SDK
GH_SolutionEventArgs Class
 Event arguments used for Document Solution events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_SolutionEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_SolutionEventArgs : EventArgs
Public Class GH_SolutionEventArgs
	Inherits EventArgs
The GH_SolutionEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document that raised the event, should be the same as the "sender" parameter in the event handler.
Duration
 Gets the duration for this solution. The duration is a more accurate measure than EndTime-StartTime.
EndTime |  Obsolete.
 Gets the time when the current solution completed. If the solution hasn't completed yet this field will be DateTime.MinValue.
StartTime
 Gets the time when the current solution began.
Top
See Also
Reference
Grasshopper.Kernel Namespace