Grasshopper SDK
GH_Lexer.EvaluatePath Method
 Evaluate the variables in this mask with the provided expression solver.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool EvaluatePath(
	GH_ExpressionParser evaluator,
	ref GH_Path path,
	ref int index
)
Public Function EvaluatePath (
	evaluator As GH_ExpressionParser,
	ByRef path As GH_Path,
	ByRef index As Integer
) As Boolean
Parameters
evaluator
Type: Grasshopper.Kernel.Expressions.GH_ExpressionParser
Evaluator to use. Must have all variables properly set up.
path
Type: Grasshopper.Kernel.Data.GH_Path
Path result.
index
Type: System.Int32
Index result. If the lexer contains no item representation then the index remains unmolested.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Lexer Class
Grasshopper.Kernel.Data Namespace