Grasshopper SDK
Rotation.RotationAngle Property
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double RotationAngle { get; set; }
Public Property RotationAngle As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Transforms.Rotation.RotationAngle"]
See Also
Reference
Rotation Class
Grasshopper.Kernel.Types.Transforms Namespace