Grasshopper SDK
GH_Param<T>.Type Property
 Gets the Framework Type descriptor for the stored Data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual Type Type { get; }
Public Overridable ReadOnly Property Type As Type
	Get
Property Value
Type: Type
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.Type"]
Implements
IGH_Param.Type
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace