Grasshopper SDK
GH_Line.DuplicateLine Method
 Create a duplicate of this line.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Line DuplicateLine()
Public Function DuplicateLine As GH_Line
Return Value
Type: GH_Line
See Also
Reference
GH_Line Class
Grasshopper.Kernel.Types Namespace