Grasshopper SDK
GH_DocumentObject.Menu_AppendItem Method (ToolStrip, String, EventHandler, Image, Object)
 Utility function for appending generic menu items.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static ToolStripMenuItem Menu_AppendItem(
	ToolStrip menu,
	string text,
	EventHandler click,
	Image icon,
	Object tag
)
Public Shared Function Menu_AppendItem (
	menu As ToolStrip,
	text As String,
	click As EventHandler,
	icon As Image,
	tag As Object
) As ToolStripMenuItem
Parameters
menu
Type: System.Windows.Forms.ToolStrip
Menu to append item to.
text
Type: System.String
Item text.
click
Type: System.EventHandler
Delegate that handles click events. If nothing, the click event will not be handled.
icon
Type: System.Drawing.Image
Item icon, or null for no icon.
tag
Type: System.Object
Tag to assign to menu item.
Return Value
Type: ToolStripMenuItem
The appended item
See Also
Reference
GH_DocumentObject Class
Menu_AppendItem Overload
Grasshopper.Kernel Namespace