Grasshopper SDK
GH_ResizeBorder.Setup Method (IGH_Attributes, PointF, SizeF, SizeF)
 Set up a new sizing operation.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Setup(
	IGH_Attributes att,
	PointF MouseCursor,
	SizeF MinSize,
	SizeF MaxSize
)
Public Sub Setup (
	att As IGH_Attributes,
	MouseCursor As PointF,
	MinSize As SizeF,
	MaxSize As SizeF
)
Parameters
att
Type: Grasshopper.Kernel.IGH_Attributes
Attributes of shape to resize.
MouseCursor
Type: System.Drawing.PointF
Location of cursor in shape space coordinates.
MinSize
Type: System.Drawing.SizeF
Minimum allowed size for shape.
MaxSize
Type: System.Drawing.SizeF
Maximum allowed size for shape.
See Also
Reference
GH_ResizeBorder Class
Setup Overload
Grasshopper.GUI.Canvas Namespace