Grasshopper SDK
GH_ScriptVariant.String Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string String { get; }
Public ReadOnly Property String As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ScriptVariant.String"]
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace