Grasshopper SDK
IGH_SettingCategory.Parent Property
 Gets the name of the parent category. If the category is supposed to be top-level, this property will return null or a String.Empty.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Parent { get; }
ReadOnly Property Parent As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_SettingCategory.Parent"]
See Also
Reference
IGH_SettingCategory Interface
Grasshopper.GUI Namespace