Grasshopper SDK
GH_DebugDescriptionWriter.Depth Property
 Gets the depth of the current writer. Depth is represented by whitespace in front of each line.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Depth { get; }
Public ReadOnly Property Depth As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DebugDescriptionWriter.Depth"]
See Also
Reference
GH_DebugDescriptionWriter Class
Grasshopper.Kernel Namespace