Grasshopper SDK
GH_MaterialPreviewControl.ColourChanged Event
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_MaterialPreviewControl.ColourChangedEventHandler ColourChanged
Public Event ColourChanged As GH_MaterialPreviewControl.ColourChangedEventHandler
Value
Type: Grasshopper.GUI.GH_MaterialPreviewControl.ColourChangedEventHandler
See Also
Reference
GH_MaterialPreviewControl Class
Grasshopper.GUI Namespace