Grasshopper SDK
GH_Component.GenerateDefaultHTML Method
 Creates the default component help topic, including all parameter lists.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_HtmlFormatter GenerateDefaultHTML()
Protected Function GenerateDefaultHTML As GH_HtmlFormatter
Return Value
Type: GH_HtmlFormatter
Remarks
This formatter does not include the this-is-an-autogenerated-topic message
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace