Grasshopper SDK
GH_AssemblyInfo.LoadingMechanism Property
 Gets the mechanism used to load this assembly.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LoadingMechanism LoadingMechanism { get; }
Public ReadOnly Property LoadingMechanism As GH_LoadingMechanism
	Get
Property Value
Type: GH_LoadingMechanism
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.LoadingMechanism"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace