Grasshopper SDK
GH_Document.GH_UndoUtil.CreatePreviewEvent Method
 Create a new undo record for an object preview change. This function must be called before the preview is changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoRecord CreatePreviewEvent(
	string name,
	IGH_ActiveObject obj
)
Public Function CreatePreviewEvent (
	name As String,
	obj As IGH_ActiveObject
) As GH_UndoRecord
Parameters
name
Type: System.String
Name of undo record.
obj
Type: Grasshopper.Kernel.IGH_ActiveObject
Target object for undo record.
Return Value
Type: GH_UndoRecord
A newly created undo record.
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace