Grasshopper SDK
GH_Viewport.Zoom Property (Boolean)
 Sets the zoom of the viewport with a view anchor.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float this[
	bool adjustTarget
] { set; }
Public WriteOnly Property Zoom (
	adjustTarget As Boolean
) As Single
	Set
Parameters
adjustTarget
Type: System.Boolean
If true, the target will be adjusted so that the center point remains the same.
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.Zoom(System.Boolean)"]
See Also
Reference
GH_Viewport Class
Zoom Overload
Grasshopper.GUI.Canvas Namespace