Grasshopper SDK
GH_TextBoxInputBase.IsTextInput Property
 Gets whether the text input box is currently on screen.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsTextInput { get; }
Public ReadOnly Property IsTextInput As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_TextBoxInputBase.IsTextInput"]
See Also
Reference
GH_TextBoxInputBase Class
Grasshopper.GUI.Base Namespace