Grasshopper SDK
GH_PersistentParam<T>.AddPersistentData Method (T)
Note: This API is now obsolete.
 Utility function to add a new persistent data item. If the data is null or cannot be converted into T, this method will fail. You should probably use the PersistentData property to add type-safe data if you can.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("This method has been superceded by SetPersistenData overloads")]
public bool AddPersistentData(
	T data
)
<ObsoleteAttribute("This method has been superceded by SetPersistenData overloads")>
Public Function AddPersistentData (
	data As T
) As Boolean
Parameters
data
Type: T
Data to add.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_PersistentParam<T> Class
AddPersistentData Overload
Grasshopper.Kernel Namespace