Grasshopper SDK
GH_Canvas.CanvasPostPaintObjects Event
 Raised after object drawing completes.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPostPaintObjectsEventHandler CanvasPostPaintObjects
Public Event CanvasPostPaintObjects As GH_Canvas.CanvasPostPaintObjectsEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPostPaintObjectsEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace