Grasshopper SDK
GH_MemoryBitmap.ShrinkBitmap Method
 Shrink an image by removing all outer columns and rows that contain only fully transparent pixels.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Bitmap ShrinkBitmap(
	Bitmap image
)
Public Shared Function ShrinkBitmap (
	image As Bitmap
) As Bitmap
Parameters
image
Type: System.Drawing.Bitmap
Image to shrink.
Return Value
Type: Bitmap
Shrunk bitmap.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace