Grasshopper SDK
GH_Boolean Class
 Represents a boolean value. GH_Boolean re-implements the framework System.Boolean type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Boolean>
 Grasshopper.Kernel.Types.GH_Boolean
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Boolean : GH_Goo<bool>
Public Class GH_Boolean
	Inherits GH_Goo(Of Boolean)
The GH_Boolean type exposes the following members.
Constructors
Name | Description
GH_Boolean()
 Blank constructor
GH_Boolean(Boolean)
Initializes a new instance of the GH_Boolean class
GH_Boolean(GH_Boolean)
Initializes a new instance of the GH_Boolean class
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance. Booleans are always valid.
 (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateBoolean
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace