Grasshopper SDK
GH_Border Constructor
 Create a new border.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Border(
	RectangleF rectangle,
	GH_BorderTopology topology
)
Public Sub New (
	rectangle As RectangleF,
	topology As GH_BorderTopology
)
Parameters
rectangle
Type: System.Drawing.RectangleF
Shape of border.
topology
Type: Grasshopper.GUI.Canvas.GH_BorderTopology
Border topology.
See Also
Reference
GH_Border Class
Grasshopper.GUI.Canvas Namespace