Grasshopper SDK
GH_Document.OnObjectsAdded Method
 Raise the ObjectsAdded event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnObjectsAdded(
	IEnumerable<IGH_DocumentObject> doc_objects
)
Public Sub OnObjectsAdded (
	doc_objects As IEnumerable(Of IGH_DocumentObject)
)
Parameters
doc_objects
Type: System.Collections.Generic.IEnumerable<IGH_DocumentObject>
Objects that were added.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace