Grasshopper SDK
GH_FontPicker.SelectedFont Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Font SelectedFont { get; set; }
Public Property SelectedFont As Font
	Get
	Set
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FontPicker.SelectedFont"]
See Also
Reference
GH_FontPicker Class
Grasshopper.GUI Namespace