Grasshopper SDK
GH_PersistentParam<T>.Prompt_ManageCollection Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual bool Prompt_ManageCollection(
	GH_Structure<T> values
)
Protected Overridable Function Prompt_ManageCollection (
	values As GH_Structure(Of T)
) As Boolean
Parameters
values
Type: Grasshopper.Kernel.Data.GH_Structure<T>
Return Value
Type: Boolean
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace