Grasshopper SDK
GH_Document.ConvertNickNamesToFullNames Method
 Convert all nicknames to full names, if they are equal to the default nickname. There will be no undo record associated with this operation.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ConvertNickNamesToFullNames()
Public Sub ConvertNickNamesToFullNames
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace