Grasshopper SDK
GH_Animator.DecimalAnimator Method (Decimal, Decimal)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<decimal> DecimalAnimator(
	decimal A,
	decimal B
)
Public Shared Function DecimalAnimator (
	A As Decimal,
	B As Decimal
) As GH_Animator(Of Decimal)
Parameters
A
Type: System.Decimal
B
Type: System.Decimal
Return Value
Type: GH_Animator<Decimal>
See Also
Reference
GH_Animator Class
DecimalAnimator Overload
Grasshopper.GUI Namespace