Grasshopper SDK
GH_State.LastModified Property
 Gets the date at which this state was last modified.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime LastModified { get; }
Public ReadOnly Property LastModified As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_State.LastModified"]
See Also
Reference
GH_State Class
Grasshopper.Kernel Namespace