Grasshopper SDK
IGH_Goo.TypeDescription Property
 Gets a description of the type of the implementation.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string TypeDescription { get; }
ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_Goo.TypeDescription"]
See Also
Reference
IGH_Goo Interface
Grasshopper.Kernel.Types Namespace