Grasshopper SDK
GH_Author.Website Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Website { get; set; }
Public Property Website As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Author.Website"]
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace