Grasshopper SDK
GH_SliderBase.GripWidth Property
 Gets an estimate of the maximum number of pixels taken up by the grip. This property depends on many different factors, though should remain constant when other properties are not changed. If the Font hasn't been specified, the default Windows.Forms.Control font is used.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int GripWidth { get; }
Public ReadOnly Property GripWidth As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.GripWidth"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace