Grasshopper SDK
GH_RuleKind Enumeration
 Represents all possible element types in a Path Pattern.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_RuleKind
Public Enumeration GH_RuleKind
Members
Member name | Value | Description
None | 0 |  Represents an invalid, default value.
AnyNumber | 1 |  Any single number
AnyNumbers | 2 |  Any (or no) collection of numbers
Number | 3 |  Single number
Group | 4 |  A collection of non-related integers.
Range | 5 |  A range of digits delimited by two extremes.
Sequence | 6 |  A collection of increasing non-related integers which repeat either indefinitely or up to a limit
Complex | 7 |  Represents a complex of multiple pattern types.
See Also
Reference
Grasshopper.Kernel.Data Namespace