Grasshopper SDK
GH_Colour Constructor
 Blank constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Colour()
Public Sub New
See Also
Reference
GH_Colour Class
GH_Colour Overload
Grasshopper.Kernel.Types Namespace