Grasshopper SDK
GH_DigitScrollerBase.Font Property
 Gets or sets the Font for this scroller.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override Font Font { get; set; }
Public Overrides Property Font As Font
	Get
	Set
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.Font"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace