Grasshopper SDK
GH_Tooltip.Show Method
 Display the tooltip on screen.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void Show(
	Control owner
)
Public Shared Sub Show (
	owner As Control
)
Parameters
owner
Type: System.Windows.Forms.Control
See Also
Reference
GH_Tooltip Class
Grasshopper.GUI Namespace