Grasshopper SDK
GH_LexerCombo.Target Property
 Gets or sets the lexer object that represents the target of a lexical operation.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Lexer Target { get; set; }
Public Property Target As GH_Lexer
	Get
	Set
Property Value
Type: GH_Lexer
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_LexerCombo.Target"]
See Also
Reference
GH_LexerCombo Class
Grasshopper.Kernel.Data Namespace