Grasshopper SDK
GH_SliderBase.Value Property
 Gets or sets the value of the slider.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Value { get; set; }
Public Property Value As Decimal
	Get
	Set
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.Value"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace