Grasshopper SDK
GH_Goo<T>.CastFrom Method
 Attempt a cast from generic data.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool CastFrom(
	Object source
)
Public Overridable Function CastFrom (
	source As Object
) As Boolean
Parameters
source
Type: System.Object
Reference to data that should be cast.
Return Value
Type: Boolean
True on success, false on failure.
Implements
IGH_Goo.CastFrom(Object)
Remarks
If False, the contents of this instance are not to be trusted.
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace