Grasshopper SDK
IGH_ZuiAction Interface
 Represents a single action which is only visible on screen above a certain zoom level.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_ZuiAction : IGH_TooltipAwareObject
Public Interface IGH_ZuiAction
	Inherits IGH_TooltipAwareObject
The IGH_ZuiAction type exposes the following members.
Properties
Name | Description
Name
 Gets the display name for this action. Keep it short and sweet.
Top
Methods
Name | Description
Perform
 This method will be called when the action needs to be performed.
Top
See Also
Reference
Grasshopper.Kernel Namespace