Grasshopper SDK
GH_MemoryBitmap.HasAlphaChannel Property
 Gets a value indicating whether or not the local image has an alpha channel defined.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool HasAlphaChannel { get; }
Public ReadOnly Property HasAlphaChannel As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_MemoryBitmap.HasAlphaChannel"]
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace