Grasshopper SDK
GH_ComponentServer.AliasTargets Method
 Get all the target Component IDs for a given alias.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Guid> AliasTargets(
	string alias
)
Public Function AliasTargets (
	alias As String
) As List(Of Guid)
Parameters
alias
Type: System.String
Alias to search for.
Return Value
Type: List<Guid>
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace