Grasshopper SDK
GH_PreviewUtil.Clear Method
 Clear all temporary geometry.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace