Grasshopper SDK
IGH_Structure.DataCount Property
 Gets the total number of data items stored in all paths.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int DataCount { get; }
ReadOnly Property DataCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.IGH_Structure.DataCount"]
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace