Grasshopper SDK
GH_ComponentParamServer.Clear Method (Boolean)
 Removes all input and output parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Clear(
	bool isolate
)
Public Sub Clear (
	isolate As Boolean
)
Parameters
isolate
Type: System.Boolean
If true, parameters that are removed will be isolated from sources and recipients.
See Also
Reference
GH_ComponentParamServer Class
Clear Overload
Grasshopper.Kernel Namespace