Grasshopper SDK
GH_Brep.GH_BrepProxy.Manifold Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Manifold { get; }
Public ReadOnly Property Manifold As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Brep.GH_BrepProxy.Manifold"]
See Also
Reference
GH_Brep.GH_BrepProxy Class
Grasshopper.Kernel.Types Namespace