Grasshopper SDK
Instances.IsCursorServer Property
 Gets whether the Cursor server has been set.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsCursorServer { get; }
Public Shared ReadOnly Property IsCursorServer As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Instances.IsCursorServer"]
See Also
Reference
Instances Class
Grasshopper Namespace