Grasshopper SDK
GH_Guid Class
 Represents a globally unique identifier. GH_Guid re-implements the framework System.Guid type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Guid>
 Grasshopper.Kernel.Types.GH_Guid
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Guid : GH_Goo<Guid>
Public Class GH_Guid
	Inherits GH_Goo(Of Guid)
The GH_Guid type exposes the following members.
Constructors
Name | Description
GH_Guid()
 Blank constructor
GH_Guid(Guid)
Initializes a new instance of the GH_Guid class
GH_Guid(GH_Guid)
Initializes a new instance of the GH_Guid class
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance. Guids are always valid.
 (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateGuid
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace