Grasshopper SDK
GH_DigitNumber.Radix Property
 Gets or sets the radix point index. A negative radix index disables the radix point, zero is not a valid index.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Radix { get; set; }
Public Property Radix As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitNumber.Radix"]
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace