Grasshopper SDK
GH_Capsule.Render Method (Graphics, GH_PaletteStyle)
 Have this capsule draw itself onto a Graphics surface with a custom Style override.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Render(
	Graphics G,
	GH_PaletteStyle style
)
Public Sub Render (
	G As Graphics,
	style As GH_PaletteStyle
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with. Zoom factor is implied by the G.Transform property.
style
Type: Grasshopper.GUI.Canvas.GH_PaletteStyle
Style to draw capsule with.
See Also
Reference
GH_Capsule Class
Render Overload
Grasshopper.GUI.Canvas Namespace