Grasshopper SDK
GH_RuntimeMessage.Source Property
 Gets a string describing the source object that created the message.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Source { get; }
Public ReadOnly Property Source As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RuntimeMessage.Source"]
See Also
Reference
GH_RuntimeMessage Class
Grasshopper.Kernel Namespace