Grasshopper SDK
CentralSettings.PreviewMeshEdges Property
 Gets or sets the Mesh Wire display flag.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool PreviewMeshEdges { get; set; }
Public Shared Property PreviewMeshEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.PreviewMeshEdges"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace