Grasshopper SDK
GH_NamedView.SmoothFrameEventHandler Delegate
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void SmoothFrameEventHandler(
	GH_NamedView sender,
	GH_Canvas canvas
)
Public Delegate Sub SmoothFrameEventHandler (
	sender As GH_NamedView,
	canvas As GH_Canvas
)
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_NamedView
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
See Also
Reference
Grasshopper.GUI.Canvas Namespace