Grasshopper SDK
GH_StructurePath Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<GH_Path>
 Grasshopper.Kernel.Types.GH_StructurePath
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_StructurePath : GH_Goo<GH_Path>
Public Class GH_StructurePath
	Inherits GH_Goo(Of GH_Path)
The GH_StructurePath type exposes the following members.
Constructors
Name | Description
GH_StructurePath()
 Blank constructor
GH_StructurePath(GH_Path)
Initializes a new instance of the GH_StructurePath class
GH_StructurePath(GH_StructurePath)
Initializes a new instance of the GH_StructurePath class
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance. Integers are always valid
 (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_Goo<T>.Value.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicatePath
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace