Grasshopper SDK
GH_Viewport.ProjectX Method
 Project a value along constant X from canvas coordinates into control coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float ProjectX(
	float x
)
Public Function ProjectX (
	x As Single
) As Single
Parameters
x
Type: System.Single
The constant X value in canvas coordinates.
Return Value
Type: Single
The associated X value in control pixel coordinates.
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace