Grasshopper SDK
GH_Brep.GetBoundingBox Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override BoundingBox GetBoundingBox(
	Transform xform
)
Public Overrides Function GetBoundingBox (
	xform As Transform
) As BoundingBox
Parameters
xform
Type: Transform
Return Value
Type: BoundingBox
See Also
Reference
GH_Brep Class
Grasshopper.Kernel.Types Namespace