Grasshopper SDK
GH_ColourPicker.SliceRectangle Property
 Gets the rectangle that outlines the colour cube slice.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle SliceRectangle { get; }
Public ReadOnly Property SliceRectangle As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.GH_ColourPicker.SliceRectangle"]
See Also
Reference
GH_ColourPicker Class
Grasshopper.GUI Namespace