Grasshopper SDK
GH_DigitScrollerBase.OnInvalidated Method
 Raise the Invalidated event.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnInvalidated()
Public Sub OnInvalidated
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace