Grasshopper SDK
Folders.CustomAssemblyFolders Property
 Gets or sets all custom assembly folders.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<string> CustomAssemblyFolders { get; set; }
Public Shared Property CustomAssemblyFolders As List(Of String)
	Get
	Set
Property Value
Type: List<String>
[Missing <value> documentation for "P:Grasshopper.Folders.CustomAssemblyFolders"]
See Also
Reference
Folders Class
Grasshopper Namespace