Grasshopper SDK
CentralSettings.AuthorEMailChangedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void AuthorEMailChangedEventHandler()
Public Delegate Sub AuthorEMailChangedEventHandler
See Also
Reference
Grasshopper Namespace