Grasshopper SDK
GH_ResizeBorder Constructor (RectangleF, GH_BorderTopology)
 Create a new instance of the GH_ResizeBorder class.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ResizeBorder(
	RectangleF region,
	GH_BorderTopology topology
)
Public Sub New (
	region As RectangleF,
	topology As GH_BorderTopology
)
Parameters
region
Type: System.Drawing.RectangleF
Base rectangle for borders.
topology
Type: Grasshopper.GUI.Canvas.GH_BorderTopology
Border topology.
See Also
Reference
GH_ResizeBorder Class
GH_ResizeBorder Overload
Grasshopper.GUI.Canvas Namespace