Grasshopper SDK
GH_PreviewWireArgs.Viewport Property
 Gets the Viewport in which we're currently drawing.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewWireArgs.Viewport"]
See Also
Reference
GH_PreviewWireArgs Class
Grasshopper.Kernel Namespace