Grasshopper SDK
GH_AsynchFileData Class
 This class provides asynchronous methods to keep tabs on a file.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_AsynchFileData
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_AsynchFileData
Public Class GH_AsynchFileData
The GH_AsynchFileData type exposes the following members.
Constructors
Name | Description
GH_AsynchFileData(String, Boolean)
 Synchronous constructor.
GH_AsynchFileData(String, Boolean, GH_AsynchFileData.FileChangedDelegate)
 Asynchronous constructor. File properties will be loaded asychronously.
Top
Properties
Name | Description
CallbackDelegate
 Gets or sets the callback delegate to be used when properties are updated.
FileCreated
 Gets the date at which the file was created.
FileDataAge
 Gets the time from which the current file data stems.
FileExists
 Gets whether the file exists. Note that this property returns false if DataExists=False, regardless of whether the file exists.
FileLastChanged
 Gets the date at which the file was last changed.
FileSize
 Gets the size of the file.
FileThumbnail
 Gets the thumbnail bitmap associated with the file.
IsFileData
 Gets whether the data has been retrieved at least once.
ReadThumbnail
 Gets or sets whether the thumbnail ought to be parsed. At the moment this only makes sense for GH/GHX files.
Top
Methods
Name | Description
StartPeriodicUpdate()
 Starts periodic updating (from now), using typical periods depending on the physical location of the file. If you call this method you must call StopPeriodicUpdate() when done.
StartPeriodicUpdate(Int32)
 Starts periodic updating (from now).
StartPeriodicUpdate(TimeSpan)
 Starts periodic updating (from now).
StopPeriodicUpdate
 Stop any periodic updates.
UpdateProperties
 Updates all file properties on the thread on which this method is called.
UpdatePropertiesAsynch
 Updates all file properties on a low-priority background thread.
Top
Fields
Name | Description
LocalUpdatePeriod
 Specifies the recommended number of milliseconds in between periodic checks for files on the local system.
Location
 Gets the location this class is watching.
RemoteUpdatePeriod
 Specifies the recommended number of milliseconds in between periodic checks for files on network drives.
Top
See Also
Reference
Grasshopper.GUI Namespace