Grasshopper SDK
GH_State.Name Property
 Gets or sets the name of this state.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_State.Name"]
See Also
Reference
GH_State Class
Grasshopper.Kernel Namespace