Grasshopper SDK
GH_Format.FormatBrepValidity Method
 If the brep is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatBrepValidity(
	Brep val,
	string identifier = "Brep"
)
Public Shared Function FormatBrepValidity (
	val As Brep,
	Optional identifier As String = "Brep"
) As String
Parameters
val
Type: Brep
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the brep is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace