Grasshopper SDK
GH_DocumentIO.SaveBackup Method
 Save a time-stamped copy of the current file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool SaveBackup()
Public Function SaveBackup As Boolean
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace