Grasshopper SDK
Node3d<T>.AddToRhinoDocument Method
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddToRhinoDocument(
	RhinoDoc doc
)
Public Sub AddToRhinoDocument (
	doc As RhinoDoc
)
Parameters
doc
Type: RhinoDoc
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace