Grasshopper SDK
GH_IndexRange.Intersection Method
 Create the intersection between two ranges.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_IndexRange Intersection(
	GH_IndexRange range0,
	GH_IndexRange range1
)
Public Shared Function Intersection (
	range0 As GH_IndexRange,
	range1 As GH_IndexRange
) As GH_IndexRange
Parameters
range0
Type: Grasshopper.Kernel.Data.GH_IndexRange
First range to intersect.
range1
Type: Grasshopper.Kernel.Data.GH_IndexRange
Second range to intersect.
Return Value
Type: GH_IndexRange
The intersection or an invalid range if the input doesn't intersect.
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace