Grasshopper SDK
GH_Material.Duplicate Method
 Duplicate this material.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IGH_Goo Duplicate()
Public Overrides Function Duplicate As IGH_Goo
Return Value
Type: IGH_Goo
An exact duplicate of this material.
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace