Grasshopper SDK
GH_Attributes<T>.RespondToKeyDown Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual GH_ObjectResponse RespondToKeyDown(
	GH_Canvas sender,
	KeyEventArgs e
)
Public Overridable Function RespondToKeyDown (
	sender As GH_Canvas,
	e As KeyEventArgs
) As GH_ObjectResponse
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
e
Type: System.Windows.Forms.KeyEventArgs
Return Value
Type: GH_ObjectResponse
Implements
IGH_ResponsiveObject.RespondToKeyDown(GH_Canvas, KeyEventArgs)
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace