Grasshopper SDK
GH_Document.GH_UndoUtil.CreatePersistentDataEvent<T> Method
 Create a new undo record for a single object persistent data change.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoRecord CreatePersistentDataEvent<T>(
	string name,
	GH_PersistentParam<T> obj
)
where T : class, IGH_Goo
Public Function CreatePersistentDataEvent(Of T As {Class, IGH_Goo}) (
	name As String,
	obj As GH_PersistentParam(Of T)
) As GH_UndoRecord
Parameters
name
Type: System.String
Name of undo record.
obj
Type: Grasshopper.Kernel.GH_PersistentParam<T>
Object to be recorded.
Type Parameters
T
Return Value
Type: GH_UndoRecord
A newly created undo record.
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace