Grasshopper SDK
GH_Gradient.SelectedGrip Property
 Gets or sets the selected grip.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Grip SelectedGrip { get; set; }
Public Property SelectedGrip As GH_Grip
	Get
	Set
Property Value
Type: GH_Grip
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_Gradient.SelectedGrip"]
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace