Grasshopper SDK
GH_DocumentContext Enumeration
 Enumerates all possible (de)activation contexts for documents.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_DocumentContext
Public Enumeration GH_DocumentContext
Members
Member name | Value | Description
Unknown | 0 |  Specifies unknown context. This should never be used.
None | 1 |  Specifies unset state. This is only used for documents that have never been in a context.
Open | 2 |  Indicates the document was created anew from a file.
Close | 3 |  Indicates the document has been unloaded from memory.
Loaded | 4 |  Indicates the document has been loaded into the Canvas.
Unloaded | 5 |  Indicates the document has been unloaded from the Canvas.
Lock | 6 |  Indicates the document has been locked. This is only possible for nested documents.
Unlock | 7 |  Indicates the document has been unlocked. This is only possible for nested documents.
See Also
Reference
Grasshopper.Kernel Namespace