Grasshopper SDK
GH_MaterialPreviewControl.SelectedChangedEventHandler Delegate
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void SelectedChangedEventHandler(
	Object sender,
	EventArgs e
)
Public Delegate Sub SelectedChangedEventHandler (
	sender As Object,
	e As EventArgs
)
Parameters
sender
Type: System.Object
e
Type: System.EventArgs
See Also
Reference
Grasshopper.GUI Namespace