Grasshopper SDK
IGH_ValueProxy.IsParsable Property
 Gets a value indicating whether or not the type can be instantiated from a String
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsParsable { get; }
ReadOnly Property IsParsable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ValueProxy.IsParsable"]
See Also
Reference
IGH_ValueProxy Interface
Grasshopper.Kernel Namespace