Grasshopper SDK
GH_ColourCube.RenderSliceEdgeShadows Method
 Render the edge shadows of the slice due to GI.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderSliceEdgeShadows(
	Graphics G
)
Public Sub RenderSliceEdgeShadows (
	G As Graphics
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with.
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace