Grasshopper SDK
GH_PaletteSettings Class
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Theme.GH_PaletteSettings
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PaletteSettings
Public Class GH_PaletteSettings
The GH_PaletteSettings type exposes the following members.
Properties
Name | Description
ErrorSelected
 Gets or sets the palette style for selected Error palettes.
ErrorStandard
 Gets or sets the palette style for unselected Error palettes.
HiddenSelected
 Gets or sets the palette style for selected Hidden palettes.
HiddenStandard
 Gets or sets the palette style for unselected Hidden palettes.
LockedSelected
 Gets or sets the palette style for selected Locked palettes.
LockedStandard
 Gets or sets the palette style for unselected Locked palettes.
NormalSelected
 Gets or sets the palette style for selected Normal palettes.
NormalStandard
 Gets or sets the palette style for unselected Normal palettes.
WarningSelected
 Gets or sets the palette style for selected Warning palettes.
WarningStandard
 Gets or sets the palette style for unselected Warning palettes.
Top
See Also
Reference
Grasshopper.GUI.Theme Namespace