Grasshopper SDK
GH_TagArtist_WirePainter Class
 IGH_TagArtist implementation for drawing individual wires.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Canvas.TagArtists.GH_TagArtist
 Grasshopper.GUI.Canvas.TagArtists.GH_TagArtist_WirePainter
Namespace: Grasshopper.GUI.Canvas.TagArtists
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_TagArtist_WirePainter : GH_TagArtist
Public Class GH_TagArtist_WirePainter
	Inherits GH_TagArtist
The GH_TagArtist_WirePainter type exposes the following members.
Constructors
Name | Description
GH_TagArtist_WirePainter
Initializes a new instance of the GH_TagArtist_WirePainter class
Top
Properties
Name | Description
WirePainter_ID
Top
Methods
Name | Description
Paint |  (Overrides GH_TagArtist.Paint(GH_Canvas, GH_CanvasChannel).)
Top
See Also
Reference
Grasshopper.GUI.Canvas.TagArtists Namespace