Grasshopper SDK
IGH_Attributes.DocObject Property
 Gets the owner object of these attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_DocumentObject DocObject { get; }
ReadOnly Property DocObject As IGH_DocumentObject
	Get
Property Value
Type: IGH_DocumentObject
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.DocObject"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace