Grasshopper SDK
IGH_DocumentObject.TriggerAutoSave Method
 Triggers the AutoSave function on the owner document with the object_changed flag.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void TriggerAutoSave()
Sub TriggerAutoSave
See Also
Reference
IGH_DocumentObject Interface
TriggerAutoSave Overload
Grasshopper.Kernel Namespace