Grasshopper SDK
GH_LayoutAction Class
 Records a single object layout event. Useful for tracking object resizes.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ObjectUndoAction
 Grasshopper.Kernel.Undo.Actions.GH_LayoutAction
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_LayoutAction : GH_ObjectUndoAction
Public Class GH_LayoutAction
	Inherits GH_ObjectUndoAction
The GH_LayoutAction type exposes the following members.
Constructors
Name | Description
GH_LayoutAction
Initializes a new instance of the GH_LayoutAction class
Top
Properties
Name | Description
Top
Methods
Name | Description
Object_Redo |  (Overrides GH_ObjectUndoAction.Object_Redo(GH_Document, IGH_DocumentObject).)
Object_Undo |  (Overrides GH_ObjectUndoAction.Object_Undo(GH_Document, IGH_DocumentObject).)
Top
See Also
Reference
Grasshopper.Kernel.Undo.Actions Namespace