Grasshopper SDK
GH_IndexRuleSet Constructor
 Blank constructor. Creates an empty collection of rules.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_IndexRuleSet()
Public Sub New
See Also
Reference
GH_IndexRuleSet Class
Grasshopper.Kernel.Data Namespace