Grasshopper SDK
GH_DigitScrollerBase.BackgroundGradient Property
 Gets or sets the background Gradient. If the gradient is not null, it overrides the background colours.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Gradient BackgroundGradient { get; set; }
Public Property BackgroundGradient As GH_Gradient
	Get
	Set
Property Value
Type: GH_Gradient
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.BackgroundGradient"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace