Grasshopper SDK
IGH_Author.Company Property
 Gets the Company name of the author.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Company { get; }
ReadOnly Property Company As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Author.Company"]
See Also
Reference
IGH_Author Interface
Grasshopper.Kernel Namespace