Grasshopper SDK
GH_Convert.ToColor_Secondary Method
 Performs indirect casts from other data types into Colors.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToColor_Secondary(
	Object data,
	ref Color destination
)
Public Shared Function ToColor_Secondary (
	data As Object,
	ByRef destination As Color
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.Drawing.Color
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace