Grasshopper SDK
IGH_Component.MasterParameterIndex Property
 Gets or sets the master parameter index override. Negative indices or indices larger than or equal to the input parameter count will be ignored and regular master parameter detection will kick in.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int MasterParameterIndex { get; set; }
Property MasterParameterIndex As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Component.MasterParameterIndex"]
See Also
Reference
IGH_Component Interface
Grasshopper.Kernel Namespace