Grasshopper SDK
GH_DocumentObject.Menu_AppendGenericMenuItem Method
Note: This API is now obsolete.
 This method is obsolete.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("This method is obsolete")]
public static ToolStripMenuItem Menu_AppendGenericMenuItem(
	ToolStrip menu,
	string text,
	EventHandler on_click = null,
	Image image = null,
	Object tag = null,
	bool enabled = true,
	bool checked = false
)
<ObsoleteAttribute("This method is obsolete")>
Public Shared Function Menu_AppendGenericMenuItem (
	menu As ToolStrip,
	text As String,
	Optional on_click As EventHandler = Nothing,
	Optional image As Image = Nothing,
	Optional tag As Object = Nothing,
	Optional enabled As Boolean = true,
	Optional checked As Boolean = false
) As ToolStripMenuItem
Parameters
menu
Type: System.Windows.Forms.ToolStrip
text
Type: System.String
on_click (Optional)
Type: System.EventHandler
image (Optional)
Type: System.Drawing.Image
tag (Optional)
Type: System.Object
enabled (Optional)
Type: System.Boolean
checked (Optional)
Type: System.Boolean
Return Value
Type: ToolStripMenuItem
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace