Grasshopper SDK
GH_Path.SplitPathLikeString Method
 Try to split up a path-like formatted string "{A;B;C}(i)" into component parts.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool SplitPathLikeString(
	string s,
	out string[] path_segments,
	out string index_segment
)
Public Shared Function SplitPathLikeString (
	s As String,
	<OutAttribute> ByRef path_segments As String(),
	<OutAttribute> ByRef index_segment As String
) As Boolean
Parameters
s
Type: System.String
String to parse.
path_segments
Type: System.String[]
Output - Strings inside the path portion of s.
index_segment
Type: System.String
Output - String inside the index portion of s.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace