Grasshopper SDK
GH_Param<T>.m_data Field
 Contains the runtime data for this parameter, also known as "Volatile" data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_Structure<T> m_data
Protected m_data As GH_Structure(Of T)
Field Value
Type: GH_Structure<T>
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace