Grasshopper SDK
GH_DocumentObject.Menu_AppendPublish Method
 Appends the default item for publishing to RCP. This menu will only appear if the current class implement IRcpAwareObject
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void Menu_AppendPublish(
	ToolStripDropDown menu
)
Protected Sub Menu_AppendPublish (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace