Grasshopper SDK
GH_WireAction Constructor
Initializes a new instance of the GH_WireAction class
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_WireAction(
	IGH_Param param
)
Public Sub New (
	param As IGH_Param
)
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
See Also
Reference
GH_WireAction Class
Grasshopper.Kernel.Undo.Actions Namespace