Grasshopper SDK
CentralSettings.AuthorWebsiteChangedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void AuthorWebsiteChangedEventHandler()
Public Delegate Sub AuthorWebsiteChangedEventHandler
See Also
Reference
Grasshopper Namespace