Grasshopper SDK
Tracing.DebugLogAddEntry Method
 Add a message to the debug log. If the debug log doesn't exist yet, it will be created. This function will only work if the Grasshopper window exists. This method is threadsafe.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void DebugLogAddEntry(
	string message
)
Public Shared Sub DebugLogAddEntry (
	message As String
)
Parameters
message
Type: System.String
Message to post.
See Also
Reference
Tracing Class
Grasshopper Namespace