Grasshopper SDK
Param_MeshParameters.Prompt_Singular Method
Namespace: Grasshopper.Kernel.Parameters
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override GH_GetterResult Prompt_Singular(
	ref GH_MeshingParameters value
)
Protected Overrides Function Prompt_Singular (
	ByRef value As GH_MeshingParameters
) As GH_GetterResult
Parameters
value
Type: Grasshopper.Kernel.Types.GH_MeshingParameters
Return Value
Type: GH_GetterResult
See Also
Reference
Param_MeshParameters Class
Grasshopper.Kernel.Parameters Namespace