Grasshopper SDK
GH_Document.EnabledObjects Method
 Returns all enabled objects in the document
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_DocumentObject> EnabledObjects()
Public Function EnabledObjects As List(Of IGH_DocumentObject)
Return Value
Type: List<IGH_DocumentObject>
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace