Grasshopper SDK
GH_Document.EnableSolutionsChanged Event
 Raised whenever the Shared EnabledSolutions property is changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_Document.EnableSolutionsChangedEventHandler EnableSolutionsChanged
Public Shared Event EnableSolutionsChanged As GH_Document.EnableSolutionsChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.EnableSolutionsChangedEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace