Grasshopper SDK
GH_DocumentEditor.AggregateShortcutMenuItems Event
 This event is raised whenever a GH_DocumentEditor collects all shortcuttable menu items. If you added items to the menu and you want to be able to have custom shortcuts on these items, you must handle this event and insert your own items.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_DocumentEditor.AggregateShortcutMenuItemsEventHandler AggregateShortcutMenuItems
Public Shared Event AggregateShortcutMenuItems As GH_DocumentEditor.AggregateShortcutMenuItemsEventHandler
Value
Type: Grasshopper.GUI.GH_DocumentEditor.AggregateShortcutMenuItemsEventHandler
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace