Grasshopper SDK
GH_DocumentRenderMeshProvider.BuildCustomMeshes Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool BuildCustomMeshes(
	ViewportInfo vp,
	RhinoDoc doc,
	RenderPrimitiveList objMeshes,
	Guid requestingPlugIn,
	bool meshType
)
Public Overrides Function BuildCustomMeshes (
	vp As ViewportInfo,
	doc As RhinoDoc,
	objMeshes As RenderPrimitiveList,
	requestingPlugIn As Guid,
	meshType As Boolean
) As Boolean
Parameters
vp
Type: ViewportInfo
doc
Type: RhinoDoc
objMeshes
Type: RenderPrimitiveList
requestingPlugIn
Type: System.Guid
meshType
Type: System.Boolean
Return Value
Type: Boolean
See Also
Reference
GH_DocumentRenderMeshProvider Class
Grasshopper.Kernel Namespace