Grasshopper SDK
GH_Slider.Maximum Property
 Gets or sets the upper numeric limit for the slider range.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Maximum { get; set; }
Public Property Maximum As Decimal
	Get
	Set
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.Maximum"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace