Grasshopper SDK
CentralSettings.ComponentCascadeMenusChangedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ComponentCascadeMenusChangedEventHandler()
Public Delegate Sub ComponentCascadeMenusChangedEventHandler
See Also
Reference
Grasshopper Namespace