Grasshopper SDK
GH_AsynchFileData.FileChangedDelegate Delegate
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void FileChangedDelegate(
	GH_AsynchFileData sender
)
Public Delegate Sub FileChangedDelegate (
	sender As GH_AsynchFileData
)
Parameters
sender
Type: Grasshopper.GUI.GH_AsynchFileData
See Also
Reference
Grasshopper.GUI Namespace