Grasshopper SDK
GH_Circle.GH_CircleProxy.Normal Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Vector3d_Wrapper Normal { get; }
Public ReadOnly Property Normal As GH_Vector3d_Wrapper
	Get
Property Value
Type: GH_Vector3d_Wrapper
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Circle.GH_CircleProxy.Normal"]
See Also
Reference
GH_Circle.GH_CircleProxy Class
Grasshopper.Kernel.Types Namespace