Grasshopper SDK
GH_Component.GH_InputParamManager.AddParameter Method (IGH_Param)
 Generic parameter addition. If you cannot use one of the utility methods provided by this class, you can register a customized parameter using this method.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int AddParameter(
	IGH_Param param
)
Public Function AddParameter (
	param As IGH_Param
) As Integer
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
The parameter to add.
Return Value
Type: Int32
Index of the newly added parameter.
See Also
Reference
GH_Component.GH_InputParamManager Class
AddParameter Overload
Grasshopper.Kernel Namespace