Grasshopper SDK
GH_DocumentServer.AddNewDocument Method
 Adds a new document to the global list. If a template file has been set, this document will be based on the template.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document AddNewDocument()
Public Function AddNewDocument As GH_Document
Return Value
Type: GH_Document
The document thaw was added.
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace