Grasshopper SDK
GH_DocumentEditor.ScriptAccess_CloseAllDocuments Method
 Closes all documents in the Document Queue.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ScriptAccess_CloseAllDocuments()
Public Function ScriptAccess_CloseAllDocuments As Boolean
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace