Grasshopper SDK
GH_TreeRules.FromString Method
 Attempt to parse a Pattern string.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_TreeRules FromString(
	string text,
	ref string message = null
)
Public Shared Function FromString (
	text As String,
	Optional ByRef message As String = Nothing
) As GH_TreeRules
Parameters
text
Type: System.String
String to parse.
message (Optional)
Type: System.String
If this function fails, msg will contain a message describing the error.
Return Value
Type: GH_TreeRules
True on success, false on failure.
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace