Grasshopper SDK
GH_ColourPickerBase Fields
The GH_ColourPickerBase type exposes the following members.
Fields
Name | Description
MinWidth
SliderSize
Spacing
SwatchSize
Top
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace