Grasshopper SDK
GH_GeometricGooWrapper.GetBoundingBox Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public BoundingBox GetBoundingBox(
	Transform xform
)
Public Function GetBoundingBox (
	xform As Transform
) As BoundingBox
Parameters
xform
Type: Transform
Return Value
Type: BoundingBox
Implements
IGH_GeometricGoo.GetBoundingBox(Transform)
See Also
Reference
GH_GeometricGooWrapper Class
Grasshopper.Kernel.Types Namespace