Grasshopper SDK
GH_ComplexNumber Class
 Wraps up the Complex data type for IGH_Goo adherence.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Complex>
 Grasshopper.Kernel.Types.GH_ComplexNumber
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ComplexNumber : GH_Goo<Complex>
Public Class GH_ComplexNumber
	Inherits GH_Goo(Of Complex)
The GH_ComplexNumber type exposes the following members.
Constructors
Name | Description
GH_ComplexNumber()
 Blank constructor
GH_ComplexNumber(Complex)
Initializes a new instance of the GH_ComplexNumber class
GH_ComplexNumber(GH_ComplexNumber)
Initializes a new instance of the GH_ComplexNumber class
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance. If either the real or the imaginary component are NaN, then it is considered invalid
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateComplex
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace