Grasshopper SDK
GH_IndexRuleSet.AddRangeRule Method
 Append a single range rule.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddRangeRule(
	GH_IndexRange range,
	bool invert
)
Public Sub AddRangeRule (
	range As GH_IndexRange,
	invert As Boolean
)
Parameters
range
Type: Grasshopper.Kernel.Data.GH_IndexRange
Range to filter.
invert
Type: System.Boolean
If true, the range will be filtered against rather than for.
See Also
Reference
GH_IndexRuleSet Class
Grasshopper.Kernel.Data Namespace