Grasshopper SDK
GH_AutoSaveSettings.SaveOnDocumentUnloadChanged Event
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_AutoSaveSettings.SaveOnDocumentUnloadChangedEventHandler SaveOnDocumentUnloadChanged
Public Shared Event SaveOnDocumentUnloadChanged As GH_AutoSaveSettings.SaveOnDocumentUnloadChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_AutoSaveSettings.SaveOnDocumentUnloadChangedEventHandler
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace