Grasshopper SDK
GH_Animator.InterpolateInteger Method
 Utility interpolation delegate for System.Int32 values.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int InterpolateInteger(
	int A,
	int B,
	double factor
)
Public Shared Function InterpolateInteger (
	A As Integer,
	B As Integer,
	factor As Double
) As Integer
Parameters
A
Type: System.Int32
B
Type: System.Int32
factor
Type: System.Double
Return Value
Type: Int32
See Also
Reference
GH_Animator Class
Grasshopper.GUI Namespace