Grasshopper SDK
GH_Painter.DetermineWireType Method
 Utility method for determining wire display types.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_WireType DetermineWireType(
	IGH_Structure target
)
Public Shared Function DetermineWireType (
	target As IGH_Structure
) As GH_WireType
Parameters
target
Type: Grasshopper.Kernel.Data.IGH_Structure
Pointer to transfer data.
Return Value
Type: GH_WireType
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace