Grasshopper SDK
GH_Slider.RailBrightColour Property
 Gets or sets the edge colour for the bright parts of the rail.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color RailBrightColour { get; set; }
Public Property RailBrightColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.RailBrightColour"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace