Grasshopper SDK
IGH_DocumentOwner.OwnerDocument Method
 If the IGH_DocumentOwner is part of a GH_Document of its own, this function will return that document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_Document OwnerDocument()
Function OwnerDocument As GH_Document
Return Value
Type: GH_Document
See Also
Reference
IGH_DocumentOwner Interface
Grasshopper.Kernel Namespace