Grasshopper SDK
GH_RuntimeMessage.Event Property
 Gets the time at which the message was recorded.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime Event { get; }
Public ReadOnly Property Event As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RuntimeMessage.Event"]
See Also
Reference
GH_RuntimeMessage Class
Grasshopper.Kernel Namespace