Grasshopper SDK
GH_SignatureException.Message Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string Message { get; }
Public Overrides ReadOnly Property Message As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_SignatureException.Message"]
Implements
_Exception.Message
See Also
Reference
GH_SignatureException Class
Grasshopper.Kernel.Expressions Namespace