Grasshopper SDK
GH_CapsuleRenderEngine.RenderMessage Method
 Render a text message underneath the capsule.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderMessage(
	Graphics G,
	string message,
	GH_PaletteStyle style
)
Public Sub RenderMessage (
	G As Graphics,
	message As String,
	style As GH_PaletteStyle
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with.
message
Type: System.String
Message to draw.
style
Type: Grasshopper.GUI.Canvas.GH_PaletteStyle
Style to use.
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace