Grasshopper SDK
GH_GDI_Util.Freeform_Blob Method (IEnumerable<RectangleF>, Int32, Double)
 Create a meta-ball outline for a set of rectangles.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath Freeform_Blob(
	IEnumerable<RectangleF> content,
	int padding,
	double accuracy
)
Public Shared Function Freeform_Blob (
	content As IEnumerable(Of RectangleF),
	padding As Integer,
	accuracy As Double
) As GraphicsPath
Parameters
content
Type: System.Collections.Generic.IEnumerable<RectangleF>
Rectangles to encompass.
padding
Type: System.Int32
Number of units to add to each box.
accuracy
Type: System.Double
Pixel accuracy for isosurface outlines. 3 is a good value for 1:1 UI.
Return Value
Type: GraphicsPath
A graphics path describing all iso-surfaces.
See Also
Reference
GH_GDI_Util Class
Freeform_Blob Overload
Grasshopper.GUI Namespace