Grasshopper SDK
IGH_InstanceDescription.NewInstanceGuid Method
 Generate a new random instance GUID
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void NewInstanceGuid()
Sub NewInstanceGuid
See Also
Reference
IGH_InstanceDescription Interface
NewInstanceGuid Overload
Grasshopper.Kernel Namespace