Grasshopper SDK
GH_Culture.DuplicateCulture Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Culture DuplicateCulture()
Public Function DuplicateCulture As GH_Culture
Return Value
Type: GH_Culture
See Also
Reference
GH_Culture Class
Grasshopper.Kernel.Types Namespace