Grasshopper SDK
GH_SolutionExpiredEventArgs Constructor
Initializes a new instance of the GH_SolutionExpiredEventArgs class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SolutionExpiredEventArgs(
	bool eRecompute
)
Public Sub New (
	eRecompute As Boolean
)
Parameters
eRecompute
Type: System.Boolean
See Also
Reference
GH_SolutionExpiredEventArgs Class
Grasshopper.Kernel Namespace