Grasshopper SDK
IGH_DocumentObject.ComponentGuid Property
 Returns a consistent ID for this object type. Every object must supply a unique and unchanging ID that is used to identify objects of the same type.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid ComponentGuid { get; }
ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_DocumentObject.ComponentGuid"]
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace