Grasshopper SDK
GH_MemoryBitmap.Filter_GreyScale Method
 Convert the image to a greyscale shadow of its former self.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_GreyScale()
Public Sub Filter_GreyScale
See Also
Reference
GH_MemoryBitmap Class
Filter_GreyScale Overload
Grasshopper.Kernel Namespace