Grasshopper SDK
GH_Slider_Obsolete.DisplayFormat Property
 Gets or sets the display format fo the slider. This is the formatting that is applied prior to drawing. The default is {0} which results in a 1:1 display. Use this to append units or symbols.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string DisplayFormat { get; set; }
Public Property DisplayFormat As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider_Obsolete.DisplayFormat"]
Return Value
Type: String
Remarks
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace