Grasshopper SDK
GH_Format.FormatCurve Method (GH_Curve)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatCurve(
	GH_Curve data
)
Public Shared Function FormatCurve (
	data As GH_Curve
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Curve
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatCurve Overload
Grasshopper.Kernel Namespace