Grasshopper SDK
GH_Author.WebsiteReadonly Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string WebsiteReadonly { get; }
Public ReadOnly Property WebsiteReadonly As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Author.WebsiteReadonly"]
Implements
IGH_Author.Website
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace