Grasshopper SDK
GH_RenderArgs.MaterialSelected Property
 Gets the material hint to use for selected objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RenderMaterial MaterialSelected { get; }
Public ReadOnly Property MaterialSelected As RenderMaterial
	Get
Property Value
Type: RenderMaterial
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RenderArgs.MaterialSelected"]
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace