Grasshopper SDK
Node3d<T>.RootNode Property
 Gets the ultimate root node for this tree.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Node3d<T> RootNode { get; }
Public ReadOnly Property RootNode As Node3d(Of T)
	Get
Property Value
Type: Node3d<T>
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.RootNode"]
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace