Grasshopper SDK
GH_StandardIcons.FileIconGha_32x32 Property
 Gets the file icon used for Gha files.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Bitmap FileIconGha_32x32 { get; }
Public Shared ReadOnly Property FileIconGha_32x32 As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.GH_StandardIcons.FileIconGha_32x32"]
See Also
Reference
GH_StandardIcons Class
Grasshopper.GUI Namespace