Grasshopper SDK
GH_List.Create Method (Boolean)
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_List Create(
	bool ordered
)
Public Shared Function Create (
	ordered As Boolean
) As GH_List
Parameters
ordered
Type: System.Boolean
Return Value
Type: GH_List
See Also
Reference
GH_List Class
Create Overload
Grasshopper.Documentation Namespace