Grasshopper SDK
GH_Link.IsSharedLink Property
 Gets whether this link is a shared link. A shared link should not have text but it should have a non-empty LinkId.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsSharedLink { get; }
Public ReadOnly Property IsSharedLink As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_Link.IsSharedLink"]
See Also
Reference
GH_Link Class
Grasshopper.Documentation Namespace