Grasshopper SDK
GH_ArchivedUndoAction Class
 Base class implementation for undo actions that require (de)serialization of data.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ArchivedUndoAction
 Grasshopper.Kernel.Undo.Actions.GH_AddStateAction
 Grasshopper.Kernel.Undo.Actions.GH_GenericObjectAction
 Grasshopper.Kernel.Undo.Actions.GH_RemoveObjectAction
 Grasshopper.Kernel.Undo.Actions.GH_RemoveStateAction
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_ArchivedUndoAction : GH_UndoAction
Public MustInherit Class GH_ArchivedUndoAction
	Inherits GH_UndoAction
The GH_ArchivedUndoAction type exposes the following members.
Constructors
Name | Description
GH_ArchivedUndoAction
Initializes a new instance of the GH_ArchivedUndoAction class
Top
Properties
Name | Description
Top
Methods
Name | Description
Deserialize
 Deserializes the obj from the local archive.
Read |  (Overrides GH_UndoAction.Read(GH_IReader).)
Serialize
 Serializes the obj into the local archive.
SerializeToByteArray
 Serializes the obj into the local archive.
Write |  (Overrides GH_UndoAction.Write(GH_IWriter).)
Top
Fields
Name | Description
m_data
 Internal data storage for serialized archives.
Top
See Also
Reference
Grasshopper.Kernel.Undo Namespace