Grasshopper SDK
GH_WireSettings.SelectedColour1 Property
 Gets or sets the colour of a wire at the unselected extreme.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color SelectedColour1 { get; set; }
Public Property SelectedColour1 As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_WireSettings.SelectedColour1"]
See Also
Reference
GH_WireSettings Class
Grasshopper.GUI.Theme Namespace