Grasshopper SDK
GH_ColourCube.S0 Property
 Gets the first point in the shadow point list. This point is coincident with C0.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point S0 { get; }
Public ReadOnly Property S0 As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourCube.S0"]
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace