Grasshopper SDK
GH_TextBoxInputBase.ShowTextInputBox Method (Control, String, Boolean)
 Display a floating text-box on top of the owner control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ShowTextInputBox(
	Control owner,
	string content,
	bool selectContent
)
Public Sub ShowTextInputBox (
	owner As Control,
	content As String,
	selectContent As Boolean
)
Parameters
owner
Type: System.Windows.Forms.Control
Control that owns this slider. The coordinates of the Bounds rectangle must be specified in owner coordinates.
content
Type: System.String
selectContent
Type: System.Boolean
See Also
Reference
GH_TextBoxInputBase Class
ShowTextInputBox Overload
Grasshopper.GUI.Base Namespace