Grasshopper SDK
GH_PageSettings.EdgeColour Property
 Gets or sets the page edge colour to be used.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color EdgeColour { get; set; }
Public Property EdgeColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_PageSettings.EdgeColour"]
See Also
Reference
GH_PageSettings Class
Grasshopper.GUI.Theme Namespace