Grasshopper SDK
GH_CanvasValidator.Document Property
 Gets the document (if it exists) that is currently loaded in the canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_Document Document { get; }
Protected ReadOnly Property Document As GH_Document
	Get
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasValidator.Document"]
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace