Grasshopper SDK
GH_Mesh Class
 Represents a 3D polygonal mesh composed of quads and tris. GH_MEsh wraps the functionality of the OpenNURBS OnMesh class.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Mesh>
 Grasshopper.Kernel.Types.GH_GeometricGoo<Mesh>
 Grasshopper.Kernel.Types.GH_Mesh
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Mesh : GH_GeometricGoo<Mesh>,
	IGH_BakeAwareData, IGH_PreviewData, IGH_RenderAwareData
Public Class GH_Mesh
	Inherits GH_GeometricGoo(Of Mesh)
	Implements IGH_BakeAwareData, IGH_PreviewData, IGH_RenderAwareData
The GH_Mesh type exposes the following members.
Constructors
Name | Description
GH_Mesh()
Initializes a new instance of the GH_Mesh class
GH_Mesh(Mesh)
Initializes a new instance of the GH_Mesh class
GH_Mesh(Guid)
Initializes a new instance of the GH_Mesh class
GH_Mesh(GH_Mesh)
Initializes a new instance of the GH_Mesh class
Top
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded |  (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid |  (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
AppendRenderGeometry
BakeGeometry
CastFrom |  (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches |  (Overrides GH_GeometricGoo<T>.ClearCaches().)
DrawViewportMeshes
DrawViewportWires
DuplicateGeometry |  (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
DuplicateMesh
EmitProxy |  (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry(RhinoDoc) |  (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace