Grasshopper SDK
GH_Path.Increment Method (Int32, Int32)
 Increment a specific index in this path by one.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Path Increment(
	int index,
	int offset
)
Public Function Increment (
	index As Integer,
	offset As Integer
) As GH_Path
Parameters
index
Type: System.Int32
Index to increment. Valis indices are (-Length+1) to (Length-1).
offset
Type: System.Int32
Amount to increment.
Return Value
Type: GH_Path
A new path with incremented index.
See Also
Reference
GH_Path Class
Increment Overload
Grasshopper.Kernel.Data Namespace