Grasshopper SDK
IGH_DocumentObject.TriggerAutoSave Method (Guid)
 Triggers the AutoSave function on the owner document with the object_changed flag.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void TriggerAutoSave(
	Guid id
)
Sub TriggerAutoSave (
	id As Guid
)
Parameters
id
Type: System.Guid
ID of autosave event. Consecutive autosave requests with the same ID will be ignored.
See Also
Reference
IGH_DocumentObject Interface
TriggerAutoSave Overload
Grasshopper.Kernel Namespace