Grasshopper SDK
Generic Constructor
Initializes a new instance of the Generic class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Generic()
Public Sub New
See Also
Reference
Generic Class
Generic Overload
Grasshopper.Kernel.Types.Transforms Namespace