Grasshopper SDK
GH_RuntimeMessage Constructor
Initializes a new instance of the GH_RuntimeMessage class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RuntimeMessage(
	string nMessage,
	GH_RuntimeMessageLevel nType = GH_RuntimeMessageLevel.Remark,
	string nSource = null
)
Public Sub New (
	nMessage As String,
	Optional nType As GH_RuntimeMessageLevel = GH_RuntimeMessageLevel.Remark,
	Optional nSource As String = Nothing
)
Parameters
nMessage
Type: System.String
nType (Optional)
Type: Grasshopper.Kernel.GH_RuntimeMessageLevel
nSource (Optional)
Type: System.String
See Also
Reference
GH_RuntimeMessage Class
Grasshopper.Kernel Namespace