Grasshopper SDK
GH_TooltipDisplayEventArgs.Title Property
 Gets or sets the title of the tooltip. If you do not set the Title property, you must set the Text property or the tooltip will not be shown.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Title { get; set; }
Public Property Title As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipDisplayEventArgs.Title"]
See Also
Reference
GH_TooltipDisplayEventArgs Class
Grasshopper.GUI Namespace