Grasshopper SDK
IGH_DataAccess.IncrementIteration Method
 Increments the iteration count by 1.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void IncrementIteration()
Sub IncrementIteration
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace