Grasshopper SDK
GH_Canvas.Document_ModifiedChanged Event
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.Document_ModifiedChangedEventHandler Document_ModifiedChanged
Public Event Document_ModifiedChanged As GH_Canvas.Document_ModifiedChangedEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.Document_ModifiedChangedEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace