Grasshopper SDK
GH_Component.ClippingBox Property
 Gets the clipping box for all preview geometry drawn by this component and all associated parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual BoundingBox ClippingBox { get; }
Public Overridable ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.ClippingBox"]
Implements
IGH_PreviewObject.ClippingBox
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace