Grasshopper SDK
GH_RuleAnyNumber Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_RuleAnyNumber
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_RuleAnyNumber : IGH_Rule
Public Class GH_RuleAnyNumber
	Implements IGH_Rule
The GH_RuleAnyNumber type exposes the following members.
Constructors
Name | Description
GH_RuleAnyNumber
Initializes a new instance of the GH_RuleAnyNumber class
Top
Properties
Name | Description
Kind
Notation
Top
Methods
Name | Description
Apply
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace