Grasshopper SDK
GH_Curve.MakeDeformable Method
 Converts the local geometry into deformable nurbs curve geometry. This method will not destroy Reference data.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool MakeDeformable()
Public Function MakeDeformable As Boolean
Return Value
Type: Boolean
See Also
Reference
GH_Curve Class
Grasshopper.Kernel.Types Namespace