Grasshopper SDK
GH_SamplingSphere.SampleCount Property
 Gets the total number of samples contained in this sampling grid.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int SampleCount { get; }
Public ReadOnly Property SampleCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_SamplingSphere.SampleCount"]
See Also
Reference
GH_SamplingSphere Class
Grasshopper.GUI Namespace