Grasshopper SDK
CentralSettings.PruderyLevel Property
 Gets or sets the Grasshopper UI prudery level.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_PruderyFilter PruderyLevel { get; set; }
Public Shared Property PruderyLevel As GH_PruderyFilter
	Get
	Set
Property Value
Type: GH_PruderyFilter
[Missing <value> documentation for "P:Grasshopper.CentralSettings.PruderyLevel"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace