Grasshopper SDK
GH_Convert.GetPointFromDocument Method
 Harvest a point object from a Rhino document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool GetPointFromDocument(
	RhinoDoc doc,
	Guid id,
	out Point3d pt
)
Public Shared Function GetPointFromDocument (
	doc As RhinoDoc,
	id As Guid,
	<OutAttribute> ByRef pt As Point3d
) As Boolean
Parameters
doc
Type: RhinoDoc
Document to search.
id
Type: System.Guid
ID of point object.
pt
Type: Point3d
Point result.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace