Grasshopper SDK
GH_Canvas.ActiveObject Property
 Gets or sets the currently active object.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_DocumentObject ActiveObject { get; set; }
Public Property ActiveObject As IGH_DocumentObject
	Get
	Set
Property Value
Type: IGH_DocumentObject
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.ActiveObject"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace