Grasshopper SDK
GH_Field.Elements Property
 Gets the list of elements of this field.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_FieldElement> Elements { get; }
Public ReadOnly Property Elements As List(Of IGH_FieldElement)
	Get
Property Value
Type: List<IGH_FieldElement>
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Field.Elements"]
See Also
Reference
GH_Field Class
Grasshopper.Kernel.Types Namespace