Grasshopper SDK
GH_Gradient Class
 Represents a colour gradient defined by a succession of grips.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Gradient.GH_Gradient
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Gradient : GH_ISerializable
Public Class GH_Gradient
	Implements GH_ISerializable
The GH_Gradient type exposes the following members.
Constructors
Name | Description
GH_Gradient()
Initializes a new instance of the GH_Gradient class
GH_Gradient(GH_Gradient)
 Create a duplicate of another gradient.
GH_Gradient(IEnumerable<Double>, IEnumerable<Color>)
 Create a new gradient from grips and colours.
Top
Properties
Name | Description
Grip
 Gets or sets the grip at the given index.
GripCount
 Gets the number of grips in this gradient.
Linear
 Gets or sets whether the colours are interpolated linearly between grips.
Locked
 Gets or sets whether this gradient is locked. A locked gradient cannot be modified by the user.
SelectedGrip
 Gets or sets the selected grip.
Top
Methods
Name | Description
AddGrip(Double)
 Add a new grip to the gradient. The colour of the grip will be picked so that there is no difference to the gradient, though this is not actually possible when the interpolation mode is not linear.
AddGrip(GH_Grip)
 Add a new grip to the gradient. This method does not raise the GradientChanged event, so you need to do that yourself by calling OnGradientChanged().
AddGrip(Double, Color)
 Add a new single-colour grip.
AddGrip(Double, Color, Color)
 Add a new bi-colour grip.
ColourAt
 Evaluate the colour at a specific parameter.
DeleteGripRegion
 Gets the Delete Grip region rectangle based on a gradient destination rectangle.
DisplayGradientEditor
DisplayGripColourPicker
EarthlyBrown
Forest
GreyScale
Heat
MouseDown
 Begin grip drag operation.
MouseDragAbort
 Abort grip drag.
MouseMove
 Continue grip dragging operation.
MouseUp
 Terminate grip drag.
NearestGrip(Double)
 Find the nearest grip to a parameter.
NearestGrip(Double, GH_GripSide)
 Find the nearest grip to a parameter.
NearestGrip(RectangleF, PointF, Double)
 Find the nearest grip in screen coordinates.
NewGripRegion
 Gets the new Grip region rectangle based on a gradient destination rectangle.
NormalizeGrips
 Normalize all grips. This will scale all grip parameters so that the full gradient extend equals 0~1.
OnGradientChanged
 Raise the GradientChanged event.
OnGradientChangedIntermediate
 Raise the GradientChanged event.
OnSelectionChanged
 Raise the SelectionChanged event.
Read
RemoveGrip(Int32)
 Remove the grip at the specified index.
RemoveGrip(GH_Grip)
 Remove the specified grip.
Render_Background
Render_Gradient
Render_Grips
SoGay
Spectrum
Traffic
Write
Zebra
Top
Events
Name | Description
GradientChanged
SelectionChanged
Top
See Also
Reference
Grasshopper.GUI.Gradient Namespace