Grasshopper SDK
GH_Document.OnModifiedChanged Method
 Raise the ModifiedChanged event
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnModifiedChanged()
Public Sub OnModifiedChanged
Remarks
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace