Grasshopper SDK
Instances Methods
The Instances type exposes the following members.
Methods
Name | Description
DocumentEditorFadeIn
 Calls the FadeIn() method on the DocumentEditor if it exists.
DocumentEditorFadeOut
 Calls the FadeOut() method on the DocumentEditor if it exists.
EnforceInvariantCulture
 If the Setting "EnforceInvariantCulture" is set to False, this function does nothing
HideRemotePanel
 Hides the remote control panel.
InvalidateCanvas
 Invalidates the currently active Grasshopper Canvas, causing a redraw sometime in the foreseeable future.
RedrawAll
 Forces a redraw of both the active canvas and the Rhino viewports.
RedrawCanvas
 Forces a redraw of the currently active Grasshopper Canvas.
ShowRemotePanel
 Shows the remote control panel.
UnloadAllObjects
 Clears and unloads all cached objects. This function is called by the _GrasshopperUnloadPlugin command. Please don't use it.
Top
See Also
Reference
Instances Class
Grasshopper Namespace