Grasshopper SDK
GH_SelectionTopology Enumeration
 Enumerates the possible selection topologies.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_SelectionTopology
Public Enumeration GH_SelectionTopology
Members
Member name | Value | Description
None | 0 |  No selected objects.
Convex | 1 |  Selection set is convex, meaning unselected objects are not sandwiched between selected objects.
Concave | 2 |  Selection set is concave, meaning unselected objects are sandwiched between selected objects.
See Also
Reference
Grasshopper.Kernel Namespace