Grasshopper SDK
GH_PreviewMeshArgs Constructor
Initializes a new instance of the GH_PreviewMeshArgs class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PreviewMeshArgs(
	RhinoViewport vp,
	DisplayPipeline pl,
	DisplayMaterial mat,
	MeshingParameters meshParams
)
Public Sub New (
	vp As RhinoViewport,
	pl As DisplayPipeline,
	mat As DisplayMaterial,
	meshParams As MeshingParameters
)
Parameters
vp
Type: RhinoViewport
pl
Type: DisplayPipeline
mat
Type: DisplayMaterial
meshParams
Type: MeshingParameters
See Also
Reference
GH_PreviewMeshArgs Class
Grasshopper.Kernel Namespace