Grasshopper SDK
GH_Brep.DuplicateBrep Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Brep DuplicateBrep()
Public Function DuplicateBrep As GH_Brep
Return Value
Type: GH_Brep
See Also
Reference
GH_Brep Class
Grasshopper.Kernel.Types Namespace