Grasshopper SDK
GH_GraphicsUtil.FadeColour Method
 Fade a colour to transparency by linearly blending a parameter between extremes.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color FadeColour(
	double t0,
	double t1,
	double t,
	Color col
)
Public Shared Function FadeColour (
	t0 As Double,
	t1 As Double,
	t As Double,
	col As Color
) As Color
Parameters
t0
Type: System.Double
First extreme. (represents transparency)
t1
Type: System.Double
Second extreme. (represent unaltered colour)
t
Type: System.Double
Blending factor between t0 and t1.
col
Type: System.Drawing.Color
Colour to fade.
Return Value
Type: Color
The colour adjusted for blending.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace