Grasshopper SDK
GH_TooltipDisplayEventArgs.Description Property
 Gets or sets the description of the tooltip. This field is optional.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipDisplayEventArgs.Description"]
See Also
Reference
GH_TooltipDisplayEventArgs Class
Grasshopper.GUI Namespace