Grasshopper SDK
GH_Convert.ToString_Primary Method
 Performs a direct cast from String and GH_String.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToString_Primary(
	Object data,
	ref string destination
)
Public Shared Function ToString_Primary (
	data As Object,
	ByRef destination As String
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.String
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace