Grasshopper SDK
GH_DigitNumber.SecondaryPositive Property
 Gets a value indicating whether the secondary number is positive.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool SecondaryPositive { get; }
Public ReadOnly Property SecondaryPositive As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitNumber.SecondaryPositive"]
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace