Grasshopper SDK
GH_PersistentParam<T>.Prompt_Plural Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected abstract GH_GetterResult Prompt_Plural(
	ref List<T> values
)
Protected MustOverride Function Prompt_Plural (
	ByRef values As List(Of T)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<T>
Return Value
Type: GH_GetterResult
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace