Grasshopper SDK
GH_SliderBase.ControlEdgeColour Property
 Gets or sets the EdgeColor for this slider control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color ControlEdgeColour { get; set; }
Public Property ControlEdgeColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.ControlEdgeColour"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace