Grasshopper SDK
GH_GripSide Enumeration
 Enumerates the possible types of colour-in/colour-out behaviours of Gradient Grips.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_GripSide
Public Enumeration GH_GripSide
Members
Member name | Value | Description
Both | 0
Left | 1
Right | 2
See Also
Reference
Grasshopper.GUI.Gradient Namespace