Grasshopper SDK
GH_Param<T>.Render_AppendGeometry Method
 This function can be used to iterate over all items in the Volatile data tree and call AppendRenderGeometry on each item that implements IGH_RenderAwareData.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void Render_AppendGeometry(
	GH_RenderArgs args
)
Protected Sub Render_AppendGeometry (
	args As GH_RenderArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_RenderArgs
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace