Grasshopper SDK
GH_Point Constructor (Guid)
Initializes a new instance of the GH_Point class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Point(
	Guid rh_obj_id
)
Public Sub New (
	rh_obj_id As Guid
)
Parameters
rh_obj_id
Type: System.Guid
See Also
Reference
GH_Point Class
GH_Point Overload
Grasshopper.Kernel.Types Namespace