Grasshopper SDK
GH_ParserSymbol.m_level Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ParserPrecedence m_level
Public m_level As GH_ParserPrecedence
Field Value
Type: GH_ParserPrecedence
See Also
Reference
GH_ParserSymbol Class
Grasshopper.Kernel.Expressions Namespace