Grasshopper SDK
GH_Document.FindAttributeByGrip Method (PointF, Boolean, Boolean, Boolean, Int32)
 Search for attributes that contain grips near the search locus
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Attributes FindAttributeByGrip(
	PointF pt,
	bool bLimitToOutside,
	bool bIncludeInputs,
	bool bIncludeOutputs,
	int SearchRadius = 12
)
Public Function FindAttributeByGrip (
	pt As PointF,
	bLimitToOutside As Boolean,
	bIncludeInputs As Boolean,
	bIncludeOutputs As Boolean,
	Optional SearchRadius As Integer = 12
) As IGH_Attributes
Parameters
pt
Type: System.Drawing.PointF
Pixel for search start
bLimitToOutside
Type: System.Boolean
If true, grips are ignored if the pt is on the 'inside' side.
bIncludeInputs
Type: System.Boolean
bIncludeOutputs
Type: System.Boolean
SearchRadius (Optional)
Type: System.Int32
Radius of search
Return Value
Type: IGH_Attributes
See Also
Reference
GH_Document Class
FindAttributeByGrip Overload
Grasshopper.Kernel Namespace