Grasshopper SDK
GH_Theme.Objects Property
 Gets the theme objects and ZUI settings.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ObjectSettings Objects { get; }
Public ReadOnly Property Objects As GH_ObjectSettings
	Get
Property Value
Type: GH_ObjectSettings
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_Theme.Objects"]
See Also
Reference
GH_Theme Class
Grasshopper.GUI.Theme Namespace