Grasshopper SDK
Instances.InvalidateCanvas Method
 Invalidates the currently active Grasshopper Canvas, causing a redraw sometime in the foreseeable future.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void InvalidateCanvas()
Public Shared Sub InvalidateCanvas
See Also
Reference
Instances Class
Grasshopper Namespace