Grasshopper SDK
CentralSettings.PreviewPointStyleChanged Event
 Raised whenever the PreviewPointStyle setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.PreviewPointStyleChangedEventHandler PreviewPointStyleChanged
Public Shared Event PreviewPointStyleChanged As CentralSettings.PreviewPointStyleChangedEventHandler
Value
Type: Grasshopper.CentralSettings.PreviewPointStyleChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace