Grasshopper SDK
GH_LoadingAttribute Class
 Assembly loading behaviour attribute.
Inheritance Hierarchy
System.Object
 System.Attribute
 Grasshopper.Kernel.GH_LoadingAttribute
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_LoadingAttribute : Attribute
Public Class GH_LoadingAttribute
	Inherits Attribute
The GH_LoadingAttribute type exposes the following members.
Constructors
Name | Description
GH_LoadingAttribute
Initializes a new instance of the GH_LoadingAttribute class
Top
See Also
Reference
Grasshopper.Kernel Namespace