Grasshopper SDK
GH_PreviewArgs.DefaultCurveThickness Property
 Gets the curve thickness as defined by the viewport display scheme.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int DefaultCurveThickness { get; }
Public ReadOnly Property DefaultCurveThickness As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewArgs.DefaultCurveThickness"]
Implements
IGH_PreviewArgs.DefaultCurveThickness
See Also
Reference
GH_PreviewArgs Class
Grasshopper.Kernel Namespace