Grasshopper SDK
Instances.IsDocumentEditor Property
 Gets whether the Document Editor has been set.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsDocumentEditor { get; }
Public Shared ReadOnly Property IsDocumentEditor As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Instances.IsDocumentEditor"]
See Also
Reference
Instances Class
Grasshopper Namespace