Grasshopper SDK
GH_Component.Message Property
 Gets or sets a custom message to be displayed underneath the component. This message is not serialized and should be assigned on every solution anew.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Message { get; set; }
Public Property Message As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.Message"]
Implements
IGH_Component.Message
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace