Grasshopper SDK
IGH_InstanceDescription.InstanceGuid Property
 Gets the ID of this runtime instance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid InstanceGuid { get; }
ReadOnly Property InstanceGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_InstanceDescription.InstanceGuid"]
See Also
Reference
IGH_InstanceDescription Interface
Grasshopper.Kernel Namespace