Grasshopper SDK
GH_Convert.ToRectangle3d_Secondary Method
 Attempts to convert other data types into a Rectangle3d. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToRectangle3d_Secondary(
	Object data,
	ref Rectangle3d rc
)
Public Shared Function ToRectangle3d_Secondary (
	data As Object,
	ByRef rc As Rectangle3d
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Rectangle3d
Return Value
Type: Boolean
A Rectangle3d instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace