Grasshopper SDK
GH_BezierSolver Class
 Class for evaluating four-point bezier curves as used in GDI+
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_BezierSolver
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_BezierSolver
Public Class GH_BezierSolver
The GH_BezierSolver type exposes the following members.
Constructors
Name | Description
GH_BezierSolver
Initializes a new instance of the GH_BezierSolver class
Top
Methods
Name | Description
AngleAt
 Evaluate the tangent angle of a Bezier span.
PointAt
 Evaluate a Bezier span.
TangentAt
 Evaluate the tangent vector of a Bezier span.
Top
See Also
Reference
Grasshopper.GUI Namespace