Grasshopper SDK
GH_BezierSolver.PointAt Method
 Evaluate a Bezier span.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static PointF PointAt(
	ref PointF P0,
	ref PointF P1,
	ref PointF P2,
	ref PointF P3,
	float t
)
Public Shared Function PointAt (
	ByRef P0 As PointF,
	ByRef P1 As PointF,
	ByRef P2 As PointF,
	ByRef P3 As PointF,
	t As Single
) As PointF
Parameters
P0
Type: System.Drawing.PointF
Start point of bezier.
P1
Type: System.Drawing.PointF
Point for start tangent.
P2
Type: System.Drawing.PointF
Point for end tangent.
P3
Type: System.Drawing.PointF
End point of bezier.
t
Type: System.Single
Unit parameter.
Return Value
Type: PointF
See Also
Reference
GH_BezierSolver Class
Grasshopper.GUI Namespace