Grasshopper SDK
GH_Variant._Int Property
 Gets the contents of this Variant as an integer.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int _Int { get; }
Public ReadOnly Property _Int As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_Variant._Int"]
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace