Grasshopper SDK
GH_Time.DuplicateDateTime Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Time DuplicateDateTime()
Public Function DuplicateDateTime As GH_Time
Return Value
Type: GH_Time
See Also
Reference
GH_Time Class
Grasshopper.Kernel.Types Namespace