Grasshopper SDK
IGH_CanvasValidator.CanNavigateCanvas Method
 Validates whether the canvas can be navigated (panning, zooming etc)
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool CanNavigateCanvas()
Function CanNavigateCanvas As Boolean
Return Value
Type: Boolean
See Also
Reference
IGH_CanvasValidator Interface
Grasshopper.GUI.Canvas Namespace