Grasshopper SDK
GH_FadeAnimation Constructor
 Creates a new instance of the Animator class with default settings.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_FadeAnimation()
Public Sub New
See Also
Reference
GH_FadeAnimation Class
GH_FadeAnimation Overload
Grasshopper.GUI Namespace