Grasshopper SDK
IGH_ObjectProxy.Obsolete Property
 Gets whether this proxy represents an obsolete object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool Obsolete { get; }
ReadOnly Property Obsolete As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ObjectProxy.Obsolete"]
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace