Grasshopper SDK
GH_MaterialPreviewControl.Colour Property
 Gets or sets the colour of this preview.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Colour { get; set; }
Public Property Colour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MaterialPreviewControl.Colour"]
See Also
Reference
GH_MaterialPreviewControl Class
Grasshopper.GUI Namespace