Grasshopper SDK
GH_Convert.ToArc_Secondary Method
 Attempts to convert other data types into an OnArc. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToArc_Secondary(
	Object data,
	ref Arc rc
)
Public Shared Function ToArc_Secondary (
	data As Object,
	ByRef rc As Arc
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Arc
Return Value
Type: Boolean
An OnArc instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace