Grasshopper SDK
GH_CanvasDocumentChangedEventArgs.OldDocument Property
 Gets the document which was previously loaded into the canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document OldDocument { get; }
Public ReadOnly Property OldDocument As GH_Document
	Get
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasDocumentChangedEventArgs.OldDocument"]
See Also
Reference
GH_CanvasDocumentChangedEventArgs Class
Grasshopper.GUI.Canvas Namespace