Grasshopper SDK
GH_CanvasDropTargetValidator.CanCreateObject Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CanCreateObject(
	Guid id,
	PointF pt
)
Public Overrides Function CanCreateObject (
	id As Guid,
	pt As PointF
) As Boolean
Parameters
id
Type: System.Guid
pt
Type: System.Drawing.PointF
Return Value
Type: Boolean
See Also
Reference
GH_CanvasDropTargetValidator Class
Grasshopper.GUI.Canvas Namespace