Grasshopper SDK
GH_Structure<T>.ClearData Method
 Removes all data from all paths without affecting the structure topology.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearData()
Public Sub ClearData
Implements
IGH_Structure.ClearData()
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace