Grasshopper SDK
IGH_TooltipAwareObject Interface
 Implement this interface if you want your object to participate in Grasshopper Canvas tooltips.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_TooltipAwareObject
Public Interface IGH_TooltipAwareObject
The IGH_TooltipAwareObject type exposes the following members.
Properties
Name | Description
TooltipEnabled
 Gets the tooltip enabled value. If False, no further tooltip functions will be called.
Top
Methods
Name | Description
IsTooltipRegion
 Determine whether the specified pixel should result in a tooltip when the cursor hovers over it.
SetupTooltip
 This function is called when a tooltip it about to be displayed.
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace