Grasshopper SDK
GH_Theme.SaveTheme Method
 Store all palette and gui defaults. This function writes the colour values out to grasshopper_gui.xml settings database.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SaveTheme()
Public Sub SaveTheme
See Also
Reference
GH_Theme Class
Grasshopper.GUI.Theme Namespace