Grasshopper SDK
GH_Border.Topology Property
 Gets the type of border.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_BorderTopology Topology { get; }
Public ReadOnly Property Topology As GH_BorderTopology
	Get
Property Value
Type: GH_BorderTopology
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Border.Topology"]
See Also
Reference
GH_Border Class
Grasshopper.GUI.Canvas Namespace