Grasshopper SDK
GH_Goo<T>.Duplicate Method
 Make a complete duplicate of this instance. No shallow copies.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract IGH_Goo Duplicate()
Public MustOverride Function Duplicate As IGH_Goo
Return Value
Type: IGH_Goo
Implements
IGH_Goo.Duplicate()
Remarks
Classes which implement this interface should also provide type specific Duplicate methods
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace