Grasshopper SDK
GH_Component.IsBakeCapable Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool IsBakeCapable { get; }
Public Overridable ReadOnly Property IsBakeCapable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.IsBakeCapable"]
Implements
IGH_BakeAwareObject.IsBakeCapable
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace