Grasshopper SDK
GH_Format.FormatFilePath Method (String, Int32)
 Format a filepath so that it doesn't exceed a string length. If the filepath filename is already longer than maxLength it will be returned intact.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatFilePath(
	string path,
	int maxLength
)
Public Shared Function FormatFilePath (
	path As String,
	maxLength As Integer
) As String
Parameters
path
Type: System.String
Path for format.
maxLength
Type: System.Int32
Maximum number of characters to use.
Return Value
Type: String
The formatted path.
See Also
Reference
GH_Format Class
FormatFilePath Overload
Grasshopper.Kernel Namespace