Grasshopper SDK
GH_DocumentObject.Menu_MoveItem Method (ToolStripItem, String[])
 Utility function for moving menu items.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool Menu_MoveItem(
	ToolStripItem item,
	params string[] precedingItems
)
Public Shared Function Menu_MoveItem (
	item As ToolStripItem,
	ParamArray precedingItems As String()
) As Boolean
Parameters
item
Type: System.Windows.Forms.ToolStripItem
Item to move, it must already be part of a dropdown menu.
precedingItems
Type: System.String[]
Names of preceding items, the item will be inserted below the first name, if that fails the second, etc. etc.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentObject Class
Menu_MoveItem Overload
Grasshopper.Kernel Namespace