Grasshopper SDK
GH_Document.UndoStateChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void UndoStateChangedEventHandler(
	Object sender,
	GH_DocUndoEventArgs e
)
Public Delegate Sub UndoStateChangedEventHandler (
	sender As Object,
	e As GH_DocUndoEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_DocUndoEventArgs
See Also
Reference
Grasshopper.Kernel Namespace