Grasshopper SDK
GH_WireAction Class
 Records any change to the input wires of a given parameter.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.Actions.GH_WireAction
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_WireAction : GH_UndoAction
Public Class GH_WireAction
	Inherits GH_UndoAction
The GH_WireAction type exposes the following members.
Constructors
Name | Description
GH_WireAction
Initializes a new instance of the GH_WireAction class
Top
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
Methods
Name | Description
Internal_Redo |  (Overrides GH_UndoAction.Internal_Redo(GH_Document).)
Internal_Undo |  (Overrides GH_UndoAction.Internal_Undo(GH_Document).)
Top
See Also
Reference
Grasshopper.Kernel.Undo.Actions Namespace