Grasshopper SDK
GH_Attributes<T>.Selected Property
 Gets or sets the selected state of the top-level attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool Selected { get; set; }
Public Overridable Property Selected As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.Selected"]
Implements
IGH_Attributes.Selected
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace