Grasshopper SDK
GH_Attributes<T>.IsPickRegion Method (RectangleF, GH_PickBox)
 Determines whether a rectangle is a valid pick region for this object. By default, the picking rectangle is intersected with the Bounds rectangle.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool IsPickRegion(
	RectangleF box,
	GH_PickBox method
)
Public Overridable Function IsPickRegion (
	box As RectangleF,
	method As GH_PickBox
) As Boolean
Parameters
box
Type: System.Drawing.RectangleF
Selection box.
method
Type: Grasshopper.Kernel.GH_PickBox
Selection method.
Return Value
Type: Boolean
Implements
IGH_Attributes.IsPickRegion(RectangleF, GH_PickBox)
See Also
Reference
GH_Attributes<T> Class
IsPickRegion Overload
Grasshopper.Kernel Namespace