Grasshopper SDK
GH_SolutionSpan.EndTime Property
 Gets the time at which this solution was finished.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime EndTime { get; }
Public ReadOnly Property EndTime As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_SolutionSpan.EndTime"]
See Also
Reference
GH_SolutionSpan Structure
Grasshopper.Kernel Namespace