Grasshopper SDK
GH_PluginUtil.BringRhinoToTop Method
 Bring the Rhino window to the top of the stack.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void BringRhinoToTop()
Public Shared Sub BringRhinoToTop
See Also
Reference
GH_PluginUtil Class
Grasshopper.Plugin Namespace