Grasshopper SDK
GH_GeometricFont.Draw8 Method
 Draw the geometric character '8' at the specified location.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void Draw8(
	Graphics graphics,
	Color colour,
	PointF position
)
Public Shared Sub Draw8 (
	graphics As Graphics,
	colour As Color,
	position As PointF
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
colour
Type: System.Drawing.Color
Colour of character.
position
Type: System.Drawing.PointF
Location of character.
See Also
Reference
GH_GeometricFont Class
Grasshopper.GUI Namespace