Grasshopper SDK
GH_SliderBase.GripTextPure Property
 Gets the text format of the number of this slider value.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string GripTextPure { get; }
Public ReadOnly Property GripTextPure As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.GripTextPure"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace