Grasshopper SDK
GH_Canvas.CanvasPrePaintGroups Event
 Raised before group drawing starts.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPrePaintGroupsEventHandler CanvasPrePaintGroups
Public Event CanvasPrePaintGroups As GH_Canvas.CanvasPrePaintGroupsEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPrePaintGroupsEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace