Grasshopper SDK
GH_DisplayExpiredEventArgs.m_redraw Field
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected bool m_redraw
Protected m_redraw As Boolean
Field Value
Type: Boolean
See Also
Reference
GH_DisplayExpiredEventArgs Class
Grasshopper.Kernel Namespace