Grasshopper SDK
Instances.DocumentAssociationServer Property
 Gets the Document Association Server instance cached by the Instance Server. The Document Association Server will be instantiated the first time this property accessed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_DocumentAssociations DocumentAssociationServer { get; }
Public Shared ReadOnly Property DocumentAssociationServer As GH_DocumentAssociations
	Get
Property Value
Type: GH_DocumentAssociations
[Missing <value> documentation for "P:Grasshopper.Instances.DocumentAssociationServer"]
See Also
Reference
Instances Class
Grasshopper Namespace