Grasshopper SDK
GH_IndexRange.IsValid Property
 Gets whether this range is valid.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_IndexRange.IsValid"]
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace