Grasshopper SDK
GH_Canvas.StopAutoPan Method
 Stop the auto-panning timer.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void StopAutoPan()
Public Sub StopAutoPan
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace