Grasshopper SDK
GH_Brep Constructor (Brep)
Initializes a new instance of the GH_Brep class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Brep(
	Brep brep
)
Public Sub New (
	brep As Brep
)
Parameters
brep
Type: Brep
See Also
Reference
GH_Brep Class
GH_Brep Overload
Grasshopper.Kernel.Types Namespace