Grasshopper SDK
GH_DragInfo Constructor
 Create a new DragInfo instance.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DragInfo(
	Point drag_point,
	Rectangle initial_shape
)
Public Sub New (
	drag_point As Point,
	initial_shape As Rectangle
)
Parameters
drag_point
Type: System.Drawing.Point
Start point of drag op.
initial_shape
Type: System.Drawing.Rectangle
Initial shape associated with drag op.
See Also
Reference
GH_DragInfo Class
Grasshopper.GUI Namespace