Grasshopper SDK
GH_TooltipComponent.Enabled Property
 Gets or sets the Enabled flag.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipComponent.Enabled"]
See Also
Reference
GH_TooltipComponent Class
Grasshopper.GUI Namespace