Grasshopper SDK
GH_RuntimeFile.TagInclude Field
 String tag used to signal whether inclusion of a topic is allowed.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagInclude = "INCLUDE"
Public Const TagInclude As String = "INCLUDE"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace