Grasshopper SDK
UVInterval.U0 Property
 Gets or sets the T0 value of the U domain.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double U0 { get; set; }
Public Property U0 As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.UVInterval.U0"]
See Also
Reference
UVInterval Structure
Grasshopper.Kernel.Types Namespace