Grasshopper SDK
GH_MeshingParameters.DuplicateMesherSettings Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MeshingParameters DuplicateMesherSettings()
Public Function DuplicateMesherSettings As GH_MeshingParameters
Return Value
Type: GH_MeshingParameters
See Also
Reference
GH_MeshingParameters Class
Grasshopper.Kernel.Types Namespace