Grasshopper SDK
GH_Component.GH_OutputParamManager.Param Property
 Gets the output parameter at the given index.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IGH_Param this[
	int index
] { get; }
Public Overrides ReadOnly Default Property Param (
	index As Integer
) As IGH_Param
	Get
Parameters
index
Type: System.Int32
Property Value
Type: IGH_Param
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Param(System.Int32)"]
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace