Grasshopper SDK
GH_Component.RegisterInputParams Method
 Declare all your input parameters here.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected abstract void RegisterInputParams(
	GH_Component.GH_InputParamManager pManager
)
Protected MustOverride Sub RegisterInputParams (
	pManager As GH_Component.GH_InputParamManager
)
Parameters
pManager
Type: Grasshopper.Kernel.GH_Component.GH_InputParamManager
Use the pManager to register new parameters. pManager is never null.
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace