Grasshopper SDK
GH_FormShepard.RegisterForm Method
 Add a sheep form to the flock. This form will be affected by the location and size of the main form.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RegisterForm(
	Form dialog
)
Public Sub RegisterForm (
	dialog As Form
)
Parameters
dialog
Type: System.Windows.Forms.Form
Form to add.
See Also
Reference
GH_FormShepard Class
Grasshopper.GUI Namespace