Grasshopper SDK
DataTree<T>.Item Property
 Gets or set the data item at the specified path and index.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public T this[
	GH_Path path,
	int index
] { get; set; }
Public Default Property Item (
	path As GH_Path,
	index As Integer
) As T
	Get
	Set
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path of the data branch to retrieve. Path must be defined in the tree.
index
Type: System.Int32
Index of item to retrieve. Index must be defined in the branch.
Property Value
Type: T
[Missing <value> documentation for "P:Grasshopper.DataTree`1.Item(Grasshopper.Kernel.Data.GH_Path,System.Int32)"]
Exceptions
Exception | Condition
NullReferenceException | Thrown if the path doesn't exist.
IndexOutOfRangeException | Thrown if the index does not exist within the path list.
See Also
Reference
DataTree<T> Class
Grasshopper Namespace