Grasshopper SDK
GH_Document.GH_UndoUtil.CreateRemoveObjectEvent Method (String, IEnumerable<IGH_DocumentObject>)
 Create a new undo record for a bunch of object removals.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoRecord CreateRemoveObjectEvent(
	string name,
	IEnumerable<IGH_DocumentObject> objs
)
Public Function CreateRemoveObjectEvent (
	name As String,
	objs As IEnumerable(Of IGH_DocumentObject)
) As GH_UndoRecord
Parameters
name
Type: System.String
Name of undo record.
objs
Type: System.Collections.Generic.IEnumerable<IGH_DocumentObject>
Objects to be removed.
Return Value
Type: GH_UndoRecord
A newly created undo record.
See Also
Reference
GH_Document.GH_UndoUtil Class
CreateRemoveObjectEvent Overload
Grasshopper.Kernel Namespace