Grasshopper SDK
GH_DocObjectEventArgs.Objects Property
 Gets a readonly list of the objects to which this event pertains.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public ReadOnlyCollection<IGH_DocumentObject> Objects { get; }
Public ReadOnly Property Objects As ReadOnlyCollection(Of IGH_DocumentObject)
	Get
Property Value
Type: ReadOnlyCollection<IGH_DocumentObject>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocObjectEventArgs.Objects"]
See Also
Reference
GH_DocObjectEventArgs Class
Grasshopper.Kernel Namespace