Grasshopper SDK
GH_Convert.ToGHCircle_Primary Method
 Converts similar data into a GH_Circle instance. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToGHCircle_Primary(
	Object data,
	ref GH_Circle target
)
Public Shared Function ToGHCircle_Primary (
	data As Object,
	ByRef target As GH_Circle
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_Circle
Target instance. If null, a new GH_Circle will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace