Grasshopper SDK
GH_GooProxy<T>.Construct Method
 Override this method to supply a custom UI during proxy construction.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void Construct()
Public Overridable Sub Construct
Implements
IGH_GooProxy.Construct()
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace