Grasshopper SDK
DataTree<T>.ClearData Method
 Removes all data from all branches without affecting the tree topology.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearData()
Public Sub ClearData
See Also
Reference
DataTree<T> Class
Grasshopper Namespace