Grasshopper SDK
GH_Param<T> Class
 Base implementation of IGH_Param. Derive from this class rather than implementing IGH_Param from scratch. If your parameter can store persistent data, derive from GH_PersistentParam(Of T) instead.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<T>
 Grasshopper.Kernel.GH_PersistentParam<T>
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_Param<T> : GH_ActiveObject,
	IGH_Param
where T : class, IGH_Goo
Public MustInherit Class GH_Param(Of T As {Class, IGH_Goo})
	Inherits GH_ActiveObject
	Implements IGH_Param
Type Parameters
T
Data type for this parameter.
The GH_Param<T> type exposes the following members.
Constructors
Name | Description
GH_Param<T>(IGH_InstanceDescription)
Initializes a new instance of the GH_Param<T> class
GH_Param<T>(IGH_InstanceDescription, GH_ParamAccess)
Initializes a new instance of the GH_Param<T> class
GH_Param<T>(String, String, String, String, String, GH_ParamAccess)
Initializes a new instance of the GH_Param<T> class
Top
Properties
Name | Description
Access
 Gets or sets the Access level for this parameter.
DataMapping
 Gets or sets the data mapping of this Parameter.
DataType
 Type is either Void if there are no sources or Remote. Derived classes should expand on this.
HasProxySources
 Gets a value indicating whether or not this parameter maintains proxy sources. Proxy sources are used during file IO, when actual sources might not be available yet. Once an IO operation has been completed there should be no more proxy sources.
InstanceDescription
 Gets the description of this instance. The default description is about the amount and source of the local values.
 (Overrides GH_InstanceDescription.InstanceDescription.)
IsDataProvider |  (Overrides GH_ActiveObject.IsDataProvider.)
IsPrincipal
 Gets whether this parameter is a principal parameter. Principal parameters are maintained by components and are not part of the IGH_Param interface.
Kind
 Gets the parameter kind. The kind is evaluated lazily and cached.
Optional
 Gets or sets whether or not this parameter is considered optional by the owner component. Empty, non-optional parameters prevent the component from being solved.
ProcessorTime |  (Overrides GH_ActiveObject.ProcessorTime.)
ProxySourceCount
 Gets the number of proxy sources for this parameter. Proxy sources are used during file IO, when actual sources might not be available yet. Once an IO operation has been completed there should be no more proxy sources.
Recipients
 Gets a list of all the recipients of this parameter. I.e. a recipient has this parameter as one of the sources. The Recipient list is maintained by the parameter, do not modify it yourself.
Reverse
 Gets or sets the data reverse modifier of this parameter.
Simplify
 Gets or sets the simplify modifier for this parameter.
SourceCount
 Gets the number of sources for this parameter.
Sources
 Gets a list of source parameters. Do not modify this list, if you wish to add or remove sources, use dedicated functions like AddSource() and RemoveSource() instead.
StateTags
 Gets all the StateTags that are associated with this parameter. A state tag is a visual feedback icon that represents specific internal settings.
Type
 Gets the Framework Type descriptor for the stored Data.
TypeName
 Calls TypeName() on the first instance of T it can find. This is either an item in the volatile list, or a newly constructed instance.
VolatileData
VolatileDataCount
WireDisplay
 Gets or sets the wire display style for this parameter. Wire display only affects the wires connected to the parameter input.
Top
Methods
Name | Description
AddSource(IGH_Param)
 Append a new Source parameter to the end of the Sources list. Sources provide this parameter with data at runtime.
AddSource(IGH_Param, Int32)
 Insert a new Source parameter into the Sources list. Sources provide this parameter with data at runtime.
AddVolatileData(GH_Path, Int32, Object)
 Inserts an item of volatile data into the data structure.
AddVolatileData(GH_Path, Int32, T)
AddVolatileDataList(GH_Path, List<T>)
AddVolatileDataList(GH_Path, IEnumerable)
AddVolatileDataTree(GH_Structure<T>)
AddVolatileDataTree(IGH_Structure)
AppendAdditionalMenuItems
 Override this function if you want to add specific items to the object context menu Default items already included in the menu toolstrip are: 1. Name 2. Preview 3. Warnings 4. Errors
 (Overrides GH_ActiveObject.AppendAdditionalMenuItems(ToolStripDropDown).)
Cast_Object
 Attempts to convert the Object reference into an instance of T. This method will perform a direct cast if possible or it will call Casting functions on T or Data if they exist. Data will not be duplicated unless a type conversion is required.
ClearData |  (Overrides GH_ActiveObject.ClearData().)
ClearProxySources
 Remove all proxy sources without attempting to relink them.
CollectData |  (Overrides GH_ActiveObject.CollectData().)
CollectVolatileData_Custom
 If a parameter has no sources, the CollectVolatileData_Custom() method is called. The basic implementation does nothing, but you can override this method to provide special data instantiation logic.
CollectVolatileData_FromSources
 This method collects volatile data from all the source parameters.
ComputeData |  (Overrides GH_ActiveObject.ComputeData().)
ConversionCallback
 This method is called whenever a successful conversion takes place from some source data into local target data. Override it if you wish to keep tabs on conversions.
CreateAttributes |  (Overrides GH_DocumentObject.CreateAttributes().)
CreateProxySources
 Convert all proper source parameters into proxy sources.
DependsOn |  (Overrides GH_ActiveObject.DependsOn(IGH_ActiveObject).)
ExpireDownStreamObjects |  (Overrides GH_ActiveObject.ExpireDownStreamObjects().)
Format
 Returns "Null" if the data is a null reference, otherwise calls ToString() on the Data instance.
InstantiateT
 Attempts to instantiate a new instance of T.
IsolateObject |  (Overrides GH_DocumentObject.IsolateObject().)
Menu_AppendDisconnectWires
Menu_AppendFlattenParameter
Menu_AppendGraftParameter
Menu_AppendPrincipalParameter
Menu_AppendReverseParameter
Menu_AppendSimplifyParameter
Menu_AppendWireDisplay
OnVolatileDataCollected
 Once volatile data has been collected this method will be calles. The basic implementation does nothing, but you can add code here to post-process or analyze the volatile data.
PreferredCast
 Implement this function if you're certain that you'll be confronted with very common casts. For example, GH_Point has a preferred cast from Rhino.Geometry.Point3d and GH_Number has a preferred cast from System.Double.
Preview_ComputeClippingBox
 This function can be used to iterate over all items in the Volatile data tree and collect the union clipping box of all non-null items that implement Preview.IGH_PreviewData. This function requires a lot of TypeOf and DirectCasting, so if you're worried about performance you should consider doing this yourself.
Preview_DrawMeshes
 This function can be used to iterate over all items in the Volatile data tree and call DrawViewportWires on each item that implements Preview.IGH_PreviewData. This function requires a lot of TypeOf and DirectCasting, so if you're worried about performance you should consider doing this yourself.
Preview_DrawWires
 This function can be used to iterate over all items in the Volatile data tree and call DrawViewportWires on each item that implements Preview.IGH_PreviewData. This function requires a lot of TypeOf and DirectCasting, so if you're worried about performance you should consider doing this yourself.
Read |  (Overrides GH_ActiveObject.Read(GH_IReader).)
RegisterRemoteIDsUtil
 Utility function which treats all data in the Volatile cache as IGH_GeometricGoo and registers all referenced objects. Call this function from within RegisterRemoteIDs() if you are absolutely sure that all the items in volatiledata implement IGH_GeometricGoo.
RelinkProxySources
 Attempt to replace all proxy sources with real sources. Proxy sources are used during file IO, when actual sources might not be available yet. Once an IO operation has been completed there should be no more proxy sources.
RemoveAllSources
 Remove all sources from this parameter.
RemoveEffects
 Remove all post-process effects. Note to implementors, you must call the base method if you override this function.
RemoveSource(Guid)
 Remove the specified source from this parameter.
RemoveSource(IGH_Param)
 Remove the specified source from this parameter.
Render_AppendGeometry
 This function can be used to iterate over all items in the Volatile data tree and call AppendRenderGeometry on each item that implements IGH_RenderAwareData.
ReplaceSource(Guid, IGH_Param)
 Replace an existing source with a new one. If the old_source does not exist in this parameter, nothing happens.
ReplaceSource(IGH_Param, IGH_Param)
 Replace an existing source with a new one. If the old_source does not exist in this parameter, nothing happens.
SetPrincipal
 Set the principal parameter state.
VolatileDataDescription
 This method is called to populate the Tooltip data description field.
Write |  (Overrides GH_ActiveObject.Write(GH_IWriter).)
Top
Events
Name | Description
Top
Fields
Name | Description
m_data
 Contains the runtime data for this parameter, also known as "Volatile" data.
Top
See Also
Reference
Grasshopper.Kernel Namespace