Grasshopper SDK
GH_Path.AppendElement Method
 Create a new path by appending a new index value to this path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Path AppendElement(
	int index
)
Public Function AppendElement (
	index As Integer
) As GH_Path
Parameters
index
Type: System.Int32
Index value to append.
Return Value
Type: GH_Path
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace