Grasshopper SDK
Node3d<T>.NearestItem Method (Double, Double, Double, Double, Double)
 Find the nearest item.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Index3d<T> NearestItem(
	double x,
	double y,
	double z,
	double minimumDistance,
	double maximumDistance
)
Public Function NearestItem (
	x As Double,
	y As Double,
	z As Double,
	minimumDistance As Double,
	maximumDistance As Double
) As Index3d(Of T)
Parameters
x
Type: System.Double
x coordinate to search from.
y
Type: System.Double
y coordinate to search from.
z
Type: System.Double
z coordinate to search from.
minimumDistance
Type: System.Double
Minimum distance for nearest item. Items closer than minimumDistance will be ignored.
maximumDistance
Type: System.Double
Maximum distance for nearest item. Items further than maximumDistance will be ignored.
Return Value
Type: Index3d<T>
The index of the nearest item or null if no nearest item could be found.
See Also
Reference
Node3d<T> Class
NearestItem Overload
Grasshopper.Kernel.Geometry.SpatialTrees Namespace