Grasshopper SDK
IGH_ActiveObject.Phase Property
 Gets the solution phase in which this object is currently stuck.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_SolutionPhase Phase { get; set; }
Property Phase As GH_SolutionPhase
	Get
	Set
Property Value
Type: GH_SolutionPhase
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ActiveObject.Phase"]
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace