Grasshopper SDK
GH_Attributes<T>.RenderToCanvas Method
 Render these attributes into a Canvas control. This function places calls to PrepareForRender() and Render(), you should override those.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderToCanvas(
	GH_Canvas canvas,
	GH_CanvasChannel channel
)
Public Sub RenderToCanvas (
	canvas As GH_Canvas,
	channel As GH_CanvasChannel
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas to draw on.
channel
Type: Grasshopper.GUI.Canvas.GH_CanvasChannel
Current drawing channel.
Implements
IGH_Attributes.RenderToCanvas(GH_Canvas, GH_CanvasChannel)
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace