Grasshopper SDK
DataTree<T>.Branch Method (Int32[])
 Gets the list of data which belongs to a given Branch path.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<T> Branch(
	params int[] path
)
Public Function Branch (
	ParamArray path As Integer()
) As List(Of T)
Parameters
path
Type: System.Int32[]
Data path to retrieve.
Return Value
Type: List<T>
See Also
Reference
DataTree<T> Class
Branch Overload
Grasshopper Namespace