Grasshopper SDK
IGH_DocumentObject.PreviewExpired Event
 Raised whenever the display (in the Rhino viewports) of a certain object becomes invalid.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
event IGH_DocumentObject.PreviewExpiredEventHandler PreviewExpired
Event PreviewExpired As IGH_DocumentObject.PreviewExpiredEventHandler
Value
Type: Grasshopper.Kernel.IGH_DocumentObject.PreviewExpiredEventHandler
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace