Grasshopper SDK
GH_ObjectResponse Enumeration
 Lists the possible responses an object can give when confronted with a UI event.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ObjectResponse
Public Enumeration GH_ObjectResponse
Members
Member name | Value | Description
Ignore | 0 |  Event was ignored.
Capture | 1 |  Event caused the object to become active.
Release | 2 |  Object was active, but event caused object to become inactive.
Handled | 3 |  Something happened, but no capture is needed.
See Also
Reference
Grasshopper.GUI.Canvas Namespace