Grasshopper SDK
GH_SolutionEventArgs.EndTime Property
Note: This API is now obsolete.
 Gets the time when the current solution completed. If the solution hasn't completed yet this field will be DateTime.MinValue.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("This property is obsolete")]
public DateTime EndTime { get; }
<ObsoleteAttribute("This property is obsolete")>
Public ReadOnly Property EndTime As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_SolutionEventArgs.EndTime"]
See Also
Reference
GH_SolutionEventArgs Class
Grasshopper.Kernel Namespace