Grasshopper SDK
GH_FontServer.ConsoleFamilyChanged Event
 Raised whenever the MonospacedFamily is changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_FontServer.ConsoleFamilyChangedEventHandler ConsoleFamilyChanged
Public Shared Event ConsoleFamilyChanged As GH_FontServer.ConsoleFamilyChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_FontServer.ConsoleFamilyChangedEventHandler
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace