Grasshopper SDK
Index3d<T> Constructor
Initializes a new instance of the Index3d<T> class
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Index3d(
	Node3d<T> node,
	int nodeIndex
)
Public Sub New (
	node As Node3d(Of T),
	nodeIndex As Integer
)
Parameters
node
Type: Grasshopper.Kernel.Geometry.SpatialTrees.Node3d<T>
nodeIndex
Type: System.Int32
See Also
Reference
Index3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace