Grasshopper SDK
GH_Convert.ToCurve_Secondary Method
 Attempts to convert other data types into an IOnCurve. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToCurve_Secondary(
	Object data,
	ref Curve rc
)
Public Shared Function ToCurve_Secondary (
	data As Object,
	ByRef rc As Curve
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
rc
Type: Curve
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace