Grasshopper SDK
GH_StringMismatchException Constructor (String)
Initializes a new instance of the GH_StringMismatchException class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_StringMismatchException(
	string message
)
Public Sub New (
	message As String
)
Parameters
message
Type: System.String
See Also
Reference
GH_StringMismatchException Class
GH_StringMismatchException Overload
Grasshopper.Kernel.Data Namespace