Grasshopper SDK
CentralSettings Class
 Represents a collection of program wide settings and events for when those settings change. This should probably be the bottleneck for all program wide settings, but stuff is still littered about for now.
Inheritance Hierarchy
System.Object
 Grasshopper.CentralSettings
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class CentralSettings
Public NotInheritable Class CentralSettings
The CentralSettings type exposes the following members.
Properties
Name | Description
AuthorAddress
 Gets or sets the default author address to be used for all data generated by this Grasshopper installation.
AuthorCompany
 Gets or sets the default author company to be used for all data generated by this Grasshopper installation.
AuthorCopyright
 Gets or sets the default author copyright to be used for all data generated by this Grasshopper installation.
AuthorCopyrightFormatted
 Gets the authorCopyright message formatted to match the current date.
AuthorDetails
 Gets a new GH_AuthorDetails instance populated with the current settings. Changing this instance does not affect the settings.
AuthorEMail
 Gets or sets the default author e-mail to be used for all data generated by this Grasshopper installation.
AuthorName
 Gets or sets the default author name to be used for all data generated by this Grasshopper installation.
AuthorPhone
 Gets or sets the default author phone to be used for all data generated by this Grasshopper installation.
AuthorWebsite
 Gets or sets the default author website to be used for all data generated by this Grasshopper installation.
CanvasFancyWires
 Gets or sets whether or not fancy wires will be drawn. This is a global setting.
CanvasFullNames
 Gets or sets the global default for verbose UI. When CanvasFullNames=True, parameter nicknames are set to their actual (long) names upon addition.
CanvasObjectIcons
 Gets or sets the global default for icon display.
CanvasObsoleteTags
 Gets or sets the global default for obsolete tags.
CanvasRadialMenu
 Gets or sets the global default for whether the canvas should use Radial or olds-kool menus.
CanvasZuiZoomLevel
 Gets or sets the global Zui zoom threshold.
ComponentCascadeMenus
 Gets or sets whether Grasshopper document solutions are wrapped in undo records.
CreateSolutionUndoRecord
 Gets or sets whether Grasshopper document solutions are wrapped in undo records.
FormatDecimalDigits
 Gets or sets how many digits ought to be used for decimal formatted numbers.
FormatENotationDigits
 Gets or sets how many digits ought to be used for scientific notation formatted numbers.
FormatENotationLowerLimit
 Gets or sets at what power of ten decimal formatting of numbers switches to E notation for small numbers.
FormatENotationLowerThreshold
 Gets at what actual threshold numeric formatting switches from decimal to E-Notation.
FormatENotationUpperLimit
 Gets or sets at what power of ten decimal formatting of numbers switches to E notation for large numbers.
FormatENotationUpperThreshold
 Gets at what actual threshold numeric formatting switches from decimal to E-Notation.
FormatMultiplesOfOne
 Gets or sets whether floating point numbers close to whole integers should be special cased.
FormatMultiplesOfPi
 Gets or sets whether multiples of 0.5*Pi ought to be special cased.
IsTemplateFile
 Gets whether a template file has been defined and whether that file ectually exists.
PreviewBumpZBuffer
 Gets or sets whether the Document preview bumps the Z-Buffer. Setting this value automatically causes a redraw of the Rhino viewports.
PreviewGumballs
 Gets or sets whether the gumballs will be visible for selected preview geometry.
PreviewMeshEdges
 Gets or sets the Mesh Wire display flag.
PreviewPlaneRadius
 Gets or sets the global Plane radius.
PreviewPointStyle
 Gets or sets the point style for Grasshopper preview points.
PruderyLevel
 Gets or sets the Grasshopper UI prudery level.
RibbonDrawTabIcons
 Gets or sets whether tab icons are drawn for the ribbon.
RibbonSeparators
 Gets or sets whether there are separators between different exposures on the component Ribbon.
RibbonShowObscure
 Gets or sets a value indicating whether components marked with DropDown exposure are drawn on the main toolbar anyway.
RibbonVisible
 Gets or sets a value indicating whether components marked with DropDown exposure are drawn on the main toolbar anyway.
TemplateFile
 Gets or sets the template file path. Use String.Empty or Nothing to disable the template file.
TooltipWiggleRadius
 Gets or sets the wiggle radius (in pixels) which the mouse is allowed to move before the tooltip is nuked.
Top
Methods
Name | Description
GetLoadMechanism
 Gets what load mechanism has been specified for a certain plugin.
IsLoadProtected
 Gets whether a certain plugin is load protected.
SetLoadMechanism
 Sets the user defined load mechanism for a certain plugin.
SetLoadProtected
 Sets whether a certain plugin is load protected.
Top
Events
Name | Description
AuthorAddressChanged
 Raised whenever the AuthorAddress field is changed.
AuthorCompanyChanged
 Raised whenever the AuthorCompany field is changed.
AuthorCopyrightChanged
 Raised whenever the AuthorCopyright field is changed.
AuthorEMailChanged
 Raised whenever the AuthorEMail field is changed.
AuthorNameChanged
 Raised whenever the AuthorName field is changed.
AuthorPhoneChanged
 Raised whenever the AuthorPhone field is changed.
AuthorWebsiteChanged
 Raised whenever the AuthorWebsite field is changed.
CanvasFancyWiresChanged
 Raised whenever the CanvasFancyWires setting changes.
CanvasFullNamesChanged
 Raised whenever the CanvasFullNames setting changes.
CanvasObjectIconsChanged
 Raised whenever the CanvasObjectIcons setting changes.
CanvasObsoleteTagsChanged
 Raised whenever the CanvasObsoleteTags setting changes.
CanvasRadialMenuChanged
 Raised whenever the CanvasRadialMenu setting changes.
CanvasZuiZoomLevelChanged
 Raised whenever the CanvasZuiZoomLevel setting changes.
ComponentCascadeMenusChanged
 Raised whenever the ComponentCascadeMenus setting changes.
CreateSolutionUndoRecordChanged
 Raised whenever the CreateSolutionUndoRecord setting changes.
FormattingChanged
 Raised whenever a formatting setting is changed.
LoadMechanismChanged
 Raised whenever the load mechanism of a certain plugin changes.
LoadProtectionChanged
 Raised whenever the load protection of a certain plugin changes.
PreviewBumpZBufferChanged
 Raised whenever the PreviewBumpZBuffer setting changes.
PreviewGumballsChanged
 Raised whenever the PreviewGumballs setting changes.
PreviewMeshEdgesChanged
 Raised whenever the PreviewMeshEdges setting changes.
PreviewPlaneRadiusChanged
 Raised whenever the PreviewPlaneRadius setting changes.
PreviewPointStyleChanged
 Raised whenever the PreviewPointStyle setting changes.
PruderyLevelChanged
 Raised whenever the PruderyLevel setting changes.
RibbonAllIconsChanged
 Raised whenever the RibbonAllIcons setting changes.
RibbonDrawTabIconsChanged
 Raised whenever the RibbonDrawTabIcons setting changes.
RibbonSeparatorsChanged
 Raised whenever the RibbonSeparators setting changes.
RibbonVisibleChanged
 Raised whenever the RibbonVisible setting changes.
TemplateFileChanged
 Raised whenever the TemplateFile property is changed.
TooltipWiggleRadiusChanged
 Raised whenever the TooltipWiggleRadius setting changes.
UiScaleChanged
 Raised whenever the UiScale setting changes.
Top
See Also
Reference
Grasshopper Namespace