Grasshopper SDK
IGH_InstanceDescription.NewInstanceGuid Method (Guid)
 Set the instance ID to be a specific GUID. This is very dangerous, only use this function if you're 6"4' and called David.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void NewInstanceGuid(
	Guid UUID
)
Sub NewInstanceGuid (
	UUID As Guid
)
Parameters
UUID
Type: System.Guid
See Also
Reference
IGH_InstanceDescription Interface
NewInstanceGuid Overload
Grasshopper.Kernel Namespace