Grasshopper SDK
GH_SliderBase.DrawControlBackground Property
 Gets or sets whether the background of the slider should be drawn.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DrawControlBackground { get; set; }
Public Property DrawControlBackground As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.DrawControlBackground"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace