Grasshopper SDK
GH_Document.FindComponent Method (Guid)
 Search for components using an ID filter
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Component FindComponent(
	Guid id
)
Public Function FindComponent (
	id As Guid
) As IGH_Component
Parameters
id
Type: System.Guid
ID to search for
Return Value
Type: IGH_Component
The component with the ID, or Null if no component could be found
Remarks
See Also
Reference
GH_Document Class
FindComponent Overload
Grasshopper.Kernel Namespace