Grasshopper SDK
GH_RenderArgs Constructor
 Create new render arguments.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RenderArgs(
	RhinoDoc doc,
	ViewportInfo vp,
	RenderPrimitiveList geometry,
	Guid id,
	RenderMaterial matNormal,
	RenderMaterial matSelected
)
Public Sub New (
	doc As RhinoDoc,
	vp As ViewportInfo,
	geometry As RenderPrimitiveList,
	id As Guid,
	matNormal As RenderMaterial,
	matSelected As RenderMaterial
)
Parameters
doc
Type: RhinoDoc
Rhino document.
vp
Type: ViewportInfo
Viewport.
geometry
Type: RenderPrimitiveList
Geometry list.
id
Type: System.Guid
Render plugin id.
matNormal
Type: RenderMaterial
Material for unselected objects.
matSelected
Type: RenderMaterial
Material for selected objects.
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace