Grasshopper SDK
GH_ResizeBorder.Anchor Property
 Gets or sets the anchor point for sizing operations. This point is determined automatically when you call Setup(), however you can alter it afterwards if you want.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF Anchor { get; set; }
Public Property Anchor As PointF
	Get
	Set
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_ResizeBorder.Anchor"]
See Also
Reference
GH_ResizeBorder Class
Grasshopper.GUI.Canvas Namespace