Grasshopper SDK
GH_UndoRecord.State Property
 Gets the undo state of this record. The state dictates which action are legal.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoState State { get; }
Public ReadOnly Property State As GH_UndoState
	Get
Property Value
Type: GH_UndoState
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoRecord.State"]
See Also
Reference
GH_UndoRecord Class
Grasshopper.Kernel.Undo Namespace