Grasshopper SDK
GH_Convert.ToPoint3d_Primary Method
 Performs a direct cast from On3dPoint or GH_Point. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToPoint3d_Primary(
	Object data,
	ref Point3d rc
)
Public Shared Function ToPoint3d_Primary (
	data As Object,
	ByRef rc As Point3d
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Point3d
Return Value
Type: Boolean
An On3dPoint instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace