Grasshopper SDK
GH_CanvasMouseEvent.WinFormsEventArgs Property
 Downcast this data into a Windows.Forms.MouseEventArgs instance.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public MouseEventArgs WinFormsEventArgs { get; }
Public ReadOnly Property WinFormsEventArgs As MouseEventArgs
	Get
Property Value
Type: MouseEventArgs
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasMouseEvent.WinFormsEventArgs"]
See Also
Reference
GH_CanvasMouseEvent Class
Grasshopper.GUI Namespace