Grasshopper SDK
GH_DocumentServer.IndexOfAutoSave Method
 Gets the document index that is associated with the specified autosave location.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int IndexOfAutoSave(
	string autoSavePath
)
Public Function IndexOfAutoSave (
	autoSavePath As String
) As Integer
Parameters
autoSavePath
Type: System.String
The full path (directory, filename and extension) of the autosave file to test against.
Return Value
Type: Int32
The index of the document that matches the given autosave path or -1 if no document match is found.
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace