Grasshopper SDK
GH_FadeAnimation Constructor (Single, Int32)
 Create a new instance of the Animator class with custom values for zoom threshold and duration.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_FadeAnimation(
	float threshold,
	int duration
)
Public Sub New (
	threshold As Single,
	duration As Integer
)
Parameters
threshold
Type: System.Single
Zoom threshold at which the animation kicks in. The default is 2.0
duration
Type: System.Int32
The duration (in milliseconds) of the fade animation, the default is 350
See Also
Reference
GH_FadeAnimation Class
GH_FadeAnimation Overload
Grasshopper.GUI Namespace