Grasshopper SDK
GH_ComponentParamServer.GetEnumerator Method
 Gets a customized enumerator which iterates over all (both input and output) parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IEnumerator<IGH_Param> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of IGH_Param)
Return Value
Type: IEnumerator<IGH_Param>
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace