Grasshopper SDK
GH_Convert.CreatePureDate Method
 Convert a datetime structure into a pure date, i.e. remove the time portion. As per convention, this leaves 1 tick into the day in question intact.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static DateTime CreatePureDate(
	DateTime date
)
Public Shared Function CreatePureDate (
	date As DateTime
) As DateTime
Parameters
date
Type: System.DateTime
Return Value
Type: DateTime
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace