Grasshopper SDK
GH_Component.BakeGeometry Method (RhinoDoc, ObjectAttributes, List<Guid>)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void BakeGeometry(
	RhinoDoc doc,
	ObjectAttributes att,
	List<Guid> obj_ids
)
Public Overridable Sub BakeGeometry (
	doc As RhinoDoc,
	att As ObjectAttributes,
	obj_ids As List(Of Guid)
)
Parameters
doc
Type: RhinoDoc
att
Type: ObjectAttributes
obj_ids
Type: System.Collections.Generic.List<Guid>
Implements
IGH_BakeAwareObject.BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
See Also
Reference
GH_Component Class
BakeGeometry Overload
Grasshopper.Kernel Namespace