Grasshopper SDK
GH_Gradient Constructor
Initializes a new instance of the GH_Gradient class
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Gradient()
Public Sub New
See Also
Reference
GH_Gradient Class
GH_Gradient Overload
Grasshopper.GUI.Gradient Namespace