Grasshopper SDK
IGH_UserPromptAware Interface
 Implement this interface in your IGH_Param if you want to allow users to set data either through the menu or by double clicking.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_UserPromptAware
Public Interface IGH_UserPromptAware
The IGH_UserPromptAware type exposes the following members.
Methods
Name | Description
PromptMenuMultipleItems
 Create a menu item that will be inserted into the Parameter context menu for getting multiple values.
PromptMenuSingleItem
 Create a menu item that will be inserted into the Parameter context menu for getting single values.
PromptMultipleItems
 Get multiple items from the user.
PromptSingleItem
 Get a single item from the user.
Top
See Also
Reference
Grasshopper.Kernel Namespace