Grasshopper SDK
GH_State.Data Property (Guid)
 Gets the state data stored under the specified ID
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string this[
	Guid id
] { get; }
Public ReadOnly Default Property Data (
	id As Guid
) As String
	Get
Parameters
id
Type: System.Guid
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_State.Data(System.Guid)"]
See Also
Reference
GH_State Class
Data Overload
Grasshopper.Kernel Namespace