Grasshopper SDK
GH_DigitNumber.RadixIndex Property
 Gets the mapped radix.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int RadixIndex { get; }
Public ReadOnly Property RadixIndex As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitNumber.RadixIndex"]
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace