Grasshopper SDK
GH_UserObject.BaseGuid Property
 Gets or sets the ComponentID of the IGH_DocumentObject that functions as the base class for this User Object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid BaseGuid { get; set; }
Public Property BaseGuid As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_UserObject.BaseGuid"]
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace