Grasshopper SDK
GH_DocumentObject.Attributes Property
 Gets or sets the attributes that are associated with this object. Only set custom attributes if you know what you are doing.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Attributes Attributes { get; set; }
Public Property Attributes As IGH_Attributes
	Get
	Set
Property Value
Type: IGH_Attributes
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentObject.Attributes"]
Implements
IGH_DocumentObject.Attributes
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace