Grasshopper SDK
SliderSnapRange Constructor (Decimal, Decimal)
Initializes a new instance of the SliderSnapRange class
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public SliderSnapRange(
	decimal value0,
	decimal value1
)
Public Sub New (
	value0 As Decimal,
	value1 As Decimal
)
Parameters
value0
Type: System.Decimal
value1
Type: System.Decimal
See Also
Reference
SliderSnapRange Structure
SliderSnapRange Overload
Grasshopper.GUI.Base Namespace