Grasshopper SDK
GH_Structure<T>.DataItem Property (GH_Path, Int32)
 Gets a direct pointer to a data item under a specific path and index.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public T this[
	GH_Path path,
	int index
] { get; }
Public ReadOnly Property DataItem (
	path As GH_Path,
	index As Integer
) As T
	Get
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path of the data branch to retrieve.
index
Type: System.Int32
Index of item to retrieve.
Property Value
Type: T
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.DataItem(Grasshopper.Kernel.Data.GH_Path,System.Int32)"]
Exceptions
Exception | Condition
NullReferenceException | Thrown if the path doesn't exist.
IndexOutOfRangeException | Thrown if the index does not exist within the path list.
See Also
Reference
GH_Structure<T> Class
DataItem Overload
Grasshopper.Kernel.Data Namespace