Grasshopper SDK
GH_Canvas.InstantiateNewObject Method (Guid, PointF, Boolean)
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool InstantiateNewObject(
	Guid id,
	PointF at,
	bool update
)
Public Function InstantiateNewObject (
	id As Guid,
	at As PointF,
	update As Boolean
) As Boolean
Parameters
id
Type: System.Guid
at
Type: System.Drawing.PointF
update
Type: System.Boolean
Return Value
Type: Boolean
See Also
Reference
GH_Canvas Class
InstantiateNewObject Overload
Grasshopper.GUI.Canvas Namespace