Grasshopper SDK
DataTree<T>.AllData Method
 Collects all data in the tree in a single list. Does not alter the topology of this tree.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<T> AllData()
Public Function AllData As List(Of T)
Return Value
Type: List<T>
A linear list containing all data items in all branches.
See Also
Reference
DataTree<T> Class
Grasshopper Namespace