Grasshopper SDK
GH_Border.CreateBorders Method (RectangleF, Int32, Int32)
 Static (Shared) method for creating a set of borders.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<GH_Border> CreateBorders(
	RectangleF box,
	int borderWidth,
	int borderHeight
)
Public Shared Function CreateBorders (
	box As RectangleF,
	borderWidth As Integer,
	borderHeight As Integer
) As List(Of GH_Border)
Parameters
box
Type: System.Drawing.RectangleF
Box for border creation.
borderWidth
Type: System.Int32
The width of all vertical.
borderHeight
Type: System.Int32
The height of all horizontal borders.
Return Value
Type: List<GH_Border>
A list of borders.
See Also
Reference
GH_Border Class
CreateBorders Overload
Grasshopper.GUI.Canvas Namespace