Grasshopper SDK
SliderSnapRange.SnapValue Method
 Gets the snapped value of another value.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal SnapValue(
	decimal value
)
Public Function SnapValue (
	value As Decimal
) As Decimal
Parameters
value
Type: System.Decimal
Return Value
Type: Decimal
See Also
Reference
SliderSnapRange Structure
Grasshopper.GUI.Base Namespace