Grasshopper SDK
GH_MeshFace Constructor (GH_MeshFace)
 Create a duplicate of another mesh face
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MeshFace(
	GH_MeshFace other
)
Public Sub New (
	other As GH_MeshFace
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_MeshFace
Mesh face to duplicate
See Also
Reference
GH_MeshFace Class
GH_MeshFace Overload
Grasshopper.Kernel.Types Namespace