Grasshopper SDK
GH_Point Constructor (GH_Point)
Initializes a new instance of the GH_Point class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Point(
	GH_Point iOther
)
Public Sub New (
	iOther As GH_Point
)
Parameters
iOther
Type: Grasshopper.Kernel.Types.GH_Point
See Also
Reference
GH_Point Class
GH_Point Overload
Grasshopper.Kernel.Types Namespace