Grasshopper SDK
GH_GraphicsUtil.IsPointInEllipse Method
 Test whether a point is inside or outside an ellipse.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsPointInEllipse(
	RectangleF ellipse,
	PointF point
)
Public Shared Function IsPointInEllipse (
	ellipse As RectangleF,
	point As PointF
) As Boolean
Parameters
ellipse
Type: System.Drawing.RectangleF
Rectangle describing ellipse.
point
Type: System.Drawing.PointF
Point to test for inclusion.
Return Value
Type: Boolean
True if the point is in or on the ellipse.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace