Grasshopper SDK
GH_QuickImageEditor.ViewportImage Property
 Gets or sets the viewport image.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap ViewportImage { get; set; }
Public Property ViewportImage As Bitmap
	Get
	Set
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.GH_QuickImageEditor.ViewportImage"]
See Also
Reference
GH_QuickImageEditor Class
Grasshopper.GUI Namespace