Grasshopper SDK
GH_Path.IsCoincident Method (Int32[])
 Test to see if this path is coincident with set of integers.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsCoincident(
	params int[] index_list
)
Public Function IsCoincident (
	ParamArray index_list As Integer()
) As Boolean
Parameters
index_list
Type: System.Int32[]
Integers to compare to.
Return Value
Type: Boolean
True if both paths are coincident (identical), false if not.
See Also
Reference
GH_Path Class
IsCoincident Overload
Grasshopper.Kernel.Data Namespace