Grasshopper SDK
GH_CanvasValidator.CanCreateWire Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool CanCreateWire(
	IGH_Param source,
	IGH_Param target
)
Public Overridable Function CanCreateWire (
	source As IGH_Param,
	target As IGH_Param
) As Boolean
Parameters
source
Type: Grasshopper.Kernel.IGH_Param
target
Type: Grasshopper.Kernel.IGH_Param
Return Value
Type: Boolean
Implements
IGH_CanvasValidator.CanCreateWire(IGH_Param, IGH_Param)
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace