Grasshopper SDK
GH_Param<T>.RegisterRemoteIDsUtil Method
 Utility function which treats all data in the Volatile cache as IGH_GeometricGoo and registers all referenced objects. Call this function from within RegisterRemoteIDs() if you are absolutely sure that all the items in volatiledata implement IGH_GeometricGoo.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void RegisterRemoteIDsUtil(
	GH_GuidTable table
)
Protected Sub RegisterRemoteIDsUtil (
	table As GH_GuidTable
)
Parameters
table
Type: GH_GuidTable
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace