Grasshopper SDK
GH_MaterialPreviewControl.SelectOnClick Property
 Gets or sets whether this control can be selected.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool SelectOnClick { get; set; }
Public Property SelectOnClick As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MaterialPreviewControl.SelectOnClick"]
See Also
Reference
GH_MaterialPreviewControl Class
Grasshopper.GUI Namespace