Grasshopper SDK
GH_Document.NewSolution Method (Boolean)
 Start a new solution.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void NewSolution(
	bool expireAllObjects
)
Public Sub NewSolution (
	expireAllObjects As Boolean
)
Parameters
expireAllObjects
Type: System.Boolean
If True, all objects will be recalculated. If False, only already expired objects will be recalculated.
See Also
Reference
GH_Document Class
NewSolution Overload
Grasshopper.Kernel Namespace