Grasshopper SDK
CentralSettings.FormatENotationUpperThreshold Property
 Gets at what actual threshold numeric formatting switches from decimal to E-Notation.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static double FormatENotationUpperThreshold { get; }
Public Shared ReadOnly Property FormatENotationUpperThreshold As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.CentralSettings.FormatENotationUpperThreshold"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace