Grasshopper SDK
IGH_UserPromptAware.PromptSingleItem Method
 Get a single item from the user.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_Goo PromptSingleItem()
Function PromptSingleItem As IGH_Goo
Return Value
Type: IGH_Goo
The item if successful or nothing on abort/failure.
See Also
Reference
IGH_UserPromptAware Interface
Grasshopper.Kernel Namespace