Grasshopper SDK
GH_Rectangle Constructor (Rectangle3d)
 Create a duplicate of another rectangle.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Rectangle(
	Rectangle3d rec
)
Public Sub New (
	rec As Rectangle3d
)
Parameters
rec
Type: Rectangle3d
Rectangle to copy. If null, a default rectangle will be created.
See Also
Reference
GH_Rectangle Class
GH_Rectangle Overload
Grasshopper.Kernel.Types Namespace