Grasshopper SDK
GH_Circle.GH_CircleProxy Class
 Proxy description of GH_Circle class. This class is used by the Generic Multivalue interfaces.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Circle>
 Grasshopper.Kernel.Types.GH_Circle.GH_CircleProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_CircleProxy : GH_GooProxy<GH_Circle>
Public Class GH_CircleProxy
	Inherits GH_GooProxy(Of GH_Circle)
The GH_Circle.GH_CircleProxy type exposes the following members.
Constructors
Name | Description
GH_Circle.GH_CircleProxy
Initializes a new instance of the GH_Circle.GH_CircleProxy class
Top
Properties
Name | Description
Area
Center
Circumference
Normal
Radius
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace