Grasshopper SDK
GH_CanvasValidator.CanCreateObject Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool CanCreateObject(
	Guid id,
	PointF pt
)
Public Overridable Function CanCreateObject (
	id As Guid,
	pt As PointF
) As Boolean
Parameters
id
Type: System.Guid
pt
Type: System.Drawing.PointF
Return Value
Type: Boolean
Implements
IGH_CanvasValidator.CanCreateObject(Guid, PointF)
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace