Grasshopper SDK
IGH_Param.ClearProxySources Method
 Remove all proxy sources without attempting to relink them.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void ClearProxySources()
Sub ClearProxySources
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace