Grasshopper SDK
GH_ExternalFileConflictDialog Class
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Grasshopper.GUI.GH_ExternalFileConflictDialog
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ExternalFileConflictDialog : Form
Public Class GH_ExternalFileConflictDialog
	Inherits Form
The GH_ExternalFileConflictDialog type exposes the following members.
Constructors
Name | Description
GH_ExternalFileConflictDialog
Initializes a new instance of the GH_ExternalFileConflictDialog class
Top
Properties
Name | Description
FilePathA
FilePathB
LoadFileCode
Top
Methods
Name | Description
Dispose
Releases the unmanaged resources used by the GH_ExternalFileConflictDialog and optionally releases the managed resources
 (Overrides Form.Dispose(Boolean).)
Top
See Also
Reference
Grasshopper.GUI Namespace