Grasshopper SDK
GH_CanvasViewportChangedEventArgs Class
 These arguments are used in the ViewportChanged event on GH_Canvas.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.GUI.Canvas.GH_CanvasViewportChangedEventArgs
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_CanvasViewportChangedEventArgs : EventArgs
Public Class GH_CanvasViewportChangedEventArgs
	Inherits EventArgs
The GH_CanvasViewportChangedEventArgs type exposes the following members.
Properties
Name | Description
Canvas
 Gets the Canvas whose viewport was changed.
Viewport
 Gets the new Viewport.
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace