Grasshopper SDK
GH_DocDiagramPainter Class
 This class paints diagrammatic images of a collection of objects.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Canvas.GH_DocDiagramPainter
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocDiagramPainter
Public Class GH_DocDiagramPainter
The GH_DocDiagramPainter type exposes the following members.
Constructors
Name | Description
GH_DocDiagramPainter
Initializes a new instance of the GH_DocDiagramPainter class
Top
Properties
Name | Description
BoundingBox
 Gets the 2D domain of the diagram in canvas coordinates.
DrawingBox
 Gets the 2D domain of the diagram in image coordinates.
IgnoreSelectedStates
 Gets or sets the Ignore Selected State flag. When set to True, selected objects are not drawn in a different colour.
Image
 Gets the diagram image (only available after a call to PaintDiagram().
Size
 Gets the width and height (in pixels) of this diagram image.
Zoom
 Gets the zoom factor for this diagram.
Top
Methods
Name | Description
MapPoint(Point)
MapPoint(PointF)
MapRectangle
MapX(Int32)
MapX(Single)
MapY(Int32)
MapY(Single)
PaintDiagram(IEnumerable<IGH_DocumentObject>, Int32, Int32)
 Paint a diagram of a document.
PaintDiagram(IEnumerable<IGH_DocumentObject>, Int32, Int32, Int32)
 Paint a diagram of a document.
UnmapPoint
UnmapRectangle
UnmapX
UnmapY
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace