Grasshopper SDK
GH_Gradient.AddGrip Method (Double)
 Add a new grip to the gradient. The colour of the grip will be picked so that there is no difference to the gradient, though this is not actually possible when the interpolation mode is not linear.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Grip AddGrip(
	double t
)
Public Function AddGrip (
	t As Double
) As GH_Grip
Parameters
t
Type: System.Double
Grip parameter.
Return Value
Type: GH_Grip
See Also
Reference
GH_Gradient Class
AddGrip Overload
Grasshopper.GUI.Gradient Namespace