Grasshopper SDK
GH_PanelEditorControl Class
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Grasshopper.GUI.GH_PanelEditorControl
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PanelEditorControl : UserControl
Public Class GH_PanelEditorControl
	Inherits UserControl
The GH_PanelEditorControl type exposes the following members.
Constructors
Name | Description
GH_PanelEditorControl
Initializes a new instance of the GH_PanelEditorControl class
Top
Properties
Name | Description
PanelContent
 Gets or sets the panel text on display.
PanelProperties
 Gets or sets the panel properties on display.
Top
Methods
Name | Description
Dispose
Releases the unmanaged resources used by the GH_PanelEditorControl and optionally releases the managed resources
 (Overrides ContainerControl.Dispose(Boolean).)
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
PickNewFont
Top
See Also
Reference
Grasshopper.GUI Namespace