Grasshopper SDK
GH_Skin.canvas_grid_col Field
 Specifies the interval of the canvas grid columns.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int canvas_grid_col
Public Shared canvas_grid_col As Integer
Field Value
Type: Int32
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace