Grasshopper SDK
GH_PluginUtil.BringWindowToTop Method
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool BringWindowToTop(
	IntPtr hWnd
)
Public Shared Function BringWindowToTop (
	hWnd As IntPtr
) As Boolean
Parameters
hWnd
Type: System.IntPtr
Return Value
Type: Boolean
See Also
Reference
GH_PluginUtil Class
Grasshopper.Plugin Namespace