Grasshopper SDK
GH_Document.OnSettingsChanged Method
 Raise the SettingsChanged event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnSettingsChanged(
	GH_DocumentSettings kind
)
Public Sub OnSettingsChanged (
	kind As GH_DocumentSettings
)
Parameters
kind
Type: Grasshopper.Kernel.GH_DocumentSettings
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace