Grasshopper SDK
GH_Document.UndoStateChanged Event
 Raised whenever there is a change to the document undo/redo stack.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Document.UndoStateChangedEventHandler UndoStateChanged
Public Event UndoStateChanged As GH_Document.UndoStateChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.UndoStateChangedEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace