Grasshopper SDK
GH_Surface.Boundingbox Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override BoundingBox Boundingbox { get; }
Public Overrides ReadOnly Property Boundingbox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Surface.Boundingbox"]
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace