Grasshopper SDK
GH_Param<T>.IsDataProvider Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override sealed bool IsDataProvider { get; }
Public Overrides NotOverridable ReadOnly Property IsDataProvider As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.IsDataProvider"]
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace