Grasshopper SDK
IGH_DocumentObject.DisplayExpiredEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void DisplayExpiredEventHandler(
	IGH_DocumentObject sender,
	GH_DisplayExpiredEventArgs e
)
Public Delegate Sub DisplayExpiredEventHandler (
	sender As IGH_DocumentObject,
	e As GH_DisplayExpiredEventArgs
)
Parameters
sender
Type: Grasshopper.Kernel.IGH_DocumentObject
e
Type: Grasshopper.Kernel.GH_DisplayExpiredEventArgs
See Also
Reference
Grasshopper.Kernel Namespace