Grasshopper SDK
GH_GeometricGooWrapper.Transform Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_GeometricGoo Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As IGH_GeometricGoo
Parameters
xform
Type: Transform
Return Value
Type: IGH_GeometricGoo
Implements
IGH_GeometricGoo.Transform(Transform)
See Also
Reference
GH_GeometricGooWrapper Class
Grasshopper.Kernel.Types Namespace