Grasshopper SDK
GH_StateTag Constructor
Initializes a new instance of the GH_StateTag class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_StateTag()
Protected Sub New
See Also
Reference
GH_StateTag Class
Grasshopper.Kernel Namespace