Grasshopper SDK
GH_Capsule.OutputGrips Property
 Gets the list of locally defined output grip locations.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Point> OutputGrips { get; }
Public ReadOnly Property OutputGrips As List(Of Point)
	Get
Property Value
Type: List<Point>
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.OutputGrips"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace