Grasshopper SDK
CentralSettings.CreateSolutionUndoRecordChangedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void CreateSolutionUndoRecordChangedEventHandler()
Public Delegate Sub CreateSolutionUndoRecordChangedEventHandler
See Also
Reference
Grasshopper Namespace