Grasshopper SDK
GH_Viewport.TargetRatio Property
 Gets or sets the target ratio with respect to the viewport dimensions. This is a useful tool to prevent weird view changes during a canvas resize.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public SizeF TargetRatio { get; set; }
Public Property TargetRatio As SizeF
	Get
	Set
Property Value
Type: SizeF
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.TargetRatio"]
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace