Grasshopper SDK
IGH_Structure.Path Property
 Gets the data path at the specified index.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_Path this[
	int index
] { get; }
ReadOnly Property Path (
	index As Integer
) As GH_Path
	Get
Parameters
index
Type: System.Int32
Index of path to retrieve.
Property Value
Type: GH_Path
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.IGH_Structure.Path(System.Int32)"]
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown if the index does not represent a valid path.
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace