Grasshopper SDK
GH_DifferentialSolver Enumeration
 Enumerates all implemented differential samplers.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_DifferentialSolver
Public Enumeration GH_DifferentialSolver
Members
Member name | Value | Description
None | 0 |  Unset solver, always returns a zero-length tensor.
Euler | 1 |  Euler differential solver.
RungeKutta2 | 2 |  Runge-Kutta second order solver.
RungeKutta3 | 3 |  Runge-Kutta third order solver.
RungeKutta4 | 4 |  Runge-Kutta fourth order solver.
See Also
Reference
Grasshopper.Kernel.Types Namespace