Grasshopper SDK
GH_MeshFace Class
 Represents a tri or quad mesh face. GH_MeshFace works similar to the OpenNURBS OnMeshFace class.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<MeshFace>
 Grasshopper.Kernel.Types.GH_MeshFace
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_MeshFace : GH_Goo<MeshFace>
Public Class GH_MeshFace
	Inherits GH_Goo(Of MeshFace)
The GH_MeshFace type exposes the following members.
Constructors
Name | Description
GH_MeshFace()
 Default constructor. Sets all corners to 0.
GH_MeshFace(MeshFace)
 Create a duplicate of another mesh face.
GH_MeshFace(GH_MeshFace)
 Create a duplicate of another mesh face
GH_MeshFace(Int32, Int32, Int32)
 Create a triangular mesh face from 3 corners indices.
GH_MeshFace(Int32, Int32, Int32, Int32)
 Create a quadrangular mesh face from 4 corners indices.
Top
Properties
Name | Description
IsValid
 Test for validity. No negative indices are allowed and only C and D are allowed to be identical.
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate
 Create a duplicate of this Mesh face.
 (Overrides GH_Goo<T>.Duplicate().)
DuplicateMeshFace
 Create a duplicate of this Mesh face.
EmitProxy
 Returns a proxy that represents this mesh face. Do not call this function unless you're
 (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString
 Format the mesh face using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace