Grasshopper SDK
GH_ExternalFileConflictDialog.FilePathA Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string FilePathA { get; set; }
Public Property FilePathA As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_ExternalFileConflictDialog.FilePathA"]
See Also
Reference
GH_ExternalFileConflictDialog Class
Grasshopper.GUI Namespace