Grasshopper SDK
GH_Structure<T>.LongestPathIndex Method
 Finds the path in this structure with the most dimensions. In case of multiple equally long longest paths, the last one will be returned.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int LongestPathIndex()
Public Function LongestPathIndex As Integer
Return Value
Type: Int32
The index of the longest path or -1 if there are no paths.
Implements
IGH_Structure.LongestPathIndex()
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace