Grasshopper SDK
GH_TagArtist_WirePainter Constructor
Initializes a new instance of the GH_TagArtist_WirePainter class
Namespace: Grasshopper.GUI.Canvas.TagArtists
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_TagArtist_WirePainter(
	IGH_Param source,
	IGH_Param target,
	Color colour,
	int width
)
Public Sub New (
	source As IGH_Param,
	target As IGH_Param,
	colour As Color,
	width As Integer
)
Parameters
source
Type: Grasshopper.Kernel.IGH_Param
target
Type: Grasshopper.Kernel.IGH_Param
colour
Type: System.Drawing.Color
width
Type: System.Int32
See Also
Reference
GH_TagArtist_WirePainter Class
Grasshopper.GUI.Canvas.TagArtists Namespace