Grasshopper SDK
GH_UndoRecord.Redo Method
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Redo(
	GH_Document doc
)
Public Sub Redo (
	doc As GH_Document
)
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
See Also
Reference
GH_UndoRecord Class
Grasshopper.Kernel.Undo Namespace