Grasshopper SDK
IGH_Structure Interface
 Base interface for all GH_Structure types.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_Structure
Public Interface IGH_Structure
The IGH_Structure type exposes the following members.
Properties
Name | Description
Branch[Int32]
 Gets a limited access pointer to the data list at the specified index.
Branch[GH_Path]
 Gets a limited access pointer to the data list associated with a certain path.
DataCount
 Gets the total number of data items stored in all paths.
IsEmpty
 Gets the Empty state of the structure. If the structure is Empty when it contains no paths and no branches.
Path
 Gets the data path at the specified index.
PathCount
 Gets the number of paths defined in this structure.
Paths
 Gets a list of all the paths in this structure.
StructureProxy
 Gets a proxy list of all the data-arrays in this structure
TopologyDescription
 Gets a description of the topology of the structure. Useful for debugging purposes.
Top
Methods
Name | Description
AllData
 Gets an enumerator for all the data items in this structure.
Clear
 Clears the entire structure.
ClearData
 Removes all data from all paths without affecting the structure topology.
DataDescription
 Gets a description of the data contained in this structure.
EnsureCapacity
 Ensures that all branches have a certain capacity
ExpandPath
 Expand a path in this structure by appending an element.
Flatten
 Flattens the entire structure into a single path.
Graft(Boolean) |  Obsolete.
 Grafts all paths by reallocating all data into child paths.
Graft(GH_GraftMode)
 Grafts all paths by reallocating all data into child paths.
Graft(GH_GraftMode, GH_Path)
 Grafts a specific path by reallocating all data into child paths. If a grafted path coincides with an existing path, the data item in question will be appended to the existing path.
Graft(GH_Path, Boolean) |  Obsolete.
 Grafts a specific path by reallocating all data into child paths. If a grafted path coincides with an existing path, the data item in question will be appended to the existing path.
LongestPathIndex
 Finds the path in this structure with the most dimensions. In case of multiple equally long longest paths, the last one will be returned.
PathExists
 Returns True if the specified path is already defined inside the structure.
PathIndex
 Find the indices that delineate the given path domain.
RemovePath
 Removes a path and all associated data from the structure. If the path doesn't exist, nothing will happen.
ReplacePath
 Replace an existing path with a different one. If the operation is successfull, then the 'find' path will be deleted. If the 'replace' path is already defined, the items in 'find' will be appended to the existing path.
ShortestPathIndex
 Finds the path in this structure with the least dimensions. In case of multiple equally long longest paths, the first one will be returned.
Simplify
 Simplify the data structure by removing path indices shared by all branches.
TrimExcess
 Trims the excess allocated memory in all branches
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace