Grasshopper SDK
SliderSnapRange.DistanceTo Method
 Compute the distance from a value to this snap range.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal DistanceTo(
	decimal value
)
Public Function DistanceTo (
	value As Decimal
) As Decimal
Parameters
value
Type: System.Decimal
Return Value
Type: Decimal
See Also
Reference
SliderSnapRange Structure
Grasshopper.GUI.Base Namespace