Grasshopper SDK
GH_ComponentServer.AddAlias Method
 Add an alias to a target.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddAlias(
	string alias,
	Guid target
)
Public Sub AddAlias (
	alias As String,
	target As Guid
)
Parameters
alias
Type: System.String
Alias to add. If the alias string contains spaces or commas, those will be used to harvest partial aliases.
target
Type: System.Guid
Component ID of object that is targeted by the alias.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace