Grasshopper SDK
GH_AssemblyPriority.PriorityLoad Method
 This method will be called exactly once before any of the Components in your project are loaded.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract GH_LoadingInstruction PriorityLoad()
Public MustOverride Function PriorityLoad As GH_LoadingInstruction
Return Value
Type: GH_LoadingInstruction
Loading instruction. If you wish to abort the loading of your project, then return GH_LoadingInstruction.Abort.
See Also
Reference
GH_AssemblyPriority Class
Grasshopper.Kernel Namespace