Grasshopper SDK
GH_Format.RhinoUnitName Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string RhinoUnitName()
Public Shared Function RhinoUnitName As String
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace