Grasshopper SDK
GH_TreeRules.RuleOpenBracket Field
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const char RuleOpenBracket = '('
Public Const RuleOpenBracket As Char = "("C
Field Value
Type: Char
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace