Grasshopper SDK
GH_PingDocumentEventArgs Class
 Event arguments passed during PingDocument events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_PingDocumentEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PingDocumentEventArgs : EventArgs
Public Class GH_PingDocumentEventArgs
	Inherits EventArgs
The GH_PingDocumentEventArgs type exposes the following members.
Constructors
Name | Description
GH_PingDocumentEventArgs
Initializes a new instance of the GH_PingDocumentEventArgs class
Top
Properties
Name | Description
Document
 If you're a GH_Document that owns this object, you must fill out this field. This is the only way for objects to know which document they belong to.
Top
Fields
Name | Description
m_document
Top
See Also
Reference
Grasshopper.Kernel Namespace