Grasshopper SDK
DataTree<T>.RemovePath Method (GH_Path)
 Removes a path and all associated data from the structure. If the path doesn't exist, nothing will happen.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RemovePath(
	GH_Path path
)
Public Sub RemovePath (
	path As GH_Path
)
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to remove.
See Also
Reference
DataTree<T> Class
RemovePath Overload
Grasshopper Namespace