Grasshopper SDK
GH_GraphicsUtil.RenderRoundBar Method
 Render a cylinder shaped object with round caps.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderRoundBar(
	Graphics graphics,
	RectangleF rec,
	Color colour
)
Public Shared Sub RenderRoundBar (
	graphics As Graphics,
	rec As RectangleF,
	colour As Color
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
rec
Type: System.Drawing.RectangleF
Rectangle containing shape.
colour
Type: System.Drawing.Color
Fill colour of shape.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace