Grasshopper SDK
GH_UndoAction.State Property
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoState State { get; }
Public ReadOnly Property State As GH_UndoState
	Get
Property Value
Type: GH_UndoState
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoAction.State"]
Implements
IGH_UndoAction.State
See Also
Reference
GH_UndoAction Class
Grasshopper.Kernel.Undo Namespace