Grasshopper SDK
GH_CapsuleRenderEngine.GetImpliedPalette Method
 Static (Shared in VB) method for solving which palette is the default given a specific object's properties. Default palettes are either GH_Palette.Normal, GH_Palette.Warning or GH_Palette.Error depending on the objects' runtime message level.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Palette GetImpliedPalette(
	IGH_ActiveObject obj
)
Public Shared Function GetImpliedPalette (
	obj As IGH_ActiveObject
) As GH_Palette
Parameters
obj
Type: Grasshopper.Kernel.IGH_ActiveObject
Object to evaluate.
Return Value
Type: GH_Palette
The default palette.
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace