Grasshopper SDK
GH_Document.GH_UndoUtil Class
 This class is emitted by the Undo property of a GH_Document instance.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_Document.GH_UndoUtil
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_UndoUtil
Public NotInheritable Class GH_UndoUtil
The GH_Document.GH_UndoUtil type exposes the following members.
Methods
Name | Description
CreateAddObjectEvent(String, IGH_DocumentObject)
 Create a new undo record for a single object addition.
CreateAddObjectEvent(String, IEnumerable<IGH_DocumentObject>)
 Create a new undo record for a bunch of object additions.
CreateAddStateEvent
 Create a new undo record for a single solution state addition.
CreateEnabledEvent
 Create a new undo record for an object enabled change. This function must be called before the enabled flag is changed.
CreateGenericObjectEvent
 Create a new undo record for a generic, single object change.
CreateLayoutEvent(String, IGH_DocumentObject)
 Create a new undo record for a single object layout change. This function must be called before the layout is changed.
CreateLayoutEvent(String, IEnumerable<IGH_DocumentObject>)
 Create a new undo record for a bunch of object layout changes. This function must be called before the layouts are changed.
CreateNickNameEvent
 Create a new undo record for an object nickname change. This function must be called before the nickname is changed.
CreatePersistentDataEvent<T>
 Create a new undo record for a single object persistent data change.
CreatePivotEvent(String, IGH_DocumentObject)
 Create a new undo record for a single pivot change. This function must be called before the pivot is changed.
CreatePivotEvent(String, IEnumerable<IGH_DocumentObject>)
 Create a new undo record for a bunch of pivot changes. This function must be called before the pivots are changed.
CreatePreviewEvent
 Create a new undo record for an object preview change. This function must be called before the preview is changed.
CreateRemoveObjectEvent(String, IGH_DocumentObject)
 Create a new undo record for a single object removal.
CreateRemoveObjectEvent(String, IEnumerable<IGH_DocumentObject>)
 Create a new undo record for a bunch of object removals.
CreateRemoveStateEvent
 Create a new undo record for a single solution state removal.
CreateReplaceStateEvent
 Create a new undo record for a single solution state addition.
CreateWireEvent(String, IGH_Param)
 Create a new undo record for a set of Connector wire changes. This function must be called before the wires are changed.
CreateWireEvent(String, IEnumerable<IGH_Param>)
 Create a new undo record for a set of Connector wire changes. This function must be called before the wires are changed.
RecordAddObjectEvent(String, IGH_DocumentObject)
 Create and Record a new ObjectAdded undo record.
RecordAddObjectEvent(String, IEnumerable<IGH_DocumentObject>)
 Create and Record a new ObjectAdded undo record.
RecordAddStateEvent
 Create and Record a new CreateAddStateEvent undo record.
RecordEnabledEvent
 Create and Record a new EnabledChanged undo record.
RecordEvent(GH_UndoRecord)
 Add a new record to the undo stack of the owner document.
RecordEvent(String, IGH_UndoAction)
 Add a new record to the undo stack of the owner document.
RecordEvent(String, IGH_UndoAction[])
 Add a new record to the undo stack of the owner document.
RecordEvent(String, IEnumerable<IGH_UndoAction>)
 Add a new record to the undo stack of the owner document.
RecordGenericObjectEvent
 Create and Record a new ObjectChanged undo record.
RecordLayoutEvent(String, IGH_DocumentObject)
 Create and Record a new LayoutChanged undo record.
RecordLayoutEvent(String, IEnumerable<IGH_DocumentObject>)
 Create and Record a new LayoutChanged undo record.
RecordNickNameEvent
 Create and Record a new NickNameChanged undo record.
RecordPersistentDataEvent<T>
 Create and Record a new PersistentDataChanged undo record.
RecordPivotEvent(String, IGH_DocumentObject)
 Create and Record a new PivotChanged undo record.
RecordPivotEvent(String, IEnumerable<IGH_DocumentObject>)
 Create and Record a new PivotChanged undo record.
RecordPreviewEvent
 Create and Record a new PreviewChanged undo record.
RecordRemoveObjectEvent(String, IGH_DocumentObject)
 Create and Record a new ObjectRemoved undo record.
RecordRemoveObjectEvent(String, IEnumerable<IGH_DocumentObject>)
 Create and Record a new ObjectRemoved undo record.
RecordRemoveStateEvent
 Create and Record a new CreateRemoveStateEvent undo record.
RecordReplaceStateEvent
 Create and Record a new CreateReplaceStateEvent undo record.
RecordWireEvent(String, IGH_Param)
 Create and Record a new WiresChanged undo record.
RecordWireEvent(String, IEnumerable<IGH_Param>)
 Create and Record a new WiresChanged undo record.
Top
See Also
Reference
Grasshopper.Kernel Namespace