Grasshopper SDK
GH_SliderBase.FixValue Method
 Fix the value of the slider. The value will be rounded according to slider type and accuracy. Also, the value will be clipped to the limits. Before you call this function, ensure the limits are set up correctly.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void FixValue()
Public Sub FixValue
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace