Grasshopper SDK
GH_ObjectWrapper.BakeGeometry Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool BakeGeometry(
	RhinoDoc doc,
	ObjectAttributes att,
	ref Guid obj_guid
)
Public Function BakeGeometry (
	doc As RhinoDoc,
	att As ObjectAttributes,
	ByRef obj_guid As Guid
) As Boolean
Parameters
doc
Type: RhinoDoc
att
Type: ObjectAttributes
obj_guid
Type: System.Guid
Return Value
Type: Boolean
Implements
IGH_BakeAwareData.BakeGeometry(RhinoDoc, ObjectAttributes, Guid)
See Also
Reference
GH_ObjectWrapper Class
Grasshopper.Kernel.Types Namespace