Grasshopper SDK
GH_Structure<T>.DataItem Property (Int32)
 Gets the item at a given offset. The structure is treated as a linear list in this case. If index is out of range, null is returned. For repeated indexed retrieval, consider using a For Each loop since the enumerator is more efficient.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public T this[
	int index
] { get; }
Public ReadOnly Property DataItem (
	index As Integer
) As T
	Get
Parameters
index
Type: System.Int32
Offset of item to retrieve
Property Value
Type: T
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.DataItem(System.Int32)"]
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown if index is smaller than zero or larger than the size of the collection
See Also
Reference
GH_Structure<T> Class
DataItem Overload
Grasshopper.Kernel.Data Namespace