Grasshopper SDK
IGH_Component Interface
 Base interface for all GH_Component types. Do not implement this interface from scratch, inherit from GH_Component instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_Component : IGH_ActiveObject,
	IGH_PreviewObject, IGH_BakeAwareObject
Public Interface IGH_Component
	Inherits IGH_ActiveObject, IGH_PreviewObject, IGH_BakeAwareObject
The IGH_Component type exposes the following members.
Properties
Name | Description
DataComparison
 A data combination flag
InConstructor
 Gets the constructor flag for this instance. If InConstructor = True, it means the component is still registering parameters and the layout is not yet complete.
IsValidMasterParameterIndex
 Gets whether the MasterParameterIndex property identifies a valid parameter.
MasterParameterIndex
 Gets or sets the master parameter index override. Negative indices or indices larger than or equal to the input parameter count will be ignored and regular master parameter detection will kick in.
Message
 Gets or sets a custom message to be displayed underneath the component.
Params
 Gets the Params object that managed input and output parameters.
RunCount
 Gets a value indicating how many times the SolveInstance method was called on this component during the last solution. This property will return -1 if no valid runcount is available.
Top
Methods
Name | Description
Top
See Also
Reference
Grasshopper.Kernel Namespace