Grasshopper SDK
Instances.RcpPanel Property
 Gets the app-domain wide RCP panel instance. If it doesn't exist yet it will be created.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static RemoteControlPanel RcpPanel { get; }
Public Shared ReadOnly Property RcpPanel As RemoteControlPanel
	Get
Property Value
Type: RemoteControlPanel
[Missing <value> documentation for "P:Grasshopper.Instances.RcpPanel"]
See Also
Reference
Instances Class
Grasshopper Namespace