Grasshopper SDK
GH_DocumentEditor.DisableUI Method
 Disable all modifier UI.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DisableUI()
Public Sub DisableUI
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace