Grasshopper SDK
IGH_ActiveObject.IsDataProvider Property
 Gets whether or not this object is capable of emitting data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsDataProvider { get; }
ReadOnly Property IsDataProvider As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ActiveObject.IsDataProvider"]
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace