Grasshopper SDK
GH_Point.CreateFromCurveDistance Method
 Create new point geometry instance based on a curve distance parameter
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateFromCurveDistance(
	Guid crv_id,
	Curve crv,
	double t,
	bool bFromStart
)
Public Sub CreateFromCurveDistance (
	crv_id As Guid,
	crv As Curve,
	t As Double,
	bFromStart As Boolean
)
Parameters
crv_id
Type: System.Guid
ID of the curve this object references
crv
Type: Curve
The curve to act on
t
Type: System.Double
Parameter on the curve that controls the distance measurement
bFromStart
Type: System.Boolean
True if the distance is to be measured from the start of the curve
Remarks
This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace