Grasshopper SDK
IGH_ValueProxy.ToString Method
 Returns a String description of the current value.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string ToString()
Function ToString As String
Return Value
Type: String
Remarks
If the implementation IsParsable(), then this representation must be in parsable format.
See Also
Reference
IGH_ValueProxy Interface
Grasshopper.Kernel Namespace