Grasshopper SDK
GH_Vector.GH_VectorProxy Constructor
Initializes a new instance of the GH_Vector.GH_VectorProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_VectorProxy(
	GH_Vector nOwner
)
Public Sub New (
	nOwner As GH_Vector
)
Parameters
nOwner
Type: Grasshopper.Kernel.Types.GH_Vector
See Also
Reference
GH_Vector.GH_VectorProxy Class
Grasshopper.Kernel.Types Namespace