Grasshopper SDK
GH_PreviewWireArgs Class
 This class is passed to objects that implement IGH_PreviewData during wire drawing operations.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_PreviewWireArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PreviewWireArgs
Public Class GH_PreviewWireArgs
The GH_PreviewWireArgs type exposes the following members.
Constructors
Name | Description
GH_PreviewWireArgs
Initializes a new instance of the GH_PreviewWireArgs class
Top
Properties
Name | Description
Color
 Gets the color in which wires ought to be drawn.
Pipeline
 Gets the Display Pipeline we're currently drawing with.
Thickness
 Gets the thickness in which wires ought to be drawn.
Viewport
 Gets the Viewport in which we're currently drawing.
Top
See Also
Reference
Grasshopper.Kernel Namespace