Grasshopper SDK
GH_Interval.EmitProxy Method
 Returns a proxy that represents this interval. Do not call this function unless you're
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IGH_GooProxy EmitProxy()
Public Overrides Function EmitProxy As IGH_GooProxy
Return Value
Type: IGH_GooProxy
See Also
Reference
GH_Interval Class
Grasshopper.Kernel.Types Namespace