Grasshopper SDK
GH_MeshFace.GH_MeshFaceProxy Class
 Proxy description of GH_MeshFace class. This class is used by the Generic Multivalue interfaces.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_MeshFace>
 Grasshopper.Kernel.Types.GH_MeshFace.GH_MeshFaceProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_MeshFaceProxy : GH_GooProxy<GH_MeshFace>
Public Class GH_MeshFaceProxy
	Inherits GH_GooProxy(Of GH_MeshFace)
The GH_MeshFace.GH_MeshFaceProxy type exposes the following members.
Constructors
Name | Description
GH_MeshFace.GH_MeshFaceProxy
Initializes a new instance of the GH_MeshFace.GH_MeshFaceProxy class
Top
Properties
Name | Description
A
B
C
D
Kind
Top
Methods
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace