Grasshopper SDK
IGH_VarParamComponent.IsInputVariable Property
 Gets a flag specifying whether or not the input can potentially contain variable parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsInputVariable { get; }
ReadOnly Property IsInputVariable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_VarParamComponent.IsInputVariable"]
Return Value
Type: Boolean
Return TRUE to enable variable parameter UI on the input side.
See Also
Reference
IGH_VarParamComponent Interface
Grasshopper.Kernel Namespace