Grasshopper SDK
GH_Document.ShowPreviewSettings Method
 Display the Preview settings dialog.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ShowPreviewSettings()
Public Sub ShowPreviewSettings
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace