Grasshopper SDK
GH_Document.Write Method (GH_IWriter)
 Standard archiving function. Will serialize the entire document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Write(
	GH_IWriter writer
)
Public Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
Implements
GH_ISerializable.Write(GH_IWriter)
See Also
Reference
GH_Document Class
Write Overload
Grasshopper.Kernel Namespace