Grasshopper SDK
GH_Transform.Value Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override Transform Value { get; set; }
Public Overrides Property Value As Transform
	Get
	Set
Property Value
Type: Transform
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Transform.Value"]
See Also
Reference
GH_Transform Class
Grasshopper.Kernel.Types Namespace