Grasshopper SDK
GH_RuleAnyNumbers Constructor
Initializes a new instance of the GH_RuleAnyNumbers class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RuleAnyNumbers()
Public Sub New
See Also
Reference
GH_RuleAnyNumbers Class
Grasshopper.Kernel.Data Namespace