Grasshopper SDK
GH_Brep.ScriptVariable Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override Object ScriptVariable()
Public Overrides Function ScriptVariable As Object
Return Value
Type: Object
See Also
Reference
GH_Brep Class
Grasshopper.Kernel.Types Namespace