Grasshopper SDK
GH_Number Constructor (Double)
Initializes a new instance of the GH_Number class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Number(
	double number
)
Public Sub New (
	number As Double
)
Parameters
number
Type: System.Double
See Also
Reference
GH_Number Class
GH_Number Overload
Grasshopper.Kernel.Types Namespace