Grasshopper SDK
GH_RuleOperator Enumeration
 Enumerate the possible ways rules can be strung together.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_RuleOperator
Public Enumeration GH_RuleOperator
Members
Member name | Value | Description
Conjunction | 0 |  Represents an and/also operator.
Disjunction | 1 |  Represents an or/else operator.
See Also
Reference
Grasshopper.Kernel.Data Namespace