Grasshopper SDK
GH_ColourCube.C0 Property
 Gets the first point in the corner point list.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point C0 { get; }
Public ReadOnly Property C0 As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourCube.C0"]
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace