Grasshopper SDK
GH_PointCharge.ElementGuid Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override Guid ElementGuid { get; }
Public Overrides ReadOnly Property ElementGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCharge.ElementGuid"]
See Also
Reference
GH_PointCharge Class
Grasshopper.Kernel.Types Namespace