Grasshopper SDK
GH_LoadingAttribute Constructor
Initializes a new instance of the GH_LoadingAttribute class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LoadingAttribute(
	GH_LoadingDemand demand
)
Public Sub New (
	demand As GH_LoadingDemand
)
Parameters
demand
Type: Grasshopper.Kernel.GH_LoadingDemand
See Also
Reference
GH_LoadingAttribute Class
Grasshopper.Kernel Namespace