Grasshopper SDK
GH_Document.IgnoredCount Property
 Returns the total numbers of components currently in the Object Exception Ignore List.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int IgnoredCount { get; }
Public ReadOnly Property IgnoredCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.IgnoredCount"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace