Grasshopper SDK
IGH_GeometricGoo.ClearCaches Method
 Clears all caches. Typically if the geometry is referenced, this will erase the local copy.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void ClearCaches()
Sub ClearCaches
See Also
Reference
IGH_GeometricGoo Interface
Grasshopper.Kernel.Types Namespace