Grasshopper SDK
IGH_GeometricGoo.IsReferencedGeometry Property
 Gets a value indicating whether or not this geometry is referenced. Not all IGH_GeometricGoo implementations support referenced geometry.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsReferencedGeometry { get; }
ReadOnly Property IsReferencedGeometry As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_GeometricGoo.IsReferencedGeometry"]
See Also
Reference
IGH_GeometricGoo Interface
Grasshopper.Kernel.Types Namespace