Grasshopper SDK
GH_Slider.TickFrequency Property
 Gets or sets the frequency of large ticks vs small ticks.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int TickFrequency { get; set; }
Public Property TickFrequency As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.TickFrequency"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace