Grasshopper SDK
GH_Goo<T>.CastTo<Q> Method
 Attempt a cast to type Q.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool CastTo<Q>(
	ref Q target
)
Public Overridable Function CastTo(Of Q) (
	ByRef target As Q
) As Boolean
Parameters
target
Type: Q
Pointer to target of cast.
Type Parameters
Q
Type to cast to.
Return Value
Type: Boolean
True on success, false on failure.
Implements
IGH_Goo.CastTo<T>(T)
Remarks
If false, the target instance contents are not guaranteed to be valid.
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace