Grasshopper SDK
GH_Format.FormatBoxValidity Method
 If the box is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatBoxValidity(
	Box val,
	string identifier = "Box"
)
Public Shared Function FormatBoxValidity (
	val As Box,
	Optional identifier As String = "Box"
) As String
Parameters
val
Type: Box
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the box is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace