Grasshopper SDK
GH_Document.DefaultSelectedPreviewColour Property
 Gets or sets the default preview colour for normal objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color DefaultSelectedPreviewColour { get; set; }
Public Shared Property DefaultSelectedPreviewColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.DefaultSelectedPreviewColour"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace