Grasshopper SDK
GH_TreeRules Constructor
 Constructs a new rule set for testing data trees. Unless you know exactly what you are doing, use the FromString() static method instead.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_TreeRules(
	IEnumerable<IGH_Rule> pathRules,
	IGH_Rule indexRule
)
Public Sub New (
	pathRules As IEnumerable(Of IGH_Rule),
	indexRule As IGH_Rule
)
Parameters
pathRules
Type: System.Collections.Generic.IEnumerable<IGH_Rule>
A collection of path rules.
indexRule
Type: Grasshopper.Kernel.Data.IGH_Rule
Optional index rule (may be null).
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace