Grasshopper SDK
GH_ComponentAttributes.RenderComponentParameters Method
 Utility method for rendering all component parameters.
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderComponentParameters(
	GH_Canvas canvas,
	Graphics graphics,
	IGH_Component owner,
	GH_PaletteStyle style
)
Public Shared Sub RenderComponentParameters (
	canvas As GH_Canvas,
	graphics As Graphics,
	owner As IGH_Component,
	style As GH_PaletteStyle
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas to draw to.
graphics
Type: System.Drawing.Graphics
Graphics to draw with.
owner
Type: Grasshopper.Kernel.IGH_Component
Component to draw parameters for.
style
Type: Grasshopper.GUI.Canvas.GH_PaletteStyle
Component capsule palette style.
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace