Grasshopper SDK
GH_SliderBase.Grip Property
 Gets the box of the current grip. If the slider value/limits are not set up correctly then this rectangle may well be outside of the bounds. If the limits are coincident, this will fail (divide by zero).
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RectangleF Grip { get; }
Public ReadOnly Property Grip As RectangleF
	Get
Property Value
Type: RectangleF
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.Grip"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace