Grasshopper SDK
GH_CanvasWidgetListEventArgs Class
 The event arguments are used in the WidgetListCreated event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.GUI.Canvas.GH_CanvasWidgetListEventArgs
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_CanvasWidgetListEventArgs : EventArgs
Public Class GH_CanvasWidgetListEventArgs
	Inherits EventArgs
The GH_CanvasWidgetListEventArgs type exposes the following members.
Methods
Name | Description
AddWidget
 Append a widget to the canvas.
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace