Grasshopper SDK
GH_FontControl.AllowFamilyOverride Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AllowFamilyOverride { get; set; }
Public Property AllowFamilyOverride As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FontControl.AllowFamilyOverride"]
See Also
Reference
GH_FontControl Class
Grasshopper.GUI Namespace