Grasshopper SDK
GH_QuickImageEditor Class
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Grasshopper.GUI.GH_QuickImageEditor
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_QuickImageEditor : Form
Public Class GH_QuickImageEditor
	Inherits Form
The GH_QuickImageEditor type exposes the following members.
Constructors
Name | Description
GH_QuickImageEditor
Initializes a new instance of the GH_QuickImageEditor class
Top
Properties
Name | Description
CanvasImage
 Gets or sets the canvas image.
FrameCrop
 Gets or sets the cropping rectangle.
FrameFocus
 Gets or sets the rectangle of the focus frame.
FrameViewport
 Gets or sets the rectangle of the viewport frame.
ViewportImage
 Gets or sets the viewport image.
ViewportName
 Gets or sets the viewport name to include. If the name string is null or empty, the active viewport is used.
Top
Methods
Name | Description
Dispose
Releases the unmanaged resources used by the GH_QuickImageEditor and optionally releases the managed resources
 (Overrides Form.Dispose(Boolean).)
Top
See Also
Reference
Grasshopper.GUI Namespace