Grasshopper SDK
GH_Canvas.GH_ImageSettings Constructor (String)
 Create a new instance of the GH_ImageSettings class.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ImageSettings(
	string filePath
)
Public Sub New (
	filePath As String
)
Parameters
filePath
Type: System.String
Target location for image.
See Also
Reference
GH_Canvas.GH_ImageSettings Class
GH_Canvas.GH_ImageSettings Overload
Grasshopper.GUI.Canvas Namespace