Grasshopper SDK
GH_DigitScrollerBase.MouseMove Method
 Respond to mouse-move events.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool MouseMove(
	MouseEventArgs args,
	PointF pt
)
Public Function MouseMove (
	args As MouseEventArgs,
	pt As PointF
) As Boolean
Parameters
args
Type: System.Windows.Forms.MouseEventArgs
Mouse Event arguments.
pt
Type: System.Drawing.PointF
Mouse cursor position in floating point accuracy.
Return Value
Type: Boolean
True if a Drag operation was performed, false if the event went unnoticed.
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace