Grasshopper SDK
IGH_PreviewArgs.WireColour Property
 Gets the document default colour for unselected Wires.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Color WireColour { get; }
ReadOnly Property WireColour As Color
	Get
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_PreviewArgs.WireColour"]
See Also
Reference
IGH_PreviewArgs Interface
Grasshopper.Kernel Namespace