Grasshopper SDK
IGH_DocumentObject.SolutionExpired Event
 Raised whenever the solution of a certain object becomes invalid.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
event IGH_DocumentObject.SolutionExpiredEventHandler SolutionExpired
Event SolutionExpired As IGH_DocumentObject.SolutionExpiredEventHandler
Value
Type: Grasshopper.Kernel.IGH_DocumentObject.SolutionExpiredEventHandler
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace