Grasshopper SDK
GH_Curve.GH_CurveProxy.Closed Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Closed { get; }
Public ReadOnly Property Closed As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Curve.GH_CurveProxy.Closed"]
See Also
Reference
GH_Curve.GH_CurveProxy Class
Grasshopper.Kernel.Types Namespace