Grasshopper SDK
GH_DocumentObject.RemovedFromDocument Method
 This method will be called when an object is removed from a document. Override this method if you want to handle such events.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void RemovedFromDocument(
	GH_Document document
)
Public Overridable Sub RemovedFromDocument (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document that now no longer owns this object.
Implements
IGH_DocumentObject.RemovedFromDocument(GH_Document)
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace