Grasshopper SDK
GH_Structure<T>.Paths Property
 Gets a list of all the paths in this structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<GH_Path> Paths { get; }
Public ReadOnly Property Paths As IList(Of GH_Path)
	Get
Property Value
Type: IList<GH_Path>
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.Paths"]
Implements
IGH_Structure.Paths
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace