Grasshopper SDK
GH_ComponentServer.CompleteRibbonLayout Property
 Gets the default component layout featuring all non-hidden components and parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Layout CompleteRibbonLayout { get; }
Public ReadOnly Property CompleteRibbonLayout As GH_Layout
	Get
Property Value
Type: GH_Layout
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.CompleteRibbonLayout"]
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace