Grasshopper SDK
GH_Structure<T>.FirstItem Property
 Gets the first item in the structure. If no such item exists, null is returned.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public T this[
	bool filter_nulls
] { get; }
Public ReadOnly Property FirstItem (
	filter_nulls As Boolean
) As T
	Get
Parameters
filter_nulls
Type: System.Boolean
If True, nulls will be skipped.
Property Value
Type: T
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.FirstItem(System.Boolean)"]
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace