Grasshopper SDK
GH_UserObject Class
 Represents a custom user object. A User Object is an existing IGH_DocumentObject with overridden icon, instance description and exposure.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_UserObject
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_UserObject
Public Class GH_UserObject
The GH_UserObject type exposes the following members.
Constructors
Name | Description
GH_UserObject()
 Empty constructor
GH_UserObject(String)
 Create a new user object from an existing *.ghuser file.
Top
Properties
Name | Description
BaseGuid
 Gets or sets the ComponentID of the IGH_DocumentObject that functions as the base class for this User Object.
Data
 Gets or sets the serialized data. This data is used to deserialize a new instance of the base class.
Description
 Gets or sets the Instance Description override for this User Object.
Exposure
 Gets or sets the Exposure of this User Object.
Guid
 Gets or sets the Guid of this User Object. The Guid is created anew during construction and is not stored in the User Object File. You should never have to set this field.
Icon
 Gets or sets the icon associated with this User Object. If the icon hasn't been overridden, then a Default icon is returned.
Path
 Gets or sets the file path this User Object is loaded from or saved to.
Top
Methods
Name | Description
Clear
 Destroy all data except the file path and the ID.
CreateDefaultPath
 Set the Path field for this user object to the default. The default file name is derived from the Description.Name field. This method also ensures the UserObject directory exists.
InstantiateObject
 Instantiate a new IGH_DocumentObject from this User Object.
ReadFromFile
 Force an update of the local data from the file. The Path field must be set for this to work.
SaveToFile
 Save the current User Object state to a file. Any existing file will be overwritten.
SetDataFromObject
 Set the Data field content of ths UserObject from a Document object instance.
Top
See Also
Reference
Grasshopper.Kernel Namespace