Grasshopper SDK
IGH_DocumentObject.OnObjectChanged Method (GH_ObjectEventType)
 Raises the ObjectChanged event on the current (!not the top level!) object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void OnObjectChanged(
	GH_ObjectEventType eventType
)
Sub OnObjectChanged (
	eventType As GH_ObjectEventType
)
Parameters
eventType
Type: Grasshopper.Kernel.GH_ObjectEventType
Type of change.
See Also
Reference
IGH_DocumentObject Interface
OnObjectChanged Overload
Grasshopper.Kernel Namespace