Grasshopper SDK
IGH_TagArtist.Paint Method
 This method is called whenever a Canvas channel is painted
Namespace: Grasshopper.GUI.Canvas.TagArtists
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void Paint(
	GH_Canvas canvas,
	GH_CanvasChannel channel
)
Sub Paint (
	canvas As GH_Canvas,
	channel As GH_CanvasChannel
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas that is currently painting.
channel
Type: Grasshopper.GUI.Canvas.GH_CanvasChannel
Channel that is currently being painted.
See Also
Reference
IGH_TagArtist Interface
Grasshopper.GUI.Canvas.TagArtists Namespace