Grasshopper SDK
GH_FontList.FontStyle Property
 Gets or sets the font style for all families.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public FontStyle FontStyle { get; set; }
Public Property FontStyle As FontStyle
	Get
	Set
Property Value
Type: FontStyle
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FontList.FontStyle"]
See Also
Reference
GH_FontList Class
Grasshopper.GUI Namespace