Grasshopper SDK
GH_Text.Create Method
 Create a new instance of GH_Text.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Text Create(
	string text
)
Public Shared Function Create (
	text As String
) As GH_Text
Parameters
text
Type: System.String
Text to wrap.
Return Value
Type: GH_Text
See Also
Reference
GH_Text Class
Grasshopper.Documentation Namespace