Grasshopper SDK
GH_Grip.Parameter Property
 Gets or sets the numeric parameter of the grip.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Parameter { get; set; }
Public Property Parameter As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_Grip.Parameter"]
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace