Grasshopper SDK
GH_Document.PreviewMeshType Property
 Gets or sets the preview mesh type for this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PreviewMesh PreviewMeshType { get; set; }
Public Property PreviewMeshType As GH_PreviewMesh
	Get
	Set
Property Value
Type: GH_PreviewMesh
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.PreviewMeshType"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace