Grasshopper SDK
IGH_DocumentObject.PingDocumentEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void PingDocumentEventHandler(
	IGH_DocumentObject sender,
	GH_PingDocumentEventArgs e
)
Public Delegate Sub PingDocumentEventHandler (
	sender As IGH_DocumentObject,
	e As GH_PingDocumentEventArgs
)
Parameters
sender
Type: Grasshopper.Kernel.IGH_DocumentObject
e
Type: Grasshopper.Kernel.GH_PingDocumentEventArgs
See Also
Reference
Grasshopper.Kernel Namespace