Grasshopper SDK
GH_TreeRules.HasPathRules Property
 Gets whether this rule set has any path rules.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool HasPathRules { get; }
Public ReadOnly Property HasPathRules As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_TreeRules.HasPathRules"]
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace