Grasshopper SDK
GH_Document.DefaultPreviewColourChanged Event
 This even is raised whenever the global default for Normal preview colour is changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_Document.DefaultPreviewColourChangedEventHandler DefaultPreviewColourChanged
Public Shared Event DefaultPreviewColourChanged As GH_Document.DefaultPreviewColourChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.DefaultPreviewColourChangedEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace