Grasshopper SDK
IGH_PreviewArgs.Display Property
 Gets the Pipeline that is being used to draw the current preview.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
DisplayPipeline Display { get; }
ReadOnly Property Display As DisplayPipeline
	Get
Property Value
Type: DisplayPipeline
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_PreviewArgs.Display"]
See Also
Reference
IGH_PreviewArgs Interface
Grasshopper.Kernel Namespace