Grasshopper SDK
GH_Format.FormatSurface Method (GH_Surface)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatSurface(
	GH_Surface data
)
Public Shared Function FormatSurface (
	data As GH_Surface
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Surface
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatSurface Overload
Grasshopper.Kernel Namespace