Grasshopper SDK
GH_RhinoScriptInterface.SetSliderRangeAndValue Method
 Find a slider and assign a new value.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool SetSliderRangeAndValue(
	string sliderID,
	double value,
	double minimum,
	double maximum
)
Public Function SetSliderRangeAndValue (
	sliderID As String,
	value As Double,
	minimum As Double,
	maximum As Double
) As Boolean
Parameters
sliderID
Type: System.String
Slider ID.
value
Type: System.Double
New value. If the value exceeds the limits, it will be clipped.
minimum
Type: System.Double
New slider minimum.
maximum
Type: System.Double
New slider maximum.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace