Grasshopper SDK
GH_MemoryBitmap.Height Property
 Gets the height (in pixels) of the local image.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Height { get; }
Public ReadOnly Property Height As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_MemoryBitmap.Height"]
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace