Grasshopper SDK
CentralSettings.PreviewGumballs Property
 Gets or sets whether the gumballs will be visible for selected preview geometry.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool PreviewGumballs { get; set; }
Public Shared Property PreviewGumballs As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.PreviewGumballs"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace