Grasshopper SDK
GH_Canvas.ThumbnailSize Property
 Gets the thumbnail size for documents.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Size ThumbnailSize { get; }
Public Shared ReadOnly Property ThumbnailSize As Size
	Get
Property Value
Type: Size
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.ThumbnailSize"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace