Grasshopper SDK
GH_LoadingInstruction Enumeration
 Enumerates all external GHA loading process instructions.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_LoadingInstruction
Public Enumeration GH_LoadingInstruction
Members
Member name | Value | Description
Proceed | 0 |  Proceed with GHA loading.
Abort | 1 |  Abort the GHA loading, all your components will be skipped.
See Also
Reference
Grasshopper.Kernel Namespace