Grasshopper SDK
GH_GraphicsUtil.BoxClosestPoint Method (PointF, RectangleF)
 Find the closest point on or in a box given a test point.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static PointF BoxClosestPoint(
	PointF pt,
	RectangleF box
)
Public Shared Function BoxClosestPoint (
	pt As PointF,
	box As RectangleF
) As PointF
Parameters
pt
Type: System.Drawing.PointF
Sample point.
box
Type: System.Drawing.RectangleF
Box to evaluate.
Return Value
Type: PointF
See Also
Reference
GH_GraphicsUtil Class
BoxClosestPoint Overload
Grasshopper.GUI Namespace