Grasshopper SDK
GH_ColourPickerBase.DrawAlphaSlider Property
 Gets or sets whether or not the alpha slider is included in the UI.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DrawAlphaSlider { get; set; }
Public Property DrawAlphaSlider As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.DrawAlphaSlider"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace