Grasshopper SDK
GH_State.Data Property (Int32)
 Gets the state data stored under the specified index
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string this[
	int index
] { get; }
Public ReadOnly Default Property Data (
	index As Integer
) As String
	Get
Parameters
index
Type: System.Int32
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_State.Data(System.Int32)"]
See Also
Reference
GH_State Class
Data Overload
Grasshopper.Kernel Namespace