Grasshopper SDK
GH_MemoryBitmap.Filter_GreyScale Method (Double)
 Convert the image to a greyscale shadow of its former self.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_GreyScale(
	double amount
)
Public Sub Filter_GreyScale (
	amount As Double
)
Parameters
amount
Type: System.Double
Greyscale factor. 1.0 equals complete greyscale, 0.0 equals no greyscale, -1.0 equals inverse greyscale
See Also
Reference
GH_MemoryBitmap Class
Filter_GreyScale Overload
Grasshopper.Kernel Namespace