Grasshopper SDK
GH_TreeRules.SequenceCode Field
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string SequenceCode = "..."
Public Const SequenceCode As String = "..."
Field Value
Type: String
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace