Grasshopper SDK
GH_UpgradeUtil.MigrateRecipients Method
 Migrate all recipients from A to B, while maintaining order.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int MigrateRecipients(
	IGH_Param from,
	IGH_Param to
)
Public Shared Function MigrateRecipients (
	from As IGH_Param,
	to As IGH_Param
) As Integer
Parameters
from
Type: Grasshopper.Kernel.IGH_Param
Parameter to move recipients from.
to
Type: Grasshopper.Kernel.IGH_Param
Parameter to move recipients to.
Return Value
Type: Int32
Number of recipients migrated.
See Also
Reference
GH_UpgradeUtil Class
Grasshopper.Kernel Namespace