Grasshopper SDK
GH_CustomEventServer.GuidTable Property
 Gets direct access to the internal guid table. The table contains pairs of object Ids and runtime serial numbers.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public SortedDictionary<Guid, uint> GuidTable { get; }
Public ReadOnly Property GuidTable As SortedDictionary(Of Guid, UInteger)
	Get
Property Value
Type: SortedDictionary<Guid, UInt32>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_CustomEventServer.GuidTable"]
See Also
Reference
GH_CustomEventServer Class
Grasshopper.Kernel Namespace