Grasshopper SDK
GH_GraphicsUtil.RenderBalloonTag Method (Graphics, String, PointF, RectangleF)
 Draw a default balloon tag in a container.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderBalloonTag(
	Graphics g,
	string text,
	PointF tip,
	RectangleF container
)
Public Shared Sub RenderBalloonTag (
	g As Graphics,
	text As String,
	tip As PointF,
	container As RectangleF
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
text
Type: System.String
Text of tag.
tip
Type: System.Drawing.PointF
Tip of balloon.
container
Type: System.Drawing.RectangleF
Container for balloon.
See Also
Reference
GH_GraphicsUtil Class
RenderBalloonTag Overload
Grasshopper.GUI Namespace