Grasshopper SDK
GH_PickBox Enumeration
 Represents the different ways in which picking rectangles can behave.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_PickBox
Public Enumeration GH_PickBox
Members
Member name | Value | Description
Window | 0 |  The picking box must completely surround the object box.
Crossing | 1 |  The picking box must only partially intersect the object box.
See Also
Reference
Grasshopper.Kernel Namespace