Grasshopper SDK
GH_ScriptVariant Implicit Conversion (Point3d to GH_ScriptVariant)
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static implicit operator GH_ScriptVariant (
	Point3d in
)
Public Shared Widening Operator CType (
	in As Point3d
) As GH_ScriptVariant
Parameters
in
Type: Point3d
Return Value
Type: GH_ScriptVariant
See Also
Reference
GH_ScriptVariant Class
Implicit Overload
Grasshopper.Kernel.Expressions Namespace