Grasshopper SDK
GH_Attributes<T> Class
 Derive from this class rather than implementing IGH_Attributes from scratch.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_Attributes<T>
 Grasshopper.Kernel.Attributes.GH_ComponentAttributes
 Grasshopper.Kernel.Attributes.GH_FloatingParamAttributes
 Grasshopper.Kernel.Attributes.GH_LinkedParamAttributes
 Grasshopper.Kernel.Attributes.GH_ResizableAttributes<T>
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_Attributes<T> : IGH_Attributes
where T : IGH_DocumentObject
Public MustInherit Class GH_Attributes(Of T As IGH_DocumentObject)
	Implements IGH_Attributes
Type Parameters
T
Type of the objects that owns these attributes.
The GH_Attributes<T> type exposes the following members.
Constructors
Name | Description
GH_Attributes<T>
 Construct a new instance of this class.
Top
Properties
Name | Description
AllowMessageBalloon
 Gets a value indicating whether these attributes allow warning and error balloons to be drawn on top of them.
Bounds
 Gets the rectangle that contains the active content of the attributes. Typically the Contents determine the active area for menus, tooltips etc. Attributes are not supposed to draw objects beyond the Bounds.
DocObject
 Gets the owner object of these attributes.
GetTopLevel
 Gets the top-level attributes of the attribute stack these attributes belong to.
HasInputGrip
 Gets a value indicating whether or not these attributes have an input grip.
HasOutputGrip
 Gets a value indicating whether or not these attributes have an output grip.
InputGrip
 Gets the input grip location for these attributes. If HasInputGrip equals False, this point is meaningless.
InstanceGuid
 Gets the instance ID of the document object that owns these attributes.
IsTopLevel
 Gets whether these attributes are top_level (i.e. no Parent attributes)
OutputGrip
 Gets the output grip location for these attributes. If HasOutputGrip equals False, this point is meaningless.
Owner
 Gets the type-safe owner object of these attributes. This property is identical to the DocObject property.
Parent
 Gets or sets the parent attributes. Top level attributes do not have parents.
PathName
 Get a description of the location of these attributes within the local attribute stack.
Pivot
 Gets or sets the pivot for these attributes. The pivot controls the general placement of the attributes. If you want to move the attributes, change the pivot location.
Selected
 Gets or sets the selected state of the top-level attributes.
TooltipEnabled
 Gets the tooltip enabled value. If False, no further tooltip functions will be called.
Top
Methods
Name | Description
AppendToAttributeTree
 Recursively append these attributes and all child attributes to the attribute list.
ExpireLayout
 Expires the entire layout of the attributes. When overridden, implementer must place a call to the base class ExpireLayout().
InvalidateCanvas
 If the mouse location should cause a canvas invalidation then return true. You only need to override this function if you draw objects that are dependant on cursor positions outside the bounds of the attributes.
IsIconMode
 Utility function for determining Icon display modes. If the supplied mode is ::application, then it will be adjusted to match the current app settings.
IsMenuRegion
 Determines whether a point is available for context menu popups. By default, IsMenuRegion calls IsPickRegion(PointF).
IsPickRegion(PointF)
 Determines whether a point is within the pickable region for this object. By default, any point inside the Bounds is treated as pickable.
IsPickRegion(RectangleF, GH_PickBox)
 Determines whether a rectangle is a valid pick region for this object. By default, the picking rectangle is intersected with the Bounds rectangle.
IsTooltipRegion
 Determines whether a point is available for tooltip popups. By default, IsMenuRegion calls IsTooltipRegion(PointF).
Layout
 Perform dedicated layout logic specific to this particular DocumentObject. This method is called from PerformLayout if the existing layout is stale.
NewInstanceGuid()
 Generate a new instance GUID for the owner object.
NewInstanceGuid(Guid)
 Generate a new instance GUID for the owner object. Do not use this overload unless you're > 1.95m and called David.
PerformLayout
 Recompute the layout for these attributes. This function is automatically called during Drawing operations, so you typically don't have to.
PrepareForRender
 This method will always be called exactly once prior to Render(). This would be a good place to make sure all the necessary GUI data is up and running.
Read
Render
 Override this function to supply custom Render logic.
RenderIncomingWires(GH_Painter, IEnumerable<IGH_Param>, GH_ParamWireDisplay)
 Utility function for derived classes. This method draws all the wires going into the left side of the attributes.
RenderIncomingWires(GH_Painter, IEnumerable<IGH_Param>, IEnumerable<Pen>)
 Utility function for derived classes. This method draws all the wires going into the left side of the attributes.
RenderToCanvas
 Render these attributes into a Canvas control. This function places calls to PrepareForRender() and Render(), you should override those.
RespondToKeyDown
RespondToKeyUp
RespondToMouseDoubleClick
RespondToMouseDown
RespondToMouseMove
RespondToMouseUp
SetupTooltip
 Populates the Grasshopper tooltip with all relevant data. If this function returns True, it is assumed that all possible fields have been filled out and the tooltip is ready for display.
Write
Top
See Also
Reference
Grasshopper.Kernel Namespace