Grasshopper SDK
GH_ColourPickerBase.Invalidated Event
 Raised whenever a redraw is required.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_ColourPickerBase.InvalidatedEventHandler Invalidated
Public Event Invalidated As GH_ColourPickerBase.InvalidatedEventHandler
Value
Type: Grasshopper.GUI.Base.GH_ColourPickerBase.InvalidatedEventHandler
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace