Grasshopper SDK
GH_Target Enumeration
 Enumerates the possible link targets in Grasshopper documentation.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_Target
Public Enumeration GH_Target
Members
Member name | Value | Description
Glossary | 0 |  Specifies a link into the Glossary.
Topic | 1 |  Specifies a link to another topic.
External | 2 |  Specifies a link to some external web-page.
See Also
Reference
Grasshopper.Documentation Namespace