Grasshopper SDK
GH_Document.Select Method (GH_RelevantObjectData)
 Default pick selection behaviour. (looks at current Shift + Control modifier states to determine addition/removal)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SelectionState Select(
	GH_RelevantObjectData obj_dat
)
Public Function Select (
	obj_dat As GH_RelevantObjectData
) As GH_SelectionState
Parameters
obj_dat
Type: Grasshopper.Kernel.GH_RelevantObjectData
Information regarding the object to be selected.
Return Value
Type: GH_SelectionState
See Also
Reference
GH_Document Class
Select Overload
Grasshopper.Kernel Namespace