Grasshopper SDK
GH_AsynchFileData.ReadThumbnail Property
 Gets or sets whether the thumbnail ought to be parsed. At the moment this only makes sense for GH/GHX files.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ReadThumbnail { get; set; }
Public Property ReadThumbnail As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_AsynchFileData.ReadThumbnail"]
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace