Grasshopper SDK
Node3d<T>.Remove Method (Int32)
 Remove the item with the given index from the entire tree. It doesn't matter on which node you call this function, it is a tree-wide operation.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Remove(
	int index
)
Public Sub Remove (
	index As Integer
)
Parameters
index
Type: System.Int32
Index of item to remove.
See Also
Reference
Node3d<T> Class
Remove Overload
Grasshopper.Kernel.Geometry.SpatialTrees Namespace