Grasshopper SDK
GH_Format.FormatComplexNumber Method (GH_ComplexNumber)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatComplexNumber(
	GH_ComplexNumber data
)
Public Shared Function FormatComplexNumber (
	data As GH_ComplexNumber
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_ComplexNumber
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatComplexNumber Overload
Grasshopper.Kernel Namespace