Grasshopper SDK
GH_CanvasValidator.CanDragObject Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool CanDragObject(
	IGH_DocumentObject object,
	PointF dragFromPoint
)
Public Overridable Function CanDragObject (
	object As IGH_DocumentObject,
	dragFromPoint As PointF
) As Boolean
Parameters
object
Type: Grasshopper.Kernel.IGH_DocumentObject
dragFromPoint
Type: System.Drawing.PointF
Return Value
Type: Boolean
Implements
IGH_CanvasValidator.CanDragObject(IGH_DocumentObject, PointF)
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace