Grasshopper SDK
GH_DocumentTree.RootDocument Property
 Gets the document inside the root node of this tree.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document RootDocument { get; }
Public ReadOnly Property RootDocument As GH_Document
	Get
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentTree.RootDocument"]
See Also
Reference
GH_DocumentTree Class
Grasshopper.Kernel Namespace