Grasshopper SDK
GH_DigitScrollerBase.SuffixBox Property
 Gets the box containing the suffix string. If there is no suffix the PrefixBox will have zero width
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle SuffixBox { get; }
Public ReadOnly Property SuffixBox As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.SuffixBox"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace