Grasshopper SDK
GH_DocumentServer.GetEnumerator_Generic Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IEnumerator<GH_Document> GetEnumerator_Generic()
Public Function GetEnumerator_Generic As IEnumerator(Of GH_Document)
Return Value
Type: IEnumerator<GH_Document>
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace