Grasshopper SDK
GH_Document.ClearIgnoreList Method
 Clears the Object Exception Ignore List.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearIgnoreList()
Public Sub ClearIgnoreList
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace