Grasshopper SDK
GH_SyntaxException Constructor
Initializes a new instance of the GH_SyntaxException class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SyntaxException(
	string nMessage
)
Public Sub New (
	nMessage As String
)
Parameters
nMessage
Type: System.String
See Also
Reference
GH_SyntaxException Class
Grasshopper.Kernel.Expressions Namespace