Grasshopper SDK
GH_DocDiagramPainter Constructor
Initializes a new instance of the GH_DocDiagramPainter class
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocDiagramPainter()
Public Sub New
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace