Grasshopper SDK
GH_MeshingParameters Constructor (MeshingParameters)
Initializes a new instance of the GH_MeshingParameters class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MeshingParameters(
	MeshingParameters other
)
Public Sub New (
	other As MeshingParameters
)
Parameters
other
Type: MeshingParameters
See Also
Reference
GH_MeshingParameters Class
GH_MeshingParameters Overload
Grasshopper.Kernel.Types Namespace