Grasshopper SDK
Projection Class
 Implements a projection transformation.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.Transforms.Projection
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class Projection : ITransform
Public Class Projection
	Implements ITransform
The Projection type exposes the following members.
Constructors
Name | Description
Projection()
Initializes a new instance of the Projection class
Projection(Plane)
Initializes a new instance of the Projection class
Top
Properties
Name | Description
Name
ProjectionPlane
Top
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Grasshopper.Kernel.Types.Transforms Namespace