Grasshopper SDK
GH_Component.GH_InputParamManager.AddIntervalParameter Method (String, String, String, GH_ParamAccess, Interval)
 Add an Interval (i.e. numeric domain) parameter to the input list of this component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int AddIntervalParameter(
	string name,
	string nickname,
	string description,
	GH_ParamAccess access,
	Interval default
)
Public Function AddIntervalParameter (
	name As String,
	nickname As String,
	description As String,
	access As GH_ParamAccess,
	default As Interval
) As Integer
Parameters
name
Type: System.String
The name of the parameter. Keep it short, single words are best.
nickname
Type: System.String
The nickname of the parameter. Keep it short, single characters are best.
description
Type: System.String
The description of the parameter. Be succinct but clear, single sentences are best.
access
Type: Grasshopper.Kernel.GH_ParamAccess
Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default
Type: Interval
A default value to store in the parameter Persistent Data.
Return Value
Type: Int32
See Also
Reference
GH_Component.GH_InputParamManager Class
AddIntervalParameter Overload
Grasshopper.Kernel Namespace