Grasshopper SDK
GH_CapsuleRenderEngine.RenderOutputGrip Method
 Static (Shared in VB) method to render a default output grip.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderOutputGrip(
	Graphics G,
	float zoom,
	PointF loc,
	bool full
)
Public Shared Sub RenderOutputGrip (
	G As Graphics,
	zoom As Single,
	loc As PointF,
	full As Boolean
)
Parameters
G
Type: System.Drawing.Graphics
Graphics objects to draw with.
zoom
Type: System.Single
Zoom level of graphics surface.
loc
Type: System.Drawing.PointF
Location of grip.
full
Type: System.Boolean
If true, a complete circular grip will be draw. If false, a semi-circular grip will be drawn.
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace