Grasshopper SDK
GH_Attributes<T>.IsMenuRegion Method
 Determines whether a point is available for context menu popups. By default, IsMenuRegion calls IsPickRegion(PointF).
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool IsMenuRegion(
	PointF point
)
Public Overridable Function IsMenuRegion (
	point As PointF
) As Boolean
Parameters
point
Type: System.Drawing.PointF
Point location to test.
Return Value
Type: Boolean
Implements
IGH_Attributes.IsMenuRegion(PointF)
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace