Grasshopper SDK
GH_DocumentIO.SaveAsCopyDocumentDialog Method
 Display the Save As Copy GH/GHX dialog.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string SaveAsCopyDocumentDialog(
	string path = null
)
Public Function SaveAsCopyDocumentDialog (
	Optional path As String = Nothing
) As String
Parameters
path (Optional)
Type: System.String
Optional default path.
Return Value
Type: String
FileName specified via the Save As Copy dialog or null if the dialog was cancelled.
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace