Grasshopper SDK
GH_GlossaryItem.Descriptions Property
 Gets the description (definition) for this glossary entry.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_Content> Descriptions { get; }
Public ReadOnly Property Descriptions As List(Of IGH_Content)
	Get
Property Value
Type: List<IGH_Content>
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_GlossaryItem.Descriptions"]
See Also
Reference
GH_GlossaryItem Class
Grasshopper.Documentation Namespace