Grasshopper SDK
GH_ScriptVariant Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Expressions.GH_ScriptVariant
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ScriptVariant
Public Class GH_ScriptVariant
The GH_ScriptVariant type exposes the following members.
Constructors
Name | Description
GH_ScriptVariant()
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Plane)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Point3d)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Vector3d)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Boolean)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Byte)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(DateTime)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Double)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(Int32)
Initializes a new instance of the GH_ScriptVariant class
GH_ScriptVariant(String)
Initializes a new instance of the GH_ScriptVariant class
Top
Properties
Name | Description
Boolean
DateTime
Double
Integer
Object
Plane
Point
String
Type
Vector
Top
Methods
Name | Description
ThrowNullOperatorException
ThrowOperatorException(String, GH_ScriptVariantType)
ThrowOperatorException(String, String)
ThrowOperatorException(String, GH_ScriptVariantType, GH_ScriptVariantType)
ThrowOperatorException(String, String, String)
ToString |  (Overrides Object.ToString().)
Top
Operators
Name | Description
Addition
BitwiseAnd
BitwiseOr
Concatenate
Division
Equality
ExclusiveOr
Explicit(GH_ScriptVariant to Boolean)
Explicit(GH_ScriptVariant to Int32)
Explicit(GH_ScriptVariant to Double)
Explicit(GH_ScriptVariant to String)
Explicit(GH_ScriptVariant to DateTime)
Explicit(GH_ScriptVariant to Point3d)
Explicit(GH_ScriptVariant to Vector3d)
Explicit(GH_ScriptVariant to Plane)
Exponent
False
GreaterThan
GreaterThanOrEqual
Implicit(Plane to GH_ScriptVariant)
Implicit(Point3d to GH_ScriptVariant)
Implicit(Vector3d to GH_ScriptVariant)
Implicit(Boolean to GH_ScriptVariant)
Implicit(DateTime to GH_ScriptVariant)
Implicit(Double to GH_ScriptVariant)
Implicit(Int32 to GH_ScriptVariant)
Implicit(String to GH_ScriptVariant)
Inequality
IntegerDivision
LeftShift
LessThan
LessThanOrEqual
Modulus
Multiply
OnesComplement
RightShift
Subtraction
True
UnaryNegation
UnaryPlus
Top
Fields
Name | Description
m_type
m_value
Top
See Also
Reference
Grasshopper.Kernel.Expressions Namespace