Grasshopper SDK
GH_Plane.DrawPlane Method (DisplayPipeline, Plane, Double, Int32, Color, Color, Color)
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void DrawPlane(
	DisplayPipeline display,
	Plane plane,
	double size,
	int frequency,
	Color grid_color,
	Color x_color,
	Color y_color
)
Public Shared Sub DrawPlane (
	display As DisplayPipeline,
	plane As Plane,
	size As Double,
	frequency As Integer,
	grid_color As Color,
	x_color As Color,
	y_color As Color
)
Parameters
display
Type: DisplayPipeline
plane
Type: Plane
size
Type: System.Double
frequency
Type: System.Int32
grid_color
Type: System.Drawing.Color
x_color
Type: System.Drawing.Color
y_color
Type: System.Drawing.Color
See Also
Reference
GH_Plane Class
DrawPlane Overload
Grasshopper.Kernel.Types Namespace