Grasshopper SDK
GH_Gradient.MouseMove Method
 Continue grip dragging operation.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool MouseMove(
	RectangleF dest,
	PointF pt
)
Public Function MouseMove (
	dest As RectangleF,
	pt As PointF
) As Boolean
Parameters
dest
Type: System.Drawing.RectangleF
Destination rectangle of gradient.
pt
Type: System.Drawing.PointF
Mouse position in destination coordinates.
Return Value
Type: Boolean
True if a grip position was changed, false otherwise. Redraws are only required on TRUE.
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace