Grasshopper SDK
Versioning.SyncVersionHistoryData Method
 Attempts to download the version history information. The downloaded data (if the download works) will eventually be stored at: Grasshopper.Folders.VersionHistoryFile
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void SyncVersionHistoryData()
Public Shared Sub SyncVersionHistoryData
See Also
Reference
Versioning Class
Grasshopper Namespace