Grasshopper SDK
IGH_DocumentObject.OnPreviewExpired Method
 Raises the PreviewExpired event on the toplevel object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void OnPreviewExpired(
	bool redraw
)
Sub OnPreviewExpired (
	redraw As Boolean
)
Parameters
redraw
Type: System.Boolean
If True, the viewports will be immediately redrawn.
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace