Grasshopper SDK
IGH_Tooltip.Description Property
 Gets or sets the tooltip Description. The Description is optional and is displayed in the same area as the TooltipDiagram image.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Description { get; set; }
Property Description As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_Tooltip.Description"]
See Also
Reference
IGH_Tooltip Interface
Grasshopper.GUI Namespace