Grasshopper SDK
GH_WireSettings.EmptyColour Property
 Gets or sets the colour to use for empty wires.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color EmptyColour { get; set; }
Public Property EmptyColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_WireSettings.EmptyColour"]
See Also
Reference
GH_WireSettings Class
Grasshopper.GUI.Theme Namespace