Grasshopper SDK
GH_StateServer.RestoreState Method (Int32, Int32, Int32)
 Restore a certain state.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RestoreState(
	int index,
	out int restored_objects,
	out int missing_objects
)
Public Function RestoreState (
	index As Integer,
	<OutAttribute> ByRef restored_objects As Integer,
	<OutAttribute> ByRef missing_objects As Integer
) As Boolean
Parameters
index
Type: System.Int32
Index of state to restore.
restored_objects
Type: System.Int32
Number of objects successfully restored.
missing_objects
Type: System.Int32
Number of objects that could not be found.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_StateServer Class
RestoreState Overload
Grasshopper.Kernel Namespace