Grasshopper SDK
GH_FontServer.MeasureString Method (String, Font, Single)
 Measure the size of a string
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Size MeasureString(
	string text,
	Font font,
	float maxwidth
)
Public Shared Function MeasureString (
	text As String,
	font As Font,
	maxwidth As Single
) As Size
Parameters
text
Type: System.String
The string to measure
font
Type: System.Drawing.Font
The font to measure with
maxwidth
Type: System.Single
The maximum width (in pixels) for the layout
Return Value
Type: Size
See Also
Reference
GH_FontServer Class
MeasureString Overload
Grasshopper.Kernel Namespace