Grasshopper SDK
GH_Canvas.HideMRUPanels Method
 Hide all existing MRU panels by sliding them out of view.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void HideMRUPanels()
Public Sub HideMRUPanels
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace