Grasshopper SDK
GH_Attributes<T>.IsTooltipRegion Method
 Determines whether a point is available for tooltip popups. By default, IsMenuRegion calls IsTooltipRegion(PointF).
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool IsTooltipRegion(
	PointF point
)
Public Overridable Function IsTooltipRegion (
	point As PointF
) As Boolean
Parameters
point
Type: System.Drawing.PointF
Point location to test.
Return Value
Type: Boolean
Implements
IGH_TooltipAwareObject.IsTooltipRegion(PointF)
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace