Grasshopper SDK
GH_FontScroller Class
 Represents a panel with a scrolling collection of pangrams.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.Panel
 Grasshopper.GUI.GH_DoubleBufferedPanel
 Grasshopper.GUI.GH_FontScroller
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_FontScroller : GH_DoubleBufferedPanel
Public Class GH_FontScroller
	Inherits GH_DoubleBufferedPanel
The GH_FontScroller type exposes the following members.
Constructors
Name | Description
GH_FontScroller
Initializes a new instance of the GH_FontScroller class
Top
Properties
Name | Description
PostPaintDelegate
Top
Methods
Name | Description
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
Top
See Also
Reference
Grasshopper.GUI Namespace