Grasshopper SDK
GH_Convert.ToGHRectangle_Secondary Method
 Converts similar data into a GH_Rectangle instance. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToGHRectangle_Secondary(
	Object data,
	ref GH_Rectangle target
)
Public Shared Function ToGHRectangle_Secondary (
	data As Object,
	ByRef target As GH_Rectangle
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_Rectangle
Target instance. If null, a new GH_Rectangle will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace