Grasshopper SDK
GH_Style Enumeration
 Enumerates possible formatting for documentation content.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_Style
Public Enumeration GH_Style
Members
Member name | Value | Description
None | 0
WeakEmphasis | 1
StrongEmphasis | 2
Monospaced | 3
Boxed | 4
ChapterHeader | 5
ParagraphHeader | 6
See Also
Reference
Grasshopper.Documentation Namespace