Grasshopper SDK
GH_ComponentServer.ObjectProxyNames Property
 Returns a specialized string collection of all component names.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public AutoCompleteStringCollection ObjectProxyNames { get; }
Public ReadOnly Property ObjectProxyNames As AutoCompleteStringCollection
	Get
Property Value
Type: AutoCompleteStringCollection
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.ObjectProxyNames"]
Remarks
This property is used for autocompletion in textboxes.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace