Grasshopper SDK
GH_Format.FormatPointCloud Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatPointCloud(
	PointCloud data
)
Public Shared Function FormatPointCloud (
	data As PointCloud
) As String
Parameters
data
Type: PointCloud
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace