Grasshopper SDK
IGH_GeometricGoo.LoadGeometry Method
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool LoadGeometry()
Function LoadGeometry As Boolean
Return Value
Type: Boolean
See Also
Reference
IGH_GeometricGoo Interface
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace