Grasshopper SDK
GH_Viewport.VisibleRegion Property
 Gets the rectangle in canvas coordinates that is visible in the control.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RectangleF VisibleRegion { get; }
Public ReadOnly Property VisibleRegion As RectangleF
	Get
Property Value
Type: RectangleF
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.VisibleRegion"]
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace