Grasshopper SDK
GH_Format.FormatMesh Method (GH_Mesh)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatMesh(
	GH_Mesh data
)
Public Shared Function FormatMesh (
	data As GH_Mesh
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Mesh
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatMesh Overload
Grasshopper.Kernel Namespace