Grasshopper SDK
GH_Document.IsEscapeKeyDown Method
 Gets whether the escape key was pressed since the last time this function was called. Though in reality the actual escape state is checked no more than once every 50 milliseconds or so, which should be sufficient for a smooth user experience.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsEscapeKeyDown()
Public Shared Function IsEscapeKeyDown As Boolean
Return Value
Type: Boolean
True if escape was/is pressed, false if otherwise.
Remarks
If GetAsyncKeyState is called by some other application, it will mess with the value returned here, as GetAsyncKeyState is a system wide static method.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace