Grasshopper SDK
DataTree<T> Constructor (DataTree<T>)
 Create a shallow duplicate of another data tree. This means it will create a new tree that contains the same items.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DataTree(
	DataTree<T> other
)
Public Sub New (
	other As DataTree(Of T)
)
Parameters
other
Type: Grasshopper.DataTree<T>
Tree to duplicate
See Also
Reference
DataTree<T> Class
DataTree<T> Overload
Grasshopper Namespace