Grasshopper SDK
GH_AsynchFileData.RemoteUpdatePeriod Field
 Specifies the recommended number of milliseconds in between periodic checks for files on network drives.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int RemoteUpdatePeriod = 2500
Public Const RemoteUpdatePeriod As Integer = 2500
Field Value
Type: Int32
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace