Grasshopper SDK
GH_Skin.canvas_mono Field
 Canvas monochromatic flag. If True, the canvas background is a solid colour.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool canvas_mono
Public Shared canvas_mono As Boolean
Field Value
Type: Boolean
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace