Grasshopper SDK
IGH_TooltipAwareObject.TooltipEnabled Property
 Gets the tooltip enabled value. If False, no further tooltip functions will be called.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool TooltipEnabled { get; }
ReadOnly Property TooltipEnabled As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.IGH_TooltipAwareObject.TooltipEnabled"]
See Also
Reference
IGH_TooltipAwareObject Interface
Grasshopper.GUI.Canvas Namespace