Grasshopper SDK
IGH_ZuiAction.Name Property
 Gets the display name for this action. Keep it short and sweet.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Name { get; }
ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ZuiAction.Name"]
See Also
Reference
IGH_ZuiAction Interface
Grasshopper.Kernel Namespace