Grasshopper SDK
GH_Skin.zui_fill_highlight Field
 Specifies the default fill colour for highlighted ZUI elements.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color zui_fill_highlight
Public Shared zui_fill_highlight As Color
Field Value
Type: Color
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace