Grasshopper SDK
GH_Tooltip Class
 Implements a custom Tooltip class with advanced functionality. All methods and fields are Shared. There can never be more than one GH_Tooltip.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_Tooltip
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_Tooltip
Public NotInheritable Class GH_Tooltip
The GH_Tooltip type exposes the following members.
Properties
Name | Description
Tag
 Gets or sets the tag object for the tooltip
TooltipForm
 Gets the internal instance of GH_TooltipForm.
Top
Methods
Name | Description
Adjust
 Repositions the tooltip to match with new cursor positions.
AssignTooltipFields
 Set all fields of the Tooltip. You'll still need to call Show() to display the tooltip.
Clear
 Hides the tooltip and clears all references and caches.
IsOwner
 Returns true if the test control matches the internal Owner control. Use this method to make sure you actually own this tooltip prior to clearing it.
IsTag
 Returns True if the test object matches the internal Tag object
Layout
 Layout the tooltip fields. Layout happens automatically if you use the AssigTooltipField method, if however you poke values directly in the tooltip form you must place a call to Layout() before showing the tooltip.
Show
 Display the tooltip on screen.
TooltipDetailedInformation
Top
See Also
Reference
Grasshopper.GUI Namespace