Grasshopper SDK
GH_TooltipDisplayEventArgs.Valid Property
 Gets whether there is currently enough data to display a tooltip.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Valid { get; }
Public ReadOnly Property Valid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipDisplayEventArgs.Valid"]
See Also
Reference
GH_TooltipDisplayEventArgs Class
Grasshopper.GUI Namespace