Grasshopper SDK
GH_ObjectChangedEventArgs.CustomType Property
 Gets the customised type description of this event. This field is only set when the Type is GH_ObjectEventType.Custom.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string CustomType { get; }
Public ReadOnly Property CustomType As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ObjectChangedEventArgs.CustomType"]
See Also
Reference
GH_ObjectChangedEventArgs Class
Grasshopper.Kernel Namespace