Grasshopper SDK
GH_Box Constructor (Box)
Initializes a new instance of the GH_Box class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Box(
	Box box
)
Public Sub New (
	box As Box
)
Parameters
box
Type: Box
See Also
Reference
GH_Box Class
GH_Box Overload
Grasshopper.Kernel.Types Namespace