Grasshopper SDK
GH_TreeRules.Apply Method (GH_Path, Int32)
 Apply all the local rules to a path+index combination.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Apply(
	GH_Path path,
	int index
)
Public Function Apply (
	path As GH_Path,
	index As Integer
) As Boolean
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to test.
index
Type: System.Int32
Index to test.
Return Value
Type: Boolean
True if path+index pass all the rule tests.
See Also
Reference
GH_TreeRules Class
Apply Overload
Grasshopper.Kernel.Data Namespace