Grasshopper SDK
GH_DocumentObject Constructor (String, String, String, String, String)
Initializes a new instance of the GH_DocumentObject class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_DocumentObject(
	string name,
	string nickName,
	string description,
	string category,
	string subCategory
)
Protected Sub New (
	name As String,
	nickName As String,
	description As String,
	category As String,
	subCategory As String
)
Parameters
name
Type: System.String
nickName
Type: System.String
description
Type: System.String
category
Type: System.String
subCategory
Type: System.String
See Also
Reference
GH_DocumentObject Class
GH_DocumentObject Overload
Grasshopper.Kernel Namespace