Grasshopper SDK
CentralSettings.RibbonSeparators Property
 Gets or sets whether there are separators between different exposures on the component Ribbon.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool RibbonSeparators { get; set; }
Public Shared Property RibbonSeparators As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.RibbonSeparators"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace