Grasshopper SDK
GH_Document.TogglePreviewFlags Method
 Toggle the preview flags of all selected objects
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void TogglePreviewFlags()
Public Sub TogglePreviewFlags
See Also
Reference
GH_Document Class
TogglePreviewFlags Overload
Grasshopper.Kernel Namespace