Grasshopper SDK
GH_ExternalFile.FileSize Property
 Gets the file size (in bytes).
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public long FileSize { get; }
Public ReadOnly Property FileSize As Long
	Get
Property Value
Type: Int64
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ExternalFile.FileSize"]
See Also
Reference
GH_ExternalFile Class
Grasshopper.Kernel Namespace