Grasshopper SDK
GH_Format.FormatCurve Method (Curve, String, String)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatCurve(
	Curve data,
	string CrvPrefix = "",
	string CrvName = "Curve"
)
Public Shared Function FormatCurve (
	data As Curve,
	Optional CrvPrefix As String = "",
	Optional CrvName As String = "Curve"
) As String
Parameters
data
Type: Curve
CrvPrefix (Optional)
Type: System.String
CrvName (Optional)
Type: System.String
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatCurve Overload
Grasshopper.Kernel Namespace