Grasshopper SDK
IGH_DocumentObject.ObjectChanged Event
 Raised whenever some property of the object changes that would affect remote instances.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
event IGH_DocumentObject.ObjectChangedEventHandler ObjectChanged
Event ObjectChanged As IGH_DocumentObject.ObjectChangedEventHandler
Value
Type: Grasshopper.Kernel.IGH_DocumentObject.ObjectChangedEventHandler
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace