Grasshopper SDK
GH_ComponentParamServer.RegisterInputParam Method (IGH_Param, Int32)
 Add a parameter at the specific index of the input list.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RegisterInputParam(
	IGH_Param new_param,
	int at_index
)
Public Function RegisterInputParam (
	new_param As IGH_Param,
	at_index As Integer
) As Boolean
Parameters
new_param
Type: Grasshopper.Kernel.IGH_Param
at_index
Type: System.Int32
Return Value
Type: Boolean
See Also
Reference
GH_ComponentParamServer Class
RegisterInputParam Overload
Grasshopper.Kernel Namespace