Grasshopper SDK
GH_ConnectivityNode Constructor
Initializes a new instance of the GH_ConnectivityNode class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ConnectivityNode(
	GH_ConnectivityNode other
)
Public Sub New (
	other As GH_ConnectivityNode
)
Parameters
other
Type: Grasshopper.Kernel.GH_ConnectivityNode
See Also
Reference
GH_ConnectivityNode Class
Grasshopper.Kernel Namespace