Grasshopper SDK
GH_Canvas.Document_ModifiedChangedEventHandler Delegate
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void Document_ModifiedChangedEventHandler(
	GH_Document sender,
	GH_DocModifiedEventArgs e
)
Public Delegate Sub Document_ModifiedChangedEventHandler (
	sender As GH_Document,
	e As GH_DocModifiedEventArgs
)
Parameters
sender
Type: Grasshopper.Kernel.GH_Document
e
Type: Grasshopper.Kernel.GH_DocModifiedEventArgs
See Also
Reference
Grasshopper.GUI.Canvas Namespace