Grasshopper SDK
GH_MemoryBitmap.Filter_AlphaEdges Method
 Set the alpha component on all edges to a specific value.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_AlphaEdges(
	Padding padding,
	byte alpha_override
)
Public Sub Filter_AlphaEdges (
	padding As Padding,
	alpha_override As Byte
)
Parameters
padding
Type: System.Windows.Forms.Padding
Width of alpha band along all edges. Must be a valid padding construct.
alpha_override
Type: System.Byte
Value of alpha to apply.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace