Grasshopper SDK
GH_ColourPickerBase.Cube Property
 Gets the graphics object that describes the current colour cube.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ColourCube Cube { get; }
Public ReadOnly Property Cube As GH_ColourCube
	Get
Property Value
Type: GH_ColourCube
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.Cube"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace