Grasshopper SDK
GH_CanvasWireValidator.CanShowCanvasMenu Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CanShowCanvasMenu(
	PointF pt
)
Public Overrides Function CanShowCanvasMenu (
	pt As PointF
) As Boolean
Parameters
pt
Type: System.Drawing.PointF
Return Value
Type: Boolean
See Also
Reference
GH_CanvasWireValidator Class
Grasshopper.GUI.Canvas Namespace