Grasshopper SDK
GH_Variant Constructor (GH_Variant)
 Duplicate a Variant.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant(
	GH_Variant other
)
Public Sub New (
	other As GH_Variant
)
Parameters
other
Type: Grasshopper.Kernel.Expressions.GH_Variant
Variant to duplicate
See Also
Reference
GH_Variant Class
GH_Variant Overload
Grasshopper.Kernel.Expressions Namespace