Grasshopper SDK
GH_Convert.ToPoint3d_Secondary Method
 Attempts to convert other data types into an Point. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToPoint3d_Secondary(
	Object data,
	ref Point3d rc
)
Public Shared Function ToPoint3d_Secondary (
	data As Object,
	ByRef rc As Point3d
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Point3d
[out] Point cast.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace