Grasshopper SDK
GH_Palette Enumeration
 Lists all possible Capsule Palette styles in Grasshopper.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_Palette
Public Enumeration GH_Palette
Members
Member name | Value | Description
Normal | 0
Hidden | 1
Locked | 2
Warning | 3
Error | 4
White | 5
Grey | 6
Black | 7
Brown | 8
Pink | 9
Blue | 10
Transparent | 11
See Also
Reference
Grasshopper.GUI.Canvas Namespace