Grasshopper SDK
GH_Curve.ReferenceEdge Property
 Gets or sets the edge index for a referenced curve. If the index >= 0 then an edge reference is implied.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ReferenceEdge { get; set; }
Public Property ReferenceEdge As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Curve.ReferenceEdge"]
Remarks
If an edge reference is implied, then the ReferenceID must point to a RhinoBrepObject.
See Also
Reference
GH_Curve Class
Grasshopper.Kernel.Types Namespace