Grasshopper SDK
GH_Document.MergeDocument Method (GH_Document, Boolean, Boolean)
 Hoist all objects from another document into this one.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool MergeDocument(
	GH_Document other,
	bool resolveProxies,
	bool removeProxies
)
Public Function MergeDocument (
	other As GH_Document,
	resolveProxies As Boolean,
	removeProxies As Boolean
) As Boolean
Parameters
other
Type: Grasshopper.Kernel.GH_Document
The other document. Cannot be null.
resolveProxies
Type: System.Boolean
If True, an attempt is made to repair proxy sources after insertion.
removeProxies
Type: System.Boolean
If True, all remaining proxies will be deleted.
Return Value
Type: Boolean
Remarks
The objects will be moved, not copied. The other document ends up being empty since objects can only belong to one document at a time.
See Also
Reference
GH_Document Class
MergeDocument Overload
Grasshopper.Kernel Namespace