Grasshopper SDK
GH_SamplingSphere Constructor
Initializes a new instance of the GH_SamplingSphere class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SamplingSphere(
	int size
)
Public Sub New (
	size As Integer
)
Parameters
size
Type: System.Int32
See Also
Reference
GH_SamplingSphere Class
Grasshopper.GUI Namespace