Grasshopper SDK
GH_Animator<T>.ValueB Property
 Gets or sets the end value of the animation. This value is set from within the constructor though you can change it at any time.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public T ValueB { get; set; }
Public Property ValueB As T
	Get
	Set
Property Value
Type: T
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Animator`1.ValueB"]
See Also
Reference
GH_Animator<T> Class
Grasshopper.GUI Namespace