Grasshopper SDK
GH_DigitNumber.DigitCount Property
 Gets or sets the amount of digits in this number.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int DigitCount { get; }
Public ReadOnly Property DigitCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitNumber.DigitCount"]
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace