Grasshopper SDK
GH_Convert.ToVector3d Method
 Convert data into Rhino.Geometry.Vector3d.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToVector3d(
	Object data,
	ref Vector3d rc,
	GH_Conversion conversion_level
)
Public Shared Function ToVector3d (
	data As Object,
	ByRef rc As Vector3d,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Vector3d
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace