Grasshopper SDK
GH_Gradient.SelectionChanged Event
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Gradient.SelectionChangedEventHandler SelectionChanged
Public Event SelectionChanged As GH_Gradient.SelectionChangedEventHandler
Value
Type: Grasshopper.GUI.Gradient.GH_Gradient.SelectionChangedEventHandler
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace