Grasshopper SDK
GH_Colour Class
 Represents an ARGB colour. GH_Colour re-implements the framework System.Drawing.Color type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Color>
 Grasshopper.Kernel.Types.GH_Colour
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Colour : GH_Goo<Color>
Public Class GH_Colour
	Inherits GH_Goo(Of Color)
The GH_Colour type exposes the following members.
Constructors
Name | Description
GH_Colour()
 Blank constructor
GH_Colour(Color)
Initializes a new instance of the GH_Colour class
GH_Colour(GH_Colour)
Initializes a new instance of the GH_Colour class
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance.
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateColour
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace