Grasshopper SDK
Index3d<T>.CompareTo Method
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int CompareTo(
	Index3d<T> other
)
Public Function CompareTo (
	other As Index3d(Of T)
) As Integer
Parameters
other
Type: Grasshopper.Kernel.Geometry.SpatialTrees.Index3d<T>
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
Index3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace