Grasshopper SDK
IGH_StateAwareObject.SaveState Method
 Override this function to store your state data. You have to return a deserializable string.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string SaveState()
Function SaveState As String
Return Value
Type: String
See Also
Reference
IGH_StateAwareObject Interface
Grasshopper.Kernel Namespace