Grasshopper SDK
IGH_InstanceDescription.Name Property
 Gets or sets the name of the object. This field typically remains fixed during the lifetime of an object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Name { get; set; }
Property Name As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_InstanceDescription.Name"]
See Also
Reference
IGH_InstanceDescription Interface
Grasshopper.Kernel Namespace