Grasshopper SDK
GH_IconLabel Class
 A simple Icon with an icon overlay plus highlight rectangle.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.Label
 Grasshopper.GUI.GH_IconLabel
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_IconLabel : Label
Public Class GH_IconLabel
	Inherits Label
The GH_IconLabel type exposes the following members.
Constructors
Name | Description
GH_IconLabel
Initializes a new instance of the GH_IconLabel class
Top
Properties
Name | Description
LabelIcon
Top
See Also
Reference
Grasshopper.GUI Namespace