Grasshopper SDK
GH_SolutionEventArgs.Duration Property
 Gets the duration for this solution. The duration is a more accurate measure than EndTime-StartTime.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public TimeSpan Duration { get; }
Public ReadOnly Property Duration As TimeSpan
	Get
Property Value
Type: TimeSpan
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_SolutionEventArgs.Duration"]
See Also
Reference
GH_SolutionEventArgs Class
Grasshopper.Kernel Namespace