Grasshopper SDK
GH_FadeAnimation.Delay Field
 Gets the number of milliseconds between redraws (25 milliseconds, resulting in ~40 fps)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int Delay = 25
Public Const Delay As Integer = 25
Field Value
Type: Int32
See Also
Reference
GH_FadeAnimation Class
Grasshopper.GUI Namespace