Grasshopper SDK
GH_InstanceDescription.Keywords Property
 Gets a list of additional keywords that describe the object. Typically this list is empty but you can override this property to aid in object searches.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual IEnumerable<string> Keywords { get; }
Public Overridable ReadOnly Property Keywords As IEnumerable(Of String)
	Get
Property Value
Type: IEnumerable<String>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_InstanceDescription.Keywords"]
Implements
IGH_InstanceDescription.Keywords
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace