Grasshopper SDK
GH_Document.OnUndoStateChanged Method
 Raise the UndoStateChanged event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnUndoStateChanged(
	GH_UndoOperation op,
	GH_UndoRecord rec
)
Public Sub OnUndoStateChanged (
	op As GH_UndoOperation,
	rec As GH_UndoRecord
)
Parameters
op
Type: Grasshopper.Kernel.GH_UndoOperation
Type of undo operation to provide with the Event arguments.
rec
Type: Grasshopper.Kernel.Undo.GH_UndoRecord
Record to provide in the Event arguments.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace