Grasshopper SDK
GH_Structure<T> Constructor
 Default constructor, create a blank data structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Structure()
Public Sub New
See Also
Reference
GH_Structure<T> Class
GH_Structure<T> Overload
Grasshopper.Kernel.Data Namespace