Grasshopper SDK
GH_Capsule.InputGrips Property
 Gets the list of locally defined input grip locations.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Point> InputGrips { get; }
Public ReadOnly Property InputGrips As List(Of Point)
	Get
Property Value
Type: List<Point>
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.InputGrips"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace