Grasshopper SDK
GH_DocumentRank Enumeration
 Enumerates all possible document rankings.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_DocumentRank
Public Enumeration GH_DocumentRank
Members
Member name | Value | Description
Unset | 0 |  Indicates no rank. Documents with unset rank are invalid.
TopLevel | 1 |  Top level ranking.
Subsidiary | 2 |  Subsidiary ranking indicates this document is part of another document.
See Also
Reference
Grasshopper.Kernel Namespace