Grasshopper SDK
GH_Border.CreateBorders Method (RectangleF, Padding)
 Static (Shared) method for creating a set of borders.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<GH_Border> CreateBorders(
	RectangleF box,
	Padding padding
)
Public Shared Function CreateBorders (
	box As RectangleF,
	padding As Padding
) As List(Of GH_Border)
Parameters
box
Type: System.Drawing.RectangleF
Box for border creation.
padding
Type: System.Windows.Forms.Padding
The size of the borders along all four edges.
Return Value
Type: List<GH_Border>
A list of borders.
See Also
Reference
GH_Border Class
CreateBorders Overload
Grasshopper.GUI.Canvas Namespace