Grasshopper SDK
GH_AssemblyPriority Constructor
Initializes a new instance of the GH_AssemblyPriority class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_AssemblyPriority()
Protected Sub New
See Also
Reference
GH_AssemblyPriority Class
Grasshopper.Kernel Namespace