Grasshopper SDK
GH_GraphicsUtil.RenderFadedImage Method (Graphics, Image, Rectangle, Int32)
 Render an icon into a rectangle with a specific fading factor.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderFadedImage(
	Graphics graphics,
	Image image,
	Rectangle destination,
	int alpha
)
Public Shared Sub RenderFadedImage (
	graphics As Graphics,
	image As Image,
	destination As Rectangle,
	alpha As Integer
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
image
Type: System.Drawing.Image
Image to draw.
destination
Type: System.Drawing.Rectangle
Destination rectangle.
alpha
Type: System.Int32
Alpha value. 0=completely transparent, 255=original transparency.
See Also
Reference
GH_GraphicsUtil Class
RenderFadedImage Overload
Grasshopper.GUI Namespace