Grasshopper SDK
GH_DocumentEventServer.CreateGuidTable Method
 Create the entire ID table from scratch.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateGuidTable()
Public Sub CreateGuidTable
See Also
Reference
GH_DocumentEventServer Class
Grasshopper.Kernel Namespace