Grasshopper SDK
GH_Matrix Constructor
 Blank constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Matrix()
Public Sub New
See Also
Reference
GH_Matrix Class
GH_Matrix Overload
Grasshopper.Kernel.Types Namespace