Grasshopper SDK
GH_SliderBase.DecimalPlaces Property
 Gets or sets the number of decimal places allowed for floating point type sliders. Valid values between zero and 12.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int DecimalPlaces { get; set; }
Public Property DecimalPlaces As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.DecimalPlaces"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace