Grasshopper SDK
GH_ValueProxy<T>.Duplicate_T Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract GH_ValueProxy<T> Duplicate_T()
Public MustOverride Function Duplicate_T As GH_ValueProxy(Of T)
Return Value
Type: GH_ValueProxy<T>
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace