Grasshopper SDK
IGH_SettingCategory.Icon Property
 Category icon. Image should be 48x48 pixels.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Bitmap Icon { get; }
ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_SettingCategory.Icon"]
See Also
Reference
IGH_SettingCategory Interface
Grasshopper.GUI Namespace