Grasshopper SDK
GH_IndexRuleSet.AddRangePatternRule Method
 Append a rule for filtering range patterns.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddRangePatternRule(
	GH_IndexRange[] pattern
)
Public Sub AddRangePatternRule (
	pattern As GH_IndexRange()
)
Parameters
pattern
Type: Grasshopper.Kernel.Data.GH_IndexRange[]
Complete pattern. A complete pattern consists of at least three ranges, the first one signifying the pattern lower bound, the last one signifying the patters upper bound (use GH_IndexRange.MaxValue is you do not want to enforce an upper bound), and at least one range in between defining the pattern growth.
See Also
Reference
GH_IndexRuleSet Class
Grasshopper.Kernel.Data Namespace