Grasshopper SDK
GH_UndoRecord Class
 Represents a single undo/redo record. A single record may contain any number of undo actions.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoRecord
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_UndoRecord
Public Class GH_UndoRecord
The GH_UndoRecord type exposes the following members.
Constructors
Name | Description
GH_UndoRecord()
Initializes a new instance of the GH_UndoRecord class
GH_UndoRecord(String)
Initializes a new instance of the GH_UndoRecord class
GH_UndoRecord(String, IGH_UndoAction)
Initializes a new instance of the GH_UndoRecord class
GH_UndoRecord(String, IGH_UndoAction[])
Initializes a new instance of the GH_UndoRecord class
GH_UndoRecord(String, IEnumerable<IGH_UndoAction>)
Initializes a new instance of the GH_UndoRecord class
Top
Properties
Name | Description
ActionCount
 Gets the number of actions stored in this record.
Actions
 Gets or sets the actions inside this record.
ExpiresDisplay
 Gets the display expiration flag for this event. If True, the Rhino viewports will be redrawn once the entire undo record has been completed. If ExpiresSolution is set to true, ExpriresDisplay is implied.
ExpiresSolution
 Gets the solution expiration flag for this event. If True, the solution needs to be recalculated once the entire undo record has been completed.
Guid
 Gets the ID of this undo item. Every undo record has a unique ID.
Name
 Gets or sets the name of the undo record (as displayed in the menu)
State
 Gets the undo state of this record. The state dictates which action are legal.
Time
 Gets the time at which this record was created.
Top
Methods
Name | Description
AddAction
 Append an undo action to this record. You should only do this prior to calling undo for the first time.
Redo
Undo
Top
See Also
Reference
Grasshopper.Kernel.Undo Namespace