Grasshopper SDK
GH_MeshFace.GH_MeshFaceProxy Constructor
Initializes a new instance of the GH_MeshFace.GH_MeshFaceProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MeshFaceProxy(
	GH_MeshFace nValue
)
Public Sub New (
	nValue As GH_MeshFace
)
Parameters
nValue
Type: Grasshopper.Kernel.Types.GH_MeshFace
See Also
Reference
GH_MeshFace.GH_MeshFaceProxy Class
Grasshopper.Kernel.Types Namespace