Grasshopper SDK
GH_Canvas.CanvasPaintBegin Event
 Raised before a new paint operation starts. This event is always raised, even if the Canvas isn't visible.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPaintBeginEventHandler CanvasPaintBegin
Public Event CanvasPaintBegin As GH_Canvas.CanvasPaintBeginEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPaintBeginEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace