Grasshopper SDK
GH_LoadingMechanism Enumeration
 Enumerates all assembly loading mechanisms.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_LoadingMechanism
Public Enumeration GH_LoadingMechanism
Members
Member name | Value | Description
Unknown | -1 |  Assembly was loaded with an unknown mechanism.
COFF | 1 |  Assembly was loaded from a memory byte-array representation of the file.
Direct | 2 |  Assembly was loaded directly from disk.
See Also
Reference
Grasshopper.Kernel Namespace