Grasshopper SDK
GH_MemoryBitmap.Filter_HueScale Method
 Convert the image to a greyscale representation of the hues.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_HueScale()
Public Sub Filter_HueScale
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace