Grasshopper SDK
GH_ComponentAttributes.LayoutBounds Method
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static RectangleF LayoutBounds(
	IGH_Component owner,
	RectangleF bounds
)
Public Shared Function LayoutBounds (
	owner As IGH_Component,
	bounds As RectangleF
) As RectangleF
Parameters
owner
Type: Grasshopper.Kernel.IGH_Component
bounds
Type: System.Drawing.RectangleF
Return Value
Type: RectangleF
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace