Grasshopper SDK
Instances.GrasshopperPluginId Property
 Gets the ID of the Grasshopper Plugin.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Guid GrasshopperPluginId { get; }
Public Shared ReadOnly Property GrasshopperPluginId As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Instances.GrasshopperPluginId"]
See Also
Reference
Instances Class
Grasshopper Namespace