Grasshopper SDK
GH_DocDiagramPainter.PaintDiagram Method (IEnumerable<IGH_DocumentObject>, Int32, Int32)
 Paint a diagram of a document.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool PaintDiagram(
	IEnumerable<IGH_DocumentObject> objs,
	int approx_size,
	int inflate
)
Public Function PaintDiagram (
	objs As IEnumerable(Of IGH_DocumentObject),
	approx_size As Integer,
	inflate As Integer
) As Boolean
Parameters
objs
Type: System.Collections.Generic.IEnumerable<IGH_DocumentObject>
Objects to paint.
approx_size
Type: System.Int32
Approximate size along each side.
inflate
Type: System.Int32
Padding around the objects.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocDiagramPainter Class
PaintDiagram Overload
Grasshopper.GUI.Canvas Namespace