Grasshopper SDK
GH_SolutionMode Enumeration
 Enumerates all solution modes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_SolutionMode
Public Enumeration GH_SolutionMode
Members
Member name | Value | Description
Default | 0 |  Represents the standard mode, error messages are displayed in custom forms.
CommandLine | 1 |  Represents reduced feedback mode. All messages are send to the Rhino command history, which is thread safe.
Silent | 2 |  Represents null feedback mode. No messages are send to any GUI.
See Also
Reference
Grasshopper.Kernel Namespace