Grasshopper SDK
CentralSettings.AuthorPhoneChanged Event
 Raised whenever the AuthorPhone field is changed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.AuthorPhoneChangedEventHandler AuthorPhoneChanged
Public Shared Event AuthorPhoneChanged As CentralSettings.AuthorPhoneChangedEventHandler
Value
Type: Grasshopper.CentralSettings.AuthorPhoneChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace