Grasshopper SDK
GH_CursorServer.ReferenceCursors Method
 Reference all the cursor files in a given directory.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ReferenceCursors(
	string folder
)
Public Function ReferenceCursors (
	folder As String
) As Integer
Parameters
folder
Type: System.String
Directory to parse.
Return Value
Type: Int32
The number of cursors referenced. Use the AttachCursor() method to assign a referenced cursor to a control.
See Also
Reference
GH_CursorServer Class
Grasshopper.GUI Namespace