Grasshopper SDK
GH_DocumentIO.Save Method
 Perform a default Save operation on the internal document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Save()
Public Function Save As Boolean
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace