Grasshopper SDK
GH_FileWatcher.SetCustomUIThread Method (Control)
 If you want to override the default Invoke behaviour, you must set InvokeOnDefaultThread to False and supply either a custom Control or a Form.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetCustomUIThread(
	Control target
)
Public Sub SetCustomUIThread (
	target As Control
)
Parameters
target
Type: System.Windows.Forms.Control
GUI target object which will be used for Invoking File System Events.
See Also
Reference
GH_FileWatcher Class
SetCustomUIThread Overload
Grasshopper.Kernel Namespace