Grasshopper SDK
GH_GeometricGoo<T>.IsGeometryLoaded Property
 Gets a value indicating whether or not this geometry is currently loaded (assuming it is referenced). Not all IGH_GeometricGoo implementations support referenced geometry. The default is to always return True.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool IsGeometryLoaded { get; }
Public Overridable ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometricGoo`1.IsGeometryLoaded"]
Implements
IGH_GeometricGoo.IsGeometryLoaded
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace