Grasshopper SDK
GH_ColourPickerBase.DesiredHeight Property
 Gets the ideal height for this colour picker given it's width and UI settings.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int DesiredHeight { get; }
Public ReadOnly Property DesiredHeight As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.DesiredHeight"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace