Grasshopper SDK
CentralSettings.FormatENotationLowerLimit Property
 Gets or sets at what power of ten decimal formatting of numbers switches to E notation for small numbers.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int FormatENotationLowerLimit { get; set; }
Public Shared Property FormatENotationLowerLimit As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.CentralSettings.FormatENotationLowerLimit"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace