Grasshopper SDK
GH_Gradient.RemoveGrip Method (Int32)
 Remove the grip at the specified index.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RemoveGrip(
	int index
)
Public Sub RemoveGrip (
	index As Integer
)
Parameters
index
Type: System.Int32
Index of grip to remove.
See Also
Reference
GH_Gradient Class
RemoveGrip Overload
Grasshopper.GUI.Gradient Namespace