Grasshopper SDK
GH_AssemblyInfo Class
 Implement this interface once (and once only) in a GHA project if you wish to add additional information about your library to Grasshopper. Note you must supply an empty constructor.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_AssemblyInfo
 Grasshopper.Kernel.GH_AssemblyInfoStub
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_AssemblyInfo
Public MustInherit Class GH_AssemblyInfo
The GH_AssemblyInfo type exposes the following members.
Constructors
Name | Description
GH_AssemblyInfo
Initializes a new instance of the GH_AssemblyInfo class
Top
Properties
Name | Description
Assembly
 Gets the actual assembly that this info object describes.
AssemblyDescription
AssemblyIcon
AssemblyLicense
AssemblyName
AssemblyVersion
AuthorContact
 Gets the contact information for the author. This can be email, phone, fax, address or all of the above. Return null if you do not wish to associate contact details with this assembly.
AuthorName
 Gets the name of the individual/company/organisation that is responsible for this assembly. Return null if you do not wish to associate an author with this assembly.
Description
 Gets the human readable description of this assembly. Return null if you do not wish to associate a description with this assembly.
Icon
 Gets a 24x24 icon that represents this assembly. Return null if you do not wish to associate an icon with this assembly.
Id
 Gets the Id of this assembly. By default the Id is a hash of the name.
IsCoreLibrary
 Gets whether this library is a Grasshopper core library. Core libraries are installed along with Grasshopper and thus should always be available anywhere.
License
 Gets the license type for this assembly.
LoadingMechanism
 Gets the mechanism used to load this assembly.
Location
 Gets the location this assembly was loaded from.
Name
 Gets the human readable name of this assembly. Return null if you do not wish to associate a name with this assembly.
Version
 Gets the version code for this assembly.
Top
See Also
Reference
Grasshopper.Kernel Namespace