Grasshopper SDK
GH_DebugDescriptionWriter.CreateLog Method
 Get a single string that represents the entire log so far.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string CreateLog()
Public Function CreateLog As String
Return Value
Type: String
See Also
Reference
GH_DebugDescriptionWriter Class
Grasshopper.Kernel Namespace