Grasshopper SDK
GH_Interval2D.GH_Interval2DProxy Class
 Proxy description of GH_Interval class. This class is used by the Generic Multivalue interfaces.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Interval2D>
 Grasshopper.Kernel.Types.GH_Interval2D.GH_Interval2DProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Interval2DProxy : GH_GooProxy<GH_Interval2D>
Public Class GH_Interval2DProxy
	Inherits GH_GooProxy(Of GH_Interval2D)
The GH_Interval2D.GH_Interval2DProxy type exposes the following members.
Constructors
Name | Description
GH_Interval2D.GH_Interval2DProxy
Initializes a new instance of the GH_Interval2D.GH_Interval2DProxy class
Top
Properties
Name | Description
Area
U0
U1
UIsIncreasing
UIsNormalized
ULength
UMiddle
V0
V1
VIsIncreasing
VIsNormalized
VLength
VMiddle
Top
Methods
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace