Grasshopper SDK
GH_AutoSaveSettings.AutosaveFilter Method
 Tests a given trigger to see if it allows an autosave operation.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool AutosaveFilter(
	GH_AutoSaveTrigger trigger
)
Public Shared Function AutosaveFilter (
	trigger As GH_AutoSaveTrigger
) As Boolean
Parameters
trigger
Type: Grasshopper.Kernel.GH_AutoSaveTrigger
Trigger to filter.
Return Value
Type: Boolean
True if the trigger ought to start an AutoSave op.
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace