Grasshopper SDK
GH_ComplexNumber Constructor
 Blank constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ComplexNumber()
Public Sub New
See Also
Reference
GH_ComplexNumber Class
GH_ComplexNumber Overload
Grasshopper.Kernel.Types Namespace