Grasshopper SDK
GH_Capsule.DefaultHighlight Field
 The default size (in pixel units) of the highlight bar.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int DefaultHighlight = 8
Public Const DefaultHighlight As Integer = 8
Field Value
Type: Int32
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace