Grasshopper SDK
GH_Grip.ColourRight Property
 Gets the colour to the right of this grip.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color ColourRight { get; set; }
Public Property ColourRight As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_Grip.ColourRight"]
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace