Grasshopper SDK
GH_Capsule.HighlightShape Property
 Gets the graphics path that describes the highlight bar shape of the capsule.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GraphicsPath HighlightShape { get; }
Public ReadOnly Property HighlightShape As GraphicsPath
	Get
Property Value
Type: GraphicsPath
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.HighlightShape"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace