Grasshopper SDK
CentralSettings.TemplateFileChanged Event
 Raised whenever the TemplateFile property is changed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.TemplateFileChangedEventHandler TemplateFileChanged
Public Shared Event TemplateFileChanged As CentralSettings.TemplateFileChangedEventHandler
Value
Type: Grasshopper.CentralSettings.TemplateFileChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace