Grasshopper SDK
CentralSettings.CanvasObsoleteTags Property
 Gets or sets the global default for obsolete tags.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool CanvasObsoleteTags { get; set; }
Public Shared Property CanvasObsoleteTags As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CanvasObsoleteTags"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace