Grasshopper SDK
Index3d<T>.Node Property
 Gets the node of the tree in which this element is stored.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Node3d<T> Node { get; }
Public ReadOnly Property Node As Node3d(Of T)
	Get
Property Value
Type: Node3d<T>
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Index3d`1.Node"]
See Also
Reference
Index3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace