Grasshopper SDK
GH_Component.CreateAttributes Method
 Create new attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void CreateAttributes()
Public Overrides Sub CreateAttributes
Remarks
Typically you do not have to override this.
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace