Grasshopper SDK
GH_ComponentAttributes.LayoutOutputParams Method
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void LayoutOutputParams(
	IGH_Component owner,
	RectangleF componentBox
)
Public Shared Sub LayoutOutputParams (
	owner As IGH_Component,
	componentBox As RectangleF
)
Parameters
owner
Type: Grasshopper.Kernel.IGH_Component
componentBox
Type: System.Drawing.RectangleF
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace