Grasshopper SDK
GH_SeparatorDisplay Enumeration
 Enumerates all possible display modes for horizontal and vertical separators.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_SeparatorDisplay
Public Enumeration GH_SeparatorDisplay
Members
Member name | Value | Description
None | 0 |  No separator is drawn.
Etched | 1 |  A double line etched separator is drawn.
EtchedFading | 2 |  A double line etched separator with fading extremes is drawn.
Dashed | 3 |  A single line dashed separator is drawn.
See Also
Reference
Grasshopper.GUI Namespace