Grasshopper SDK
GH_DocumentRenderMeshProvider Class
 Utility class for seeding render queues with GH geometry.
Inheritance Hierarchy
System.Object
 CustomRenderMeshProvider
 Grasshopper.Kernel.GH_DocumentRenderMeshProvider
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocumentRenderMeshProvider : CustomRenderMeshProvider
Public Class GH_DocumentRenderMeshProvider
	Inherits CustomRenderMeshProvider
The GH_DocumentRenderMeshProvider type exposes the following members.
Constructors
Name | Description
GH_DocumentRenderMeshProvider
Initializes a new instance of the GH_DocumentRenderMeshProvider class
Top
Properties
Name | Description
Name |  (Overrides CustomRenderMeshProvider.Name.)
Top
Methods
Name | Description
BoundingBox |  (Overrides CustomRenderMeshProvider.BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean).)
BuildCustomMeshes |  (Overrides CustomRenderMeshProvider.BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, Boolean).)
WillBuildCustomMeshes |  (Overrides CustomRenderMeshProvider.WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean).)
Top
See Also
Reference
Grasshopper.Kernel Namespace