Grasshopper SDK
IGH_FileDropTarget.HandleDrop Method
 Handle a file drop.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool HandleDrop(
	string path,
	PointF mouse_pt
)
Function HandleDrop (
	path As String,
	mouse_pt As PointF
) As Boolean
Parameters
path
Type: System.String
Path of file to handle.
mouse_pt
Type: System.Drawing.PointF
Point at which the drop occured.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
IGH_FileDropTarget Interface
Grasshopper.GUI Namespace