Grasshopper SDK
GH_Document.PreviewCustomMeshParameters Property
 Gets or sets the Custom Meshing Parameters for this document, these are only used when PreviewMeshType = GH_PreviewMesh.Custom
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public MeshingParameters PreviewCustomMeshParameters { get; set; }
Public Property PreviewCustomMeshParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.PreviewCustomMeshParameters"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace