Grasshopper SDK
GH_ColourPickerBase.Font Property
 Gets or sets the Font used in this Colour Picker. Do not Dispose the Font returned by this property.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Font Font { get; set; }
Public Property Font As Font
	Get
	Set
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.Font"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace