Grasshopper SDK
GH_Convert.BackSolveExpression Method
 Try and backsolve an expression
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool BackSolveExpression(
	string exp,
	string variable,
	double target,
	double minimum,
	double maximum,
	int steps,
	out double t,
	out double v
)
Public Shared Function BackSolveExpression (
	exp As String,
	variable As String,
	target As Double,
	minimum As Double,
	maximum As Double,
	steps As Integer,
	<OutAttribute> ByRef t As Double,
	<OutAttribute> ByRef v As Double
) As Boolean
Parameters
exp
Type: System.String
Expression to back solve.
variable
Type: System.String
Name of input variable.
target
Type: System.Double
Result to look for.
minimum
Type: System.Double
Lowest input to try.
maximum
Type: System.Double
Highest input to try.
steps
Type: System.Int32
Number of steps per iteration.
t
Type: System.Double
Value for variable that closest approximates the target value.
v
Type: System.Double
Value of expression for the best approximation.
Return Value
Type: Boolean
True on success, false on failure..
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace