Grasshopper SDK
GH_CharPatternParamNameConstructor Class
Note: This API is now obsolete.
Inheritance Hierarchy
System.Object
 GH_StringPattern
 Grasshopper.Kernel.GH_CharPatternParamNameConstructor
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("This class is obsolete, please use GH_StringPattern")]
public class GH_CharPatternParamNameConstructor : GH_StringPattern
<ObsoleteAttribute("This class is obsolete, please use GH_StringPattern")>
Public Class GH_CharPatternParamNameConstructor
	Inherits GH_StringPattern
Constructors
Name | Description
GH_CharPatternParamNameConstructor()
Initializes a new instance of the GH_CharPatternParamNameConstructor class
GH_CharPatternParamNameConstructor(String)
Initializes a new instance of the GH_CharPatternParamNameConstructor class
GH_CharPatternParamNameConstructor(String, Int32)
Initializes a new instance of the GH_CharPatternParamNameConstructor class
Top
See Also
Reference
Grasshopper.Kernel Namespace