Grasshopper SDK
GH_NamedView Constructor (String, PointF, Single, GH_NamedViewType)
 Create a new named view.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_NamedView(
	string view_name,
	PointF view_point,
	float view_zoom = 1f,
	GH_NamedViewType view_type = GH_NamedViewType.target
)
Public Sub New (
	view_name As String,
	view_point As PointF,
	Optional view_zoom As Single = 1F,
	Optional view_type As GH_NamedViewType = GH_NamedViewType.target
)
Parameters
view_name
Type: System.String
Name of view.
view_point
Type: System.Drawing.PointF
Anchor point of named view.
view_zoom (Optional)
Type: System.Single
Zoom factor of named view.
view_type (Optional)
Type: Grasshopper.GUI.Canvas.GH_NamedViewType
The type of named view.
See Also
Reference
GH_NamedView Class
GH_NamedView Overload
Grasshopper.GUI.Canvas Namespace