Grasshopper SDK
GH_Viewport.Tx Property
 Gets or sets the x-component of the target pixel. The target represents where the canvas origin is drawn.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Tx { get; set; }
Public Property Tx As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.Tx"]
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace