Grasshopper SDK
IGH_Attributes.Pivot Property
 Gets the pivot for these attributes. The pivot controls the general placement of the attributes. If you want to move the attributes, change the pivot location.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
PointF Pivot { get; set; }
Property Pivot As PointF
	Get
	Set
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.Pivot"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace