Grasshopper SDK
IGH_GeometricGoo.DuplicateGeometry Method
 Make a complete duplicate of this geometry. No shallow copies.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_GeometricGoo DuplicateGeometry()
Function DuplicateGeometry As IGH_GeometricGoo
Return Value
Type: IGH_GeometricGoo
Remarks
Each class that implements this interface should also provide a type specific duplication method
See Also
Reference
IGH_GeometricGoo Interface
Grasshopper.Kernel.Types Namespace