Grasshopper SDK
GH_VerticalScrollBar.TargetRatio Property
 Gets or sets the scroll ration. If the scroll ratio is changed, the OnScrollRatioChanged event will be raised.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double TargetRatio { get; set; }
Public Property TargetRatio As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.GUI.GH_VerticalScrollBar.TargetRatio"]
See Also
Reference
GH_VerticalScrollBar Class
Grasshopper.GUI Namespace