Grasshopper SDK
GH_PreviewUtil.AddBox Method
 Add a box to the temporary Preview lists.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddBox(
	Box box
)
Public Sub AddBox (
	box As Box
)
Parameters
box
Type: Box
Box to add.
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace