Grasshopper SDK
GH_TrackerFrame Constructor
Initializes a new instance of the GH_TrackerFrame class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_TrackerFrame(
	Point position
)
Public Sub New (
	position As Point
)
Parameters
position
Type: System.Drawing.Point
See Also
Reference
GH_TrackerFrame Structure
Grasshopper.GUI Namespace