Grasshopper SDK
GH_LockedAction Constructor
Initializes a new instance of the GH_LockedAction class
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LockedAction(
	IGH_ActiveObject obj
)
Public Sub New (
	obj As IGH_ActiveObject
)
Parameters
obj
Type: Grasshopper.Kernel.IGH_ActiveObject
See Also
Reference
GH_LockedAction Class
Grasshopper.Kernel.Undo.Actions Namespace