Grasshopper SDK
GH_ActiveObject.AppendMenuItems Method
 This function is called when a context menu is about to be displayed. Override it to set custom items. GH_ActiveObject will already populate the menu with default items, if you merely wish to insert object-specific menu item, consider overriding AppendAdditionalMenuItems instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool AppendMenuItems(
	ToolStripDropDown menu
)
Public Overrides Function AppendMenuItems (
	menu As ToolStripDropDown
) As Boolean
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
Menu object to populate.
Return Value
Type: Boolean
If true, the menu will be displayed, if false the menu will be supressed.
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace