Grasshopper SDK
GH_Document.SolutionSpan Property
 Gets the timespan for the most recent solution.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public TimeSpan SolutionSpan { get; }
Public ReadOnly Property SolutionSpan As TimeSpan
	Get
Property Value
Type: TimeSpan
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.SolutionSpan"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace