Grasshopper SDK
GH_GraphicsUtil.SolveArc Method (Point3d, Point3d, Vector3d, RectangleF, Single, Single)
 Create a GDI circular arc definition from start-point, end-point and tangent direction.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool SolveArc(
	Point3d p0,
	Point3d p1,
	Vector3d dir,
	ref RectangleF box,
	ref float angle,
	ref float sweep
)
Public Shared Function SolveArc (
	p0 As Point3d,
	p1 As Point3d,
	dir As Vector3d,
	ByRef box As RectangleF,
	ByRef angle As Single,
	ByRef sweep As Single
) As Boolean
Parameters
p0
Type: Point3d
Start point of arc.
p1
Type: Point3d
End point of arc.
dir
Type: Vector3d
Tangent direction at start of arc.
box
Type: System.Drawing.RectangleF
Bounding box of arc (out)
angle
Type: System.Single
Start angle of arc (out)
sweep
Type: System.Single
Sweep angle of arc (out)
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_GraphicsUtil Class
SolveArc Overload
Grasshopper.GUI Namespace