Grasshopper SDK
GH_AutoSaveSettings.SaveOnDocumentUnload Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool SaveOnDocumentUnload { get; set; }
Public Shared Property SaveOnDocumentUnload As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AutoSaveSettings.SaveOnDocumentUnload"]
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace