Grasshopper SDK
DataTree<T>.PathExists Method (GH_Path)
 Test if the specified path is already defined inside the tree.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool PathExists(
	GH_Path path
)
Public Function PathExists (
	path As GH_Path
) As Boolean
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
The branch path to search for
Return Value
Type: Boolean
True if the path already exists, false if it doesn't.
See Also
Reference
DataTree<T> Class
PathExists Overload
Grasshopper Namespace