Grasshopper SDK
GH_GeometryGroup.LoadGeometry Method (RhinoDoc)
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool LoadGeometry(
	RhinoDoc doc
)
Public Function LoadGeometry (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: RhinoDoc
Return Value
Type: Boolean
Implements
IGH_GeometricGoo.LoadGeometry(RhinoDoc)
See Also
Reference
GH_GeometryGroup Class
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace