Grasshopper SDK
GH_Capsule.Palette Property
 Gets or sets the palette for this Capsule.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Palette Palette { get; set; }
Public Property Palette As GH_Palette
	Get
	Set
Property Value
Type: GH_Palette
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.Palette"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace