Grasshopper SDK
IGH_DocumentObject.DocumentContextChanged Method
 This method will be called when the document that owns this object moves into a different context.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void DocumentContextChanged(
	GH_Document document,
	GH_DocumentContext context
)
Sub DocumentContextChanged (
	document As GH_Document,
	context As GH_DocumentContext
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document that owns this object.
context
Type: Grasshopper.Kernel.GH_DocumentContext
The reason for this event.
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace