Grasshopper SDK
GH_Document.GH_UndoUtil.CreateLayoutEvent Method (String, IGH_DocumentObject)
 Create a new undo record for a single object layout change. This function must be called before the layout is changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoRecord CreateLayoutEvent(
	string name,
	IGH_DocumentObject obj
)
Public Function CreateLayoutEvent (
	name As String,
	obj As IGH_DocumentObject
) As GH_UndoRecord
Parameters
name
Type: System.String
Name of undo record.
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
Target object for undo record.
Return Value
Type: GH_UndoRecord
A newly created undo record.
See Also
Reference
GH_Document.GH_UndoUtil Class
CreateLayoutEvent Overload
Grasshopper.Kernel Namespace