Grasshopper SDK
Folders.SettingsFolder Property
 Gets the folder into which all Grasshopper settings are stored. This folder might not exist until some settings are actually saved.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string SettingsFolder { get; }
Public Shared ReadOnly Property SettingsFolder As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.SettingsFolder"]
See Also
Reference
Folders Class
Grasshopper Namespace