Grasshopper SDK
GH_DocumentObject.Obsolete Property
 Gets whether this object is obsolete. Default implementation returns true if the class name contains the string "OBSOLETE" or if this class has been decorated with the ObsoleteAttribute. You are free to override this if you want, but I suggest adding the ObsoleteAttribute instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool Obsolete { get; }
Public Overridable ReadOnly Property Obsolete As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentObject.Obsolete"]
Implements
IGH_DocumentObject.Obsolete
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace