Grasshopper SDK
GH_Number.DuplicateNumber Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Number DuplicateNumber()
Public Function DuplicateNumber As GH_Number
Return Value
Type: GH_Number
See Also
Reference
GH_Number Class
Grasshopper.Kernel.Types Namespace