Grasshopper SDK
GH_ScriptVariant.ThrowNullOperatorException Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected static void ThrowNullOperatorException(
	string sName
)
Protected Shared Sub ThrowNullOperatorException (
	sName As String
)
Parameters
sName
Type: System.String
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace