Grasshopper SDK
GH_CapsuleRenderEngine.RenderText Method
 Render the capsule text. This is usually the sixth and final stage in a capsule rendering.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderText(
	Graphics G,
	Color colour
)
Public Sub RenderText (
	G As Graphics,
	colour As Color
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with.
colour
Type: System.Drawing.Color
Colour of text.
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace