Grasshopper SDK
GH_Document.Author Property
 Gets the author details associated with this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Author Author { get; }
Public ReadOnly Property Author As IGH_Author
	Get
Property Value
Type: IGH_Author
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.Author"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace