Grasshopper SDK
GH_Format.FormatBox Method (GH_Box)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatBox(
	GH_Box data
)
Public Shared Function FormatBox (
	data As GH_Box
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Box
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatBox Overload
Grasshopper.Kernel Namespace