Grasshopper SDK
Complex.Log Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Complex Log()
Public Function Log As Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace