Grasshopper SDK
GH_CanvasValidator.Canvas Property
 Gets the canvas this validator is associated with.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_Canvas Canvas { get; }
Protected ReadOnly Property Canvas As GH_Canvas
	Get
Property Value
Type: GH_Canvas
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasValidator.Canvas"]
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace