Grasshopper SDK
GH_DocumentServer.Contains Method
 Gets a value indicating whether or not the given document is inside the list.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Contains(
	GH_Document doc
)
Public Function Contains (
	doc As GH_Document
) As Boolean
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
Return Value
Type: Boolean
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace