Grasshopper SDK
GH_StructurePath Constructor (GH_StructurePath)
Initializes a new instance of the GH_StructurePath class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_StructurePath(
	GH_StructurePath other
)
Public Sub New (
	other As GH_StructurePath
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_StructurePath
See Also
Reference
GH_StructurePath Class
GH_StructurePath Overload
Grasshopper.Kernel.Types Namespace