Grasshopper SDK
GH_ComponentParamServer.RegisterOutputParam Method (IGH_Param)
 Add a parameter to the end of the output list.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RegisterOutputParam(
	IGH_Param new_param
)
Public Function RegisterOutputParam (
	new_param As IGH_Param
) As Boolean
Parameters
new_param
Type: Grasshopper.Kernel.IGH_Param
Return Value
Type: Boolean
See Also
Reference
GH_ComponentParamServer Class
RegisterOutputParam Overload
Grasshopper.Kernel Namespace