Grasshopper SDK
GH_GraphicsUtil.ShadowRectangle Method (Graphics, Rectangle, Int32, Color)
 Draws shadow edges on the interior of a rectangle.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void ShadowRectangle(
	Graphics g,
	Rectangle rec,
	int size,
	Color color
)
Public Shared Sub ShadowRectangle (
	g As Graphics,
	rec As Rectangle,
	size As Integer,
	color As Color
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
rec
Type: System.Drawing.Rectangle
Bounding rectangle.
size
Type: System.Int32
Length of cast shadow.
color
Type: System.Drawing.Color
Color at edge of shadow.
See Also
Reference
GH_GraphicsUtil Class
ShadowRectangle Overload
Grasshopper.GUI Namespace