Grasshopper SDK
GH_Document.Owner Property
 Gets or sets the owner of this document. A document is typically owned when it is subsidiary to some object, such as a cluster.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_DocumentOwner Owner { get; set; }
Public Property Owner As IGH_DocumentOwner
	Get
	Set
Property Value
Type: IGH_DocumentOwner
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.Owner"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace