Grasshopper SDK
GH_Document.GH_UndoUtil.RecordPersistentDataEvent<T> Method
 Create and Record a new PersistentDataChanged undo record.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid RecordPersistentDataEvent<T>(
	string name,
	GH_PersistentParam<T> obj
)
where T : class, IGH_Goo
Public Function RecordPersistentDataEvent(Of T As {Class, IGH_Goo}) (
	name As String,
	obj As GH_PersistentParam(Of T)
) As Guid
Parameters
name
Type: System.String
Name of undo record.
obj
Type: Grasshopper.Kernel.GH_PersistentParam<T>
Target object for undo record.
Type Parameters
T
Return Value
Type: Guid
The ID of the newly added undo record or Guid.Empty on failure.
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace