Grasshopper SDK
Versioning.VersionString Property
 Gets the version of the current build of Grasshopper.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string VersionString { get; }
Public Shared ReadOnly Property VersionString As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Versioning.VersionString"]
See Also
Reference
Versioning Class
Grasshopper Namespace