Grasshopper SDK
GH_DragInfo.Point_Start Property
 Gets the cursor location at the start of the drag.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point Point_Start { get; }
Public ReadOnly Property Point_Start As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DragInfo.Point_Start"]
See Also
Reference
GH_DragInfo Class
Grasshopper.GUI Namespace