Grasshopper SDK
GH_Brep.GH_BrepProxy.ObjectID Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string ObjectID { get; set; }
Public Property ObjectID As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Brep.GH_BrepProxy.ObjectID"]
See Also
Reference
GH_Brep.GH_BrepProxy Class
Grasshopper.Kernel.Types Namespace