Grasshopper SDK
CentralSettings.PruderyLevelChanged Event
 Raised whenever the PruderyLevel setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.PruderyLevelChangedEventHandler PruderyLevelChanged
Public Shared Event PruderyLevelChanged As CentralSettings.PruderyLevelChangedEventHandler
Value
Type: Grasshopper.CentralSettings.PruderyLevelChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace