Grasshopper SDK
GH_ActiveObject Constructor (String, String, String, String, String)
Initializes a new instance of the GH_ActiveObject class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_ActiveObject(
	string sName,
	string sAbbreviation,
	string sDescription,
	string sCategory,
	string sSubCategory
)
Protected Sub New (
	sName As String,
	sAbbreviation As String,
	sDescription As String,
	sCategory As String,
	sSubCategory As String
)
Parameters
sName
Type: System.String
sAbbreviation
Type: System.String
sDescription
Type: System.String
sCategory
Type: System.String
sSubCategory
Type: System.String
See Also
Reference
GH_ActiveObject Class
GH_ActiveObject Overload
Grasshopper.Kernel Namespace