Grasshopper SDK
GH_VerticalScrollBar.ImpliedVerticalOffset Property
 Gets or sets the offset of the target region as implied by the scroll ratio. If you set this value, the ratio is reverse engineered.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ImpliedVerticalOffset { get; set; }
Public Property ImpliedVerticalOffset As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_VerticalScrollBar.ImpliedVerticalOffset"]
See Also
Reference
GH_VerticalScrollBar Class
Grasshopper.GUI Namespace