Grasshopper SDK
GH_ResourceGate Class
 This class provides access to specific resources of the Grasshopper assembly.
Inheritance Hierarchy
System.Object
 Grasshopper.Plugin.GH_ResourceGate
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_ResourceGate
Public NotInheritable Class GH_ResourceGate
The GH_ResourceGate type exposes the following members.
Properties
Name | Description
BlackIcon
 Returns a 24x24 hexagonal black icon.
Error_12x12
 Returns a 12x12 round red icon
Error_16x16
 Returns a 16x16 round red icon
Error_24x24
 Returns a 24x24 round red icon
Error_40x40
 Returns a 40x40 round red icon
Info_12x12
 Returns a 12x12 round blue icon
Info_16x16
 Returns a 16x16 round blue icon
Info_24x24
 Returns a 24x24 round blue icon
Info_40x40
 Returns a 40x40 round blue icon
OK_12x12
 Returns a 12x12 round green icon
OK_16x16
 Returns a 16x16 round green icon
OK_24x24
 Returns a 24x24 round green icon
OK_40x40
 Returns a 40x40 round green icon
Warning_12x12
 Returns a 12x12 round yellow icon
Warning_16x16
 Returns a 16x16 round yellow icon
Warning_24x24
 Returns a 24x24 round yellow icon
Warning_40x40
 Returns a 40x40 round yellow icon
WhiteIcon
 Returns a 24x24 square white icon.
Top
See Also
Reference
Grasshopper.Plugin Namespace