Grasshopper SDK
GH_Surface.GH_SurfaceProxy Constructor
Initializes a new instance of the GH_Surface.GH_SurfaceProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SurfaceProxy(
	GH_Surface Value
)
Public Sub New (
	Value As GH_Surface
)
Parameters
Value
Type: Grasshopper.Kernel.Types.GH_Surface
See Also
Reference
GH_Surface.GH_SurfaceProxy Class
Grasshopper.Kernel.Types Namespace