Grasshopper SDK
GH_Grip.Selected Property
 Gets or sets whether this grip is selected. Selection state is not (de)serialized.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Selected { get; set; }
Public Property Selected As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_Grip.Selected"]
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace