Grasshopper SDK
IGH_UndoAction.ExpiresDisplay Property
 Gets the display expiration flag for this event. If True, the Rhino viewports will be redrawn once the entire undo record has been completed. If ExpiresSolution is set to true, ExpriresDisplay is implied.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool ExpiresDisplay { get; }
ReadOnly Property ExpiresDisplay As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.IGH_UndoAction.ExpiresDisplay"]
See Also
Reference
IGH_UndoAction Interface
Grasshopper.Kernel.Undo Namespace