Grasshopper SDK
GH_SliderBase.Maximum Property
 Gets or sets the upper limit of the slider.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Maximum { get; set; }
Public Property Maximum As Decimal
	Get
	Set
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.Maximum"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace