Grasshopper SDK
Instances.IsDocumentAssociationServer Property
 Gets whether the Document Association server has been set.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsDocumentAssociationServer { get; }
Public Shared ReadOnly Property IsDocumentAssociationServer As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Instances.IsDocumentAssociationServer"]
See Also
Reference
Instances Class
Grasshopper Namespace