Grasshopper SDK
GH_GraphicsUtil.EtchHorizontal Method (Graphics, Single, Single, Single, Int32)
 Draws an etched line segment.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void EtchHorizontal(
	Graphics g,
	float x0,
	float x1,
	float y,
	int alpha = 50
)
Public Shared Sub EtchHorizontal (
	g As Graphics,
	x0 As Single,
	x1 As Single,
	y As Single,
	Optional alpha As Integer = 50
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
x0
Type: System.Single
x component of start point.
x1
Type: System.Single
x component of end point.
y
Type: System.Single
y component of line segment.
alpha (Optional)
Type: System.Int32
Alpha level of etched line.
See Also
Reference
GH_GraphicsUtil Class
EtchHorizontal Overload
Grasshopper.GUI Namespace