Grasshopper SDK
GH_ComponentServer.FindUpgrader Method
 Find the upgrader that can convert from the given target.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_UpgradeObject FindUpgrader(
	Guid target
)
Public Function FindUpgrader (
	target As Guid
) As IGH_UpgradeObject
Parameters
target
Type: System.Guid
ComponentID of object to upgrade.
Return Value
Type: IGH_UpgradeObject
Matching upgrader or null if no upgrader is defined.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace