Grasshopper SDK
GH_SettingsServer.ShowSettingsBrowser Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ShowSettingsBrowser(
	IWin32Window parent
)
Public Sub ShowSettingsBrowser (
	parent As IWin32Window
)
Parameters
parent
Type: System.Windows.Forms.IWin32Window
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace