Grasshopper SDK
IGH_SettingFrontend.Category Property
 Category of this setting.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Category { get; }
ReadOnly Property Category As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_SettingFrontend.Category"]
See Also
Reference
IGH_SettingFrontend Interface
Grasshopper.GUI Namespace