Grasshopper SDK
GH_SliderBase.RailFullColour Property
 Gets or sets the fill colour for the full portion of the rail.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color RailFullColour { get; set; }
Public Property RailFullColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.RailFullColour"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace