Grasshopper SDK
Complex.Addition Operator (Double, Complex)
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Complex operator +(
	double A,
	Complex B
)
Public Shared Operator + (
	A As Double,
	B As Complex
) As Complex
Parameters
A
Type: System.Double
B
Type: Grasshopper.Kernel.Types.Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Addition Overload
Grasshopper.Kernel.Types Namespace