Grasshopper SDK
GH_AssemblyInfo.AuthorContact Property
 Gets the contact information for the author. This can be email, phone, fax, address or all of the above. Return null if you do not wish to associate contact details with this assembly.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string AuthorContact { get; }
Public Overridable ReadOnly Property AuthorContact As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.AuthorContact"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace