Grasshopper SDK
GH_ParserSymbol.Equals Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
GH_ParserSymbol Class
Grasshopper.Kernel.Expressions Namespace