Grasshopper SDK
Rotation Constructor (Point3d, Vector3d, Vector3d)
Initializes a new instance of the Rotation class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rotation(
	Point3d center,
	Vector3d dir0,
	Vector3d dir1
)
Public Sub New (
	center As Point3d,
	dir0 As Vector3d,
	dir1 As Vector3d
)
Parameters
center
Type: Point3d
dir0
Type: Vector3d
dir1
Type: Vector3d
See Also
Reference
Rotation Class
Rotation Overload
Grasshopper.Kernel.Types.Transforms Namespace