Grasshopper SDK
GH_GraphicsUtil.EtchHorizontal Method (Graphics, Int32, Int32, Int32, Int32, Int32)
 Draws an etched line segment.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void EtchHorizontal(
	Graphics g,
	int x0,
	int x1,
	int y,
	int alphaLight = 200,
	int alphaDark = 35
)
Public Shared Sub EtchHorizontal (
	g As Graphics,
	x0 As Integer,
	x1 As Integer,
	y As Integer,
	Optional alphaLight As Integer = 200,
	Optional alphaDark As Integer = 35
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
x0
Type: System.Int32
x component of start point.
x1
Type: System.Int32
x component of end point.
y
Type: System.Int32
y component of line segment.
alphaLight (Optional)
Type: System.Int32
Alpha level of etched lit line.
alphaDark (Optional)
Type: System.Int32
Alpha level of etched shadow line.
See Also
Reference
GH_GraphicsUtil Class
EtchHorizontal Overload
Grasshopper.GUI Namespace