Grasshopper SDK
GH_ColourCube.Grip Property
 Gets the rectangle that describes the slice grip.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle Grip { get; }
Public ReadOnly Property Grip As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourCube.Grip"]
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace