Grasshopper SDK
IGH_ValueProxy.IsValid Property
 Gets a value indicating whether or not the current value is valid
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsValid { get; }
ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ValueProxy.IsValid"]
See Also
Reference
IGH_ValueProxy Interface
Grasshopper.Kernel Namespace