Grasshopper SDK
GH_Slider_Obsolete.TextInputMode Property
 Gets or sets the Text input mode for this slider.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SliderInputMode TextInputMode { get; set; }
Public Property TextInputMode As GH_SliderInputMode
	Get
	Set
Property Value
Type: GH_SliderInputMode
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider_Obsolete.TextInputMode"]
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace