Grasshopper SDK
GH_Component.Params Property
 Gets the parameter manager object for this component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ComponentParamServer Params { get; }
Public ReadOnly Property Params As GH_ComponentParamServer
	Get
Property Value
Type: GH_ComponentParamServer
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.Params"]
Implements
IGH_Component.Params
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace