Grasshopper SDK
GH_Transform.CastTo<Q> Method (Q)
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CastTo<Q>(
	ref Q target
)
Public Overrides Function CastTo(Of Q) (
	ByRef target As Q
) As Boolean
Parameters
target
Type: Q
Type Parameters
Q
Return Value
Type: Boolean
See Also
Reference
GH_Transform Class
CastTo Overload
Grasshopper.Kernel.Types Namespace