Grasshopper SDK
GH_DigitNumber.Minimum Property
 Gets the minimum value allowed in this number.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Minimum { get; set; }
Public Property Minimum As Decimal
	Get
	Set
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitNumber.Minimum"]
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace