Grasshopper SDK
IGH_EventConsumer.TotalExpiration Method
 This method will be called by the GH_CustomEventServer to indicate all interesting object events can now be processed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void TotalExpiration(
	GH_CustomEventServer server
)
Sub TotalExpiration (
	server As GH_CustomEventServer
)
Parameters
server
Type: Grasshopper.Kernel.GH_CustomEventServer
Server that called this method.
See Also
Reference
IGH_EventConsumer Interface
Grasshopper.Kernel Namespace