Grasshopper SDK
GH_UndoRecord Constructor
Initializes a new instance of the GH_UndoRecord class
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoRecord()
Public Sub New
See Also
Reference
GH_UndoRecord Class
GH_UndoRecord Overload
Grasshopper.Kernel.Undo Namespace