Grasshopper SDK
GH_Point.CreateFromSurfaceParam Method
 Create new point geometry instance based on a curve distance parameter
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateFromSurfaceParam(
	Guid brp_id,
	int f_index,
	Surface srf,
	double u,
	double v
)
Public Sub CreateFromSurfaceParam (
	brp_id As Guid,
	f_index As Integer,
	srf As Surface,
	u As Double,
	v As Double
)
Parameters
brp_id
Type: System.Guid
ID of the curve this object references
f_index
Type: System.Int32
Index of edge to reference
srf
Type: Surface
Surface to work on
u
Type: System.Double
Parameter in surface U direction
v
Type: System.Double
Parameter in surface V direction
Remarks
This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace