Grasshopper SDK
GH_ResourceGate.BlackIcon Property
 Returns a 24x24 hexagonal black icon.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Bitmap BlackIcon { get; }
Public Shared ReadOnly Property BlackIcon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Plugin.GH_ResourceGate.BlackIcon"]
See Also
Reference
GH_ResourceGate Class
Grasshopper.Plugin Namespace