Grasshopper SDK
GH_Circle.GH_CircleProxy.Construct Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void Construct()
Public Overrides Sub Construct
See Also
Reference
GH_Circle.GH_CircleProxy Class
Grasshopper.Kernel.Types Namespace