Grasshopper SDK
IGH_StateTag.Stage Property
 Gets or sets the Stage rectangle for this state tag. Stages are assigned during Attribute Layout operations by owner objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Rectangle Stage { get; set; }
Property Stage As Rectangle
	Get
	Set
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_StateTag.Stage"]
See Also
Reference
IGH_StateTag Interface
Grasshopper.Kernel Namespace