Grasshopper SDK
GH_RhinoScriptInterface.BakeDataInObject Method
 Find an object and bake all geometry inside of it.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Object BakeDataInObject(
	string objectID
)
Public Function BakeDataInObject (
	objectID As String
) As Object
Parameters
objectID
Type: System.String
Object InstanceID or name.
Return Value
Type: Object
An array of Rhino object IDs, or null on failure.
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace