Grasshopper SDK
GH_Box.Mesh Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Mesh Mesh()
Public Function Mesh As Mesh
Return Value
Type: Mesh
See Also
Reference
GH_Box Class
Grasshopper.Kernel.Types Namespace