Grasshopper SDK
IGH_Component.IsValidMasterParameterIndex Property
 Gets whether the MasterParameterIndex property identifies a valid parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsValidMasterParameterIndex { get; }
ReadOnly Property IsValidMasterParameterIndex As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Component.IsValidMasterParameterIndex"]
See Also
Reference
IGH_Component Interface
Grasshopper.Kernel Namespace