Grasshopper SDK
GH_Variant.Data<T> Method
 Perform a straight cast of the data inside this Variant.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public T Data<T>()
Public Function Data(Of T) As T
Type Parameters
T
Return Value
Type: T
The value inside this Variant cast to T.
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace