Grasshopper SDK
GH_CanvasDropTargetValidator.DropID Property
 Gets or sets the ID for the allowed component.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid DropID { get; set; }
Public Property DropID As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasDropTargetValidator.DropID"]
See Also
Reference
GH_CanvasDropTargetValidator Class
Grasshopper.GUI.Canvas Namespace