Grasshopper SDK
Folders.DefaultTemplateFolder Property
 Gets the standard directory in windows ApplicationData that contains template files.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string DefaultTemplateFolder { get; }
Public Shared ReadOnly Property DefaultTemplateFolder As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.DefaultTemplateFolder"]
Return Value
Type: String
A directory path.
See Also
Reference
Folders Class
Grasshopper Namespace