Grasshopper SDK
GH_Attributes<T> Constructor
 Construct a new instance of this class.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_Attributes(
	T owner
)
Protected Sub New (
	owner As T
)
Parameters
owner
Type: T
Owner object associated with these attributes.
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace