Grasshopper SDK
GH_PreviewFilter Enumeration
 Lists all possible Grasshopper preview filters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_PreviewFilter
Public Enumeration GH_PreviewFilter
Members
Member name | Value | Description
None | 0 |  Specifies no filtering is applied to the preview, i.e. all objects are drawn.
Selected | 1 |  Only selected objects are included in the preview.
See Also
Reference
Grasshopper.Kernel Namespace