Grasshopper SDK
GH_DocumentServer.GetEnumerator Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IEnumerator GetEnumerator()
Public Function GetEnumerator As IEnumerator
Return Value
Type: IEnumerator
Implements
IEnumerable.GetEnumerator()
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace