Grasshopper SDK
GH_MenuTextBox.KeyDown Event
 Raised whenever a key is pressed.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_MenuTextBox.KeyDownEventHandler KeyDown
Public Event KeyDown As GH_MenuTextBox.KeyDownEventHandler
Value
Type: Grasshopper.GUI.GH_MenuTextBox.KeyDownEventHandler
See Also
Reference
GH_MenuTextBox Class
Grasshopper.GUI Namespace