Grasshopper SDK
GH_CapsuleRenderEngine.GetPaletteStyle Method (GH_Palette, Boolean, Boolean, Boolean)
Note: This API is now obsolete.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("this method has been replaced by GetImpliedStyle")]
public static GH_PaletteStyle GetPaletteStyle(
	GH_Palette palette,
	bool selected,
	bool locked,
	bool hidden
)
<ObsoleteAttribute("this method has been replaced by GetImpliedStyle")>
Public Shared Function GetPaletteStyle (
	palette As GH_Palette,
	selected As Boolean,
	locked As Boolean,
	hidden As Boolean
) As GH_PaletteStyle
Parameters
palette
Type: Grasshopper.GUI.Canvas.GH_Palette
selected
Type: System.Boolean
locked
Type: System.Boolean
hidden
Type: System.Boolean
Return Value
Type: GH_PaletteStyle
See Also
Reference
GH_CapsuleRenderEngine Class
GetPaletteStyle Overload
Grasshopper.GUI.Canvas Namespace