Grasshopper SDK
DataTree<T>.RenumberPaths Method
 Renumber all paths in this data tree, using a single incrementing path index.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenumberPaths()
Public Sub RenumberPaths
See Also
Reference
DataTree<T> Class
RenumberPaths Overload
Grasshopper Namespace