Grasshopper SDK
Identity.Name Property
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Transforms.Identity.Name"]
Implements
ITransform.Name
See Also
Reference
Identity Class
Grasshopper.Kernel.Types.Transforms Namespace