Grasshopper SDK
GH_Curve Constructor (Guid)
 Create a new referenced curve that references a Rhino curve object with the specified ID.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Curve(
	Guid ref_guid
)
Public Sub New (
	ref_guid As Guid
)
Parameters
ref_guid
Type: System.Guid
ID of curve object to reference.
See Also
Reference
GH_Curve Class
GH_Curve Overload
Grasshopper.Kernel.Types Namespace