Grasshopper SDK
GH_ResizeBorder Class
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Canvas.GH_Border
 Grasshopper.GUI.Canvas.GH_ResizeBorder
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ResizeBorder : GH_Border
Public Class GH_ResizeBorder
	Inherits GH_Border
The GH_ResizeBorder type exposes the following members.
Constructors
Name | Description
GH_ResizeBorder(GH_Border)
 Create a new instance of the GH_ResizeBorder class.
GH_ResizeBorder(RectangleF, GH_BorderTopology)
 Create a new instance of the GH_ResizeBorder class.
Top
Properties
Name | Description
Anchor
 Gets or sets the anchor point for sizing operations. This point is determined automatically when you call Setup(), however you can alter it afterwards if you want.
Top
Methods
Name | Description
Setup(IGH_Attributes, PointF)
 Set up a new sizing operation.
Setup(RectangleF, PointF, PointF)
 Set up a new sizing operation.
Setup(IGH_Attributes, PointF, SizeF)
 Set up a new sizing operation.
Setup(RectangleF, PointF, PointF, SizeF)
 Set up a new sizing operation.
Setup(IGH_Attributes, PointF, SizeF, SizeF)
 Set up a new sizing operation.
Setup(RectangleF, PointF, PointF, SizeF, SizeF)
 Set up a new sizing operation.
Solve
 Solve a resizing step.
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace