Grasshopper SDK
IGH_RenderAwareObject Methods
The IGH_RenderAwareObject type exposes the following members.
Methods
Name | Description
AppendRenderGeometry
Top
See Also
Reference
IGH_RenderAwareObject Interface
Grasshopper.Kernel Namespace