Grasshopper SDK
GH_UndoAction.Undo Method
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Undo(
	GH_Document doc
)
Public Sub Undo (
	doc As GH_Document
)
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
Implements
IGH_UndoAction.Undo(GH_Document)
See Also
Reference
GH_UndoAction Class
Grasshopper.Kernel.Undo Namespace