Grasshopper SDK
GH_Border.Region Property
 Gets the shape of the border.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RectangleF Region { get; }
Public ReadOnly Property Region As RectangleF
	Get
Property Value
Type: RectangleF
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Border.Region"]
See Also
Reference
GH_Border Class
Grasshopper.GUI.Canvas Namespace