Grasshopper SDK
GH_ConnectivityDiagram Constructor (GH_ConnectivityDiagram)
 Create a duplicate of another Connectivity Diagram.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ConnectivityDiagram(
	GH_ConnectivityDiagram other
)
Public Sub New (
	other As GH_ConnectivityDiagram
)
Parameters
other
Type: Grasshopper.Kernel.GH_ConnectivityDiagram
Diagram to copy.
See Also
Reference
GH_ConnectivityDiagram Class
GH_ConnectivityDiagram Overload
Grasshopper.Kernel Namespace