Grasshopper SDK
GH_Convert.ToCircle_Primary Method
 Performs a direct cast from OnCircle or GH_Circle. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToCircle_Primary(
	Object data,
	ref Circle rc
)
Public Shared Function ToCircle_Primary (
	data As Object,
	ByRef rc As Circle
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Circle
Return Value
Type: Boolean
An OnCircle instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace