Grasshopper SDK
GH_FadeAnimation.Threshold Property
 Gets or sets the threshold value for the fade animation trigger.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float Threshold { get; set; }
Public Property Threshold As Single
	Get
	Set
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FadeAnimation.Threshold"]
See Also
Reference
GH_FadeAnimation Class
Grasshopper.GUI Namespace