Grasshopper SDK
GH_ValueProxy<T>.ProxyType Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Type ProxyType { get; }
Public ReadOnly Property ProxyType As Type
	Get
Property Value
Type: Type
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ValueProxy`1.ProxyType"]
Implements
IGH_ValueProxy.ProxyType
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace