Grasshopper SDK
GH_Canvas.DestroyMRUPanels Method
 Destroy any MRU panels that might be in existence.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DestroyMRUPanels()
Public Sub DestroyMRUPanels
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace