Grasshopper SDK
GH_Gradient.MouseDragAbort Method
 Abort grip drag.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool MouseDragAbort()
Public Function MouseDragAbort As Boolean
Return Value
Type: Boolean
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace