Grasshopper SDK
Node3d<T>.NearestItem Method (Double, Double, Double)
 Find the nearest item.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Index3d<T> NearestItem(
	double x,
	double y,
	double z
)
Public Function NearestItem (
	x As Double,
	y As Double,
	z As Double
) As Index3d(Of T)
Parameters
x
Type: System.Double
x coordinate to search from.
y
Type: System.Double
y coordinate to search from.
z
Type: System.Double
z coordinate to search from.
Return Value
Type: Index3d<T>
The index of the nearest item or null if no nearest item could be found.
See Also
Reference
Node3d<T> Class
NearestItem Overload
Grasshopper.Kernel.Geometry.SpatialTrees Namespace