Grasshopper SDK
UVInterval.IsValid Property
 Gets a value indicating whether or not this UVInterval is valid.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.UVInterval.IsValid"]
See Also
Reference
UVInterval Structure
Grasshopper.Kernel.Types Namespace