Grasshopper SDK
IGH_DataAccess.Util_EnsureNonNullCount<T> Method
 Tests a list to see if it contains sufficient non-null references.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool Util_EnsureNonNullCount<T>(
	List<T> L,
	int N
)
Function Util_EnsureNonNullCount(Of T) (
	L As List(Of T),
	N As Integer
) As Boolean
Parameters
L
Type: System.Collections.Generic.List<T>
List to parse
N
Type: System.Int32
Type Parameters
T
Type of list
Return Value
Type: Boolean
True if L contains N or more non-null references.
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace