Grasshopper SDK
GH_Document.AbortRequested Property
 Gets the abortrequested flag state.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AbortRequested { get; }
Public ReadOnly Property AbortRequested As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.AbortRequested"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace