Grasshopper SDK
GH_AutoSaveTrigger Enumeration
 Different types of events that can cause an AutoSave.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_AutoSaveTrigger
Public Enumeration GH_AutoSaveTrigger
Members
Member name | Value | Description
undefined | 0 |  Generic autosave trigger, this flag is not filtered.
doc_unload | 1 |  Autosave was triggered by a document being unloaded from a Canvas Context.
object_added | 2 |  Autosave was triggered by the addition of an object to the document.
object_removed | 3 |  Autosave was triggered by the removal of an object from the document.
wire_event | 4 |  Autosave was triggered by a change in connector wires.
data_matching_event | 5 |  Autosave was triggered by a change to Data Matching settings.
data_modification_event | 6 |  Autosave was triggered by a change to Data modifier settings.
object_generic | 7 |  Autosave was triggered by a non-trivial change to object data or settings.
See Also
Reference
Grasshopper.Kernel Namespace