Grasshopper SDK
GH_Format.Content Property
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Content Content { get; }
Public ReadOnly Property Content As IGH_Content
	Get
Property Value
Type: IGH_Content
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_Format.Content"]
See Also
Reference
GH_Format Class
Grasshopper.Documentation Namespace