Grasshopper SDK
GH_PathOffset.PathWrap Property
 Gets or sets the PathWrap flag.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool PathWrap { get; set; }
Public Property PathWrap As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_PathOffset.PathWrap"]
See Also
Reference
GH_PathOffset Class
Grasshopper.Kernel.Data Namespace