Grasshopper SDK
GH_Document.StateServer Property
 Gets the list of stored states in this document
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_StateServer StateServer { get; }
Public ReadOnly Property StateServer As GH_StateServer
	Get
Property Value
Type: GH_StateServer
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.StateServer"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace