Grasshopper SDK
GH_ScriptVariant.Integer Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Integer { get; }
Public ReadOnly Property Integer As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ScriptVariant.Integer"]
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace