Grasshopper SDK
GH_ContentCollection Constructor
Initializes a new instance of the GH_ContentCollection class
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ContentCollection()
Public Sub New
See Also
Reference
GH_ContentCollection Class
Grasshopper.Documentation Namespace