Grasshopper SDK
GH_Path.PathLengthComparer.Compare Method
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Compare(
	GH_Path x,
	GH_Path y
)
Public Function Compare (
	x As GH_Path,
	y As GH_Path
) As Integer
Parameters
x
Type: Grasshopper.Kernel.Data.GH_Path
y
Type: Grasshopper.Kernel.Data.GH_Path
Return Value
Type: Int32
Implements
IComparer<T>.Compare(T, T)
See Also
Reference
GH_Path.PathLengthComparer Class
Grasshopper.Kernel.Data Namespace