Grasshopper SDK
IGH_DataAccess.Util_FirstNonNullItem<T> Method
 Returns the index of the first non-null item in a list.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int Util_FirstNonNullItem<T>(
	List<T> L
)
Function Util_FirstNonNullItem(Of T) (
	L As List(Of T)
) As Integer
Parameters
L
Type: System.Collections.Generic.List<T>
List to parse.
Type Parameters
T
Type of list
Return Value
Type: Int32
The index of the first non-null item or -1 if no object reference could be found.
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace