Grasshopper SDK
GH_PathOffset Class
 Represents a relative offset within a data structure.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_PathOffset
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PathOffset
Public Class GH_PathOffset
The GH_PathOffset type exposes the following members.
Constructors
Name | Description
GH_PathOffset()
Initializes a new instance of the GH_PathOffset class
GH_PathOffset(IEnumerable<Int32>)
Initializes a new instance of the GH_PathOffset class
GH_PathOffset(IEnumerable<Int32>, Int32)
Initializes a new instance of the GH_PathOffset class
GH_PathOffset(IEnumerable<Int32>, Int32, Boolean, Boolean)
Initializes a new instance of the GH_PathOffset class
Top
Properties
Name | Description
ItemOffset
 Gets or sets the relative offset for branch items.
ItemWrap
 Gets or sets the ItemWrap flag.
PathOffset
 Gets access to the relative offsets for path indices.
PathWrap
 Gets or sets the PathWrap flag.
Top
Methods
Name | Description
OffsetPath(GH_Path, Int32, GH_Path, Int32)
 Offset a path + index value without wrapping.
OffsetPath(GH_Path, Int32, IGH_Structure, GH_Path, Int32)
 Offset a path + index value with wrapping and bounds checking.
ParseString
ToString
 Format the Path Offset.
 (Overrides Object.ToString().)
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace