Grasshopper SDK
GH_ActiveObject.MutableNickName Property
 Gets or sets a value that enables Nick name changes through the menu. The default is TRUE.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool MutableNickName { get; set; }
Public Property MutableNickName As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ActiveObject.MutableNickName"]
Implements
IGH_ActiveObject.MutableNickName
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace