Grasshopper SDK
Folders.TutorialFiles Property
 Gets an array of all the tutorial files. This includes all the files with the *.gh or *.ghx extension in the Tutorials folder. Subfolders are not traversed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string[] TutorialFiles { get; }
Public Shared ReadOnly Property TutorialFiles As String()
	Get
Property Value
Type: String[]
[Missing <value> documentation for "P:Grasshopper.Folders.TutorialFiles"]
See Also
Reference
Folders Class
Grasshopper Namespace