Grasshopper SDK
GH_Document.UndoUtil Property
 Gets a temporary undo utility instance that allows you to easily create standard undo events.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document.GH_UndoUtil UndoUtil { get; }
Public ReadOnly Property UndoUtil As GH_Document.GH_UndoUtil
	Get
Property Value
Type: GH_Document.GH_UndoUtil
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.UndoUtil"]
Return Value
Type: GH_Document.GH_UndoUtil
A new instance of GH_UndoUtil set up to work with this document. Do not hang on to this object, ask for a new one every time you need it.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace