Grasshopper SDK
GH_DigitScrollerBase.RaiseEvents Property
 Gets or sets whether this scroller raises the ValueChanged event.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RaiseEvents { get; set; }
Public Property RaiseEvents As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.RaiseEvents"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace