Grasshopper SDK
GH_Format.FormatArcValidity Method
 If the arc is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatArcValidity(
	Arc val,
	string identifier = "Arc"
)
Public Shared Function FormatArcValidity (
	val As Arc,
	Optional identifier As String = "Arc"
) As String
Parameters
val
Type: Arc
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the arc is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace