Grasshopper SDK
GH_DocumentRenderMeshProvider.Name Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string Name { get; }
Public Overrides ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentRenderMeshProvider.Name"]
See Also
Reference
GH_DocumentRenderMeshProvider Class
Grasshopper.Kernel Namespace