Grasshopper SDK
IGH_Tooltip.Icon Property
 Sets the Tooltip Icon image.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Image Icon { set; }
WriteOnly Property Icon As Image
	Set
Property Value
Type: Image
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_Tooltip.Icon"]
See Also
Reference
IGH_Tooltip Interface
Grasshopper.GUI Namespace