Grasshopper SDK
GH_SettingsServer.Count Property
 Gets the total number of settings stored in this database.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_SettingsServer.Count"]
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace