Grasshopper SDK
GH_Component.GH_InputParamManager.HideParameter Method
 Hide a specific input parameter. If the parameter at the given index implements IGH_PreviewObject then the Hidden flag will be set to True. Otherwise, nothing will happen.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void HideParameter(
	int index
)
Public Overrides Sub HideParameter (
	index As Integer
)
Parameters
index
Type: System.Int32
Index of parameter to hide.
See Also
Reference
GH_Component.GH_InputParamManager Class
Grasshopper.Kernel Namespace