Grasshopper SDK
GH_RelevantObjectData.CreateBalloonData Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateBalloonData(
	IGH_DocumentObject obj
)
Public Sub CreateBalloonData (
	obj As IGH_DocumentObject
)
Parameters
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace