Grasshopper SDK
GH_Box Class
 Represents a 3D oriented Box volume.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Box>
 Grasshopper.Kernel.Types.GH_GeometricGoo<Box>
 Grasshopper.Kernel.Types.GH_Box
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Box : GH_GeometricGoo<Box>,
	IGH_BakeAwareData, IGH_PreviewData, IGH_RenderAwareData
Public Class GH_Box
	Inherits GH_GeometricGoo(Of Box)
	Implements IGH_BakeAwareData, IGH_PreviewData, IGH_RenderAwareData
The GH_Box type exposes the following members.
Constructors
Name | Description
GH_Box()
Initializes a new instance of the GH_Box class
GH_Box(BoundingBox)
Initializes a new instance of the GH_Box class
GH_Box(Box)
Initializes a new instance of the GH_Box class
GH_Box(Guid)
Initializes a new instance of the GH_Box class
GH_Box(GH_Box)
Initializes a new instance of the GH_Box class
Top
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded |  (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid |  (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
Top
Methods
Name | Description
AppendRenderGeometry
BakeGeometry
Brep
 Differs from Rhino.Geometry.Brep.FromBox() because it Handles degenerate cases.
CastFrom |  (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches |  (Overrides GH_GeometricGoo<T>.ClearCaches().)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateBox
DuplicateGeometry |  (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
EmitProxy |  (Overrides GH_GeometricGoo<T>.EmitProxy().)
Geometry
 Convert the box to a GeometryBase instance.
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry(RhinoDoc) |  (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Mesh
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace