Grasshopper SDK
GH_FontServer.NewFont Method (FontFamily, Single)
 Safe font constructor.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font NewFont(
	FontFamily family,
	float size
)
Public Shared Function NewFont (
	family As FontFamily,
	size As Single
) As Font
Parameters
family
Type: System.Drawing.FontFamily
Font family.
size
Type: System.Single
Size (in points).
Return Value
Type: Font
See Also
Reference
GH_FontServer Class
NewFont Overload
Grasshopper.Kernel Namespace