Grasshopper SDK
GH_FontList Class
 Represents the installed Font collection. This control allows both navigation and selection of Font Families.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.Panel
 Grasshopper.GUI.GH_DoubleBufferedPanel
 Grasshopper.GUI.GH_FontList
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_FontList : GH_DoubleBufferedPanel
Public Class GH_FontList
	Inherits GH_DoubleBufferedPanel
The GH_FontList type exposes the following members.
Constructors
Name | Description
GH_FontList
Initializes a new instance of the GH_FontList class
Top
Properties
Name | Description
DisplayText
 Gets or sets the placeholder string.
Filter
 Gets or sets the filter string. You must call RecreateFontList() before the new font list is created.
FontFamily
 Gets or sets the selected font family.
FontSize
 Gets or sets the font size.
FontStyle
 Gets or sets the font style for all families.
Top
Methods
Name | Description
CreateFont
 Create a font that best approximates the current settings.
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
RecreateFontList
Top
See Also
Reference
Grasshopper.GUI Namespace