Grasshopper SDK
GH_GeometryGroup.IsValidWhyNot Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string IsValidWhyNot { get; }
Public ReadOnly Property IsValidWhyNot As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometryGroup.IsValidWhyNot"]
Implements
IGH_Goo.IsValidWhyNot
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace