Grasshopper SDK
Utility.InvokeSetterSafe Method
 Call a setter property via its name. No exceptions are thrown.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void InvokeSetterSafe(
	Object target,
	string property,
	Object value
)
Public Shared Sub InvokeSetterSafe (
	target As Object,
	property As String,
	value As Object
)
Parameters
target
Type: System.Object
Object to invoke on.
property
Type: System.String
Name of property to invoke.
value
Type: System.Object
See Also
Reference
Utility Class
Grasshopper Namespace