Grasshopper SDK
GH_Structure<T>.MergeStructure Method
 Merges two structures together. Data inside similar paths will be merged into single lists and unique paths will be appended. The other structure will not be altered, so beware that data is now shared among both structures.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void MergeStructure(
	GH_Structure<T> other
)
Public Sub MergeStructure (
	other As GH_Structure(Of T)
)
Parameters
other
Type: Grasshopper.Kernel.Data.GH_Structure<T>
Structure to merge
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace