Grasshopper SDK
GH_Grip Class
 Represents a grip in a gradient. A grip defines both where and how the colour of a gradient changes.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Gradient.GH_Grip
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Grip : IComparable<GH_Grip>,
	GH_ISerializable
Public Class GH_Grip
	Implements IComparable(Of GH_Grip), GH_ISerializable
The GH_Grip type exposes the following members.
Constructors
Name | Description
GH_Grip()
Initializes a new instance of the GH_Grip class
GH_Grip(GH_Grip)
Initializes a new instance of the GH_Grip class
GH_Grip(Double, Color)
Initializes a new instance of the GH_Grip class
GH_Grip(Double, Color, Color)
Initializes a new instance of the GH_Grip class
Top
Properties
Name | Description
ColourLeft
 Gets the colour to the left of this grip.
ColourRight
 Gets the colour to the right of this grip.
GripId
 Gets the Grip ID.
IsValid
 Gets whether this grip is valid. A valid grip must have a non-empty Id and a non-NaN parameter.
Parameter
 Gets or sets the numeric parameter of the grip.
Selected
 Gets or sets whether this grip is selected. Selection state is not (de)serialized.
Type
 Gets whether the colour across this grip is smooth.
Top
Methods
Name | Description
Blend
CompareTo
MutateId
 Create a new grip ID.
Read
Write
Top
See Also
Reference
Grasshopper.GUI.Gradient Namespace