Grasshopper SDK
GH_Param<T>.CollectVolatileData_Custom Method
 If a parameter has no sources, the CollectVolatileData_Custom() method is called. The basic implementation does nothing, but you can override this method to provide special data instantiation logic.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void CollectVolatileData_Custom()
Protected Overridable Sub CollectVolatileData_Custom
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace