Grasshopper SDK
GH_Gradient.Render_Grips Method
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Render_Grips(
	Graphics g,
	RectangleF dest
)
Public Sub Render_Grips (
	g As Graphics,
	dest As RectangleF
)
Parameters
g
Type: System.Drawing.Graphics
dest
Type: System.Drawing.RectangleF
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace