Grasshopper SDK
Tracing.Assert Method (Guid)
 Display a typical ASSERT dialog with stack information.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void Assert(
	Guid assert_id
)
Public Shared Sub Assert (
	assert_id As Guid
)
Parameters
assert_id
Type: System.Guid
ID of assert message. Every assert must have a unique ID so individual messages can be ignored.
See Also
Reference
Tracing Class
Assert Overload
Grasshopper Namespace