Grasshopper SDK
GH_Interval.DuplicateInterval Method
 Create a duplicate of this interval.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Interval DuplicateInterval()
Public Function DuplicateInterval As GH_Interval
Return Value
Type: GH_Interval
See Also
Reference
GH_Interval Class
Grasshopper.Kernel.Types Namespace