Grasshopper SDK
GH_RemoveObjectAction Class
 Records a single object removal.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ArchivedUndoAction
 Grasshopper.Kernel.Undo.Actions.GH_RemoveObjectAction
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_RemoveObjectAction : GH_ArchivedUndoAction
Public Class GH_RemoveObjectAction
	Inherits GH_ArchivedUndoAction
The GH_RemoveObjectAction type exposes the following members.
Constructors
Name | Description
GH_RemoveObjectAction
Initializes a new instance of the GH_RemoveObjectAction class
Top
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
Methods
Name | Description
Internal_Redo |  (Overrides GH_UndoAction.Internal_Redo(GH_Document).)
Internal_Undo |  (Overrides GH_UndoAction.Internal_Undo(GH_Document).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Undo.Actions Namespace