Grasshopper SDK
GH_Link Class
 Represents a link to another location in the Help or some external address.
Inheritance Hierarchy
System.Object
 Grasshopper.Documentation.GH_Link
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Link : IGH_Content
Public Class GH_Link
	Implements IGH_Content
The GH_Link type exposes the following members.
Properties
Name | Description
Destination
 Gets the link target.
IsSharedLink
 Gets whether this link is a shared link. A shared link should not have text but it should have a non-empty LinkId.
LinkId
 Gets the link ID. The link ID is only used for shared links.
Target
 Gets the link type.
Text
 Gets the list text.
Tooltip
 Gets the link tooltip text.
Top
Methods
Name | Description
CreateExternalLink(String, String)
CreateExternalLink(String, String, String)
CreateGlossaryLink(String)
CreateGlossaryLink(String, String)
CreateSharedLink(String, String)
CreateSharedLink(String, String, String)
CreateTopicLink(String, String)
CreateTopicLink(String, String, String)
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
Grasshopper.Documentation Namespace