Grasshopper SDK
GH_DragDropFileAction Enumeration
 Enumerates the possible actions for drag+drop loading ghx files.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_DragDropFileAction
Public Enumeration GH_DragDropFileAction
Members
Member name | Value | Description
None | 0 |  Indicates no action is defined.
Open | 1 |  Open the file(s) as a new document.
Examine | 2 |  Examine the file(s) using FileViewer.exe
Insert | 3 |  Insert the file(s) into the current document.
Group | 4 |  Insert the file(s) into the current document as separate groups.
Cluster | 5 |  Insert the file(s) into the current document as clusters.
See Also
Reference
Grasshopper.GUI.Canvas Namespace