Grasshopper SDK
GH_Material.DuplicateMaterial Method
 Duplicate this material.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Material DuplicateMaterial()
Public Function DuplicateMaterial As GH_Material
Return Value
Type: GH_Material
An exact duplicate of this material.
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace