Grasshopper SDK
GH_Vector.Duplicate Method
 Create a duplicate of this vector.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IGH_Goo Duplicate()
Public Overrides Function Duplicate As IGH_Goo
Return Value
Type: IGH_Goo
See Also
Reference
GH_Vector Class
Grasshopper.Kernel.Types Namespace