Grasshopper SDK
GH_CanvasChannel Enumeration
 Enumerates all the drawing channels that are handled inside the Grasshopper canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_CanvasChannel
Public Enumeration GH_CanvasChannel
Members
Member name | Value | Description
First | 0 |  First channel. At present, the first channel equals the Groups channel.
Groups | 0 |  Channel for Group outlines and name tags.
Wires | 10 |  Channel for connecting wires.
Objects | 20 |  Channels for Document Objects (components, parameters, special objects)
Overlay | 30 |  Channel for drawing overlay geometry.
Last | 30 |  Last channel. At present, the last channel equals the Overlay channel.
See Also
Reference
Grasshopper.GUI.Canvas Namespace