Grasshopper SDK
GH_Material Constructor (DisplayMaterial)
 Create a new Material.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Material(
	DisplayMaterial other
)
Public Sub New (
	other As DisplayMaterial
)
Parameters
other
Type: DisplayMaterial
Material to use (an internal copy will be made).
See Also
Reference
GH_Material Class
GH_Material Overload
Grasshopper.Kernel.Types Namespace