Grasshopper SDK
GH_Document.ClusterOutputHooks Method
 Gets a sorted list of all the cluster output hooks.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ClusterOutputHook[] ClusterOutputHooks()
Public Function ClusterOutputHooks As GH_ClusterOutputHook()
Return Value
Type: GH_ClusterOutputHook[]
A list of hooks in the proper order (from top to bottom, left to right).
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace