Grasshopper SDK
GH_Component.ClearData Method
 Clear the data inside this component and all output parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void ClearData()
Public Overrides Sub ClearData
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace