Grasshopper SDK
GH_Brep.LoadGeometry Method (RhinoDoc)
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool LoadGeometry(
	RhinoDoc doc
)
Public Overrides Function LoadGeometry (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: RhinoDoc
Return Value
Type: Boolean
See Also
Reference
GH_Brep Class
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace