Grasshopper SDK
GH_CanvasDropTargetValidator.DropText Property
 Gets or sets the text to display.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string DropText { get; set; }
Public Property DropText As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasDropTargetValidator.DropText"]
See Also
Reference
GH_CanvasDropTargetValidator Class
Grasshopper.GUI.Canvas Namespace