Grasshopper SDK
GH_ComplexNumber.DuplicateComplex Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ComplexNumber DuplicateComplex()
Public Function DuplicateComplex As GH_ComplexNumber
Return Value
Type: GH_ComplexNumber
See Also
Reference
GH_ComplexNumber Class
Grasshopper.Kernel.Types Namespace