Grasshopper SDK
IGH_FieldElement.Force Method
 Compute the force at a given location.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Vector3d Force(
	Point3d location
)
Function Force (
	location As Point3d
) As Vector3d
Parameters
location
Type: Point3d
Return Value
Type: Vector3d
See Also
Reference
IGH_FieldElement Interface
Grasshopper.Kernel.Types Namespace