Grasshopper SDK
GH_IconPicker.IconChanged Property
 Gets a value indicating whether or not the icon has been changed.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IconChanged { get; }
Public ReadOnly Property IconChanged As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_IconPicker.IconChanged"]
See Also
Reference
GH_IconPicker Class
Grasshopper.GUI Namespace