Grasshopper SDK
GH_AsynchFileData.UpdateProperties Method
 Updates all file properties on the thread on which this method is called.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void UpdateProperties()
Public Sub UpdateProperties
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace