Grasshopper SDK
CentralSettings.AuthorName Property
 Gets or sets the default author name to be used for all data generated by this Grasshopper installation.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string AuthorName { get; set; }
Public Shared Property AuthorName As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.CentralSettings.AuthorName"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace