Grasshopper SDK
GH_FontServer.MeasureString Method (String, Font, SizeF)
 Measure the size of a string
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Size MeasureString(
	string text,
	Font font,
	SizeF iLayout
)
Public Shared Function MeasureString (
	text As String,
	font As Font,
	iLayout As SizeF
) As Size
Parameters
text
Type: System.String
The string to measure
font
Type: System.Drawing.Font
The font to measure with
iLayout
Type: System.Drawing.SizeF
The layout rectangle
Return Value
Type: Size
See Also
Reference
GH_FontServer Class
MeasureString Overload
Grasshopper.Kernel Namespace