Grasshopper SDK
Instances.IsDocumentServer Property
 Gets whether the Document server has been set.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsDocumentServer { get; }
Public Shared ReadOnly Property IsDocumentServer As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Instances.IsDocumentServer"]
See Also
Reference
Instances Class
Grasshopper Namespace