Grasshopper SDK
GH_ComponentServer.GetCategoryIcon Method
 Get the icon for a specific category. If the icon hasn't been defined, this method will return the default icon.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap GetCategoryIcon(
	string fullName
)
Public Function GetCategoryIcon (
	fullName As String
) As Bitmap
Parameters
fullName
Type: System.String
Full name of category.
Return Value
Type: Bitmap
The category icon.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace