Grasshopper SDK
GH_Parser.StringToFragment Method
 Parse a block of text and return it as an interpreted IGH_Fragment.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static IGH_Content StringToFragment(
	string text
)
Public Shared Function StringToFragment (
	text As String
) As IGH_Content
Parameters
text
Type: System.String
Text to parse.
Return Value
Type: IGH_Content
Fragment representing the text.
See Also
Reference
GH_Parser Class
Grasshopper.Documentation Namespace