Grasshopper SDK
GH_Document.AppendToDebugLog Method
 Useful for creating textual representations of this document for debugging purposes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AppendToDebugLog(
	GH_DebugDescriptionWriter writer
)
Public Sub AppendToDebugLog (
	writer As GH_DebugDescriptionWriter
)
Parameters
writer
Type: Grasshopper.Kernel.GH_DebugDescriptionWriter
Implements
IGH_DebugDescription.AppendToDebugLog(GH_DebugDescriptionWriter)
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace