Grasshopper SDK
GH_DocumentIO.IsDocument Property
 Gets a value indicating whether or not this instance of GH_DocumentIO contains an internal document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsDocument { get; }
Public ReadOnly Property IsDocument As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentIO.IsDocument"]
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace