Grasshopper SDK
GH_DocumentEditor.ScriptAccess_IsDocumentModified Method
 Gets the modified flag of the currently loaded document.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ScriptAccess_IsDocumentModified()
Public Function ScriptAccess_IsDocumentModified As Boolean
Return Value
Type: Boolean
True if the document has been modified, false if not or if there is no document.
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace