Grasshopper SDK
GH_GeometricGooWrapper Constructor
Initializes a new instance of the GH_GeometricGooWrapper class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_GeometricGooWrapper()
Public Sub New
See Also
Reference
GH_GeometricGooWrapper Class
GH_GeometricGooWrapper Overload
Grasshopper.Kernel.Types Namespace