Grasshopper SDK
IGH_Goo.IsValidWhyNot Property
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string IsValidWhyNot { get; }
ReadOnly Property IsValidWhyNot As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_Goo.IsValidWhyNot"]
See Also
Reference
IGH_Goo Interface
Grasshopper.Kernel.Types Namespace