Grasshopper SDK
GH_Skin.wire_selected_b Field
 Specifies the colour for wires at the unselected end.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color wire_selected_b
Public Shared wire_selected_b As Color
Field Value
Type: Color
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace