Grasshopper SDK
GH_AsynchFileData.FileCreated Property
 Gets the date at which the file was created.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime FileCreated { get; }
Public ReadOnly Property FileCreated As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.GUI.GH_AsynchFileData.FileCreated"]
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace