Grasshopper SDK
GH_GraphicsUtil.AppendArc Method (PointF, PointF, SizeF, GraphicsPath)
 Append an arc segment to a GraphicsPath. If the arc cannot be solved, a linear segment is appended instead.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void AppendArc(
	PointF p0,
	PointF p1,
	SizeF dir,
	GraphicsPath path
)
Public Shared Sub AppendArc (
	p0 As PointF,
	p1 As PointF,
	dir As SizeF,
	path As GraphicsPath
)
Parameters
p0
Type: System.Drawing.PointF
Start point of arc.
p1
Type: System.Drawing.PointF
End point of arc.
dir
Type: System.Drawing.SizeF
Tangent direction at start of arc.
path
Type: System.Drawing.Drawing2D.GraphicsPath
Path to append to.
See Also
Reference
GH_GraphicsUtil Class
AppendArc Overload
Grasshopper.GUI Namespace