Grasshopper SDK
GH_GeometryGroup Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GeometryGroup
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_GeometryGroup : IGH_GeometricGoo,
	IGH_BakeAwareData, IGH_PreviewData
Public Class GH_GeometryGroup
	Implements IGH_GeometricGoo, IGH_BakeAwareData, IGH_PreviewData
The GH_GeometryGroup type exposes the following members.
Constructors
Name | Description
GH_GeometryGroup
Initializes a new instance of the GH_GeometryGroup class
Top
Properties
Name | Description
Boundingbox
ClippingBox
IsGeometryLoaded
IsReferencedGeometry
IsValid
IsValidWhyNot
Objects
ReferenceID
TypeDescription
TypeName
Top
Methods
Name | Description
BakeGeometry
CastFrom
CastTo<T>
ClearCaches
DrawViewportMeshes
DrawViewportWires
Duplicate
DuplicateGeometry
EmitProxy
GetBoundingBox
LoadGeometry()
LoadGeometry(RhinoDoc)
Morph
Read
ScriptVariable
ToString |  (Overrides Object.ToString().)
Transform
Write
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace