Grasshopper SDK
GH_Guid Constructor (GH_Guid)
Initializes a new instance of the GH_Guid class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Guid(
	GH_Guid other
)
Public Sub New (
	other As GH_Guid
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Guid
See Also
Reference
GH_Guid Class
GH_Guid Overload
Grasshopper.Kernel.Types Namespace