Grasshopper SDK
GH_RuleSequence.Apply Method
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Apply(
	int number
)
Public Function Apply (
	number As Integer
) As Boolean
Parameters
number
Type: System.Int32
Return Value
Type: Boolean
Implements
IGH_Rule.Apply(Int32)
See Also
Reference
GH_RuleSequence Class
Grasshopper.Kernel.Data Namespace