Grasshopper SDK
GH_ActiveObject.ProcessorTime Property
 Gets the most recent processor time profiler value.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual TimeSpan ProcessorTime { get; }
Public Overridable ReadOnly Property ProcessorTime As TimeSpan
	Get
Property Value
Type: TimeSpan
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ActiveObject.ProcessorTime"]
Implements
IGH_ActiveObject.ProcessorTime
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace