Grasshopper SDK
Instances.DocumentServer Property
 Gets the DocumentServer instance cached by the Instance Server. The DocumentServer will be instantiated the first time this property accessed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_DocumentServer DocumentServer { get; }
Public Shared ReadOnly Property DocumentServer As GH_DocumentServer
	Get
Property Value
Type: GH_DocumentServer
[Missing <value> documentation for "P:Grasshopper.Instances.DocumentServer"]
See Also
Reference
Instances Class
Grasshopper Namespace