Grasshopper SDK
GH_FieldElement.IsLimited Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsLimited { get; set; }
Public Property IsLimited As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_FieldElement.IsLimited"]
Implements
IGH_FieldElement.IsLimited
See Also
Reference
GH_FieldElement Class
Grasshopper.Kernel.Types Namespace