Grasshopper SDK
Instances.CanvasCreated Event
 Raised when the main canvas is created.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event Instances.CanvasCreatedEventHandler CanvasCreated
Public Shared Event CanvasCreated As Instances.CanvasCreatedEventHandler
Value
Type: Grasshopper.Instances.CanvasCreatedEventHandler
See Also
Reference
Instances Class
Grasshopper Namespace