Grasshopper SDK
GH_DocDiagramPainter.DrawingBox Property
 Gets the 2D domain of the diagram in image coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle DrawingBox { get; }
Public ReadOnly Property DrawingBox As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_DocDiagramPainter.DrawingBox"]
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace