Grasshopper SDK
GH_DocumentIO.Copy Method (GH_ClipboardType)
 Copy the internal document into the clipboard.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Copy(
	GH_ClipboardType clipboard
)
Public Function Copy (
	clipboard As GH_ClipboardType
) As Boolean
Parameters
clipboard
Type: Grasshopper.Kernel.GH_ClipboardType
Specifies the clipboard type to use.
Return Value
Type: Boolean
See Also
Reference
GH_DocumentIO Class
Copy Overload
Grasshopper.Kernel Namespace