Grasshopper SDK
GH_Document.FindObject Method (Guid, Boolean)
 Find the object that matches the ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_DocumentObject FindObject(
	Guid id,
	bool topLevelOnly
)
Public Function FindObject (
	id As Guid,
	topLevelOnly As Boolean
) As IGH_DocumentObject
Parameters
id
Type: System.Guid
The ID to search for.
topLevelOnly
Type: System.Boolean
If True, only top-level objects are included. If False, the entire object attribute tree is recursed
Return Value
Type: IGH_DocumentObject
See Also
Reference
GH_Document Class
FindObject Overload
Grasshopper.Kernel Namespace