Grasshopper SDK
GH_AssemblyInfoStub.AssemblyName Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string AssemblyName { get; }
Public Overrides ReadOnly Property AssemblyName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfoStub.AssemblyName"]
See Also
Reference
GH_AssemblyInfoStub Class
Grasshopper.Kernel Namespace