Grasshopper SDK
GH_UserObject.Path Property
 Gets or sets the file path this User Object is loaded from or saved to.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Path { get; set; }
Public Property Path As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_UserObject.Path"]
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace