Grasshopper SDK
GH_MouseTracker.Deviation Method
 Gets the maximum deviation of the recorded mouse path. The maximum deviation is the furthest distance the mouse has been from the first point in the history record.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Deviation()
Public Function Deviation As Double
Return Value
Type: Double
See Also
Reference
GH_MouseTracker Class
Deviation Overload
Grasshopper.GUI Namespace