Grasshopper SDK
GH_AssemblyFolderInfo.Type Field
 Identifies the type of assembly folder.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PluginFolderType Type
Public Type As GH_PluginFolderType
Field Value
Type: GH_PluginFolderType
See Also
Reference
GH_AssemblyFolderInfo Structure
Grasshopper.Kernel Namespace