Grasshopper SDK
GH_ComponentParamServer.OnlyTreeAndListParameters Property
 Returns True if every input parameter is either a list or a tree parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool OnlyTreeAndListParameters { get; }
Public ReadOnly Property OnlyTreeAndListParameters As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentParamServer.OnlyTreeAndListParameters"]
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace