Grasshopper SDK
GH_DigitScrollerBase.RadixBox Property
 Gets the Radix box for this control, if there is no radix box, Rectangle.Empty will be returned.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle RadixBox { get; }
Public ReadOnly Property RadixBox As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.RadixBox"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace