Grasshopper SDK
GH_IndexRanges.InsertRange Method
 Insert an index range into the collection.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool InsertRange(
	GH_IndexRange range
)
Public Function InsertRange (
	range As GH_IndexRange
) As Boolean
Parameters
range
Type: Grasshopper.Kernel.Data.GH_IndexRange
Range to insert.
Return Value
Type: Boolean
True if the collection was meaningfully modified.
See Also
Reference
GH_IndexRanges Class
Grasshopper.Kernel.Data Namespace