Grasshopper SDK
GH_ParserOperator Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Expressions.GH_ParserOperator
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ParserOperator : IComparable<GH_ParserOperator>
Public Class GH_ParserOperator
	Implements IComparable(Of GH_ParserOperator)
The GH_ParserOperator type exposes the following members.
Constructors
Name | Description
GH_ParserOperator
Initializes a new instance of the GH_ParserOperator class
Top
Methods
Name | Description
CompareTo
Equals |  (Overrides Object.Equals(Object).)
Top
Fields
Name | Description
m_description
m_name
m_precedence
m_symbol
m_type
Top
See Also
Reference
Grasshopper.Kernel.Expressions Namespace