Grasshopper SDK
GH_GenericObjectAction Class
 Records a single object change. Object changes are undone/redone by (de)serializing the objects. Object changes also keep track of all wires feeding into and coming out of the object.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ArchivedUndoAction
 Grasshopper.Kernel.Undo.Actions.GH_GenericObjectAction
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_GenericObjectAction : GH_ArchivedUndoAction
Public Class GH_GenericObjectAction
	Inherits GH_ArchivedUndoAction
The GH_GenericObjectAction type exposes the following members.
Constructors
Name | Description
GH_GenericObjectAction
Initializes a new instance of the GH_GenericObjectAction class
Top
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
Methods
Name | Description
Internal_Redo |  (Overrides GH_UndoAction.Internal_Redo(GH_Document).)
Internal_Undo |  (Overrides GH_UndoAction.Internal_Undo(GH_Document).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Undo.Actions Namespace