Grasshopper SDK
GH_GeometricFont.CharBracketOpen Property
 Gets the default geometry for '{'. Caller is responsible for disposing the path.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath CharBracketOpen { get; }
Public Shared ReadOnly Property CharBracketOpen As GraphicsPath
	Get
Property Value
Type: GraphicsPath
[Missing <value> documentation for "P:Grasshopper.GUI.GH_GeometricFont.CharBracketOpen"]
See Also
Reference
GH_GeometricFont Class
Grasshopper.GUI Namespace