Grasshopper SDK
GH_NumberSliderSnappingEditor.SnapLines Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string> SnapLines { get; }
Public ReadOnly Property SnapLines As List(Of String)
	Get
Property Value
Type: List<String>
[Missing <value> documentation for "P:Grasshopper.GUI.GH_NumberSliderSnappingEditor.SnapLines"]
See Also
Reference
GH_NumberSliderSnappingEditor Class
Grasshopper.GUI Namespace