Grasshopper SDK
GH_StateTagList.Layout Method
 Layout the StateTags.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Layout(
	Rectangle box,
	GH_StateTagLayoutDirection direction
)
Public Sub Layout (
	box As Rectangle,
	direction As GH_StateTagLayoutDirection
)
Parameters
box
Type: System.Drawing.Rectangle
Content box to append to.
direction
Type: Grasshopper.Kernel.GH_StateTagLayoutDirection
See Also
Reference
GH_StateTagList Class
Grasshopper.Kernel Namespace