Grasshopper SDK
GH_SliderBase.RaiseEvents Property
 Gets or sets a value indicating whether this slider raises the ValueChanged event.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RaiseEvents { get; set; }
Public Property RaiseEvents As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.RaiseEvents"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace