Grasshopper SDK
GH_Field Constructor
 Blank constructor.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Field()
Public Sub New
See Also
Reference
GH_Field Class
GH_Field Overload
Grasshopper.Kernel.Types Namespace