Grasshopper SDK
ITransform.ToString Method
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string ToString()
Function ToString As String
Return Value
Type: String
See Also
Reference
ITransform Interface
Grasshopper.Kernel.Types.Transforms Namespace