Grasshopper SDK
GH_DocumentTree Class
 Represents a hierarchical tree of documents that are subsidiary to one another.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_DocumentTree
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocumentTree : IGH_DebugDescription
Public Class GH_DocumentTree
	Implements IGH_DebugDescription
The GH_DocumentTree type exposes the following members.
Constructors
Name | Description
GH_DocumentTree
 Create a new document tree.
Top
Properties
Name | Description
FlatCollection
 Gets a flat collection of all documents. The most subsidiary documents are at the start of the collection.
Root
 Gets the root node for this document.
RootDocument
 Gets the document inside the root node of this tree.
Top
Methods
Name | Description
AppendToDebugLog
Top
See Also
Reference
Grasshopper.Kernel Namespace