Grasshopper SDK
GH_Document.OnContextChanged Method
 Raise the ContextChanged event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnContextChanged()
Public Sub OnContextChanged
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace