Grasshopper SDK
GH_Document.CreateConnectivityDiagram Method
 Gets the connectivity diagram for the current state of this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ConnectivityDiagram CreateConnectivityDiagram()
Public Function CreateConnectivityDiagram As GH_ConnectivityDiagram
Return Value
Type: GH_ConnectivityDiagram
The connectivity diagram of the current state. Once objects/wires are added or removed the diagram will not update and you must request a new one.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace