Grasshopper SDK
GH_Slider_Obsolete.GripBackColor Property
 Background colour of slider grip.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color GripBackColor { get; set; }
Public Property GripBackColor As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider_Obsolete.GripBackColor"]
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace