Grasshopper SDK
GH_CapsuleRenderEngine.CreateRoundedRectangle Method (Rectangle, Int32)
 Static (Shared in VB) method for creating rectangles with rounded corners.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath CreateRoundedRectangle(
	Rectangle rec,
	int radius
)
Public Shared Function CreateRoundedRectangle (
	rec As Rectangle,
	radius As Integer
) As GraphicsPath
Parameters
rec
Type: System.Drawing.Rectangle
Rectangle to fillet. Rectangles smaller than 3 pixels wide/high will be grown.
radius
Type: System.Int32
Radius of corner fillets.
Return Value
Type: GraphicsPath
Graphics path that describes the rounded rectangle.
See Also
Reference
GH_CapsuleRenderEngine Class
CreateRoundedRectangle Overload
Grasshopper.GUI.Canvas Namespace