Grasshopper SDK
GH_SettingsServer Class
 A single instance of this class is maintained at module level under the accessor "Settings".
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_SettingsServer
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_SettingsServer : GH_ISerializable
Public NotInheritable Class GH_SettingsServer
	Implements GH_ISerializable
The GH_SettingsServer type exposes the following members.
Constructors
Name | Description
GH_SettingsServer(String)
 Create a new instance of the GH_SettingsServer class. The server will be associated with a settings xml file in the %ApplicationData%\Grasshopper\ directory. If a file with the same name already exists, its settings will be automatically loaded.
GH_SettingsServer(String, Boolean)
 Create a new instance of the GH_SettingsServer class. The server will be associated with a settings xml file in the %ApplicationData%\Grasshopper\ directory.
Top
Properties
Name | Description
Count
 Gets the total number of settings stored in this database.
DatabaseName
 Gets the name of this settings database.
Top
Methods
Name | Description
Clear
 Destroy all settings.
ConstainsEntry
 Tests to see if a given entry is stored in this settings database.
DeleteValue
EntryNames
 Gets a list of all the entry names in this settings.
EntryType
 Gets the type of a specific entry.
GetValue(String, Boolean)
GetValue(String, Byte)
GetValue(String, DateTime)
GetValue(String, Double)
GetValue(String, Color)
GetValue(String, Point)
GetValue(String, Rectangle)
GetValue(String, Size)
GetValue(String, Int32)
GetValue(String, String)
Read
 Low-level deserializer.
SetValue(String)
SetValue(String, Boolean)
SetValue(String, Byte)
SetValue(String, DateTime)
SetValue(String, Double)
SetValue(String, Color)
SetValue(String, Point)
SetValue(String, Rectangle)
SetValue(String, Size)
SetValue(String, Int32)
SetValue(String, String)
ShowSettingsBrowser
Write
 Low-level serializer.
WritePersistentSettings
 Store all settings in the xml file now. You must call this function if you want the current settings to persist between sessions.
Top
See Also
Reference
Grasshopper.Kernel Namespace