Grasshopper SDK
IGH_PreviewArgs.Document Property
 Gets the Grasshopper document that is currently drawing the preview.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_Document Document { get; }
ReadOnly Property Document As GH_Document
	Get
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_PreviewArgs.Document"]
See Also
Reference
IGH_PreviewArgs Interface
Grasshopper.Kernel Namespace