Grasshopper SDK
GH_RhinoScriptInterface.RunSolver Method
 Runs the solver once, even if the global solver lock is on.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RunSolver(
	bool expireAllObjects
)
Public Sub RunSolver (
	expireAllObjects As Boolean
)
Parameters
expireAllObjects
Type: System.Boolean
If true, will expire all objects in the current document.
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace