Grasshopper SDK
GH_Param<T>.ProcessorTime Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override TimeSpan ProcessorTime { get; }
Public Overrides ReadOnly Property ProcessorTime As TimeSpan
	Get
Property Value
Type: TimeSpan
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.ProcessorTime"]
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace