Grasshopper SDK
GH_UnrecognizedObjectsForm Constructor
Initializes a new instance of the GH_UnrecognizedObjectsForm class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UnrecognizedObjectsForm()
Public Sub New
See Also
Reference
GH_UnrecognizedObjectsForm Class
Grasshopper.GUI Namespace