Grasshopper SDK
GH_AssemblyInfo.AssemblyIcon Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual Bitmap AssemblyIcon { get; }
Public Overridable ReadOnly Property AssemblyIcon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.AssemblyIcon"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace