Grasshopper SDK
GH_Circle Constructor
 Default constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Circle()
Public Sub New
See Also
Reference
GH_Circle Class
GH_Circle Overload
Grasshopper.Kernel.Types Namespace