Grasshopper SDK
GH_Transform Constructor
Initializes a new instance of the GH_Transform class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Transform()
Public Sub New
See Also
Reference
GH_Transform Class
GH_Transform Overload
Grasshopper.Kernel.Types Namespace