Grasshopper SDK
GH_MouseTracker.DropFrames Method (Double, Point)
 Find the youngest frame that deviates too much from the given locus and drop it and everything preceding it.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DropFrames(
	double deviation,
	Point anchor
)
Public Sub DropFrames (
	deviation As Double,
	anchor As Point
)
Parameters
deviation
Type: System.Double
Local deviation.
anchor
Type: System.Drawing.Point
See Also
Reference
GH_MouseTracker Class
DropFrames Overload
Grasshopper.GUI Namespace