Grasshopper SDK
GH_Structure<T>.RemovePath Method
 Removes a path and all associated data from the structure. If the path doesn't exist, nothing will happen.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RemovePath(
	GH_Path path
)
Public Sub RemovePath (
	path As GH_Path
)
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to remove.
Implements
IGH_Structure.RemovePath(GH_Path)
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace