Grasshopper SDK
CentralSettings.AuthorAddressChanged Event
 Raised whenever the AuthorAddress field is changed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.AuthorAddressChangedEventHandler AuthorAddressChanged
Public Shared Event AuthorAddressChanged As CentralSettings.AuthorAddressChangedEventHandler
Value
Type: Grasshopper.CentralSettings.AuthorAddressChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace