Grasshopper SDK
GH_RhinoScriptInterface.CloseAllDocuments Method
 Close all Grasshopper documents.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool CloseAllDocuments()
Public Function CloseAllDocuments As Boolean
Return Value
Type: Boolean
True on success, false on failure.
Examples
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
  Dim GH
  Set GH = Rhino.GetPlugInObject("Grasshopper")
  Call GH.CloseAllDocuments()
  Set GH = Nothing
End Sub
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace