Grasshopper SDK
GH_Painter.DrawNoDocumentMessage Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DrawNoDocumentMessage()
Public Sub DrawNoDocumentMessage
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace