Grasshopper SDK
GH_Canvas.ActiveInteraction Property
 Gets or sets the currently active interaction object.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_MouseInteraction ActiveInteraction { get; set; }
Public Property ActiveInteraction As IGH_MouseInteraction
	Get
	Set
Property Value
Type: IGH_MouseInteraction
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.ActiveInteraction"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace