Grasshopper SDK
GH_Document.EventServer Property
 Gets the event server that belongs to this document. The Event server may be in an inactive state, but it is never null.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentEventServer EventServer { get; }
Public ReadOnly Property EventServer As GH_DocumentEventServer
	Get
Property Value
Type: GH_DocumentEventServer
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.EventServer"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace