Grasshopper SDK
GH_Attributes<T>.HasInputGrip Property
 Gets a value indicating whether or not these attributes have an input grip.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool HasInputGrip { get; }
Public Overridable ReadOnly Property HasInputGrip As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.HasInputGrip"]
Implements
IGH_Attributes.HasInputGrip
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace