Grasshopper SDK
GH_GraphicsUtil.UiScale Property
 Gets the screen-scaling factor for the entire system. Use the UiAdjust methods in the Grasshopper top level namespace (Global_Proc module) to modify integer and single values.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static float UiScale { get; }
Public Shared ReadOnly Property UiScale As Single
	Get
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.GH_GraphicsUtil.UiScale"]
Return Value
Type: Single
Scaling factor (dpi / 96).
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace