Grasshopper SDK
GH_ScrollBarVerticalBase.Offset Property
 Gets the offset of the scroller.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Offset { get; }
Public ReadOnly Property Offset As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.Offset"]
See Also
Reference
GH_ScrollBarVerticalBase Class
Grasshopper.GUI.Base Namespace