Grasshopper SDK
IGH_DocumentObject.TriggerAutoSave Method (GH_AutoSaveTrigger)
 Triggers the AutoSave function on the owner document with a custom flag.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void TriggerAutoSave(
	GH_AutoSaveTrigger trigger
)
Sub TriggerAutoSave (
	trigger As GH_AutoSaveTrigger
)
Parameters
trigger
Type: Grasshopper.Kernel.GH_AutoSaveTrigger
Reason for the autosave operation. It is possible that a user has decided to avoid autosave events for specific types, so if you can, try and provide a correct trigger flag.
See Also
Reference
IGH_DocumentObject Interface
TriggerAutoSave Overload
Grasshopper.Kernel Namespace