Grasshopper SDK
IGH_Param.DataType Property
 Gets the type of the current data state.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_ParamData DataType { get; }
ReadOnly Property DataType As GH_ParamData
	Get
Property Value
Type: GH_ParamData
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.DataType"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace