Grasshopper SDK
GH_Format.FormatVector Method (Vector3d)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatVector(
	Vector3d data
)
Public Shared Function FormatVector (
	data As Vector3d
) As String
Parameters
data
Type: Vector3d
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatVector Overload
Grasshopper.Kernel Namespace