Grasshopper SDK
GH_Document.RuntimeID Property
 Gets the runtime ID of this document. RuntimeID is assigned once and never changed. It is also not deserialized so every document will always have a unique ID when loaded.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public ulong RuntimeID { get; }
Public ReadOnly Property RuntimeID As ULong
	Get
Property Value
Type: UInt64
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.RuntimeID"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace