Grasshopper SDK
GH_Attributes<T>.IsTopLevel Property
 Gets whether these attributes are top_level (i.e. no Parent attributes)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsTopLevel { get; }
Public ReadOnly Property IsTopLevel As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.IsTopLevel"]
Implements
IGH_Attributes.IsTopLevel
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace