Grasshopper SDK
GH_RuleGroup Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_RuleGroup
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_RuleGroup : IGH_Rule
Public Class GH_RuleGroup
	Implements IGH_Rule
The GH_RuleGroup type exposes the following members.
Constructors
Name | Description
GH_RuleGroup
Initializes a new instance of the GH_RuleGroup class
Top
Properties
Name | Description
Kind
Notation
Top
Methods
Name | Description
Apply
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace