Grasshopper SDK
GH_ComponentServer.EmitObject Method
 Create a new instance of the IGH_DocumentObject that matches the id. If no proxy can be matched to the id, a null reference will be returned.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_DocumentObject EmitObject(
	Guid id
)
Public Function EmitObject (
	id As Guid
) As IGH_DocumentObject
Parameters
id
Type: System.Guid
The component type id to instantiate
Return Value
Type: IGH_DocumentObject
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace