Grasshopper SDK
Utility.InvokeMethodSafe Method (Object, String)
 Call a method via its name. No exceptions are thrown.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Object InvokeMethodSafe(
	Object target,
	string method
)
Public Shared Function InvokeMethodSafe (
	target As Object,
	method As String
) As Object
Parameters
target
Type: System.Object
Object to invoke on.
method
Type: System.String
Name of method to invoke.
Return Value
Type: Object
The return value of the method.
See Also
Reference
Utility Class
InvokeMethodSafe Overload
Grasshopper Namespace