Grasshopper SDK
GH_FileSystemEventServer.FileEvent Delegate
 This delegate is called when changes to a certain file occur.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void FileEvent(
	string path
)
Public Delegate Sub FileEvent (
	path As String
)
Parameters
path
Type: System.String
The path of the file involved.
See Also
Reference
Grasshopper.Kernel Namespace