Grasshopper SDK
GH_MouseTracker.MaximumFrameCount Property
 Gets or sets the maximum number of frames to keep in history. If more frames are added, the oldest ones will be dropped. The default is 16,384 frames.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int MaximumFrameCount { get; set; }
Public Property MaximumFrameCount As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MouseTracker.MaximumFrameCount"]
See Also
Reference
GH_MouseTracker Class
Grasshopper.GUI Namespace