Grasshopper SDK
GH_Component.GH_OutputParamManager.RegisterParam Method (IGH_Param, String, String, String, GH_ParamAccess)
 Generic parameter registration. This class provides methods to register standard parameters, but if you have a special type you're in charge of setting it all up yourself.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RegisterParam(
	IGH_Param param,
	string name,
	string nickname,
	string description,
	GH_ParamAccess access
)
Public Sub RegisterParam (
	param As IGH_Param,
	name As String,
	nickname As String,
	description As String,
	access As GH_ParamAccess
)
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
The parameter to add
name
Type: System.String
The name of the parameter. Keep it short, single words are best.
nickname
Type: System.String
The nickname of the parameter. Keep it short, single characters are best.
description
Type: System.String
The description of the parameter. Be succinct but clear.
access
Type: Grasshopper.Kernel.GH_ParamAccess
Parameter access, you should set this field if you intend to output lists here.
See Also
Reference
GH_Component.GH_OutputParamManager Class
RegisterParam Overload
Grasshopper.Kernel Namespace