Grasshopper SDK
IGH_ActiveObject.SDKCompliancy Method
 Test whether this object is compliant with a given Rhino version.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool SDKCompliancy(
	int exeVersion,
	int exeServiceRelease
)
Function SDKCompliancy (
	exeVersion As Integer,
	exeServiceRelease As Integer
) As Boolean
Parameters
exeVersion
Type: System.Int32
Rhino major release (4, 5, ...).
exeServiceRelease
Type: System.Int32
Rhino minor (service) release.
Return Value
Type: Boolean
True if this object is compliant with the given Rhino release.
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace