Grasshopper SDK
GH_Slider Class
 Provides a standard Grasshopper slider as a winforms control.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 GH_TextInputBaseControl
 Grasshopper.GUI.GH_Slider
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Slider : GH_TextInputBaseControl
Public Class GH_Slider
	Inherits GH_TextInputBaseControl
The GH_Slider type exposes the following members.
Constructors
Name | Description
GH_Slider
Initializes a new instance of the GH_Slider class
Top
Properties
Name | Description
ControlEdgeColour
 Gets or sets the EdgeColor for this slider control.
ControlShadowColour
 Gets or sets the Shadow colour for this control.
DecimalPlaces
 Gets or sets the number of decimal places allowed for Floating Point Sliders.
DrawControlBorder
 Gets or sets whether the border of the slider should be drawn.
DrawControlShadows
 Gets or sets whether the drop shadows of the slider should be drawn.
FormatMask
 Gets or sets the string format mask to use for the display. Should contain at least one "{0}" element.
GripBottomColour
 Gets or sets the fill colour for the bottom edge of the slider grip.
GripDisplay
 Gets or sets how the slider grip (or thumb) is drawn.
GripEdgeColour
 Gets or sets the edge colour for the slider grip.
GripTopColour
 Gets or sets the fill colour for the top edge of the slider grip.
InternalSlider
 Gets the internal slider.
Maximum
 Gets or sets the upper numeric limit for the slider range.
Minimum
 Gets or sets the lower numeric limit for the slider range.
RailBrightColour
 Gets or sets the edge colour for the bright parts of the rail.
RailDarkColour
 Gets or sets the edge colour for the dark parts of the rail.
RailDisplay
 Gets or sets how the slider rail (or track) is drawn.
RailEmptyColour
 Gets or sets the fill colour for the empty portion of the rail.
RailFullColour
 Gets or sets the fill colour for the full portion of the rail.
ShadowSize
 Gets or sets the size of the border shadow along all edges of the box.
TextColour
 Gets or sets the fill colour for the slider text.
TickCount
 Gets or sets the number of ticks.
TickDisplay
 Gets or sets how the slider ticks are drawn.
TickFrequency
 Gets or sets the frequency of large ticks vs small ticks.
Type
 Gets or sets the numeric type of this slider.
Value
 Gets or sets the numeric value for the slider range.
Top
Methods
Name | Description
Input_Assign |  (Overrides GH_TextInputBaseControl.Input_Assign(String).)
Input_Parse |  (Overrides GH_TextInputBaseControl.Input_Parse(String).)
Input_Supply |  (Overrides GH_TextInputBaseControl.Input_Supply().)
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
Top
Events
Name | Description
ValueChanged
 Raised whenever the value of the slider is changed via GUI interaction.
Top
See Also
Reference
Grasshopper.GUI Namespace