Grasshopper SDK
GH_RenderArgs.Document Property
 Gets the rhino document from whence the render originated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RenderArgs.Document"]
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace