Grasshopper SDK
GH_ExpressionString.m_t Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected List<GH_CharType> m_t
Protected m_t As List(Of GH_CharType)
Field Value
Type: List<GH_CharType>
See Also
Reference
GH_ExpressionString Class
Grasshopper.Kernel.Expressions Namespace