Grasshopper SDK
Folders.ClusterFolders Property
 Gets a list of all the directories from which GHCLUSTER files are loaded. GHUSER files are loaded from subfolders as well.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<string> ClusterFolders { get; }
Public Shared ReadOnly Property ClusterFolders As List(Of String)
	Get
Property Value
Type: List<String>
[Missing <value> documentation for "P:Grasshopper.Folders.ClusterFolders"]
Return Value
Type: List<String>
A list of load target directories.
See Also
Reference
Folders Class
Grasshopper Namespace