Grasshopper SDK
GH_TypeLib.t_gh_arc Field
Grasshopper.Kernel.Types.GH_Arc
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Type t_gh_arc
Public Shared t_gh_arc As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace