Grasshopper SDK
GH_Transform Constructor (GH_Transform)
Initializes a new instance of the GH_Transform class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Transform(
	GH_Transform other
)
Public Sub New (
	other As GH_Transform
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Transform
See Also
Reference
GH_Transform Class
GH_Transform Overload
Grasshopper.Kernel.Types Namespace