Grasshopper SDK
GH_DigitNumber.PrimaryPositive Property
 Gets or sets a value indicating whether the number is positive.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool PrimaryPositive { get; set; }
Public Property PrimaryPositive As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitNumber.PrimaryPositive"]
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace