Grasshopper SDK
GH_PanelEditorControl.PanelContent Property
 Gets or sets the panel text on display.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string PanelContent { get; set; }
Public Property PanelContent As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_PanelEditorControl.PanelContent"]
See Also
Reference
GH_PanelEditorControl Class
Grasshopper.GUI Namespace