Grasshopper SDK
GH_ColourPickerBase.OnColorChanged Method
 Raise the ColorChanged event.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnColorChanged(
	bool intermediate
)
Public Sub OnColorChanged (
	intermediate As Boolean
)
Parameters
intermediate
Type: System.Boolean
Set the intermediate state of the event arguments.
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace