Grasshopper SDK
Index3d<T>.GlobalIndex Property
 Gets the item index within the tree global list.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int GlobalIndex { get; }
Public ReadOnly Property GlobalIndex As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Index3d`1.GlobalIndex"]
See Also
Reference
Index3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace