Grasshopper SDK
GH_GeometricGoo<T>.ReferenceID Property
 Gets or sets the Guid of the object that is referenced. Not all IGH_GeometricGoo implementations support referenced geometry. The default implementation is to always return Guid.Empty.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual Guid ReferenceID { get; set; }
Public Overridable Property ReferenceID As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometricGoo`1.ReferenceID"]
Implements
IGH_GeometricGoo.ReferenceID
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace