Grasshopper SDK
GH_Brep.IsGeometryLoaded Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool IsGeometryLoaded { get; }
Public Overrides ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Brep.IsGeometryLoaded"]
See Also
Reference
GH_Brep Class
Grasshopper.Kernel.Types Namespace