Grasshopper SDK
GH_Material.RdkMaterialResult Enumeration
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum RdkMaterialResult
Public Enumeration RdkMaterialResult
Members
Member name | Value | Description
None | 0
Success | 1
NotFound | 2
See Also
Reference
Grasshopper.Kernel.Types Namespace