Grasshopper SDK
Instances.DocumentEditor Property
 Gets the DocumentEditor of Grasshopper.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_DocumentEditor DocumentEditor { get; }
Public Shared ReadOnly Property DocumentEditor As GH_DocumentEditor
	Get
Property Value
Type: GH_DocumentEditor
[Missing <value> documentation for "P:Grasshopper.Instances.DocumentEditor"]
See Also
Reference
Instances Class
Grasshopper Namespace