Grasshopper SDK
GH_Format.FormatMeshFaceValidity Method
 If the number is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatMeshFaceValidity(
	MeshFace val,
	string identifier = "MeshFace"
)
Public Shared Function FormatMeshFaceValidity (
	val As MeshFace,
	Optional identifier As String = "MeshFace"
) As String
Parameters
val
Type: MeshFace
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the point is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace