Grasshopper SDK
GH_String.DuplicateString Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_String DuplicateString()
Public Function DuplicateString As GH_String
Return Value
Type: GH_String
See Also
Reference
GH_String Class
Grasshopper.Kernel.Types Namespace