Grasshopper SDK
IGH_Param.StateTags Property
 Gets all the StateTags that are associated with this parameter. A state tag is a visual feedback icon that represents specific internal settings.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_StateTagList StateTags { get; }
ReadOnly Property StateTags As GH_StateTagList
	Get
Property Value
Type: GH_StateTagList
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.StateTags"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace