Grasshopper SDK
GH_ParserSymbol Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Expressions.GH_ParserSymbol
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ParserSymbol : IComparable<GH_ParserSymbol>
Public Class GH_ParserSymbol
	Implements IComparable(Of GH_ParserSymbol)
The GH_ParserSymbol type exposes the following members.
Constructors
Name | Description
GH_ParserSymbol()
Initializes a new instance of the GH_ParserSymbol class
GH_ParserSymbol(String, GH_ParserTokenClass, GH_ParserPrecedence)
Initializes a new instance of the GH_ParserSymbol class
Top
Methods
Name | Description
CompareTo
Equals |  (Overrides Object.Equals(Object).)
ToString |  (Overrides Object.ToString().)
Top
Fields
Name | Description
m_class
m_level
m_token
Top
See Also
Reference
Grasshopper.Kernel.Expressions Namespace