Grasshopper SDK
GH_Vector Constructor (GH_Vector)
 Create a duplicate of another vector
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Vector(
	GH_Vector other
)
Public Sub New (
	other As GH_Vector
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Vector
Vector to copy. If null, a default vector will be created.
See Also
Reference
GH_Vector Class
GH_Vector Overload
Grasshopper.Kernel.Types Namespace