Grasshopper SDK
GH_Document.RaiseEvents Property
 If RaiseEvents is set to false, all the On....() methods of this document will stop raising events.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RaiseEvents { get; set; }
Public Property RaiseEvents As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.RaiseEvents"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace