Grasshopper SDK
GH_GraphicsUtil.RenderCenteredIcon Method (Graphics, RectangleF, Image, Single)
Note: This API is now obsolete.
 Draw an icon centered in a frame. This code is not zoom-aware, but it will perform consistent rounding (to avoid pixel-jitter when moving the frame across the screen). Icon will not be clipped to the frame.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("This method is obsolete, use a RenderIcon() overload instead.")]
public static void RenderCenteredIcon(
	Graphics g,
	RectangleF frame,
	Image icon,
	float scale
)
<ObsoleteAttribute("This method is obsolete, use a RenderIcon() overload instead.")>
Public Shared Sub RenderCenteredIcon (
	g As Graphics,
	frame As RectangleF,
	icon As Image,
	scale As Single
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to render with.
frame
Type: System.Drawing.RectangleF
Frame to center icon in.
icon
Type: System.Drawing.Image
Icon to render
scale
Type: System.Single
See Also
Reference
GH_GraphicsUtil Class
RenderCenteredIcon Overload
Grasshopper.GUI Namespace