Grasshopper SDK
GH_ActiveObject.AddRuntimeMessage Method
 Add a new message to this object. Valid message type flags are Warning and Error. If the Message string is empty or zero-length no message is added.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void AddRuntimeMessage(
	GH_RuntimeMessageLevel level,
	string text
)
Public Overridable Sub AddRuntimeMessage (
	level As GH_RuntimeMessageLevel,
	text As String
)
Parameters
level
Type: Grasshopper.Kernel.GH_RuntimeMessageLevel
Type of message. Only Warnings and Errors are recorded.
text
Type: System.String
Content of message.
Implements
IGH_ActiveObject.AddRuntimeMessage(GH_RuntimeMessageLevel, String)
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace