Grasshopper SDK
GH_Canvas.CreatePreview Method
 Render this canvas to a thumbnail preview.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap CreatePreview(
	Size size
)
Public Function CreatePreview (
	size As Size
) As Bitmap
Parameters
size
Type: System.Drawing.Size
Return Value
Type: Bitmap
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace