Grasshopper SDK
GH_RuleAnyNumbers Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_RuleAnyNumbers
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_RuleAnyNumbers : IGH_Rule
Public Class GH_RuleAnyNumbers
	Implements IGH_Rule
The GH_RuleAnyNumbers type exposes the following members.
Constructors
Name | Description
GH_RuleAnyNumbers
Initializes a new instance of the GH_RuleAnyNumbers class
Top
Properties
Name | Description
Kind
Notation
Top
Methods
Name | Description
Apply
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace