Grasshopper SDK
GH_ObjectUndoAction Class
 Utility base class for undo actions that operate on a single IGH_DocumentObject.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ObjectUndoAction
 More...
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_ObjectUndoAction : GH_UndoAction
Public MustInherit Class GH_ObjectUndoAction
	Inherits GH_UndoAction
The GH_ObjectUndoAction type exposes the following members.
Constructors
Name | Description
GH_ObjectUndoAction
Initializes a new instance of the GH_ObjectUndoAction class
Top
Properties
Name | Description
Top
Methods
Name | Description
Internal_Redo |  (Overrides GH_UndoAction.Internal_Redo(GH_Document).)
Internal_Undo |  (Overrides GH_UndoAction.Internal_Undo(GH_Document).)
Object_Redo
Object_Undo
Top
See Also
Reference
Grasshopper.Kernel.Undo Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ObjectUndoAction
 Grasshopper.Kernel.Undo.Actions.GH_DataMatchingAction
 Grasshopper.Kernel.Undo.Actions.GH_DataModificationAction
 Grasshopper.Kernel.Undo.Actions.GH_HiddenAction
 Grasshopper.Kernel.Undo.Actions.GH_IconDisplayAction
 Grasshopper.Kernel.Undo.Actions.GH_IconOverrideAction
 Grasshopper.Kernel.Undo.Actions.GH_LayoutAction
 Grasshopper.Kernel.Undo.Actions.GH_LockedAction
 Grasshopper.Kernel.Undo.Actions.GH_NickNameAction
 Grasshopper.Kernel.Undo.Actions.GH_PersistentDataAction<T>
 Grasshopper.Kernel.Undo.Actions.GH_PivotAction
 Grasshopper.Kernel.Undo.Actions.GH_WireDisplayAction