Grasshopper SDK
IGH_PreviewArgs.WireColour_Selected Property
 Gets the document default colour for selected Wires.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Color WireColour_Selected { get; }
ReadOnly Property WireColour_Selected As Color
	Get
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_PreviewArgs.WireColour_Selected"]
See Also
Reference
IGH_PreviewArgs Interface
Grasshopper.Kernel Namespace