Grasshopper SDK
GH_MouseTracker.LastFrameWithinDeviation Method
 Starting from the youngest frame, finds the oldest frame that is still within a maximum deviation of the youngest frame.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int LastFrameWithinDeviation(
	double deviation
)
Public Function LastFrameWithinDeviation (
	deviation As Double
) As Integer
Parameters
deviation
Type: System.Double
Maximum allowed deviation.
Return Value
Type: Int32
The index of the oldest frame with a distance less than the deviation from the youngest frame, or -1 if no such frame could be found.
See Also
Reference
GH_MouseTracker Class
Grasshopper.GUI Namespace