Grasshopper SDK
GH_Convert.ToInterval_Primary Method
 Performs a direct cast from OnInterval or GH_Interval.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToInterval_Primary(
	Object data,
	ref Interval rc
)
Public Shared Function ToInterval_Primary (
	data As Object,
	ByRef rc As Interval
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Interval
[out] Interval cast.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace