Grasshopper SDK
GH_Canvas.NavigationZoomIn Property
 Gets or sets the special key for zooming in.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Keys NavigationZoomIn { get; set; }
Public Shared Property NavigationZoomIn As Keys
	Get
	Set
Property Value
Type: Keys
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.NavigationZoomIn"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace