Grasshopper SDK
Utility.TernaryIf<T> Method
 Type safe implementation of the IIf conditional statement.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static T TernaryIf<T>(
	bool condition,
	T A,
	T B
)
Public Shared Function TernaryIf(Of T) (
	condition As Boolean,
	A As T,
	B As T
) As T
Parameters
condition
Type: System.Boolean
If True, A is returned.
A
Type: T
Value to return when condition evaluates to true.
B
Type: T
Value to return when condition evaluates to false.
Type Parameters
T
Type of statement.
Return Value
Type: T
See Also
Reference
Utility Class
Grasshopper Namespace