Grasshopper SDK
GH_DocumentEditor.ClearStatusBar Method
 Clear the Grasshopper status-bar.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearStatusBar()
Public Sub ClearStatusBar
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace