Grasshopper SDK
GH_Author.AddressReadonly Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string AddressReadonly { get; }
Public ReadOnly Property AddressReadonly As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Author.AddressReadonly"]
Implements
IGH_Author.Address
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace