Grasshopper SDK
GH_Capsule.CreateCapsule Method (RectangleF, GH_Palette, Int32[], Int32)
 Create a new blank capsule.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Capsule CreateCapsule(
	RectangleF box,
	GH_Palette palette,
	int[] radii,
	int highlight
)
Public Shared Function CreateCapsule (
	box As RectangleF,
	palette As GH_Palette,
	radii As Integer(),
	highlight As Integer
) As GH_Capsule
Parameters
box
Type: System.Drawing.RectangleF
Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
palette
Type: Grasshopper.GUI.Canvas.GH_Palette
Colour palette to apply.
radii
Type: System.Int32[]
Radii of rounded corners. This array must contain at least 4 integers. Radii are defined clockwise, starting at the upper left corner.
highlight
Type: System.Int32
Height of the highlight bar. A value of zero or lower disables the highlight.
Return Value
Type: GH_Capsule
A new instance of GH_Capsule. Caller is responsible for disposing of the object.
See Also
Reference
GH_Capsule Class
CreateCapsule Overload
Grasshopper.GUI.Canvas Namespace