Grasshopper SDK
GH_Structure<T>.RemoveData Method
 Removes the first occurence of a data instance in the tree.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RemoveData(
	T data
)
Public Sub RemoveData (
	data As T
)
Parameters
data
Type: T
Data to remove.
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace