Grasshopper SDK
IGH_Attributes.ExpireLayout Method
 Expires the entire layout of the attributes. When overridden, implementer must place a call to the base class ExpireLayout().
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void ExpireLayout()
Sub ExpireLayout
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace