Grasshopper SDK
GH_StateTag.Render Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void Render(
	Graphics graphics
)
Public Overridable Sub Render (
	graphics As Graphics
)
Parameters
graphics
Type: System.Drawing.Graphics
Implements
IGH_StateTag.Render(Graphics)
See Also
Reference
GH_StateTag Class
Grasshopper.Kernel Namespace