Grasshopper SDK
GH_ContentCollection.Content Property
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_Content> Content { get; }
Public ReadOnly Property Content As List(Of IGH_Content)
	Get
Property Value
Type: List<IGH_Content>
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_ContentCollection.Content"]
See Also
Reference
GH_ContentCollection Class
Grasshopper.Documentation Namespace