Grasshopper SDK
GH_DocumentEditor.ScriptAccess_SaveDocument Method
 Saves the document currently loaded in the Canvas. If the document hasn't been saved before then a Save... dialog box will be shown.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ScriptAccess_SaveDocument()
Public Function ScriptAccess_SaveDocument As Boolean
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace