Grasshopper SDK
GH_MatchWeight Enumeration
 Weighting factors of string matches.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_MatchWeight
Public Enumeration GH_MatchWeight
Members
Member name | Value | Description
Exact | 100
Start | 100
WordExact | 100
WordStart | 100
Contains | 10
Fuzzy | 10
See Also
Reference
Grasshopper.Kernel Namespace