Grasshopper SDK
GH_MemoryBitmap.CopyChannel Method
 Copy the contents of one channel into another.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CopyChannel(
	GH_BitmapChannel source,
	GH_BitmapChannel target
)
Public Sub CopyChannel (
	source As GH_BitmapChannel,
	target As GH_BitmapChannel
)
Parameters
source
Type: Grasshopper.Kernel.GH_BitmapChannel
Source channel (compound channels are not allowed).
target
Type: Grasshopper.Kernel.GH_BitmapChannel
Target channel (compound channels are not allowed).
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace