Grasshopper SDK
GH_ComponentServer.FindAssembly Method
 Gets the assembly that corresponds to the given library ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_AssemblyInfo FindAssembly(
	Guid libraryId
)
Public Function FindAssembly (
	libraryId As Guid
) As GH_AssemblyInfo
Parameters
libraryId
Type: System.Guid
Library ID to search for.
Return Value
Type: GH_AssemblyInfo
The library info, or null if the ID is not registered.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace