Grasshopper SDK
GH_Gradient.MouseDown Method
 Begin grip drag operation.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool MouseDown(
	RectangleF dest,
	PointF pt
)
Public Function MouseDown (
	dest As RectangleF,
	pt As PointF
) As Boolean
Parameters
dest
Type: System.Drawing.RectangleF
Destination rectangle of the gradient.
pt
Type: System.Drawing.PointF
Mouse position in destination coordinates.
Return Value
Type: Boolean
True if a grip drag was started, false otherwise.
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace