Grasshopper SDK
GH_Alias Constructor (GH_Alias)
Initializes a new instance of the GH_Alias class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Alias(
	GH_Alias other
)
Public Sub New (
	other As GH_Alias
)
Parameters
other
Type: Grasshopper.Kernel.GH_Alias
See Also
Reference
GH_Alias Class
GH_Alias Overload
Grasshopper.Kernel Namespace