Grasshopper SDK
GH_CapsuleRenderEngine.RenderOutlines Method
 Render default capsule outlines. If the zoom factor is less than 50% the inner outline is not drawn. This is usually the fifth stage in a Capsule rendering.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderOutlines(
	Graphics G,
	float zoom,
	GH_PaletteStyle style
)
Public Sub RenderOutlines (
	G As Graphics,
	zoom As Single,
	style As GH_PaletteStyle
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with.
zoom
Type: System.Single
Zoom level of graphics object.
style
Type: Grasshopper.GUI.Canvas.GH_PaletteStyle
Palette style that defines edge properties.
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace