Grasshopper SDK
GH_FormShepard Constructor
 Create a new form shepard.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_FormShepard(
	Form nOwner
)
Public Sub New (
	nOwner As Form
)
Parameters
nOwner
Type: System.Windows.Forms.Form
Owner form.
See Also
Reference
GH_FormShepard Class
Grasshopper.GUI Namespace