Grasshopper SDK
IGH_DocumentObject.OnObjectChanged Method (GH_ObjectEventType, Object)
 Raises the ObjectChanged event on the current (!not the top level!) object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void OnObjectChanged(
	GH_ObjectEventType eventType,
	Object tag
)
Sub OnObjectChanged (
	eventType As GH_ObjectEventType,
	tag As Object
)
Parameters
eventType
Type: Grasshopper.Kernel.GH_ObjectEventType
Type of change.
tag
Type: System.Object
Tag to apply to the event arguments.
See Also
Reference
IGH_DocumentObject Interface
OnObjectChanged Overload
Grasshopper.Kernel Namespace