Grasshopper SDK
Node3d<T>.CollapseNodes Method
 Collapse the (sub)tree rooted at this node. Collapsing happens when a node only has a single child, in which case the child usurps the position previously held by the parent. Do not collapse a (sub)tree if you still plan to add items later.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Node3d<T> CollapseNodes()
Public Function CollapseNodes As Node3d(Of T)
Return Value
Type: Node3d<T>
The new root for this (sub)tree. May well be an instance of this node if it cannot be collapsed.
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace