Grasshopper SDK
GH_Box Constructor
Initializes a new instance of the GH_Box class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Box()
Public Sub New
See Also
Reference
GH_Box Class
GH_Box Overload
Grasshopper.Kernel.Types Namespace