Grasshopper SDK
GH_GraphicsUtil.ShadowHorizontal Method (Graphics, Int32, Int32, Int32, Int32, Boolean, Int32)
 Draws a horizontal shadow edge.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void ShadowHorizontal(
	Graphics g,
	int x0,
	int x1,
	int y,
	int size = 10,
	bool below = true,
	int darkness = 50
)
Public Shared Sub ShadowHorizontal (
	g As Graphics,
	x0 As Integer,
	x1 As Integer,
	y As Integer,
	Optional size As Integer = 10,
	Optional below As Boolean = true,
	Optional darkness As Integer = 50
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
x0
Type: System.Int32
Start of shadow edge.
x1
Type: System.Int32
End of shadow edge.
y
Type: System.Int32
Elevation of shadow edge.
size (Optional)
Type: System.Int32
Length of cast shadow.
below (Optional)
Type: System.Boolean
If true, shadow is drawn below elevation line.
darkness (Optional)
Type: System.Int32
Alpha component of darkness directly underneath the edge.
See Also
Reference
GH_GraphicsUtil Class
ShadowHorizontal Overload
Grasshopper.GUI Namespace