Grasshopper SDK
GH_GeometricGoo<T>.Value Property
 Gets or sets the value of this type. Note that if the type has a ReferenceID this value might get destroyed in the future.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override T Value { get; set; }
Public Overrides Property Value As T
	Get
	Set
Property Value
Type: T
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometricGoo`1.Value"]
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace