Grasshopper SDK
GH_GHXHarvester.HarvestPivots Method (GH_Archive)
 Harvest all attribute pivots from a GHX/GH archive.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<PointF> HarvestPivots(
	GH_Archive archive
)
Public Shared Function HarvestPivots (
	archive As GH_Archive
) As List(Of PointF)
Parameters
archive
Type: GH_IO.Serialization.GH_Archive
Archive to parse.
Return Value
Type: List<PointF>
A list of all attribute pivots or null on failure.
See Also
Reference
GH_GHXHarvester Class
HarvestPivots Overload
Grasshopper.Kernel Namespace