Grasshopper SDK
GH_GraphicsUtil.TransparencyMatrix Method (Double)
 Create an image transparency matrix for a specific blending factor.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static ColorMatrix TransparencyMatrix(
	double fade
)
Public Shared Function TransparencyMatrix (
	fade As Double
) As ColorMatrix
Parameters
fade
Type: System.Double
Alpha fade amount. 0.0=complete transparency, 1.0=original transparency.
Return Value
Type: ColorMatrix
See Also
Reference
GH_GraphicsUtil Class
TransparencyMatrix Overload
Grasshopper.GUI Namespace