Grasshopper SDK
GH_DocumentObject.Menu_AppendItem Method (ToolStrip, String)
 Utility function for appending generic menu items.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static ToolStripMenuItem Menu_AppendItem(
	ToolStrip menu,
	string text
)
Public Shared Function Menu_AppendItem (
	menu As ToolStrip,
	text As String
) As ToolStripMenuItem
Parameters
menu
Type: System.Windows.Forms.ToolStrip
Menu to append item to.
text
Type: System.String
Item text.
Return Value
Type: ToolStripMenuItem
The appended item
See Also
Reference
GH_DocumentObject Class
Menu_AppendItem Overload
Grasshopper.Kernel Namespace