Grasshopper SDK
GH_ParserOperator Fields
The GH_ParserOperator type exposes the following members.
Fields
Name | Description
m_description
m_name
m_precedence
m_symbol
m_type
Top
See Also
Reference
GH_ParserOperator Class
Grasshopper.Kernel.Expressions Namespace