Grasshopper SDK
GH_FloatingParamAttributes.TextHeight Field
 Defines the default height of a floating parameter in Text display mode.
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int TextHeight = 20
Public Const TextHeight As Integer = 20
Field Value
Type: Int32
See Also
Reference
GH_FloatingParamAttributes Class
Grasshopper.Kernel.Attributes Namespace