Grasshopper SDK
GH_GHALoadingEventArgs.LoadingMechanism Property
 Gets the mechanism that was used to load the file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LoadingMechanism LoadingMechanism { get; }
Public ReadOnly Property LoadingMechanism As GH_LoadingMechanism
	Get
Property Value
Type: GH_LoadingMechanism
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_GHALoadingEventArgs.LoadingMechanism"]
See Also
Reference
GH_GHALoadingEventArgs Class
Grasshopper.Kernel Namespace