Grasshopper SDK
GH_DigitScrollerBase.DigitAlign Property
 Gets or sets the digit align mode.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DigitAlign DigitAlign { get; set; }
Public Property DigitAlign As GH_DigitAlign
	Get
	Set
Property Value
Type: GH_DigitAlign
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.DigitAlign"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace