Grasshopper SDK
GH_Document.RemoveObject Method (IGH_DocumentObject, Boolean)
 Remove the object from the document. This removal is the precursor to object deletion. Do not call this function if you intend to transfer the object to another GH_Document. This method does not add an Undo event, that is the responsibility of the caller.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RemoveObject(
	IGH_DocumentObject docObject,
	bool update
)
Public Function RemoveObject (
	docObject As IGH_DocumentObject,
	update As Boolean
) As Boolean
Parameters
docObject
Type: Grasshopper.Kernel.IGH_DocumentObject
Object to remove.
update
Type: System.Boolean
Return Value
Type: Boolean
See Also
Reference
GH_Document Class
RemoveObject Overload
Grasshopper.Kernel Namespace