Grasshopper SDK
GH_GraphicsUtil.ShadowHorizontal Method (Graphics, Single, Single, Single, Single, Boolean, Int32)
 Draws a horizontal shadow edge.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void ShadowHorizontal(
	Graphics g,
	float x0,
	float x1,
	float y,
	float size = 10f,
	bool below = true,
	int darkness = 50
)
Public Shared Sub ShadowHorizontal (
	g As Graphics,
	x0 As Single,
	x1 As Single,
	y As Single,
	Optional size As Single = 10F,
	Optional below As Boolean = true,
	Optional darkness As Integer = 50
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
x0
Type: System.Single
Start of shadow edge.
x1
Type: System.Single
End of shadow edge.
y
Type: System.Single
Elevation of shadow edge.
size (Optional)
Type: System.Single
Length of cast shadow.
below (Optional)
Type: System.Boolean
If true, shadow is drawn below elevation line.
darkness (Optional)
Type: System.Int32
Alpha component of darkness directly underneath the edge.
See Also
Reference
GH_GraphicsUtil Class
ShadowHorizontal Overload
Grasshopper.GUI Namespace