Grasshopper SDK
GH_GradientChangedEventArgs.Intermediate Property
 Gets whether this event is intermediate. I.e. whether it will be followed by another, similar event.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Intermediate { get; }
Public ReadOnly Property Intermediate As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_GradientChangedEventArgs.Intermediate"]
See Also
Reference
GH_GradientChangedEventArgs Class
Grasshopper.GUI.Gradient Namespace