Grasshopper SDK
GH_ConnectivityNode.NodeID Property
 Gets the InstanceID of the Parameter that this node represents.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid NodeID { get; }
Public ReadOnly Property NodeID As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ConnectivityNode.NodeID"]
See Also
Reference
GH_ConnectivityNode Class
Grasshopper.Kernel Namespace