Grasshopper SDK
GH_ColourCube.RenderSliceDropShadow Method
 Render the drop shadow onto the slice.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderSliceDropShadow(
	Graphics G
)
Public Sub RenderSliceDropShadow (
	G As Graphics
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with.
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace