Grasshopper SDK
GH_ConnectivityDiagram Constructor (GH_Document)
 Create a new Connectivity Diagram from a GH_Document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ConnectivityDiagram(
	GH_Document doc
)
Public Sub New (
	doc As GH_Document
)
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
Document to examine.
See Also
Reference
GH_ConnectivityDiagram Class
GH_ConnectivityDiagram Overload
Grasshopper.Kernel Namespace