Grasshopper SDK
GH_LineCharge.Segment Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Line Segment { get; set; }
Public Property Segment As Line
	Get
	Set
Property Value
Type: Line
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_LineCharge.Segment"]
See Also
Reference
GH_LineCharge Class
Grasshopper.Kernel.Types Namespace