Grasshopper SDK
GH_Document.AttributeCount Property
 Returns the total number of attributes in the document. Both Normal and Hidden ones
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int AttributeCount { get; }
Public ReadOnly Property AttributeCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.AttributeCount"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace