Grasshopper SDK
GH_FontServer.ScriptFamilyChanged Event
 Raised whenever the ScriptFamily is changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_FontServer.ScriptFamilyChangedEventHandler ScriptFamilyChanged
Public Shared Event ScriptFamilyChanged As GH_FontServer.ScriptFamilyChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_FontServer.ScriptFamilyChangedEventHandler
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace