Grasshopper SDK
GH_ColourPickerBase.ColorChanged Event
 Raised whenever the color of this picker is changed due to User-Interface methods.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_ColourPickerBase.ColorChangedEventHandler ColorChanged
Public Event ColorChanged As GH_ColourPickerBase.ColorChangedEventHandler
Value
Type: Grasshopper.GUI.Base.GH_ColourPickerBase.ColorChangedEventHandler
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace