Grasshopper SDK
GH_Viewport.Focus Method (Point)
 Look at a specific point.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Focus(
	Point pt
)
Public Sub Focus (
	pt As Point
)
Parameters
pt
Type: System.Drawing.Point
Point to focus on.
See Also
Reference
GH_Viewport Class
Focus Overload
Grasshopper.GUI.Canvas Namespace