Grasshopper SDK
GH_StateServer.Names Property
 Gets a list of all the state names in this server.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string> Names { get; }
Public ReadOnly Property Names As List(Of String)
	Get
Property Value
Type: List<String>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_StateServer.Names"]
See Also
Reference
GH_StateServer Class
Grasshopper.Kernel Namespace