Grasshopper SDK
GH_DigitScrollerBase.Suffix Property
 Gets or sets the suffix text to be displayed on the scroller.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Suffix { get; set; }
Public Property Suffix As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.Suffix"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace