Grasshopper SDK
GH_Interval2D.GH_Interval2DProxy.VMiddle Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double VMiddle { get; }
Public ReadOnly Property VMiddle As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Interval2D.GH_Interval2DProxy.VMiddle"]
See Also
Reference
GH_Interval2D.GH_Interval2DProxy Class
Grasshopper.Kernel.Types Namespace