Grasshopper SDK
IGH_BakeAwareObject Interface
 Implement this interface on your IGH_ActiveObject if you want to participate in the Bake GUI.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_BakeAwareObject
Public Interface IGH_BakeAwareObject
The IGH_BakeAwareObject type exposes the following members.
Properties
Name | Description
IsBakeCapable
 Gets a value indicating whether or not the object can potentially Bake data in its current state.
Top
Methods
Name | Description
BakeGeometry(RhinoDoc, List<Guid>)
 Bake all the goemetry in this object in the given Rhino document.
BakeGeometry(RhinoDoc, ObjectAttributes, List<Guid>)
 Bake all the goemetry in this object in the given Rhino document.
Top
See Also
Reference
Grasshopper.Kernel Namespace