Grasshopper SDK
GH_ValueProxy<T>.ProxyValue Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Object ProxyValue { get; }
Public ReadOnly Property ProxyValue As Object
	Get
Property Value
Type: Object
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ValueProxy`1.ProxyValue"]
Implements
IGH_ValueProxy.ProxyValue
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace