Grasshopper SDK
GH_AssemblyFolderInfo.Folder Field
 The actual full path to the folder.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Folder
Public Folder As String
Field Value
Type: String
See Also
Reference
GH_AssemblyFolderInfo Structure
Grasshopper.Kernel Namespace