Grasshopper SDK
GH_Document.DestroyPreviewMeshes Method
 Attempts to destroy all the preview meshes in this document. It might not work for all objects, but this is still your best bet.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DestroyPreviewMeshes()
Public Sub DestroyPreviewMeshes
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace