Grasshopper SDK
GH_IndexRange Constructor (Int32)
 Create a new singular range.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_IndexRange(
	int index
)
Public Sub New (
	index As Integer
)
Parameters
index
Type: System.Int32
Index of range start and end.
See Also
Reference
GH_IndexRange Structure
GH_IndexRange Overload
Grasshopper.Kernel.Data Namespace