Grasshopper SDK
GH_DigitNumber.LimitValue Method
 Limits the value to the minimum and maximum domain.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void LimitValue()
Public Sub LimitValue
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace