Grasshopper SDK
GH_Attributes<T>.PathName Property
 Get a description of the location of these attributes within the local attribute stack.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string PathName { get; }
Public Overridable ReadOnly Property PathName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.PathName"]
Implements
IGH_Attributes.PathName
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace