Grasshopper SDK
IGH_Author.Email Property
 Gets the email of the author.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Email { get; }
ReadOnly Property Email As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Author.Email"]
See Also
Reference
IGH_Author Interface
Grasshopper.Kernel Namespace