Grasshopper SDK
GH_Canvas.Regen Method
Note: This API is now obsolete.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("This method is obsolete, use Refresh() instead. Or better yet, use Invalidate().")]
public void Regen()
<ObsoleteAttribute("This method is obsolete, use Refresh() instead. Or better yet, use Invalidate().")>
Public Sub Regen
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace