Grasshopper SDK
GH_BracketMismatchException.Index Property
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_BracketMismatchException.Index"]
See Also
Reference
GH_BracketMismatchException Class
Grasshopper.Kernel.Data Namespace