Grasshopper SDK
GH_ResizeBorder Constructor (GH_Border)
 Create a new instance of the GH_ResizeBorder class.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ResizeBorder(
	GH_Border borders
)
Public Sub New (
	borders As GH_Border
)
Parameters
borders
Type: Grasshopper.GUI.Canvas.GH_Border
Border to mimic.
See Also
Reference
GH_ResizeBorder Class
GH_ResizeBorder Overload
Grasshopper.GUI.Canvas Namespace