Grasshopper SDK
GH_SpinForce.Radius Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_SpinForce.Radius"]
See Also
Reference
GH_SpinForce Class
Grasshopper.Kernel.Types Namespace