Grasshopper SDK
GH_Field.IsValid Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Field.IsValid"]
Implements
IGH_Goo.IsValid
See Also
Reference
GH_Field Class
Grasshopper.Kernel.Types Namespace