Grasshopper SDK
GH_MemoryBitmap.Filter_DitherPattern Method
 Create a checkerboard dither pattern.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_DitherPattern(
	Color colour
)
Public Sub Filter_DitherPattern (
	colour As Color
)
Parameters
colour
Type: System.Drawing.Color
Colour value to set at dithered pixels.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace