Grasshopper SDK
GH_ActiveObject.ComputeData Method
 This function is called whenever the object is required to generate new data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void ComputeData()
Public Overridable Sub ComputeData
Implements
IGH_ActiveObject.ComputeData()
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace