Grasshopper SDK
IGH_Goo.Duplicate Method
 Make a complete duplicate of this instance. No shallow copies.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_Goo Duplicate()
Function Duplicate As IGH_Goo
Return Value
Type: IGH_Goo
Remarks
Classes which implement this interface should also provide type specific Duplicate methods
See Also
Reference
IGH_Goo Interface
Grasshopper.Kernel.Types Namespace