Grasshopper SDK
CentralSettings.SetLoadProtected Method
 Sets whether a certain plugin is load protected.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void SetLoadProtected(
	string pluginName,
	bool loadProtect
)
Public Shared Sub SetLoadProtected (
	pluginName As String,
	loadProtect As Boolean
)
Parameters
pluginName
Type: System.String
The name of the plugin file (without the extension).
loadProtect
Type: System.Boolean
Load protection flag for this plugin.
See Also
Reference
CentralSettings Class
Grasshopper Namespace