Grasshopper SDK
GH_ComponentServer.GetCategorySymbolName Method
 Get the single char representation for a specific category. If the char hasn't been defined, this method will return the first char of the full name instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string GetCategorySymbolName(
	string fullName
)
Public Function GetCategorySymbolName (
	fullName As String
) As String
Parameters
fullName
Type: System.String
Full name of category.
Return Value
Type: String
The category char.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace