Grasshopper SDK
Tracing.DebugLogEndBlock Method
 Start a new block in the debug data. You must end all your own blocks. This function will only work if the Grasshopper window exists. This method is threadsafe.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void DebugLogEndBlock()
Public Shared Sub DebugLogEndBlock
See Also
Reference
Tracing Class
Grasshopper Namespace