Grasshopper SDK
GH_AsynchFileData.FileSize Property
 Gets the size of the file.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public long FileSize { get; }
Public ReadOnly Property FileSize As Long
	Get
Property Value
Type: Int64
[Missing <value> documentation for "P:Grasshopper.GUI.GH_AsynchFileData.FileSize"]
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace