Grasshopper SDK
GH_Gradient.Grip Property
 Gets or sets the grip at the given index.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Grip this[
	int index
] { get; set; }
Public Default Property Grip (
	index As Integer
) As GH_Grip
	Get
	Set
Parameters
index
Type: System.Int32
Index of grip to retrieve.
Property Value
Type: GH_Grip
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_Gradient.Grip(System.Int32)"]
Return Value
Type: GH_Grip
The grip at the given index.
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace