Grasshopper SDK
GH_Culture Constructor (GH_Culture)
Initializes a new instance of the GH_Culture class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Culture(
	GH_Culture other
)
Public Sub New (
	other As GH_Culture
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Culture
See Also
Reference
GH_Culture Class
GH_Culture Overload
Grasshopper.Kernel.Types Namespace