Grasshopper SDK
GH_InstanceDescription.Read Method
 Default deserialization. Only retrieves Name, NickName, Description and InstanceGuid fields. If you want to retrieve additional fields use ReadFull() instead. However, ReadFull() will only work if the archive was written using WriteFull().
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool Read(
	GH_IReader reader
)
Public Overridable Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Object to deserialize with.
Return Value
Type: Boolean
Always True.
Implements
GH_ISerializable.Read(GH_IReader)
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace