Grasshopper SDK
GH_GeometryGroup.ClearCaches Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearCaches()
Public Sub ClearCaches
Implements
IGH_GeometricGoo.ClearCaches()
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace