Grasshopper SDK
IGH_ActiveObject.RegisterRemoteIDs Method
 If this object depends on Rhino Objects, you must register the UUIDs of those objects. Failure to do so will result in faulty event handling.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void RegisterRemoteIDs(
	GH_GuidTable id_list
)
Sub RegisterRemoteIDs (
	id_list As GH_GuidTable
)
Parameters
id_list
Type: GH_GuidTable
The object ID database Grasshopper is responsive to.
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace