Grasshopper SDK
GH_Slider.Type Property
 Gets or sets the numeric type of this slider.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SliderAccuracy Type { get; set; }
Public Property Type As GH_SliderAccuracy
	Get
	Set
Property Value
Type: GH_SliderAccuracy
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.Type"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace