Grasshopper SDK
GH_RuntimeFile.TagSynonyms Field
 String tag used to identify Synonym collections in glossary source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagSynonyms = "SYNONYMS"
Public Const TagSynonyms As String = "SYNONYMS"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace