Grasshopper SDK
GH_Path.Valid Property
 Gets whether this path is valid. Invalid paths either have no elements or negative elements.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Valid { get; }
Public ReadOnly Property Valid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Path.Valid"]
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace