Grasshopper SDK
CentralSettings.FormattingChanged Event
 Raised whenever a formatting setting is changed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.FormattingChangedEventHandler FormattingChanged
Public Shared Event FormattingChanged As CentralSettings.FormattingChangedEventHandler
Value
Type: Grasshopper.CentralSettings.FormattingChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace