Grasshopper SDK
GH_PointCharge.Decay Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Decay { get; set; }
Public Property Decay As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCharge.Decay"]
See Also
Reference
GH_PointCharge Class
Grasshopper.Kernel.Types Namespace