Grasshopper SDK
GH_Convert.ToGeometryBase Method
 Attempt to convert an object into a Rhino.Geometry.GeometryBase instance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GeometryBase ToGeometryBase(
	Object data
)
Public Shared Function ToGeometryBase (
	data As Object
) As GeometryBase
Parameters
data
Type: System.Object
Data to convert.
Return Value
Type: GeometryBase
A GeometryBase instance on success or null on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace