Grasshopper SDK
IGH_DocumentObject.DisplayExpired Event
 Raised whenever the display (on the Canvas) of a certain object becomes invalid.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
event IGH_DocumentObject.DisplayExpiredEventHandler DisplayExpired
Event DisplayExpired As IGH_DocumentObject.DisplayExpiredEventHandler
Value
Type: Grasshopper.Kernel.IGH_DocumentObject.DisplayExpiredEventHandler
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace