Grasshopper SDK
IGH_ObjectProxy.SDKCompliant Property
 Gets whether this object is compliant with the current Rhino version.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool SDKCompliant { get; }
ReadOnly Property SDKCompliant As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ObjectProxy.SDKCompliant"]
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace