Grasshopper SDK
GH_RuntimeMessageLevel Enumeration
 Indicates the severity of a runtime message.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_RuntimeMessageLevel
Public Enumeration GH_RuntimeMessageLevel
Members
Member name | Value | Description
Blank | 0 |  No warnings or errors were recorded during solver-time processes
Remark | 255 |  One of more messages (but no warnings and no errors) were recorded during solver-time processes.
Warning | 10 |  One or more warnings (but no errors) were recorded during solver-time processes
Error | 20 |  One or more errors (and possibly any number of warnings) were recorded during solver-time processes.
See Also
Reference
Grasshopper.Kernel Namespace