Grasshopper SDK
IGH_BakeAwareData Interface
 Implement this interface in your IGH_Goo data type if you want to be included in baking operations.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_BakeAwareData
Public Interface IGH_BakeAwareData
The IGH_BakeAwareData type exposes the following members.
Methods
Name | Description
BakeGeometry
 Bake an object in the given Rhino document.
Top
See Also
Reference
Grasshopper.Kernel Namespace