Grasshopper SDK
GH_TreeRules.NotOperator Field
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const char NotOperator = '!'
Public Const NotOperator As Char = "!"C
Field Value
Type: Char
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace