Grasshopper SDK
GH_Grip Constructor (GH_Grip)
Initializes a new instance of the GH_Grip class
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Grip(
	GH_Grip other
)
Public Sub New (
	other As GH_Grip
)
Parameters
other
Type: Grasshopper.GUI.Gradient.GH_Grip
See Also
Reference
GH_Grip Class
GH_Grip Overload
Grasshopper.GUI.Gradient Namespace