Grasshopper SDK
CentralSettings.RibbonAllIconsChangedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void RibbonAllIconsChangedEventHandler()
Public Delegate Sub RibbonAllIconsChangedEventHandler
See Also
Reference
Grasshopper Namespace