Grasshopper SDK
GH_CodeStringSegment.String Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string String { get; set; }
Public Property String As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_CodeStringSegment.String"]
See Also
Reference
GH_CodeStringSegment Class
Grasshopper.Kernel.Expressions Namespace