Grasshopper SDK
GH_Structure<T>.Flatten Method
 Flattens the entire structure into a single path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Flatten(
	GH_Path flat_path = null
)
Public Sub Flatten (
	Optional flat_path As GH_Path = Nothing
)
Parameters
flat_path (Optional)
Type: Grasshopper.Kernel.Data.GH_Path
The path of the flattened data. If null, the path will be {0}
Implements
IGH_Structure.Flatten(GH_Path)
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace