Grasshopper SDK
GH_Canvas.CanvasPrePaintOverlay Event
 Raised before object overlay drawing starts.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPrePaintOverlayEventHandler CanvasPrePaintOverlay
Public Event CanvasPrePaintOverlay As GH_Canvas.CanvasPrePaintOverlayEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPrePaintOverlayEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace