Grasshopper SDK
GH_NumberSliderSnappingEditor Constructor
Initializes a new instance of the GH_NumberSliderSnappingEditor class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_NumberSliderSnappingEditor()
Public Sub New
See Also
Reference
GH_NumberSliderSnappingEditor Class
Grasshopper.GUI Namespace