Grasshopper SDK
GH_DocDiagramPainter.UnmapPoint Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point UnmapPoint(
	Point pt
)
Public Function UnmapPoint (
	pt As Point
) As Point
Parameters
pt
Type: System.Drawing.Point
Return Value
Type: Point
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace