Grasshopper SDK
GH_ExpressionString Class
Inheritance Hierarchy
System.Object
 System.Collections.Generic.List<Char>
 Grasshopper.Kernel.Expressions.GH_ExpressionString
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ExpressionString : List<char>
Public Class GH_ExpressionString
	Inherits List(Of Char)
The GH_ExpressionString type exposes the following members.
Constructors
Name | Description
GH_ExpressionString
Initializes a new instance of the GH_ExpressionString class
Top
Properties
Name | Description
Char
Next
Prev
Top
Methods
Name | Description
BuildLUT
IsWhiteSpace
ToString |  (Overrides Object.ToString().)
Top
Fields
Name | Description
bracket_closed
bracket_open
colon
comma
dot
dquote
invalid
linefeed
m_t
paren_close
paren_open
quote
return
scolon
space
tab
underbar
Top
See Also
Reference
Grasshopper.Kernel.Expressions Namespace