Grasshopper SDK
GH_Skin.palette_brown_selected Field
Brown palette, selected.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_PaletteStyle palette_brown_selected
Public Shared palette_brown_selected As GH_PaletteStyle
Field Value
Type: GH_PaletteStyle
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace