Grasshopper SDK
IGH_ObjectProxy.LibraryGuid Property
 Gets the ID of the library (GHA file) that defines this object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid LibraryGuid { get; }
ReadOnly Property LibraryGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ObjectProxy.LibraryGuid"]
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace