Grasshopper SDK
GH_RuntimeFile.ContainsKey Method
 Test whether a certain key is present in the File.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ContainsKey(
	string key
)
Public Function ContainsKey (
	key As String
) As Boolean
Parameters
key
Type: System.String
Key to search for.
Return Value
Type: Boolean
True if the key is present in the file, false if not.
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace