Grasshopper SDK
CentralSettings.CanvasFancyWires Property
 Gets or sets whether or not fancy wires will be drawn. This is a global setting.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool CanvasFancyWires { get; set; }
Public Shared Property CanvasFancyWires As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CanvasFancyWires"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace