Grasshopper SDK
Generic.Transform Property
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Transform Transform { get; set; }
Public Property Transform As Transform
	Get
	Set
Property Value
Type: Transform
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Transforms.Generic.Transform"]
See Also
Reference
Generic Class
Grasshopper.Kernel.Types.Transforms Namespace