Grasshopper SDK
GH_UndoServer.PushUndoRecord Method (GH_UndoRecord)
 Add a new undo record to the undo stack, this function clears the Redo stack.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void PushUndoRecord(
	GH_UndoRecord record
)
Public Sub PushUndoRecord (
	record As GH_UndoRecord
)
Parameters
record
Type: Grasshopper.Kernel.Undo.GH_UndoRecord
Record to add.
See Also
Reference
GH_UndoServer Class
PushUndoRecord Overload
Grasshopper.Kernel.Undo Namespace