Grasshopper SDK
IGH_DocumentObject.Exposure Property
 Gets the exposure of this object in the Graphical User Interface.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_Exposure Exposure { get; }
ReadOnly Property Exposure As GH_Exposure
	Get
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_DocumentObject.Exposure"]
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace