Grasshopper SDK
GH_MemoryBitmap.Filter_Contrast Method
 Adjust the contrast of a specific channel.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_Contrast(
	GH_BitmapChannel channel,
	double factor
)
Public Sub Filter_Contrast (
	channel As GH_BitmapChannel,
	factor As Double
)
Parameters
channel
Type: Grasshopper.Kernel.GH_BitmapChannel
Channel(s) to modify.
factor
Type: System.Double
Contrast boost factor. A factor of 1.0 will not affect contrast. Lower values will lessen contrast and higher values will increase contrast.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace