Grasshopper SDK
GH_GraphicsUtil.BlendColour Method (Color, Color, Double)
 Overlays two colours.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color BlendColour(
	Color bottom,
	Color top,
	double factor
)
Public Shared Function BlendColour (
	bottom As Color,
	top As Color,
	factor As Double
) As Color
Parameters
bottom
Type: System.Drawing.Color
Base colour.
top
Type: System.Drawing.Color
Overlay colour.
factor
Type: System.Double
Blend factor. 0.0 means the return colour will be identical to the bottom colour, 1.0 means the return colour will be identical to the top colour.
Return Value
Type: Color
The blended colour.
See Also
Reference
GH_GraphicsUtil Class
BlendColour Overload
Grasshopper.GUI Namespace