Grasshopper SDK
GH_Component.SolveInstance Method
 This function will be called (successively) from within the ComputeData method of this component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected abstract void SolveInstance(
	IGH_DataAccess DA
)
Protected MustOverride Sub SolveInstance (
	DA As IGH_DataAccess
)
Parameters
DA
Type: Grasshopper.Kernel.IGH_DataAccess
Data Access object. Use this object to retrieve data from input parameters and assign data to output parameters.
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace