Grasshopper SDK
IGH_Rule.Kind Property
 Gets the type of rule.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_RuleKind Kind { get; }
ReadOnly Property Kind As GH_RuleKind
	Get
Property Value
Type: GH_RuleKind
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.IGH_Rule.Kind"]
See Also
Reference
IGH_Rule Interface
Grasshopper.Kernel.Data Namespace