Grasshopper SDK
DataTree<T>.PathExists Method (Int32[])
 Test if the specified path is already defined inside the tree.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool PathExists(
	params int[] path
)
Public Function PathExists (
	ParamArray path As Integer()
) As Boolean
Parameters
path
Type: System.Int32[]
The branch path to search for.
Return Value
Type: Boolean
True if the path already exists, false if it doesn't.
See Also
Reference
DataTree<T> Class
PathExists Overload
Grasshopper Namespace