Grasshopper SDK
DataTree<T>.AddRange Method (IEnumerable<T>, GH_Path)
 Add (append) a list of data items to the specified branch in the tree. If the branch doesn't exist yet, it will be created.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddRange(
	IEnumerable<T> data,
	GH_Path path
)
Public Sub AddRange (
	data As IEnumerable(Of T),
	path As GH_Path
)
Parameters
data
Type: System.Collections.Generic.IEnumerable<T>
Data to append.
path
Type: Grasshopper.Kernel.Data.GH_Path
Data path.
See Also
Reference
DataTree<T> Class
AddRange Overload
Grasshopper Namespace