Grasshopper SDK
CentralSettings.PreviewGumballsChanged Event
 Raised whenever the PreviewGumballs setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.PreviewGumballsChangedEventHandler PreviewGumballsChanged
Public Shared Event PreviewGumballsChanged As CentralSettings.PreviewGumballsChangedEventHandler
Value
Type: Grasshopper.CentralSettings.PreviewGumballsChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace