Grasshopper SDK
GH_DigitScrollerBase Constructor
Initializes a new instance of the GH_DigitScrollerBase class
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DigitScrollerBase()
Public Sub New
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace