Grasshopper SDK
GH_Capsule.AddInputGrip Method (Single, Single)
 Add an input grip to this UI Box.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddInputGrip(
	float X,
	float Y
)
Public Sub AddInputGrip (
	X As Single,
	Y As Single
)
Parameters
X
Type: System.Single
X coordinate of grip.
Y
Type: System.Single
Y coordinate of grip.
See Also
Reference
GH_Capsule Class
AddInputGrip Overload
Grasshopper.GUI.Canvas Namespace