Grasshopper SDK
GH_MouseTracker Class
 Record mouse-movements over time.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_MouseTracker
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_MouseTracker
Public Class GH_MouseTracker
The GH_MouseTracker type exposes the following members.
Constructors
Name | Description
GH_MouseTracker()
 Create a new mouse tracker.
GH_MouseTracker(Point)
 Create a new mouse tracker.
GH_MouseTracker(Point, Object)
 Create a new mouse tracker.
Top
Properties
Name | Description
Duration
 Gets the timespan that has passed between the oldest and youngest recorded frames. This is not the same as the time that has passed since recording began.
Frame
 Gets the position (in control coordinates) of the frame at the given index.
FrameCount
 Gets the number of recorded frames.
MaximumDuration
 Gets or sets the maximum allowed duration of the entire record. When new frames are recorded, old frames that are more distant than MaximumDuration will be dropped. The default duration is 10 seconds.
MaximumFrameCount
 Gets or sets the maximum number of frames to keep in history. If more frames are added, the oldest ones will be dropped. The default is 16,384 frames.
NewestFrame
 Gets the most recent frame in recorded history.
OldestFrame
 Gets the oldest frame in recorded history.
TemporalAccuracy
 Gets or sets the maximum temporal accuracy. Frames that are closer together than the accuracy will not be recorded. The default accuracy equals 5ms.
Top
Methods
Name | Description
Deviation()
 Gets the maximum deviation of the recorded mouse path. The maximum deviation is the furthest distance the mouse has been from the first point in the history record.
Deviation(DateTime, DateTime)
 Gets the maximum deviation of the recorded mouse path. The maximum deviation is the furthest distance the mouse has been from the first point in the history span. It does not measure the largest deviation between any two points in the time span, only the first and any subsequent point.
DropFrames(DateTime)
 Drop all frames older than a given limit.
DropFrames(Double)
 Find the youngest frame that deviates too much from the current locus and drop it and everything preceding it.
DropFrames(Double, Point)
 Find the youngest frame that deviates too much from the given locus and drop it and everything preceding it.
LastFrameWithinDeviation
 Starting from the youngest frame, finds the oldest frame that is still within a maximum deviation of the youngest frame.
Record(Point)
 Record a new mouse event frame. If this frame is closer than [Accuracy]ms to the previously recorded frame, it is not included.
Record(Point, Object)
 Record a new mouse event frame. If this frame is closer than [Accuracy]ms to the previously recorded frame, it is not included.
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
Grasshopper.GUI Namespace