Grasshopper SDK
GH_Variant.ToGoo Method
 Attempt to convert a Variant to a Grasshopper IGH_Goo type.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Goo ToGoo()
Public Function ToGoo As IGH_Goo
Return Value
Type: IGH_Goo
An instance of a class implementing IGH_Goo or null.
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace