Grasshopper SDK
GH_RuntimeFile.IsTag Method
 Tests whether a string is a predefined Grasshopper Help keyword.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsTag(
	string text
)
Public Shared Function IsTag (
	text As String
) As Boolean
Parameters
text
Type: System.String
String to test. Should contain no whitespace, but does not need to properly cased.
Return Value
Type: Boolean
True if text is a predefined keyword, false if not.
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace