Grasshopper SDK
GH_Parser Class
 Provides parsing methods for the Grasshopper Markdown flavour.
Inheritance Hierarchy
System.Object
 Grasshopper.Documentation.GH_Parser
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Parser
Public Class GH_Parser
The GH_Parser type exposes the following members.
Properties
Name | Description
Whitespace
 Gets an array of characters that are considered to be whitespace. At the moment, this array contains the space char and the tab char, it does not contain feeds or breaks.
Top
Methods
Name | Description
IsChapterHeaderLine
 Test whether a line represents a chapter header underline. Chapter header underlines contain at least 4 consecutive equals symbols preceded or followed by any amount of white space.
IsCommentLine
 Test whether a line is a comment. Commented lines begin with double slashes (//) and are ignored during parsing.
IsLinkLine(String)
 Test whether a line represents a referenced link target. Note; this is a quick check. The link might still be invalid, use the IsLinkLine overload to include validity checks.
IsLinkLine(String, String, String, String)
 Test whether a line represents a referenced link target.
IsListLine
 Test whether a line contains a list item.
IsParagraphHeaderLine
 Test whether a line represents a paragraph header underline. Paragraph header underlines contain at least 4 consecutive dashes preceded or followed by any amount of white space.
IsQuoteLine
 Test whether a line is a block quote line. Block quotes start with a larger than symbol.
StringToFragment
 Parse a block of text and return it as an interpreted IGH_Fragment.
Top
See Also
Reference
Grasshopper.Documentation Namespace