Grasshopper SDK
GH_Document.DeselectAll Method
 Deselect all top-level attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DeselectAll()
Public Sub DeselectAll
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace