Grasshopper SDK
GH_Canvas.NavigationSettingsChangedEventHandler Delegate
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void NavigationSettingsChangedEventHandler()
Public Delegate Sub NavigationSettingsChangedEventHandler
See Also
Reference
Grasshopper.GUI.Canvas Namespace