Grasshopper SDK
IGH_DocumentObject.AttributesChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void AttributesChangedEventHandler(
	IGH_DocumentObject sender,
	GH_AttributesChangedEventArgs e
)
Public Delegate Sub AttributesChangedEventHandler (
	sender As IGH_DocumentObject,
	e As GH_AttributesChangedEventArgs
)
Parameters
sender
Type: Grasshopper.Kernel.IGH_DocumentObject
e
Type: Grasshopper.Kernel.GH_AttributesChangedEventArgs
See Also
Reference
Grasshopper.Kernel Namespace