Grasshopper SDK
GH_Mesh Constructor (GH_Mesh)
Initializes a new instance of the GH_Mesh class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Mesh(
	GH_Mesh other
)
Public Sub New (
	other As GH_Mesh
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Mesh
See Also
Reference
GH_Mesh Class
GH_Mesh Overload
Grasshopper.Kernel.Types Namespace