Grasshopper SDK
Folders.IconFolder Property
 Gets the directory that contains the icon files that ship with Grasshopper.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string IconFolder { get; }
Public Shared ReadOnly Property IconFolder As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.IconFolder"]
See Also
Reference
Folders Class
Grasshopper Namespace