Grasshopper SDK
GH_FieldElement.ClippingBox Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual BoundingBox ClippingBox { get; }
Public Overridable ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_FieldElement.ClippingBox"]
Implements
IGH_PreviewData.ClippingBox
See Also
Reference
GH_FieldElement Class
Grasshopper.Kernel.Types Namespace