Grasshopper SDK
GH_AssemblyInfo.Name Property
 Gets the human readable name of this assembly. Return null if you do not wish to associate a name with this assembly.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string Name { get; }
Public Overridable ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.Name"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace