Grasshopper SDK
GH_Canvas.ZoomFadeLow Property
 Gets the ZUI fade alpha value for the low zoom level threshold. This static field gets set on every Canvas paint start. The low threshold is typically used for fading of icons and object names.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int ZoomFadeLow { get; }
Public Shared ReadOnly Property ZoomFadeLow As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.ZoomFadeLow"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace