Grasshopper SDK
GH_Rectangle.GH_RectangleProxy.ZAxis Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Vector3d_Wrapper ZAxis { get; }
Public ReadOnly Property ZAxis As GH_Vector3d_Wrapper
	Get
Property Value
Type: GH_Vector3d_Wrapper
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Rectangle.GH_RectangleProxy.ZAxis"]
See Also
Reference
GH_Rectangle.GH_RectangleProxy Class
Grasshopper.Kernel.Types Namespace