Grasshopper SDK
IGH_Goo.CastTo<T> Method
 Attempt a cast to type T
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool CastTo<T>(
	out T target
)
Function CastTo(Of T) (
	<OutAttribute> ByRef target As T
) As Boolean
Parameters
target
Type: T
Pointer to target of cast.
Type Parameters
T
Type to cast to
Return Value
Type: Boolean
True on success, false on failure.
Remarks
If false, the target instance contents are not guaranteed to be valid.
See Also
Reference
IGH_Goo Interface
Grasshopper.Kernel.Types Namespace