Grasshopper SDK
GH_GlossaryItem.Word Property
 Gets the word this glossary entry is about.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Word { get; }
Public ReadOnly Property Word As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_GlossaryItem.Word"]
See Also
Reference
GH_GlossaryItem Class
Grasshopper.Documentation Namespace