Grasshopper SDK
GH_DigitNumber.SecondaryDigits Property
 Gets the internal list of secondary digits. Do not modify this list.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<int> SecondaryDigits { get; }
Public ReadOnly Property SecondaryDigits As IList(Of Integer)
	Get
Property Value
Type: IList<Int32>
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitNumber.SecondaryDigits"]
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace