Grasshopper SDK
Node3d<T>.ItemsLocal Property
 Gets a list of all the items stored directly in this node. This list is constructed every time you access this property, so keep it down to a minimum.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<T> ItemsLocal { get; }
Public ReadOnly Property ItemsLocal As List(Of T)
	Get
Property Value
Type: List<T>
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ItemsLocal"]
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace