Grasshopper SDK
GH_Document.AlignObjects Method (GH_Align, GH_Distribute)
 Perform alignment and distribution logic on all selected objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AlignObjects(
	GH_Align align,
	GH_Distribute distribute
)
Public Sub AlignObjects (
	align As GH_Align,
	distribute As GH_Distribute
)
Parameters
align
Type: GH_Align
distribute
Type: GH_Distribute
See Also
Reference
GH_Document Class
AlignObjects Overload
Grasshopper.Kernel Namespace