Grasshopper SDK
IGH_PreviewArgs.MeshingParameters Property
 Gets the meshing parameters to be used during meshing breps.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
MeshingParameters MeshingParameters { get; }
ReadOnly Property MeshingParameters As MeshingParameters
	Get
Property Value
Type: MeshingParameters
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_PreviewArgs.MeshingParameters"]
See Also
Reference
IGH_PreviewArgs Interface
Grasshopper.Kernel Namespace