Grasshopper SDK
GH_DigitScrollerBase.AllowTextInput Property
 Gets or sets whether text input is allowed by double click.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AllowTextInput { get; set; }
Public Property AllowTextInput As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.AllowTextInput"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace