Grasshopper SDK
GH_GeometricFont.Char2 Property
 Gets the default geometry for '2'. Caller is responsible for disposing the path.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath Char2 { get; }
Public Shared ReadOnly Property Char2 As GraphicsPath
	Get
Property Value
Type: GraphicsPath
[Missing <value> documentation for "P:Grasshopper.GUI.GH_GeometricFont.Char2"]
See Also
Reference
GH_GeometricFont Class
Grasshopper.GUI Namespace