Grasshopper SDK
TreeDelegates Class
 Provides a bunch of standard coordinate extractor methods.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Geometry.SpatialTrees.TreeDelegates
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class TreeDelegates
Public NotInheritable Class TreeDelegates
The TreeDelegates type exposes the following members.
Methods
Name | Description
Node2Coordinates
Node3Coordinates
Point2dCoordinates
Point2fCoordinates
Point3dCoordinates
Point3fCoordinates
PointCoordinates
Top
See Also
Reference
Grasshopper.Kernel.Geometry.SpatialTrees Namespace