Grasshopper SDK
IGH_CanvasValidator.CanCreateObject Method
 Validates whether a specific component may be inserted at a specific point.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool CanCreateObject(
	Guid id,
	PointF pt
)
Function CanCreateObject (
	id As Guid,
	pt As PointF
) As Boolean
Parameters
id
Type: System.Guid
pt
Type: System.Drawing.PointF
Return Value
Type: Boolean
See Also
Reference
IGH_CanvasValidator Interface
Grasshopper.GUI.Canvas Namespace