Grasshopper SDK
GH_Convert.ToBoolean_Primary Method
 Performs a direct cast from boolean or GH_Boolean.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToBoolean_Primary(
	Object data,
	ref bool destination
)
Public Shared Function ToBoolean_Primary (
	data As Object,
	ByRef destination As Boolean
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.Boolean
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace