Grasshopper SDK
GH_TypeLib.t_rectanglef Field
System.Drawing.RectangleF
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Type t_rectanglef
Public Shared t_rectanglef As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace