Grasshopper SDK
GH_Document.ModifiedSubsidiaries Property
 Gets the number of modified subsidiary documents.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ModifiedSubsidiaries { get; }
Public ReadOnly Property ModifiedSubsidiaries As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.ModifiedSubsidiaries"]
Return Value
Type: Int32
The number of modified subsidiary documents.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace