Grasshopper SDK
GH_GraphicsUtil.BoxClosestPoint Method (Point, Rectangle)
 Find the closest point on or in a box given a test point.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Point BoxClosestPoint(
	Point pt,
	Rectangle box
)
Public Shared Function BoxClosestPoint (
	pt As Point,
	box As Rectangle
) As Point
Parameters
pt
Type: System.Drawing.Point
Sample point.
box
Type: System.Drawing.Rectangle
Box to evaluate.
Return Value
Type: Point
See Also
Reference
GH_GraphicsUtil Class
BoxClosestPoint Overload
Grasshopper.GUI Namespace