Grasshopper SDK
GH_DocumentObject.Menu_MoveItem Method (ToolStripItem, Boolean, String[])
 Utility function for moving menu items.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool Menu_MoveItem(
	ToolStripItem item,
	bool insertBelow,
	params string[] targets
)
Public Shared Function Menu_MoveItem (
	item As ToolStripItem,
	insertBelow As Boolean,
	ParamArray targets As String()
) As Boolean
Parameters
item
Type: System.Windows.Forms.ToolStripItem
Item to move, it must already be part of the dropdown menu.
insertBelow
Type: System.Boolean
If true, the item will be inserted below the match, if false, above the match.
targets
Type: System.String[]
Names of move to targets, the item will be inserted next to the first name, if that fails the second, etc. etc.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentObject Class
Menu_MoveItem Overload
Grasshopper.Kernel Namespace