Grasshopper SDK
IGH_Param.Access Property
 Gets or sets the Access level for this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_ParamAccess Access { get; set; }
Property Access As GH_ParamAccess
	Get
	Set
Property Value
Type: GH_ParamAccess
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.Access"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace