Grasshopper SDK
GH_ConnectivityNode Class
 Represents a single node in a Grasshopper connectivity diagram. A single node represents a single IGH_Param instance.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_ConnectivityNode
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ConnectivityNode
Public Class GH_ConnectivityNode
The GH_ConnectivityNode type exposes the following members.
Constructors
Name | Description
GH_ConnectivityNode
Initializes a new instance of the GH_ConnectivityNode class
Top
Properties
Name | Description
NodeID
 Gets the InstanceID of the Parameter that this node represents.
NodeIn
 Gets the list of IDs that are connected to the input of this node.
NodeOut
 Gets the list of IDs that are connected to the input of this node.
Top
See Also
Reference
Grasshopper.Kernel Namespace