Grasshopper SDK
GH_ArchivedUndoAction.Deserialize Method
 Deserializes the obj from the local archive.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void Deserialize(
	GH_ISerializable obj
)
Protected Sub Deserialize (
	obj As GH_ISerializable
)
Parameters
obj
Type: GH_IO.GH_ISerializable
Exceptions
Exception | Condition
ArgumentNullException | Thrown when obj is a null reference.
NullReferenceException | Thrown when the internal archive data is null.
IOException | Thrown when the deserialization fails.
See Also
Reference
GH_ArchivedUndoAction Class
Grasshopper.Kernel.Undo Namespace