Grasshopper SDK
GH_Capsule.Box_Content Property
 Gets the content box for this Capsule. Text and icons are drawn inside this box.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle Box_Content { get; }
Public ReadOnly Property Box_Content As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.Box_Content"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace