Grasshopper SDK
IGH_ResponsiveObject.RespondToMouseUp Method
 This function will be called whenever a mouse button is released over the canvas. If you are active, you will be the only object who gets called. If you are inactive, you will not be called at all for MouseUp events.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_ObjectResponse RespondToMouseUp(
	GH_Canvas sender,
	GH_CanvasMouseEvent e
)
Function RespondToMouseUp (
	sender As GH_Canvas,
	e As GH_CanvasMouseEvent
) As GH_ObjectResponse
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
Base canvas.
e
Type: Grasshopper.GUI.GH_CanvasMouseEvent
Mouse event arguments.
Return Value
Type: GH_ObjectResponse
All Response flags are valid.
See Also
Reference
IGH_ResponsiveObject Interface
Grasshopper.GUI.Canvas Namespace