Grasshopper SDK
GH_PersistentParam<T>.RecordPersistentDataEvent Method
 Add an undo record that stores changes to persistent data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void RecordPersistentDataEvent(
	string name
)
Protected Sub RecordPersistentDataEvent (
	name As String
)
Parameters
name
Type: System.String
Name of undo record.
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace