Grasshopper SDK
GH_GeometricGoo<T>.LoadGeometry Method (RhinoDoc)
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry. The default is to always return True.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool LoadGeometry(
	RhinoDoc doc
)
Public Overridable Function LoadGeometry (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: RhinoDoc
Document to use for loading.
Return Value
Type: Boolean
Implements
IGH_GeometricGoo.LoadGeometry(RhinoDoc)
See Also
Reference
GH_GeometricGoo<T> Class
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace