Grasshopper SDK
GH_Convert.ToGUID_Secondary Method
 Performs indirect casts from other data types into Guids.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToGUID_Secondary(
	Object data,
	ref Guid destination
)
Public Shared Function ToGUID_Secondary (
	data As Object,
	ByRef destination As Guid
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.Guid
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace