Grasshopper SDK
GH_IconOverrideAction Class
 Records a single icon override event.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ObjectUndoAction
 Grasshopper.Kernel.Undo.Actions.GH_IconOverrideAction
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_IconOverrideAction : GH_ObjectUndoAction
Public Class GH_IconOverrideAction
	Inherits GH_ObjectUndoAction
The GH_IconOverrideAction type exposes the following members.
Constructors
Name | Description
GH_IconOverrideAction
Initializes a new instance of the GH_IconOverrideAction class
Top
Properties
Name | Description
Top
Methods
Name | Description
Object_Redo |  (Overrides GH_ObjectUndoAction.Object_Redo(GH_Document, IGH_DocumentObject).)
Object_Undo |  (Overrides GH_ObjectUndoAction.Object_Undo(GH_Document, IGH_DocumentObject).)
Top
See Also
Reference
Grasshopper.Kernel.Undo.Actions Namespace