Grasshopper SDK
GH_Brep.GH_BrepProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Brep>
 Grasshopper.Kernel.Types.GH_Brep.GH_BrepProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_BrepProxy : GH_GooProxy<GH_Brep>
Public Class GH_BrepProxy
	Inherits GH_GooProxy(Of GH_Brep)
The GH_Brep.GH_BrepProxy type exposes the following members.
Constructors
Name | Description
GH_Brep.GH_BrepProxy
Initializes a new instance of the GH_Brep.GH_BrepProxy class
Top
Properties
Name | Description
Area
EdgeCount
FaceCount
LoopCount
Manifold
ObjectID
Solid
VertexCount
Volume
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
FromString |  (Overrides GH_GooProxy<T>.FromString(String).)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace