Grasshopper SDK
GH_Component.PostConstructor Method
 The PostConstructor is called from within each constructor. DO NOT OVERRIDE THIS unless you know what you are doing.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void PostConstructor()
Protected Overridable Sub PostConstructor
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace