Grasshopper SDK
GH_Document.ScheduleDelay Property
 Gets the delay for the next scheduled solution. If there is no solution scheduled the delay will be negative.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ScheduleDelay { get; }
Public ReadOnly Property ScheduleDelay As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.ScheduleDelay"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace