Grasshopper SDK
Instances.IsMarkovChain Property
 Gets a value indicating whether or not the MarkovChain has already been initialized.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsMarkovChain { get; }
Public Shared ReadOnly Property IsMarkovChain As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Instances.IsMarkovChain"]
See Also
Reference
Instances Class
Grasshopper Namespace