Grasshopper SDK
IGH_Param.Simplify Property
 Gets or sets the simplify modifier for this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool Simplify { get; set; }
Property Simplify As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.Simplify"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace