Grasshopper SDK
GH_LoadProtectDialog Constructor
Initializes a new instance of the GH_LoadProtectDialog class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LoadProtectDialog()
Public Sub New
See Also
Reference
GH_LoadProtectDialog Class
Grasshopper.GUI Namespace