Grasshopper SDK
GH_CanvasObjectMouseDownEventArgs Constructor
Initializes a new instance of the GH_CanvasObjectMouseDownEventArgs class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CanvasObjectMouseDownEventArgs(
	GH_Canvas sender,
	GH_RelevantObjectData object
)
Public Sub New (
	sender As GH_Canvas,
	object As GH_RelevantObjectData
)
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
object
Type: Grasshopper.Kernel.GH_RelevantObjectData
See Also
Reference
GH_CanvasObjectMouseDownEventArgs Class
Grasshopper.GUI Namespace