Grasshopper SDK
GH_IndexRange.Index0 Property
 Gets the first index in the range.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Index0 { get; }
Public ReadOnly Property Index0 As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_IndexRange.Index0"]
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace