Grasshopper SDK
GH_Canvas.ThumbnailWidth Field
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static readonly int ThumbnailWidth
Public Shared ReadOnly ThumbnailWidth As Integer
Field Value
Type: Int32
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace