Grasshopper SDK
GH_TagArtist_WirePainter.WirePainter_ID Property
Namespace: Grasshopper.GUI.Canvas.TagArtists
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Guid WirePainter_ID { get; }
Public Shared ReadOnly Property WirePainter_ID As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.TagArtists.GH_TagArtist_WirePainter.WirePainter_ID"]
See Also
Reference
GH_TagArtist_WirePainter Class
Grasshopper.GUI.Canvas.TagArtists Namespace