Grasshopper SDK
GH_UndoRecord Constructor (String, IGH_UndoAction)
Initializes a new instance of the GH_UndoRecord class
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoRecord(
	string name,
	IGH_UndoAction action
)
Public Sub New (
	name As String,
	action As IGH_UndoAction
)
Parameters
name
Type: System.String
action
Type: Grasshopper.Kernel.Undo.IGH_UndoAction
See Also
Reference
GH_UndoRecord Class
GH_UndoRecord Overload
Grasshopper.Kernel.Undo Namespace