Grasshopper SDK
GH_ColourCube.S1 Property
 Gets the second point in the shadow point list. This is the corner of the drop-shadow on the bottom face.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point S1 { get; }
Public ReadOnly Property S1 As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourCube.S1"]
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace