Grasshopper SDK
GH_DragInfo.Region Property
 Gets or sets the drag limits. If the region is Rectangle.Empty then the region is ignored. For valid results the Region should be larger than the dimensions of the drag box.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle Region { get; set; }
Public Property Region As Rectangle
	Get
	Set
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DragInfo.Region"]
See Also
Reference
GH_DragInfo Class
Grasshopper.GUI Namespace