Grasshopper SDK
GH_Convert.GetTimeKind Method (DateTime)
 Gets the kind of time implied by a System.DateTime value.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_TimeKind GetTimeKind(
	DateTime time
)
Public Shared Function GetTimeKind (
	time As DateTime
) As GH_TimeKind
Parameters
time
Type: System.DateTime
Time to evaluate.
Return Value
Type: GH_TimeKind
GH_TimeKind.PureTime, GH_TimeKind.PureDate or GH_TimeKind.DateAndTime.
See Also
Reference
GH_Convert Class
GetTimeKind Overload
Grasshopper.Kernel Namespace