Grasshopper SDK
GH_RelevantObjectData.CreateGroupData Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateGroupData(
	GH_Group group
)
Public Sub CreateGroupData (
	group As GH_Group
)
Parameters
group
Type: GH_Group
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace