Grasshopper SDK
GH_ObjectSettings.ZuiEdgeColour Property
 Gets or sets the edge colour for ZUI elements.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color ZuiEdgeColour { get; set; }
Public Property ZuiEdgeColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_ObjectSettings.ZuiEdgeColour"]
See Also
Reference
GH_ObjectSettings Class
Grasshopper.GUI.Theme Namespace