Grasshopper SDK
GH_ScrollBarVerticalBase.Minimum Property
 Gets or sets the minimum height of the scrollbar.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Minimum { get; set; }
Public Property Minimum As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.Minimum"]
See Also
Reference
GH_ScrollBarVerticalBase Class
Grasshopper.GUI.Base Namespace