Grasshopper SDK
GH_ExpressionSyntaxWriter.RewriteForEvaluator Method (GH_CodeString)
 Rewrite the expression so that all temporary keywords and symbols are replaced by evaluator-specific chars. The expression will become less readable, do not let the user see the result of this function. You need to rewrite the expression with this function if you intend to feed it into the Evaluator.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RewriteForEvaluator(
	GH_CodeString sCode
)
Public Shared Sub RewriteForEvaluator (
	sCode As GH_CodeString
)
Parameters
sCode
Type: Grasshopper.Kernel.Expressions.GH_CodeString
See Also
Reference
GH_ExpressionSyntaxWriter Class
RewriteForEvaluator Overload
Grasshopper.Kernel.Expressions Namespace