Grasshopper SDK
GH_Viewport.ControlMidPoint Property
 Gets the point in the exact center of the viewport in control coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF ControlMidPoint { get; }
Public ReadOnly Property ControlMidPoint As PointF
	Get
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.ControlMidPoint"]
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace