Grasshopper SDK
GH_GraphicsUtil.RenderHighlightBox Method (Graphics, Rectangle, Int32, Boolean, Boolean)
 Render a typical blueish highlight rectangle
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderHighlightBox(
	Graphics g,
	Rectangle box,
	int cornerRadius,
	bool drawFill,
	bool drawEdge
)
Public Shared Sub RenderHighlightBox (
	g As Graphics,
	box As Rectangle,
	cornerRadius As Integer,
	drawFill As Boolean,
	drawEdge As Boolean
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to render with.
box
Type: System.Drawing.Rectangle
Dimensions of selection box.
cornerRadius
Type: System.Int32
Radius (in pixels) of box corners, use zero or less to render crisp rectangles.
drawFill
Type: System.Boolean
If true, the box fill have a blue background.
drawEdge
Type: System.Boolean
If true, the box will have a blue edge.
See Also
Reference
GH_GraphicsUtil Class
RenderHighlightBox Overload
Grasshopper.GUI Namespace