Grasshopper SDK
GH_Point.DuplicatePoint Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Point DuplicatePoint()
Public Function DuplicatePoint As GH_Point
Return Value
Type: GH_Point
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace