Grasshopper SDK
GH_GDI_Util.SimplifyBoxes Method
 Create a simplified collection of Rectangles that describe the same union space as the supplied rectangles.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Rectangle[] SimplifyBoxes(
	IEnumerable<Rectangle> boxes
)
Public Shared Function SimplifyBoxes (
	boxes As IEnumerable(Of Rectangle)
) As Rectangle()
Parameters
boxes
Type: System.Collections.Generic.IEnumerable<Rectangle>
Rectangles to simplify.
Return Value
Type: Rectangle[]
An ordered collection of non-intersecting rectangles or null on failure.
See Also
Reference
GH_GDI_Util Class
Grasshopper.GUI Namespace