Grasshopper SDK
GH_PersistentParam<T>.CollectVolatileData_Custom Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override sealed void CollectVolatileData_Custom()
Protected Overrides NotOverridable Sub CollectVolatileData_Custom
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace