Grasshopper SDK
Folders.VersionHistoryUrl Property
 Gets the url of the version history data.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string VersionHistoryUrl { get; }
Public Shared ReadOnly Property VersionHistoryUrl As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.VersionHistoryUrl"]
See Also
Reference
Folders Class
Grasshopper Namespace