Grasshopper SDK
GH_Curve.IsGeometryLoaded Property
 Gets the load state of this curve object. The curve is considered to be loaded when the local OnCurve instance is not null.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool IsGeometryLoaded { get; }
Public Overrides ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Curve.IsGeometryLoaded"]
See Also
Reference
GH_Curve Class
Grasshopper.Kernel.Types Namespace