Grasshopper SDK
Complex.IsReal Property
 Gets whether this complex number only has a real component.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsReal { get; }
Public ReadOnly Property IsReal As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Complex.IsReal"]
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace