Grasshopper SDK
GH_FontServer.NewFont Method (Font, FontStyle)
 Safe font constructor.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font NewFont(
	Font font,
	FontStyle style
)
Public Shared Function NewFont (
	font As Font,
	style As FontStyle
) As Font
Parameters
font
Type: System.Drawing.Font
Base font.
style
Type: System.Drawing.FontStyle
New style.
Return Value
Type: Font
See Also
Reference
GH_FontServer Class
NewFont Overload
Grasshopper.Kernel Namespace