Grasshopper SDK
GH_ComponentServer.FindObjects Method (Guid)
 Find all the objects that are part of a certain library.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_ObjectProxy> FindObjects(
	Guid libraryID
)
Public Function FindObjects (
	libraryID As Guid
) As List(Of IGH_ObjectProxy)
Parameters
libraryID
Type: System.Guid
ID of library to search for.
Return Value
Type: List<IGH_ObjectProxy>
A list of all the objects that are defined in the specified library.
See Also
Reference
GH_ComponentServer Class
FindObjects Overload
Grasshopper.Kernel Namespace