Grasshopper SDK
GH_Convert.ToPrevPowerOfTen Method
 Round a number downwards to the nearest power of ten.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static double ToPrevPowerOfTen(
	double num
)
Public Shared Function ToPrevPowerOfTen (
	num As Double
) As Double
Parameters
num
Type: System.Double
Number to round.
Return Value
Type: Double
The power of ten equal to or less than num.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace