Grasshopper SDK
GH_DocContextEventArgs.Context Property
 Gets the value of the document context flag at the time the event was raised, it may have been changed in between by other event handlers.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentContext Context { get; }
Public ReadOnly Property Context As GH_DocumentContext
	Get
Property Value
Type: GH_DocumentContext
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocContextEventArgs.Context"]
See Also
Reference
GH_DocContextEventArgs Class
Grasshopper.Kernel Namespace