Grasshopper SDK
GH_CustomEventServer.GuidTableCount Property
 Gets the number of stored ids in the Guid Table.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int GuidTableCount { get; }
Public ReadOnly Property GuidTableCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_CustomEventServer.GuidTableCount"]
See Also
Reference
GH_CustomEventServer Class
Grasshopper.Kernel Namespace