Grasshopper SDK
GH_Circle.CastTo<T> Method (T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CastTo<T>(
	out T target
)
Public Overrides Function CastTo(Of T) (
	<OutAttribute> ByRef target As T
) As Boolean
Parameters
target
Type: T
Type Parameters
T
Return Value
Type: Boolean
See Also
Reference
GH_Circle Class
CastTo Overload
Grasshopper.Kernel.Types Namespace