Grasshopper SDK
GH_StateTag.Icon Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract Bitmap Icon { get; }
Public MustOverride ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_StateTag.Icon"]
Implements
IGH_StateTag.Icon
See Also
Reference
GH_StateTag Class
Grasshopper.Kernel Namespace