Grasshopper SDK
GH_GDI_Util.FilletBoxOutline Method
 Fillet all the corners of the combined outline of a set of rectangles.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath FilletBoxOutline(
	IEnumerable<Rectangle> boxes,
	int radius
)
Public Shared Function FilletBoxOutline (
	boxes As IEnumerable(Of Rectangle),
	radius As Integer
) As GraphicsPath
Parameters
boxes
Type: System.Collections.Generic.IEnumerable<Rectangle>
Rectangles to outline.
radius
Type: System.Int32
Radius of corner fillets.
Return Value
Type: GraphicsPath
GraphicsPath describing the filleted outline or null on failure.
See Also
Reference
GH_GDI_Util Class
Grasshopper.GUI Namespace