Grasshopper SDK
GH_GradientChangedEventArgs.Gradient Property
 Gets the gradient that raised this event.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Gradient Gradient { get; }
Public ReadOnly Property Gradient As GH_Gradient
	Get
Property Value
Type: GH_Gradient
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_GradientChangedEventArgs.Gradient"]
See Also
Reference
GH_GradientChangedEventArgs Class
Grasshopper.GUI.Gradient Namespace