Grasshopper SDK
GH_Document.FilterObjects Method (List<IGH_DocumentObject>, GH_Filter, GH_Filter, GH_Filter)
 Filter a list of objects using several filters at once
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<IGH_DocumentObject> FilterObjects(
	List<IGH_DocumentObject> in,
	GH_Filter bSelectedObjects = GH_Filter.DontCare,
	GH_Filter bEnabledObjects = GH_Filter.DontCare,
	GH_Filter bActiveObjects = GH_Filter.DontCare
)
Public Shared Function FilterObjects (
	in As List(Of IGH_DocumentObject),
	Optional bSelectedObjects As GH_Filter = GH_Filter.DontCare,
	Optional bEnabledObjects As GH_Filter = GH_Filter.DontCare,
	Optional bActiveObjects As GH_Filter = GH_Filter.DontCare
) As List(Of IGH_DocumentObject)
Parameters
in
Type: System.Collections.Generic.List<IGH_DocumentObject>
The set to filter
bSelectedObjects (Optional)
Type: Grasshopper.Kernel.GH_Filter
Filter (non)selected objects only
bEnabledObjects (Optional)
Type: Grasshopper.Kernel.GH_Filter
Filter (non)enabled objects only
bActiveObjects (Optional)
Type: Grasshopper.Kernel.GH_Filter
Filter (non)active objects only
Return Value
Type: List<IGH_DocumentObject>
A list with all objects that pass all filters
See Also
Reference
GH_Document Class
FilterObjects Overload
Grasshopper.Kernel Namespace