Grasshopper SDK
GH_TextBoxInputBase.ShowTextInputBox Method (Control, String, Boolean, Boolean, Matrix)
 Display a floating text-box on top of the owner control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ShowTextInputBox(
	Control owner,
	string content,
	bool selectContent,
	bool limitToBoundary,
	Matrix transform
)
Public Sub ShowTextInputBox (
	owner As Control,
	content As String,
	selectContent As Boolean,
	limitToBoundary As Boolean,
	transform As Matrix
)
Parameters
owner
Type: System.Windows.Forms.Control
Control that owns this slider. The coordinates of the Bounds rectangle must be specified in owner coordinates.
content
Type: System.String
selectContent
Type: System.Boolean
limitToBoundary
Type: System.Boolean
If True, the pop up input box will be 'clipped' to the owner boundary. At least some part of the slider must be visible for this to work.
transform
Type: System.Drawing.Drawing2D.Matrix
Transformation matrix to apply to pop up UI.
See Also
Reference
GH_TextBoxInputBase Class
ShowTextInputBox Overload
Grasshopper.GUI.Base Namespace