Grasshopper SDK
GH_ComponentParamServer.OnlyTreeParameters Property
 Returns True if every input parameter is a tree parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool OnlyTreeParameters { get; }
Public ReadOnly Property OnlyTreeParameters As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentParamServer.OnlyTreeParameters"]
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace