Grasshopper SDK
GH_ComponentParamServer.Output Property
 Gets or sets the output list of parameters. Do not insert or remove parameters from this list, use the dedicated functions instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_Param> Output { get; }
Public ReadOnly Property Output As List(Of IGH_Param)
	Get
Property Value
Type: List<IGH_Param>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentParamServer.Output"]
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace