Grasshopper SDK
GH_StructurePath.Value Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override GH_Path Value { get; set; }
Public Overrides Property Value As GH_Path
	Get
	Set
Property Value
Type: GH_Path
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_StructurePath.Value"]
See Also
Reference
GH_StructurePath Class
Grasshopper.Kernel.Types Namespace