Grasshopper SDK
IGH_UndoAction Interface
 Base interface for all undo/redo actions
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_UndoAction : GH_ISerializable
Public Interface IGH_UndoAction
	Inherits GH_ISerializable
The IGH_UndoAction type exposes the following members.
Properties
Name | Description
ExpiresDisplay
 Gets the display expiration flag for this event. If True, the Rhino viewports will be redrawn once the entire undo record has been completed. If ExpiresSolution is set to true, ExpriresDisplay is implied.
ExpiresSolution
 Gets the solution expiration flag for this event. If True, the solution needs to be recalculated once the entire undo record has been completed.
State
 Gets the current state of the undo action.
Top
Methods
Name | Description
Redo
 Redo the action stored in this record.
Undo
 Undo the action stored in this record.
Top
See Also
Reference
Grasshopper.Kernel.Undo Namespace