Grasshopper SDK
GH_ColourCube.Pivot Property
 Gets the point that describes the center of the pivot on the slice.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point Pivot { get; }
Public ReadOnly Property Pivot As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourCube.Pivot"]
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace