Grasshopper SDK
GH_InstanceDescription Class
 Base implementation of IGH_InstanceDescription. Consider deriving from this class rather than implementing IGH_InstanceDescription from scratch.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_InstanceDescription : IGH_InstanceDescription
Public Class GH_InstanceDescription
	Implements IGH_InstanceDescription
The GH_InstanceDescription type exposes the following members.
Properties
Name | Description
Category
 Gets or sets the Category in which this object belongs. If HasCategory() returns false, this field has no meaning.
Description
 Gets or sets the description of the object. This field typically remains fixed during the lifetime of an object.
HasCategory
 Gets whether or not the Category field has been set.
HasSubCategory
 Gets whether or not the SubCategory field has been set.
InstanceDescription
 Gets a description of the current state of the object. This field is usually the same as the Description() field, but it might be variable when overridden.
InstanceGuid
 Gets the ID of this runtime instance.
Keywords
 Gets a list of additional keywords that describe the object. Typically this list is empty but you can override this property to aid in object searches.
Name
 Gets or sets the name of the object. This field typically remains fixed during the lifetime of an object.
NickName
 Gets or sets the nickname of the object. This field can be changed by the user.
SubCategory
 Gets or sets the SubCategory in which this object belongs. If HasSubCategory() returns false, this field has no meaning.
Top
Methods
Name | Description
CopyFrom
 Copy all fields (except the instance ID) from another instance description.
NewInstanceGuid()
 Generate a new random instance GUID
NewInstanceGuid(Guid)
 Set the instance ID to be a specific GUID. This is very dangerous, only use this function if you're 6"4' and your first name is David.
Read
 Default deserialization. Only retrieves Name, NickName, Description and InstanceGuid fields. If you want to retrieve additional fields use ReadFull() instead. However, ReadFull() will only work if the archive was written using WriteFull().
ReadFull
 GH_InstanceDescription does not by default serialize all fields. Use this function to read all fields from the archive. This method is compatible with the default Write()/Read() operations.
Write
 Default serialization. Only stores Name, NickName, Description and InstanceGuid fields. If you want to store additional fields use WriteFull() instead.
WriteFull
 GH_InstanceDescription does not by default serialize all fields. Use this function to write all fields to the archive. This method is compatible with the default Write()/Read() operations.
Top
See Also
Reference
Grasshopper.Kernel Namespace