Grasshopper SDK
GH_GeometricFont.DrawPath Method
 Draw an entire path string at a specific location.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void DrawPath(
	Graphics graphics,
	GH_Path path,
	Color colour,
	PointF position
)
Public Shared Sub DrawPath (
	graphics As Graphics,
	path As GH_Path,
	colour As Color,
	position As PointF
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to draw.
colour
Type: System.Drawing.Color
Colour of path.
position
Type: System.Drawing.PointF
Location of opening bracket.
See Also
Reference
GH_GeometricFont Class
Grasshopper.GUI Namespace