Grasshopper SDK
GH_AssemblyInfoStub.AssemblyVersion Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string AssemblyVersion { get; }
Public Overrides ReadOnly Property AssemblyVersion As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfoStub.AssemblyVersion"]
See Also
Reference
GH_AssemblyInfoStub Class
Grasshopper.Kernel Namespace