Grasshopper SDK
GH_Structure<T>.AppendRange Method (IEnumerable<T>)
 Append a list of data items to the last branch in the structure
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AppendRange(
	IEnumerable<T> data
)
Public Sub AppendRange (
	data As IEnumerable(Of T)
)
Parameters
data
Type: System.Collections.Generic.IEnumerable<T>
Data to append
See Also
Reference
GH_Structure<T> Class
AppendRange Overload
Grasshopper.Kernel.Data Namespace