Grasshopper SDK
GH_FieldElement.Limits Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Box Limits { get; set; }
Public Property Limits As Box
	Get
	Set
Property Value
Type: Box
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_FieldElement.Limits"]
Implements
IGH_FieldElement.Limits
See Also
Reference
GH_FieldElement Class
Grasshopper.Kernel.Types Namespace