Grasshopper SDK
GH_UndoServer.RedoCount Property
 Number of redo records currently in the stack.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int RedoCount { get; }
Public ReadOnly Property RedoCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoServer.RedoCount"]
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace