Grasshopper SDK
GH_UndoServer.Clear Method
 Clear both undo and redo lists.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace