Grasshopper SDK
GH_ComponentParamServer.WriteParamHashData Method
 Write parameter data to a binary writer.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void WriteParamHashData(
	BinaryWriter writer,
	IGH_Param param,
	GH_ParamHashFields fields
)
Public Shared Sub WriteParamHashData (
	writer As BinaryWriter,
	param As IGH_Param,
	fields As GH_ParamHashFields
)
Parameters
writer
Type: System.IO.BinaryWriter
Writer to write with.
param
Type: Grasshopper.Kernel.IGH_Param
Parameter to serialize.
fields
Type: Grasshopper.Kernel.GH_ParamHashFields
Fields of parameter to serialize.
Remarks
This is useful for hashing purposes, there is no way to deserialize data written with this method.
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace