Grasshopper SDK
GH_Boolean.DuplicateBoolean Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Boolean DuplicateBoolean()
Public Function DuplicateBoolean As GH_Boolean
Return Value
Type: GH_Boolean
See Also
Reference
GH_Boolean Class
Grasshopper.Kernel.Types Namespace