Grasshopper SDK
GH_Param<T>.PreferredCast Method
 Implement this function if you're certain that you'll be confronted with very common casts. For example, GH_Point has a preferred cast from Rhino.Geometry.Point3d and GH_Number has a preferred cast from System.Double.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual T PreferredCast(
	Object data
)
Protected Overridable Function PreferredCast (
	data As Object
) As T
Parameters
data
Type: System.Object
Data to convert. Data is never null.
Return Value
Type: T
An instance of T or null if you did not handle the cast.
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace