Grasshopper SDK
GH_LonLatCoordinate Constructor (Double, Double)
Initializes a new instance of the GH_LonLatCoordinate class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LonLatCoordinate(
	double longitude,
	double latitude
)
Public Sub New (
	longitude As Double,
	latitude As Double
)
Parameters
longitude
Type: System.Double
latitude
Type: System.Double
See Also
Reference
GH_LonLatCoordinate Class
GH_LonLatCoordinate Overload
Grasshopper.Kernel.Types Namespace