Grasshopper SDK
GH_ActiveObject.RegisterRemoteIDs Method
 Override this function if you want object changes in the Rhino document to trigger a new solution.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void RegisterRemoteIDs(
	GH_GuidTable id_list
)
Public Overridable Sub RegisterRemoteIDs (
	id_list As GH_GuidTable
)
Parameters
id_list
Type: GH_GuidTable
The object ID database Grasshopper is responsive to.
Implements
IGH_ActiveObject.RegisterRemoteIDs(GH_GuidTable)
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace