Grasshopper SDK
IGH_DocumentObject.RecordUndoEvent Method (String)
 Record a generic object change undo event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid RecordUndoEvent(
	string name
)
Function RecordUndoEvent (
	name As String
) As Guid
Parameters
name
Type: System.String
Name of undo record.
Return Value
Type: Guid
See Also
Reference
IGH_DocumentObject Interface
RecordUndoEvent Overload
Grasshopper.Kernel Namespace