Grasshopper SDK
GH_Param<T>.AddVolatileData Method (GH_Path, Int32, Object)
 Inserts an item of volatile data into the data structure.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AddVolatileData(
	GH_Path path,
	int index,
	Object data
)
Public Function AddVolatileData (
	path As GH_Path,
	index As Integer,
	data As Object
) As Boolean
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
The branch path of the data. If the path doesn't exist yet, it will be created.
index
Type: System.Int32
The item index of the data. If the path doesn't contain the index yet, it will be enlarged to encompass the index.
data
Type: System.Object
The data to store.
Return Value
Type: Boolean
True on success, False on failure. If the data cannot be converted, the topology will remain unmolested.
Implements
IGH_Param.AddVolatileData(GH_Path, Int32, Object)
See Also
Reference
GH_Param<T> Class
AddVolatileData Overload
Grasshopper.Kernel Namespace