Grasshopper SDK
GH_Component.GH_OutputParamManager.RegisterParam Method (IGH_Param)
 Generic parameter registration. This class provides methods to register standard parameters, but if you have a special type you're in charge of setting it all up yourself.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RegisterParam(
	IGH_Param param
)
Public Sub RegisterParam (
	param As IGH_Param
)
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
The parameter to add
See Also
Reference
GH_Component.GH_OutputParamManager Class
RegisterParam Overload
Grasshopper.Kernel Namespace