Grasshopper SDK
GH_Convert.ToGHArc Method
 Convert data into GH_Arcs.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToGHArc(
	Object data,
	GH_Conversion conversion_level,
	ref GH_Arc target
)
Public Shared Function ToGHArc (
	data As Object,
	conversion_level As GH_Conversion,
	ByRef target As GH_Arc
) As Boolean
Parameters
data
Type: System.Object
Data to convert
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
target
Type: Grasshopper.Kernel.Types.GH_Arc
Destination of conversion. If Null, a new instance will be created.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace