Grasshopper SDK
IGH_DataAccess.GetData<T> Method (Int32, T)
 Retrieve data from an input parameter during GH_Component.SolveInstance().
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool GetData<T>(
	int index,
	ref T destination
)
Function GetData(Of T) (
	index As Integer,
	ByRef destination As T
) As Boolean
Parameters
index
Type: System.Int32
destination
Type: T
Type Parameters
T
Type of the data to retrieve. If the data type does not match the parameter type, a conversion will be attempted.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
IGH_DataAccess Interface
GetData Overload
Grasshopper.Kernel Namespace