Grasshopper SDK
GH_Document.IsFilePathDefined Property
 Returns True if the filename flag of this document has been set
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsFilePathDefined { get; }
Public ReadOnly Property IsFilePathDefined As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.IsFilePathDefined"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace