Grasshopper SDK
IGH_DataTree Interface
 Utility interface for detection of DataTree generic instances.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_DataTree
Public Interface IGH_DataTree
The IGH_DataTree type exposes the following members.
Methods
Name | Description
MergeWithParameter
 Utility function for assigning Script Data Trees to parameters.
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace