Grasshopper SDK
GH_ObjectChangedEventArgs.Sender Property
 Gets the object which raised this event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_DocumentObject Sender { get; }
Public ReadOnly Property Sender As IGH_DocumentObject
	Get
Property Value
Type: IGH_DocumentObject
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ObjectChangedEventArgs.Sender"]
See Also
Reference
GH_ObjectChangedEventArgs Class
Grasshopper.Kernel Namespace