Grasshopper SDK
GH_DigitScroller.Digits Property
 Gets or sets the number of digits displayed in the scroller.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Digits { get; set; }
Public Property Digits As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DigitScroller.Digits"]
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace