Grasshopper SDK
GH_AttributesChangedEventArgs Constructor
Initializes a new instance of the GH_AttributesChangedEventArgs class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_AttributesChangedEventArgs()
Public Sub New
See Also
Reference
GH_AttributesChangedEventArgs Class
Grasshopper.Kernel Namespace