Grasshopper SDK
IGH_DocumentObject.ObjectChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ObjectChangedEventHandler(
	IGH_DocumentObject sender,
	GH_ObjectChangedEventArgs e
)
Public Delegate Sub ObjectChangedEventHandler (
	sender As IGH_DocumentObject,
	e As GH_ObjectChangedEventArgs
)
Parameters
sender
Type: Grasshopper.Kernel.IGH_DocumentObject
e
Type: Grasshopper.Kernel.GH_ObjectChangedEventArgs
See Also
Reference
Grasshopper.Kernel Namespace