Grasshopper SDK
GH_DocumentEditor.FixCanvasToolbarState Method
 Enabled/Disables the appropriate buttons depending on whether there is a document loaded on the canvas.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void FixCanvasToolbarState()
Public Sub FixCanvasToolbarState
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace