Grasshopper SDK
GH_Document.RelevantObjectAtPoint Method (PointF, GH_RelevantObjectFilter)
 Find the most relevant object at a given canvas location. The most relevant object might be a regular Object (Component or Parameter), it might be an attribute grip, an attribute balloon, a wire or a group.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RelevantObjectData RelevantObjectAtPoint(
	PointF pt,
	GH_RelevantObjectFilter searchFilter
)
Public Function RelevantObjectAtPoint (
	pt As PointF,
	searchFilter As GH_RelevantObjectFilter
) As GH_RelevantObjectData
Parameters
pt
Type: System.Drawing.PointF
The point to test.
searchFilter
Type: Grasshopper.Kernel.GH_RelevantObjectFilter
Return Value
Type: GH_RelevantObjectData
Information about the most relevant object or Null if no relevant object could be found at the given point.
See Also
Reference
GH_Document Class
RelevantObjectAtPoint Overload
Grasshopper.Kernel Namespace