Grasshopper SDK
GH_GooProxy<T>.MutateString Method
 Munge a string to remove obvious errors on account of the user.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string MutateString(
	string in
)
Public Overridable Function MutateString (
	in As String
) As String
Parameters
in
Type: System.String
Return Value
Type: String
Implements
IGH_GooProxy.MutateString(String)
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace