Grasshopper SDK
GH_Point.GH_PointProxy.ReferenceType Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string ReferenceType { get; }
Public ReadOnly Property ReferenceType As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Point.GH_PointProxy.ReferenceType"]
See Also
Reference
GH_Point.GH_PointProxy Class
Grasshopper.Kernel.Types Namespace