Grasshopper SDK
GH_Slider.Input_Supply Method
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override string Input_Supply()
Protected Overrides Function Input_Supply As String
Return Value
Type: String
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace