Grasshopper SDK
GH_Interval2D.GH_Interval2DProxy Constructor
Initializes a new instance of the GH_Interval2D.GH_Interval2DProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Interval2DProxy(
	GH_Interval2D nValue
)
Public Sub New (
	nValue As GH_Interval2D
)
Parameters
nValue
Type: Grasshopper.Kernel.Types.GH_Interval2D
See Also
Reference
GH_Interval2D.GH_Interval2DProxy Class
Grasshopper.Kernel.Types Namespace