Grasshopper SDK
GH_Rectangle.GH_RectangleProxy.Circumference Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Circumference { get; }
Public ReadOnly Property Circumference As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Rectangle.GH_RectangleProxy.Circumference"]
See Also
Reference
GH_Rectangle.GH_RectangleProxy Class
Grasshopper.Kernel.Types Namespace