Grasshopper SDK
GH_Path.Indices Property
 Gets or sets the entire index space; the path that identifies an element in structure space. You should not change the index space when the path is used inside a structure since it will invalidate the sort order. If you don't know what you're doing, for Pete's sake don't touch this.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int[] Indices { get; set; }
Public Property Indices As Integer()
	Get
	Set
Property Value
Type: Int32[]
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Path.Indices"]
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace