Grasshopper SDK
GH_Convert.ToDate_Secondary Method
 Performs indirect casts from other data types into DateTime constructs.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToDate_Secondary(
	Object data,
	ref DateTime destination
)
Public Shared Function ToDate_Secondary (
	data As Object,
	ByRef destination As DateTime
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.DateTime
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace