Grasshopper SDK
GH_ActiveObject.CollectData Method
 This function is called whenever the object is required to collect all data. Either from Persistent records, from source params or whatever.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void CollectData()
Public Overridable Sub CollectData
Implements
IGH_ActiveObject.CollectData()
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace