Grasshopper SDK
GH_ObjectUndoAction Constructor
Initializes a new instance of the GH_ObjectUndoAction class
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_ObjectUndoAction(
	Guid object_id
)
Protected Sub New (
	object_id As Guid
)
Parameters
object_id
Type: System.Guid
See Also
Reference
GH_ObjectUndoAction Class
Grasshopper.Kernel.Undo Namespace