Grasshopper SDK
IGH_DocumentOwner Interface
 Implement this interface if you want to be the owner assigned to a document in the Grasshopper documentserver.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_DocumentOwner
Public Interface IGH_DocumentOwner
The IGH_DocumentOwner type exposes the following members.
Methods
Name | Description
DocumentClosed
 This method will be called whenever the owner document was closed.
DocumentModified
 This method will be called whenever the owned document is modified.
OwnerDocument
 If the IGH_DocumentOwner is part of a GH_Document of its own, this function will return that document.
Top
See Also
Reference
Grasshopper.Kernel Namespace