Grasshopper SDK
GH_DocumentIO.GetDocumentThumbnail Method
 Try and extract the preview image of a document. Not all gh/ghx files contain a thumbnail so this function may return null. The document itself is not loaded and rendered, so the thumbnail really has to be part of the file already.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Bitmap GetDocumentThumbnail(
	string filePath
)
Public Shared Function GetDocumentThumbnail (
	filePath As String
) As Bitmap
Parameters
filePath
Type: System.String
Filepath to examine.
Return Value
Type: Bitmap
A preview bitmap on success or null on failure. Caller is responsible for disposing of the image.
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace