Grasshopper SDK
GH_Convert.ToDate Method
 Convert data into Dates.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToDate(
	Object data,
	out DateTime destination,
	GH_Conversion conversion_level
)
Public Shared Function ToDate (
	data As Object,
	<OutAttribute> ByRef destination As DateTime,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
destination
Type: System.DateTime
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace