Grasshopper SDK
GH_AutoSaveSettings.SaveOnObjectAddedChanged Event
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_AutoSaveSettings.SaveOnObjectAddedChangedEventHandler SaveOnObjectAddedChanged
Public Shared Event SaveOnObjectAddedChanged As GH_AutoSaveSettings.SaveOnObjectAddedChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_AutoSaveSettings.SaveOnObjectAddedChangedEventHandler
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace