Grasshopper SDK
GH_ComponentParamServer.IGH_SyncObject Interface
 Synch object for tracking long term changes to the parameter server.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_SyncObject
Public Interface IGH_SyncObject
See Also
Reference
Grasshopper.Kernel Namespace