Grasshopper SDK
GH_Capsule.CreateCapsule Method (Rectangle, GH_Palette)
 Create a new blank capsule with default radius and highlight dimensions.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Capsule CreateCapsule(
	Rectangle box,
	GH_Palette palette
)
Public Shared Function CreateCapsule (
	box As Rectangle,
	palette As GH_Palette
) As GH_Capsule
Parameters
box
Type: System.Drawing.Rectangle
Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
palette
Type: Grasshopper.GUI.Canvas.GH_Palette
Colour palette to apply.
Return Value
Type: GH_Capsule
A new instance of GH_Capsule. Caller is responsible for disposing of the object.
See Also
Reference
GH_Capsule Class
CreateCapsule Overload
Grasshopper.GUI.Canvas Namespace