Grasshopper SDK
IGH_DocumentObject.AttributesChanged Event
 Raised whenever the number or kind of attributes changes. This event is handled by GH_Documents who subsequently wipe their attribute caches.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
event IGH_DocumentObject.AttributesChangedEventHandler AttributesChanged
Event AttributesChanged As IGH_DocumentObject.AttributesChangedEventHandler
Value
Type: Grasshopper.Kernel.IGH_DocumentObject.AttributesChangedEventHandler
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace