Grasshopper SDK
IGH_Rule.Notation Property
 Gets the string notation (representation) for this rule.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Notation { get; }
ReadOnly Property Notation As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.IGH_Rule.Notation"]
See Also
Reference
IGH_Rule Interface
Grasshopper.Kernel.Data Namespace