Grasshopper SDK
GH_ColourPickerBase.InvalidatedEventHandler Delegate
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void InvalidatedEventHandler(
	Object sender,
	EventArgs e
)
Public Delegate Sub InvalidatedEventHandler (
	sender As Object,
	e As EventArgs
)
Parameters
sender
Type: System.Object
e
Type: System.EventArgs
See Also
Reference
Grasshopper.GUI.Base Namespace