Grasshopper SDK
GH_Point.ReferencesEdge Method
 Returns True if this point is based on an edge reference
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ReferencesEdge()
Public Function ReferencesEdge As Boolean
Return Value
Type: Boolean
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace