Grasshopper SDK
GH_Param<T>.CreateAttributes Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void CreateAttributes()
Public Overrides Sub CreateAttributes
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace