Grasshopper SDK
GH_LineParser Constructor
Initializes a new instance of the GH_LineParser class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_LineParser()
Protected Sub New
See Also
Reference
GH_LineParser Class
Grasshopper.Kernel Namespace