Grasshopper SDK
Node3d<T>.Add Method
 Insert another item into the tree. The item should be within the region of this node.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Add(
	T item
)
Public Sub Add (
	item As T
)
Parameters
item
Type: T
Item to insert.
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace