Grasshopper SDK
GH_Material.GH_Material_Proxy Constructor
Initializes a new instance of the GH_Material.GH_Material_Proxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Material_Proxy(
	GH_Material nValue
)
Public Sub New (
	nValue As GH_Material
)
Parameters
nValue
Type: Grasshopper.Kernel.Types.GH_Material
See Also
Reference
GH_Material.GH_Material_Proxy Class
Grasshopper.Kernel.Types Namespace