Grasshopper SDK
GH_Canvas.NavigationSettingsChanged Event
 Raised whenever any of the shared navigation properties changed.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_Canvas.NavigationSettingsChangedEventHandler NavigationSettingsChanged
Public Shared Event NavigationSettingsChanged As GH_Canvas.NavigationSettingsChangedEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.NavigationSettingsChangedEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace