Grasshopper SDK
GH_Param<T>.Optional Property
 Gets or sets whether or not this parameter is considered optional by the owner component. Empty, non-optional parameters prevent the component from being solved.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Optional { get; set; }
Public Property Optional As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.Optional"]
Implements
IGH_Param.Optional
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace