Grasshopper SDK
GH_SolutionEventArgs.Document Property
 Gets the document that raised the event, should be the same as the "sender" parameter in the event handler.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document Document { get; }
Public ReadOnly Property Document As GH_Document
	Get
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_SolutionEventArgs.Document"]
See Also
Reference
GH_SolutionEventArgs Class
Grasshopper.Kernel Namespace