Grasshopper SDK
GH_Param<T> Constructor (IGH_InstanceDescription, GH_ParamAccess)
Initializes a new instance of the GH_Param<T> class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_Param(
	IGH_InstanceDescription tag,
	GH_ParamAccess access
)
Protected Sub New (
	tag As IGH_InstanceDescription,
	access As GH_ParamAccess
)
Parameters
tag
Type: Grasshopper.Kernel.IGH_InstanceDescription
access
Type: Grasshopper.Kernel.GH_ParamAccess
See Also
Reference
GH_Param<T> Class
GH_Param<T> Overload
Grasshopper.Kernel Namespace