Grasshopper SDK
GH_Brep.GH_BrepProxy Constructor
Initializes a new instance of the GH_Brep.GH_BrepProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_BrepProxy(
	GH_Brep Value
)
Public Sub New (
	Value As GH_Brep
)
Parameters
Value
Type: Grasshopper.Kernel.Types.GH_Brep
See Also
Reference
GH_Brep.GH_BrepProxy Class
Grasshopper.Kernel.Types Namespace