Grasshopper SDK
GH_InstanceDescription.NickName Property
 Gets or sets the nickname of the object. This field can be changed by the user.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string NickName { get; set; }
Public Overridable Property NickName As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_InstanceDescription.NickName"]
Implements
IGH_InstanceDescription.NickName
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace