Grasshopper SDK
Tracing.DebugLogBeginBlock Method
 Start a new block in the debug data. You must end all your own blocks. This function will only work if the Grasshopper window exists. This method is threadsafe.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void DebugLogBeginBlock(
	string name
)
Public Shared Sub DebugLogBeginBlock (
	name As String
)
Parameters
name
Type: System.String
Name of block
See Also
Reference
Tracing Class
Grasshopper Namespace