Grasshopper SDK
IGH_Attributes.IsTopLevel Property
 Gets whether these attributes are top_level (i.e. no Parent attributes)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsTopLevel { get; }
ReadOnly Property IsTopLevel As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.IsTopLevel"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace