Grasshopper SDK
GH_List.Ordered Property
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Ordered { get; }
Public ReadOnly Property Ordered As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_List.Ordered"]
See Also
Reference
GH_List Class
Grasshopper.Documentation Namespace