Grasshopper SDK
GH_TreeRules Class
 Represents an entire data tree rule set.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_TreeRules
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_TreeRules
Public NotInheritable Class GH_TreeRules
The GH_TreeRules type exposes the following members.
Constructors
Name | Description
GH_TreeRules
 Constructs a new rule set for testing data trees. Unless you know exactly what you are doing, use the FromString() static method instead.
Top
Properties
Name | Description
HasItemRule
 Gets whether this rule set has a defined index rule.
HasPathRules
 Gets whether this rule set has any path rules.
PathRuleCount
 Gets the number of defined path rules.
Top
Methods
Name | Description
Apply(GH_Path)
 Apply all the local rules to a path.
Apply(GH_Path, Int32)
 Apply all the local rules to a path+index combination.
FromString
 Attempt to parse a Pattern string.
ToString |  (Overrides Object.ToString().)
Top
Fields
Name | Description
AllowedChars
AndOperator
AnyNumbersSymbol
AnyNumberSymbol
ItemBrackets
ItemCloseBracket
ItemOpenBracket
NotOperator
OrOperator
PathBrackets
PathCloseBracket
PathOpenBracket
PathSeparator
RangeSymbol
RuleBrackets
RuleCloseBracket
RuleOpenBracket
Separator
SequenceCode
SequenceSymbol
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace