Grasshopper SDK
GH_DebugDescriptionWriter.WriteLine Method (String, Object[])
 Write a new formatted line to the log.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void WriteLine(
	string line,
	params Object[] args
)
Public Sub WriteLine (
	line As String,
	ParamArray args As Object()
)
Parameters
line
Type: System.String
Line to write with formatting tags.
args
Type: System.Object[]
Data to format.
See Also
Reference
GH_DebugDescriptionWriter Class
WriteLine Overload
Grasshopper.Kernel Namespace