Grasshopper SDK
GH_Viewport.ProjectRectangle Method
 Project a rectangle from canvas coordinates into control coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RectangleF ProjectRectangle(
	RectangleF rec
)
Public Function ProjectRectangle (
	rec As RectangleF
) As RectangleF
Parameters
rec
Type: System.Drawing.RectangleF
The rectangle in canvas coordinates.
Return Value
Type: RectangleF
The associated rectangle in control pixel coordinates.
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace