Grasshopper SDK
GH_SliderBase.ShadowSize Property
 Gets or sets the size of the border shadow along all edges of the box.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Padding ShadowSize { get; set; }
Public Property ShadowSize As Padding
	Get
	Set
Property Value
Type: Padding
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.ShadowSize"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace