Grasshopper SDK
GH_Param<T>.StateTags Property
 Gets all the StateTags that are associated with this parameter. A state tag is a visual feedback icon that represents specific internal settings.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual GH_StateTagList StateTags { get; }
Public Overridable ReadOnly Property StateTags As GH_StateTagList
	Get
Property Value
Type: GH_StateTagList
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.StateTags"]
Implements
IGH_Param.StateTags
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace