Grasshopper SDK
GH_Parser.IsQuoteLine Method
 Test whether a line is a block quote line. Block quotes start with a larger than symbol.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsQuoteLine(
	string line
)
Public Shared Function IsQuoteLine (
	line As String
) As Boolean
Parameters
line
Type: System.String
Line to test.
Return Value
Type: Boolean
True if the line is a block quote.
See Also
Reference
GH_Parser Class
Grasshopper.Documentation Namespace