Grasshopper SDK
GH_Parser.IsListLine Method
 Test whether a line contains a list item.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsListLine(
	string line
)
Public Shared Function IsListLine (
	line As String
) As Boolean
Parameters
line
Type: System.String
Line to check.
Return Value
Type: Boolean
True if the line contains a list item.
See Also
Reference
GH_Parser Class
Grasshopper.Documentation Namespace