Grasshopper SDK
GH_Point.ShowReferenceDialog Method (IWin32Window)
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DialogResult ShowReferenceDialog(
	IWin32Window owner
)
Public Function ShowReferenceDialog (
	owner As IWin32Window
) As DialogResult
Parameters
owner
Type: System.Windows.Forms.IWin32Window
Return Value
Type: DialogResult
See Also
Reference
GH_Point Class
ShowReferenceDialog Overload
Grasshopper.Kernel.Types Namespace