Grasshopper SDK
IGH_CanvasValidator.AppliesToDocument Method
 Test whether this validator applies to a specific document.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool AppliesToDocument(
	Guid id
)
Function AppliesToDocument (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
Document id or Guid.Empty if no document is available.
Return Value
Type: Boolean
See Also
Reference
IGH_CanvasValidator Interface
Grasshopper.GUI.Canvas Namespace