Grasshopper SDK
GH_ComponentAttributes.SetupTooltip Method
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void SetupTooltip(
	PointF canvasPoint,
	GH_TooltipDisplayEventArgs e
)
Public Overrides Sub SetupTooltip (
	canvasPoint As PointF,
	e As GH_TooltipDisplayEventArgs
)
Parameters
canvasPoint
Type: System.Drawing.PointF
e
Type: Grasshopper.GUI.GH_TooltipDisplayEventArgs
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace