Grasshopper SDK
GH_TooltipDisplayEventArgs.Point Property
 Gets the point in control coordinates for the tooltip locus.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point Point { get; }
Public ReadOnly Property Point As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipDisplayEventArgs.Point"]
See Also
Reference
GH_TooltipDisplayEventArgs Class
Grasshopper.GUI Namespace