Grasshopper SDK
IGH_Attributes Interface
 Base interface for all Attributes. Attributes are the visual portion of GH_DocumentObjects. They handle display, mouse events, layout, context menus etc. etc. You should consider inheriting from GH_Attributes or some other abstract class instead of implementing this interface from scratch.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_Attributes : GH_ISerializable,
	IGH_ResponsiveObject, IGH_TooltipAwareObject
Public Interface IGH_Attributes
	Inherits GH_ISerializable, IGH_ResponsiveObject, IGH_TooltipAwareObject
The IGH_Attributes type exposes the following members.
Properties
Name | Description
AllowMessageBalloon
 Gets a value indicating whether these attributes allow warning and error boxes to be drawn on top of them.
Bounds
 Gets the rectangle that contains the active content of the attributes. Typically the Contents determine the active area for menus, tooltips etc. Attributes are not supposed to draw objects beyond the Bounds.
DocObject
 Gets the owner object of these attributes.
GetTopLevel
 Gets the top level attributes of these attributes.
HasInputGrip
 Gets a value indicating whether or not these attributes have an input grip.
HasOutputGrip
 Gets a value indicating whether or not these attributes have an output grip.
InputGrip
 Gets the input grip location for these attributes. If HasInputGrip equals False, this point is meaningless.
InstanceGuid
 Gets the instance ID for these attributes.
IsTopLevel
 Gets whether these attributes are top_level (i.e. no Parent attributes)
OutputGrip
 Gets the output grip location for these attributes. If HasOutputGrip equals False, this point is meaningless.
Parent
 Gets or sets the parent attributes. Top level attributes do not have parents.
PathName
 Get a description of the location of these attributes within the local attribute tree.
Pivot
 Gets the pivot for these attributes. The pivot controls the general placement of the attributes. If you want to move the attributes, change the pivot location.
Selected
 Gets or sets the selected state of the top-level attributes.
Top
Methods
Name | Description
AppendToAttributeTree
 Recursively append these attributes and all child attributes to the attribute list.
ExpireLayout
 Expires the entire layout of the attributes. When overridden, implementer must place a call to the base class ExpireLayout().
InvalidateCanvas
 If the mouse location should cause a canvas invalidation then return true. You only need to override this function if you draw objects that are dependant on cursor positions outside the bounds of the attributes.
IsMenuRegion
 Determines whether a point is available for context menu popups. By default, IsMenuRegion calls IsPickRegion(PointF).
IsPickRegion(PointF)
 Determines whether a point is within the pickable region for this object. By default, any point inside the Bounds is treated as pickable.
IsPickRegion(RectangleF, GH_PickBox)
 Determines whether a rectangle is a valid pick region for this object. By default, the picking rectangle is intersected with the Bounds rectangle.
NewInstanceGuid()
 Generate a new instance GUID for the owner object.
NewInstanceGuid(Guid)
 Generate a new instance GUID for the owner object. Do not use this overload unless you're > 1.95m and called David.
PerformLayout
 Recompute the layout for these attributes. This function is automatically called during Drawing operations, so you typically don't have to.
RenderToCanvas
 Render these attributes into a Canvas control.
Top
See Also
Reference
Grasshopper.Kernel Namespace