Grasshopper SDK
Instances.CanvasCreatedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void CanvasCreatedEventHandler(
	GH_Canvas canvas
)
Public Delegate Sub CanvasCreatedEventHandler (
	canvas As GH_Canvas
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
See Also
Reference
Grasshopper Namespace