Grasshopper SDK
GH_ColourPickerEventArgs Class
 Arguments passed via GH_SliderBase.ValueChanged events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.GUI.Base.GH_ColourPickerEventArgs
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ColourPickerEventArgs : EventArgs
Public Class GH_ColourPickerEventArgs
	Inherits EventArgs
The GH_ColourPickerEventArgs type exposes the following members.
Properties
Name | Description
Colour
 Gets the new value of the colour picker. This value is cached, so even if the picker subsequently updates, this property remains constant.
ColourPicker
 Gets the instance of the picker that raised the event.
Intermediate
 Gets a value indicating whether the change was an intermediate one.
Original
 Gets the original value of the colour picker. This value is cached, so even if the picker subsequently updates, this property remains constant.
Top
See Also
Reference
Grasshopper.GUI.Base Namespace