Grasshopper SDK
GH_Gradient.AddGrip Method (Double, Color, Color)
 Add a new bi-colour grip.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Grip AddGrip(
	double t,
	Color c0,
	Color c1
)
Public Function AddGrip (
	t As Double,
	c0 As Color,
	c1 As Color
) As GH_Grip
Parameters
t
Type: System.Double
Parameter for grip.
c0
Type: System.Drawing.Color
Left colour of grip.
c1
Type: System.Drawing.Color
Right colour of grip.
Return Value
Type: GH_Grip
See Also
Reference
GH_Gradient Class
AddGrip Overload
Grasshopper.GUI.Gradient Namespace