Grasshopper SDK
GH_ComponentParamServer.EmitSyncObject Method
 Create a synch object that stores a shallow representation of this server. Cache this object if you're planning to make sweeping changes to this param-server. Then, once you are finished call the Sync() function to perform cleanup of removed parameters. This is a utility function and you can choose to perform cleanup yourself.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ComponentParamServer.IGH_SyncObject EmitSyncObject()
Public Function EmitSyncObject As GH_ComponentParamServer.IGH_SyncObject
Return Value
Type: GH_ComponentParamServer.IGH_SyncObject
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace