Grasshopper SDK
UVInterval.V Property
 Gets or sets the V interval.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Interval V { get; set; }
Public Property V As Interval
	Get
	Set
Property Value
Type: Interval
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.UVInterval.V"]
See Also
Reference
UVInterval Structure
Grasshopper.Kernel.Types Namespace