Grasshopper SDK
GH_Plane.IsValid Property
 Gets the validity of the plane. If the plane is invalid, attempts are made to fix the data. If the plane remains invalid, False is returned.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Plane.IsValid"]
See Also
Reference
GH_Plane Class
Grasshopper.Kernel.Types Namespace