Grasshopper SDK
Translation Constructor (Vector3d)
Initializes a new instance of the Translation class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Translation(
	Vector3d translation
)
Public Sub New (
	translation As Vector3d
)
Parameters
translation
Type: Vector3d
See Also
Reference
Translation Class
Translation Overload
Grasshopper.Kernel.Types.Transforms Namespace