Grasshopper SDK
GH_AutoSaveSettings.AutoSaveFileFormatChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void AutoSaveFileFormatChangedEventHandler()
Public Delegate Sub AutoSaveFileFormatChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace