Grasshopper SDK
GH_FontControl.AllowSizeOverride Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AllowSizeOverride { get; set; }
Public Property AllowSizeOverride As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FontControl.AllowSizeOverride"]
See Also
Reference
GH_FontControl Class
Grasshopper.GUI Namespace