Grasshopper SDK
GH_UndoRecord.Guid Property
 Gets the ID of this undo item. Every undo record has a unique ID.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid Guid { get; }
Public ReadOnly Property Guid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoRecord.Guid"]
See Also
Reference
GH_UndoRecord Class
Grasshopper.Kernel.Undo Namespace