Grasshopper SDK
IGH_ActiveObject.ComputeData Method
 This function is called whenever the object is required to generate new data. This step is only performed by some objects and only when the Phase flag is Collected. Upon completion, the Phase will be Computed. If this object throws exceptions, it is the responsibility of the caller to set the Phase flag to Failed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void ComputeData()
Sub ComputeData
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace