Grasshopper SDK
GH_Structure<T>.DataCount Property
 Gets the total number of data items stored in all paths.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int DataCount { get; }
Public ReadOnly Property DataCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.DataCount"]
Implements
IGH_Structure.DataCount
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace