Grasshopper SDK
GH_TreeIndex.Item Property
 Gets or sets the item index.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Item { get; set; }
Public Property Item As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_TreeIndex.Item"]
See Also
Reference
GH_TreeIndex Structure
Grasshopper.Kernel.Data Namespace