Grasshopper SDK
GH_RuntimeFile.ParseFile Method
 Parse a file and return the runtime representation of said file.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_RuntimeFile ParseFile(
	string path
)
Public Shared Function ParseFile (
	path As String
) As GH_RuntimeFile
Parameters
path
Type: System.String
Path to file.
Return Value
Type: GH_RuntimeFile
The runtime representation of the file on the disk.
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace