Grasshopper SDK
GH_Canvas.GenerateHiResImageTile Method
 Generate a single tile in a Hi-Res image export.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap GenerateHiResImageTile(
	GH_Viewport vp,
	Color bg
)
Public Function GenerateHiResImageTile (
	vp As GH_Viewport,
	bg As Color
) As Bitmap
Parameters
vp
Type: Grasshopper.GUI.Canvas.GH_Viewport
Viewport override
bg
Type: System.Drawing.Color
Background color override.
Return Value
Type: Bitmap
A list of image tiles.
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace