Grasshopper SDK
GH_CanvasMouseEvent.CanvasX Property
 Gets the x-coordinate of the cursor location in canvas unit coordinates.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float CanvasX { get; }
Public ReadOnly Property CanvasX As Single
	Get
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasMouseEvent.CanvasX"]
See Also
Reference
GH_CanvasMouseEvent Class
Grasshopper.GUI Namespace