Grasshopper SDK
GH_ComponentParamServer.UnregisterOutputParameter Method (IGH_Param, Boolean)
 Removes the specified parameter from this component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool UnregisterOutputParameter(
	IGH_Param param,
	bool isolate
)
Public Function UnregisterOutputParameter (
	param As IGH_Param,
	isolate As Boolean
) As Boolean
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
Parameter to remove
isolate
Type: System.Boolean
If true, parameters that are removed will be isolated from sources and recipients.
Return Value
Type: Boolean
See Also
Reference
GH_ComponentParamServer Class
UnregisterOutputParameter Overload
Grasshopper.Kernel Namespace