Grasshopper SDK
GH_Capsule.OutlineShape Property
 Gets the graphics path that describes the outer edge of the capsule.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GraphicsPath OutlineShape { get; }
Public ReadOnly Property OutlineShape As GraphicsPath
	Get
Property Value
Type: GraphicsPath
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.OutlineShape"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace