Grasshopper SDK
GH_Document.GH_UndoUtil.RecordEvent Method (GH_UndoRecord)
 Add a new record to the undo stack of the owner document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid RecordEvent(
	GH_UndoRecord record
)
Public Function RecordEvent (
	record As GH_UndoRecord
) As Guid
Parameters
record
Type: Grasshopper.Kernel.Undo.GH_UndoRecord
Undo record to add.
Return Value
Type: Guid
The ID of the newly added undo record or Guid.Empty on failure.
See Also
Reference
GH_Document.GH_UndoUtil Class
RecordEvent Overload
Grasshopper.Kernel Namespace