Grasshopper SDK
Complex.Zero Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Complex Zero { get; }
Public Shared ReadOnly Property Zero As Complex
	Get
Property Value
Type: Complex
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Complex.Zero"]
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace