Grasshopper SDK
GH_Point.CreateFromCurveRatio Method
 Create new point geometry instance based on a curve parameter ratio
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateFromCurveRatio(
	Guid crv_id,
	Curve crv,
	double t
)
Public Sub CreateFromCurveRatio (
	crv_id As Guid,
	crv As Curve,
	t As Double
)
Parameters
crv_id
Type: System.Guid
ID of the curve this object references
crv
Type: Curve
t
Type: System.Double
Parameter on curve in domain space
Remarks
This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace