Grasshopper SDK
GH_ObjectSettings.ZuiFillColour Property
 Gets or sets the fill colour for ZUI elements.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color ZuiFillColour { get; set; }
Public Property ZuiFillColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_ObjectSettings.ZuiFillColour"]
See Also
Reference
GH_ObjectSettings Class
Grasshopper.GUI.Theme Namespace