Grasshopper SDK
GH_DocumentObject.Menu_AppendObjectNameEx Method
 Appends the default object name + display mode menu item.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void Menu_AppendObjectNameEx(
	ToolStripDropDown menu
)
Protected Sub Menu_AppendObjectNameEx (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace