Grasshopper SDK
GH_ActiveObject.AppendAdditionalMenuItems Method
 Override this function if you want to add additional items to the object context menu. Default items already included in the menu toolstrip are:
1. Name
2. Preview
3. Warnings
4. Errors
5. [additional items will be inserted here]
6. Help
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void AppendAdditionalMenuItems(
	ToolStripDropDown menu
)
Public Overridable Sub AppendAdditionalMenuItems (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace