Grasshopper SDK
GH_DocSettingsEventArgs Class
 These arguments are passed along with SettingsChanged events on GH_Document.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_DocSettingsEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocSettingsEventArgs : EventArgs
Public Class GH_DocSettingsEventArgs
	Inherits EventArgs
The GH_DocSettingsEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document that raised the event.
Kind
 Gets the type of setting that was changed.
Top
See Also
Reference
Grasshopper.Kernel Namespace