Grasshopper SDK
GH_Viewport.ZoomInverse Property
 Gets the inverse of the zoom.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float ZoomInverse { get; }
Public ReadOnly Property ZoomInverse As Single
	Get
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.ZoomInverse"]
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace