Grasshopper SDK
GH_FontControl.AllowStyleOverride Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AllowStyleOverride { get; set; }
Public Property AllowStyleOverride As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FontControl.AllowStyleOverride"]
See Also
Reference
GH_FontControl Class
Grasshopper.GUI Namespace