Grasshopper SDK
GH_ExpressionParser.ThrowExceptions Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ThrowExceptions { get; set; }
Public Property ThrowExceptions As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ExpressionParser.ThrowExceptions"]
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace