Grasshopper SDK
Complex.Imaginary Property
 Gets or sets the imaginary component of the Complex number.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Imaginary { get; set; }
Public Property Imaginary As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Complex.Imaginary"]
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace