Grasshopper SDK
GH_DocumentServer.IndexOf Method (GH_Document)
 Gets the index of the given document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int IndexOf(
	GH_Document doc
)
Public Function IndexOf (
	doc As GH_Document
) As Integer
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
Document to search for.
Return Value
Type: Int32
The index of the given document or -1 if the document is not in the global list.
See Also
Reference
GH_DocumentServer Class
IndexOf Overload
Grasshopper.Kernel Namespace