Grasshopper SDK
GH_DocumentObject.Menu_AppendCustomItem Method (ToolStripDropDown, Control, GH_MenuCustomControl.KeyDownEventHandler, Boolean, Int32, Boolean)
 Utility function for inserting exotic controls into dropdown menus.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool Menu_AppendCustomItem(
	ToolStripDropDown menu,
	Control control,
	KeyDownEventHandler keydown,
	bool enabled,
	int width,
	bool lockOnFocus
)
Public Shared Function Menu_AppendCustomItem (
	menu As ToolStripDropDown,
	control As Control,
	keydown As KeyDownEventHandler,
	enabled As Boolean,
	width As Integer,
	lockOnFocus As Boolean
) As Boolean
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
Dropdown to add a control to.
control
Type: System.Windows.Forms.Control
Control to insert.
keydown
Type: KeyDownEventHandler
Delegate for key-presses.
enabled
Type: System.Boolean
If true, the control will be enabled.
width
Type: System.Int32
Width hint for the control.
lockOnFocus
Type: System.Boolean
If true and the control gets focus, the rest of the menu will be locked.
Return Value
Type: Boolean
See Also
Reference
GH_DocumentObject Class
Menu_AppendCustomItem Overload
Grasshopper.Kernel Namespace