Grasshopper SDK
GH_Viewport.IsVisible Method (RectangleF, Single)
 Test visibility of a rectangle.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsVisible(
	ref RectangleF rec,
	float margin = 0f
)
Public Function IsVisible (
	ByRef rec As RectangleF,
	Optional margin As Single = 0F
) As Boolean
Parameters
rec
Type: System.Drawing.RectangleF
Rectangle in canvas coordinates.
margin (Optional)
Type: System.Single
Fuzzy area around rectangle to test.
Return Value
Type: Boolean
True if the rectangle is visible in the control upon projection.
See Also
Reference
GH_Viewport Class
IsVisible Overload
Grasshopper.GUI.Canvas Namespace