Grasshopper SDK
GH_MenuTextBox.TextBoxItem Property
 Gets the text box control embedded in the menu.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public ToolStripTextBox TextBoxItem { get; }
Public ReadOnly Property TextBoxItem As ToolStripTextBox
	Get
Property Value
Type: ToolStripTextBox
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MenuTextBox.TextBoxItem"]
See Also
Reference
GH_MenuTextBox Class
Grasshopper.GUI Namespace