Grasshopper SDK
GH_Attributes<T>.HasOutputGrip Property
 Gets a value indicating whether or not these attributes have an output grip.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool HasOutputGrip { get; }
Public Overridable ReadOnly Property HasOutputGrip As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.HasOutputGrip"]
Implements
IGH_Attributes.HasOutputGrip
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace