Grasshopper SDK
DataTree<T>.TopologyDescription Property
 Gets a description of the topology of the tree. Useful for debugging purposes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string TopologyDescription { get; }
Public ReadOnly Property TopologyDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.DataTree`1.TopologyDescription"]
See Also
Reference
DataTree<T> Class
Grasshopper Namespace