Grasshopper SDK
GH_Tooltip.Adjust Method
 Repositions the tooltip to match with new cursor positions.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void Adjust()
Public Shared Sub Adjust
See Also
Reference
GH_Tooltip Class
Grasshopper.GUI Namespace