Grasshopper SDK
GH_VectorForce.Chord Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Line Chord { get; set; }
Public Property Chord As Line
	Get
	Set
Property Value
Type: Line
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_VectorForce.Chord"]
See Also
Reference
GH_VectorForce Class
Grasshopper.Kernel.Types Namespace