Grasshopper SDK
GH_Gradient.DeleteGripRegion Method
 Gets the Delete Grip region rectangle based on a gradient destination rectangle.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static RectangleF DeleteGripRegion(
	RectangleF destination
)
Public Shared Function DeleteGripRegion (
	destination As RectangleF
) As RectangleF
Parameters
destination
Type: System.Drawing.RectangleF
Gradient destination rectangle.
Return Value
Type: RectangleF
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace