Grasshopper SDK
GH_ExternalFile.FilePath Property
 Gets the file path.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string FilePath { get; }
Public ReadOnly Property FilePath As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ExternalFile.FilePath"]
See Also
Reference
GH_ExternalFile Class
Grasshopper.Kernel Namespace