Grasshopper SDK
GH_DocumentIO.Copy Method (GH_ClipboardType, IEnumerable<Guid>)
 Copy the specified objects in the internal document into the clipboard.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Copy(
	GH_ClipboardType clipboard,
	IEnumerable<Guid> guids
)
Public Function Copy (
	clipboard As GH_ClipboardType,
	guids As IEnumerable(Of Guid)
) As Boolean
Parameters
clipboard
Type: Grasshopper.Kernel.GH_ClipboardType
Specifies the clipboard type to use.
guids
Type: System.Collections.Generic.IEnumerable<Guid>
List of object ids to copy.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentIO Class
Copy Overload
Grasshopper.Kernel Namespace