Grasshopper SDK
GH_Canvas.CanvasPostPaintOverlay Event
 Raised after object overlay drawing completes.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPostPaintOverlayEventHandler CanvasPostPaintOverlay
Public Event CanvasPostPaintOverlay As GH_Canvas.CanvasPostPaintOverlayEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPostPaintOverlayEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace