Grasshopper SDK
IGH_Param.RemoveSource Method (IGH_Param)
 Remove the specified source from this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void RemoveSource(
	IGH_Param source
)
Sub RemoveSource (
	source As IGH_Param
)
Parameters
source
Type: Grasshopper.Kernel.IGH_Param
Source to remove.
See Also
Reference
IGH_Param Interface
RemoveSource Overload
Grasshopper.Kernel Namespace