Grasshopper SDK
GH_Component.MovedBetweenDocuments Method
 Overrides the MovedBetweenDocuments method and delegates the call to all parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void MovedBetweenDocuments(
	GH_Document oldDocument,
	GH_Document newDocument
)
Public Overrides Sub MovedBetweenDocuments (
	oldDocument As GH_Document,
	newDocument As GH_Document
)
Parameters
oldDocument
Type: Grasshopper.Kernel.GH_Document
Document that used to own this object.
newDocument
Type: Grasshopper.Kernel.GH_Document
Document that now owns ths object.
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace