Grasshopper SDK
GH_RelevantObjectData.Group Property
 Gets the cast of the DocObject to GH_Group.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Group Group { get; }
Public ReadOnly Property Group As GH_Group
	Get
Property Value
Type: GH_Group
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RelevantObjectData.Group"]
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace