Grasshopper SDK
GH_Structure<T>.ShallowDuplicate Method
 Create a structure with a similar topology to this one with pointers to the same data items.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Structure<T> ShallowDuplicate()
Public Function ShallowDuplicate As GH_Structure(Of T)
Return Value
Type: GH_Structure<T>
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace