Grasshopper SDK
GH_Material.IsReferencedShader Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsReferencedShader { get; }
Public ReadOnly Property IsReferencedShader As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Material.IsReferencedShader"]
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace