Grasshopper SDK
GH_ParserPrecedence Enumeration
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ParserPrecedence
Public Enumeration GH_ParserPrecedence
Members
Member name | Value | Description
Invalid | -1
None | 0
Level0 | 1
Level1 | 2
Level2 | 3
Level3 | 4
Level4 | 5
Level5 | 6
See Also
Reference
Grasshopper.Kernel.Expressions Namespace