Grasshopper SDK
GH_Material Constructor (Color)
 Create a new material based on a colour. The colour is used to control Diffuse, Emission and Transparency. Ambient, Specular and Shine are always default.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Material(
	Color diffuse
)
Public Sub New (
	diffuse As Color
)
Parameters
diffuse
Type: System.Drawing.Color
The diffuse colour of the material.
See Also
Reference
GH_Material Class
GH_Material Overload
Grasshopper.Kernel.Types Namespace