Grasshopper SDK
GH_Interval2D.ToString Method
 Format the interval using default grasshopper formatting logic.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_Interval2D Class
Grasshopper.Kernel.Types Namespace