Grasshopper SDK
GH_GeometryGroup.CastTo<T> Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool CastTo<T>(
	ref T target
)
Public Function CastTo(Of T) (
	ByRef target As T
) As Boolean
Parameters
target
Type: T
Type Parameters
T
Return Value
Type: Boolean
Implements
IGH_Goo.CastTo<T>(T)
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace