Grasshopper SDK
GH_Attributes<T>.AllowMessageBalloon Property
 Gets a value indicating whether these attributes allow warning and error balloons to be drawn on top of them.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool AllowMessageBalloon { get; }
Public Overridable ReadOnly Property AllowMessageBalloon As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.AllowMessageBalloon"]
Implements
IGH_Attributes.AllowMessageBalloon
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace