Grasshopper SDK
CentralSettings.RibbonVisible Property
 Gets or sets a value indicating whether components marked with DropDown exposure are drawn on the main toolbar anyway.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool RibbonVisible { get; set; }
Public Shared Property RibbonVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.RibbonVisible"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace