Grasshopper SDK
GH_LexerCombo.Source Property
 Gets or sets the lexer object that represents the source of a lexical operation.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Lexer Source { get; set; }
Public Property Source As GH_Lexer
	Get
	Set
Property Value
Type: GH_Lexer
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_LexerCombo.Source"]
See Also
Reference
GH_LexerCombo Class
Grasshopper.Kernel.Data Namespace