Grasshopper SDK
GH_Document.MutateAllIds Method
 Change all the instance UUIDs of all objects in the document. Be sure to resolve all proxy sources before mutating IDs. This function will ensure all groups are updated appropriately.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void MutateAllIds()
Public Sub MutateAllIds
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace