Grasshopper SDK
GH_Plane.GH_PlaneProxy.Origin Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Point3d_Wrapper Origin { get; }
Public ReadOnly Property Origin As GH_Point3d_Wrapper
	Get
Property Value
Type: GH_Point3d_Wrapper
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Plane.GH_PlaneProxy.Origin"]
See Also
Reference
GH_Plane.GH_PlaneProxy Class
Grasshopper.Kernel.Types Namespace