Grasshopper SDK
IGH_StateAwareObject Interface
 Implement this interface if you want to be included in state saving/loading.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_StateAwareObject
Public Interface IGH_StateAwareObject
The IGH_StateAwareObject type exposes the following members.
Methods
Name | Description
LoadState
 Override this function to load your state data. DO NOT START A NEW SOLUTION. This will be handled by the state manager.
SaveState
 Override this function to store your state data. You have to return a deserializable string.
Top
See Also
Reference
Grasshopper.Kernel Namespace