Grasshopper SDK
GH_Path Class
 Describes the path in structure space of a data item or a list of items. A path consists of a series of integers, each one of which represents an index in a branch structure.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_Path
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Path : IComparable<GH_Path>,
	IComparer<GH_Path>, GH_ISerializable
Public Class GH_Path
	Implements IComparable(Of GH_Path), IComparer(Of GH_Path),
	GH_ISerializable
The GH_Path type exposes the following members.
Constructors
Name | Description
GH_Path()
 Default constructor, creates a path with zero elements.
GH_Path(Int32)
 Creates a new path with a single element.
GH_Path(Int32[])
 Creates a new path from a series of elements.
GH_Path(GH_Path)
 Creates an exact copy of another path.
Top
Properties
Name | Description
Dimension
 Gets or sets the value of the path at the given dimension index.
Indices
 Gets or sets the entire index space; the path that identifies an element in structure space. You should not change the index space when the path is used inside a structure since it will invalidate the sort order. If you don't know what you're doing, for Pete's sake don't touch this.
InternalPath |  Obsolete.
 Gets or sets the entire index space; the path that identifies an element in structure space. You should not change the index space when the path is used inside a structure since it will invalidate the sort order. If you don't know what you're doing, for Pete's sake don't touch this.
Length
 Returns the number of dimensions in the path.
Valid
 Gets whether this path is valid. Invalid paths either have no elements or negative elements.
Top
Methods
Name | Description
AppendElement
 Create a new path by appending a new index value to this path.
Compare
 Compare two paths. This function determines the Sorting behaviour of paths.
CompareTo
 Compare this path to another path. This function determines the Sorting behaviour of paths.
CullElement
 Removes the last index value from the path. If the path is already empty, nothing will happen.
CullFirstElement
 Removes the first index value from the path. If the path is already empty, nothing will happen.
Format
 Format a path.
FromString
 Try to deserialize a GH_Path from a String.
GetHashCode
 Specialized Hash code pattern.
 (Overrides Object.GetHashCode().)
Increment(Int32)
 Increment a specific index in this path by one.
Increment(Int32, Int32)
 Increment a specific index in this path by one.
IsAncestor
 Test another path to see if it is an ancestor of this path. For a path to be considered an ancestor, it must share the initial dimensions.
IsCoincident(Int32[])
 Test to see if this path is coincident with set of integers.
IsCoincident(GH_Path)
 Test to see if this path is coincident with another path.
PrependElement
 Create a new path by prepending a new index value to this path.
Read
 Read this path from an archive.
SplitPathLikeString
 Try to split up a path-like formatted string "{A;B;C}(i)" into component parts.
ToString()
 Concatenates the indices in the path.
 (Overrides Object.ToString().)
ToString(Boolean)
 Concatenates the indices in the path.
Write
 Write this path to an archive.
Top
Operators
Name | Description
Equality
GreaterThan
Inequality
LessThan
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace