Grasshopper SDK
GH_Curve.DuplicateCurve Method
 Create a duplicate of this curve.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Curve DuplicateCurve()
Public Function DuplicateCurve As GH_Curve
Return Value
Type: GH_Curve
See Also
Reference
GH_Curve Class
Grasshopper.Kernel.Types Namespace