Grasshopper SDK
GH_Attributes<T>.ExpireLayout Method
 Expires the entire layout of the attributes. When overridden, implementer must place a call to the base class ExpireLayout().
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void ExpireLayout()
Public Overridable Sub ExpireLayout
Implements
IGH_Attributes.ExpireLayout()
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace