Grasshopper SDK
DataTree<T>.Paths Property
 Gets a list of all the branch paths in this tree.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<GH_Path> Paths { get; }
Public ReadOnly Property Paths As IList(Of GH_Path)
	Get
Property Value
Type: IList<GH_Path>
[Missing <value> documentation for "P:Grasshopper.DataTree`1.Paths"]
See Also
Reference
DataTree<T> Class
Grasshopper Namespace