Grasshopper SDK
GH_Point.GH_PointProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Point>
 Grasshopper.Kernel.Types.GH_Point.GH_PointProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PointProxy : GH_GooProxy<GH_Point>
Public Class GH_PointProxy
	Inherits GH_GooProxy(Of GH_Point)
The GH_Point.GH_PointProxy type exposes the following members.
Constructors
Name | Description
GH_Point.GH_PointProxy
Initializes a new instance of the GH_Point.GH_PointProxy class
Top
Properties
Name | Description
Distance
Referenced
ReferenceID
ReferenceType
TParameterRatio
UVParameterRatio
X
Y
Z
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
SrfRefChanged
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace