Grasshopper SDK
GH_TreeRules.PathOpenBracket Field
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const char PathOpenBracket = '{'
Public Const PathOpenBracket As Char = "{"C
Field Value
Type: Char
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace