Grasshopper SDK
GH_Slider_Obsolete.Value Property
 Gets or sets the current value.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Value { get; set; }
Public Property Value As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider_Obsolete.Value"]
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace