Grasshopper SDK
GH_DocumentObject.OnAttributesChanged Method
 Raises the AttributesChanged event on the toplevel object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnAttributesChanged()
Public Sub OnAttributesChanged
Implements
IGH_DocumentObject.OnAttributesChanged()
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace