Grasshopper SDK
GH_Field.Duplicate Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Goo Duplicate()
Public Function Duplicate As IGH_Goo
Return Value
Type: IGH_Goo
Implements
IGH_Goo.Duplicate()
See Also
Reference
GH_Field Class
Grasshopper.Kernel.Types Namespace