Grasshopper SDK
GH_Integer Constructor
 Blank constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Integer()
Public Sub New
See Also
Reference
GH_Integer Class
GH_Integer Overload
Grasshopper.Kernel.Types Namespace