Grasshopper SDK
IGH_DocumentObject.Obsolete Property
 Gets whether this object is Obsolete.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool Obsolete { get; }
ReadOnly Property Obsolete As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_DocumentObject.Obsolete"]
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace