Grasshopper SDK
GH_Canvas.Graphics Property
 Gets the graphics object with which this Canvas is redrawn. This object only exists during redraws, if you need the Graphics object for this canvas outside of updates, call GetGraphicsObject() instead.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Graphics Graphics { get; }
Public ReadOnly Property Graphics As Graphics
	Get
Property Value
Type: Graphics
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.Graphics"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace