Grasshopper SDK
GH_ColourPicker.AllowNumericInput Property
 Gets or sets whether this colour picker pops up a textbox on channel slider double clicks.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AllowNumericInput { get; set; }
Public Property AllowNumericInput As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_ColourPicker.AllowNumericInput"]
See Also
Reference
GH_ColourPicker Class
Grasshopper.GUI Namespace