Grasshopper SDK
GH_Material.GH_Material_Proxy.Transparency Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Transparency { get; set; }
Public Property Transparency As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Material.GH_Material_Proxy.Transparency"]
See Also
Reference
GH_Material.GH_Material_Proxy Class
Grasshopper.Kernel.Types Namespace