Grasshopper SDK
GH_MaterialPreviewControl.Selected Property
 Gets or sets the Selected state of this preview. Selected previews have thick borders drawn around them.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Selected { get; set; }
Public Property Selected As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MaterialPreviewControl.Selected"]
See Also
Reference
GH_MaterialPreviewControl Class
Grasshopper.GUI Namespace