Grasshopper SDK
GH_Param<T>.AddVolatileDataList Method (GH_Path, List<T>)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AddVolatileDataList(
	GH_Path path,
	List<T> list
)
Public Function AddVolatileDataList (
	path As GH_Path,
	list As List(Of T)
) As Boolean
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
list
Type: System.Collections.Generic.List<T>
Return Value
Type: Boolean
See Also
Reference
GH_Param<T> Class
AddVolatileDataList Overload
Grasshopper.Kernel Namespace