Grasshopper SDK
GH_TypeLib.t_rc_vector3f Field
Rhino.Geometry.Vector3f
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Type t_rc_vector3f
Public Shared t_rc_vector3f As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace