Grasshopper SDK
GH_ComponentParamServer.InputWidth Property
 Gets the width of the largest input parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float InputWidth { get; }
Public ReadOnly Property InputWidth As Single
	Get
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentParamServer.InputWidth"]
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace