Grasshopper SDK
GH_Author.CopyrightReadonly Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string CopyrightReadonly { get; }
Public ReadOnly Property CopyrightReadonly As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Author.CopyrightReadonly"]
Implements
IGH_Author.Copyright
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace