Grasshopper SDK
GH_Gradient.NearestGrip Method (Double)
 Find the nearest grip to a parameter.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int NearestGrip(
	double t
)
Public Function NearestGrip (
	t As Double
) As Integer
Parameters
t
Type: System.Double
Parameter to search from.
Return Value
Type: Int32
The grip nearest to the parameter.
See Also
Reference
GH_Gradient Class
NearestGrip Overload
Grasshopper.GUI.Gradient Namespace