Grasshopper SDK
GH_GeometryGroup.LoadGeometry Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool LoadGeometry()
Public Function LoadGeometry As Boolean
Return Value
Type: Boolean
Implements
IGH_GeometricGoo.LoadGeometry()
See Also
Reference
GH_GeometryGroup Class
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace