Grasshopper SDK
GH_UndoRecord.ExpiresSolution Property
 Gets the solution expiration flag for this event. If True, the solution needs to be recalculated once the entire undo record has been completed.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ExpiresSolution { get; }
Public ReadOnly Property ExpiresSolution As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoRecord.ExpiresSolution"]
See Also
Reference
GH_UndoRecord Class
Grasshopper.Kernel.Undo Namespace