Grasshopper SDK
IGH_SettingFrontend Interface
 Represents a single setting in the Settings UI. Implement this interface to participate in the Grasshopper Settings interface.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_SettingFrontend
Public Interface IGH_SettingFrontend
The IGH_SettingFrontend type exposes the following members.
Properties
Name | Description
Category
 Category of this setting.
Keywords
 Optional keywords for this setting.
Name
 Name of this setting.
Top
Methods
Name | Description
SettingsUI
 Create the winforms UI portion for this setting.
Top
See Also
Reference
Grasshopper.GUI Namespace