Grasshopper SDK
GH_Plane.DuplicatePlane Method
 Create a duplicate of this plane.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Plane DuplicatePlane()
Public Function DuplicatePlane As GH_Plane
Return Value
Type: GH_Plane
See Also
Reference
GH_Plane Class
Grasshopper.Kernel.Types Namespace