Grasshopper SDK
GH_ComponentServer.SetAlias Method
 Sets the aliases for a given target.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetAlias(
	string alias,
	Guid target
)
Public Sub SetAlias (
	alias As String,
	target As Guid
)
Parameters
alias
Type: System.String
Alias to add. If the alias string contains spaces or commas, those will be used to harvest partial aliases. Use a zero-length alias to remove all aliases to the target.
target
Type: System.Guid
Component ID of object that is targeted by the alias.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace