Grasshopper SDK
GH_Format.FormatIntervalValidity Method
 If the point is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatIntervalValidity(
	Interval val,
	string identifier = "Domain",
	bool testSingleton = false,
	bool testDecreasing = false
)
Public Shared Function FormatIntervalValidity (
	val As Interval,
	Optional identifier As String = "Domain",
	Optional testSingleton As Boolean = false,
	Optional testDecreasing As Boolean = false
) As String
Parameters
val
Type: Interval
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
testSingleton (Optional)
Type: System.Boolean
If true, Intervals that have no length are considered invalid.
testDecreasing (Optional)
Type: System.Boolean
If true, Intervals that are decreasing are considered invalid.
Return Value
Type: String
A string describing why the point is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace