Grasshopper SDK
Folders.ShowFolderInExplorer Method
 Open a specific folder in Windows Explorer.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void ShowFolderInExplorer(
	string folder
)
Public Shared Sub ShowFolderInExplorer (
	folder As String
)
Parameters
folder
Type: System.String
See Also
Reference
Folders Class
Grasshopper Namespace