Grasshopper SDK
GH_DocUndoEventArgs Class
 These arguments are passed along with UndoStateChanged events on GH_Document.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_DocUndoEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocUndoEventArgs : EventArgs
Public Class GH_DocUndoEventArgs
	Inherits EventArgs
The GH_DocUndoEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document that raised the event.
Operation
 Gets the type of undo operation that caused this event.
Record
 Gets the UndoRecord pertaining to this event. Not every Event type has a single record associated with it so be sure to test for null.
Top
See Also
Reference
Grasshopper.Kernel Namespace