Grasshopper SDK
GH_DigitScroller Class
 Provides the standard Grasshopper Digit scroller as a winforms Control.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 GH_TextInputBaseControl
 Grasshopper.GUI.GH_DigitScroller
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DigitScroller : GH_TextInputBaseControl
Public Class GH_DigitScroller
	Inherits GH_TextInputBaseControl
The GH_DigitScroller type exposes the following members.
Constructors
Name | Description
GH_DigitScroller
Initializes a new instance of the GH_DigitScroller class
Top
Properties
Name | Description
AllowRadixDrag
 Gets or sets whether the radix symbol can be dragged.
AllowTextInput
 Gets or sets whether the control accepts text input override.
Amplify
 Gets or sets whether vertical mouse movement ought to be amplified.
DecimalPlaces
 Gets or sets the number of decimal places.
DigitAlign
 Gets or sets the digit align mode
Digits
 Gets or sets the number of digits displayed in the scroller.
DigitScroller
 Gets the internal scroller object.
Epsilon
 Gets the smallest possible change with the current settings.
MaximumValue
 Gets or sets the upper bound of the scroll value.
MinimumValue
 Gets or sets the lower bound of the scroll value.
Prefix
 Gets or sets the prefix text
Presets
 Gets the internal object that maintains numeric presets.
Radix
 Gets or sets the radix point index.
Suffix
 Gets or sets the prefix text
Value
 Gets or sets the value of this scroller.
Top
Methods
Name | Description
Input_Assign |  (Overrides GH_TextInputBaseControl.Input_Assign(String).)
Input_Parse |  (Overrides GH_TextInputBaseControl.Input_Parse(String).)
Input_Supply |  (Overrides GH_TextInputBaseControl.Input_Supply().)
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
Top
Events
Name | Description
ValueChanged
Top
See Also
Reference
Grasshopper.GUI Namespace