Grasshopper SDK
GH_SliderAccuracy Enumeration
 Enumerates the possible numeric slider accuracies.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_SliderAccuracy
Public Enumeration GH_SliderAccuracy
Members
Member name | Value | Description
Float | 0 |  Slider supports floating point accuracy.
Integer | 1 |  Slider supports integer accuracy.
Even | 2 |  Slider only supports even integers.
Odd | 3 |  Slider only supports odd integers.
See Also
Reference
Grasshopper.GUI.Base Namespace