Grasshopper SDK
GH_MouseTracker Constructor (Point, Object)
 Create a new mouse tracker.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MouseTracker(
	Point initialPosition,
	Object tag
)
Public Sub New (
	initialPosition As Point,
	tag As Object
)
Parameters
initialPosition
Type: System.Drawing.Point
First point in tracker.
tag
Type: System.Object
First tag in tracker.
See Also
Reference
GH_MouseTracker Class
GH_MouseTracker Overload
Grasshopper.GUI Namespace