Grasshopper SDK
GH_Plane.CastFrom Method
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CastFrom(
	Object source
)
Public Overrides Function CastFrom (
	source As Object
) As Boolean
Parameters
source
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
GH_Plane Class
Grasshopper.Kernel.Types Namespace