Grasshopper SDK
GH_Canvas.AutoSaveDocument Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AutoSaveDocument(
	GH_AutoSaveTrigger trigger
)
Public Sub AutoSaveDocument (
	trigger As GH_AutoSaveTrigger
)
Parameters
trigger
Type: Grasshopper.Kernel.GH_AutoSaveTrigger
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace