Grasshopper SDK
GH_SettingsServer.GetValue Method (String, Double)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double GetValue(
	string key,
	double default
)
Public Function GetValue (
	key As String,
	default As Double
) As Double
Parameters
key
Type: System.String
default
Type: System.Double
Return Value
Type: Double
See Also
Reference
GH_SettingsServer Class
GetValue Overload
Grasshopper.Kernel Namespace