Grasshopper SDK
GH_Path.Format Method
 Format a path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Format(
	string format_provider,
	string separator
)
Public Function Format (
	format_provider As String,
	separator As String
) As String
Parameters
format_provider
Type: System.String
The string describing the format. You are allowed to use {0} as a format placeholder. The placeholder will be filled up with a semi-colon separated list: 0;0;2;4
separator
Type: System.String
Character to use for element separators. The default separator is a semi-colon.
Return Value
Type: String
Formatted string.
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace