Grasshopper SDK
GH_TreeFilter.SplitStringWithExpressions Method
 Split a string into segments using level-aware split. This method throws exceptions if the input string is not correctly formatted.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<string> SplitStringWithExpressions(
	string text,
	char separator
)
Public Shared Function SplitStringWithExpressions (
	text As String,
	separator As Char
) As List(Of String)
Parameters
text
Type: System.String
String to split.
separator
Type: System.Char
Splitting character.
Return Value
Type: List<String>
A list of string segments.
Exceptions
Exception | Condition
GH_BracketMismatchException | Thrown when the opening and closing brackets don't add up.
GH_StringMismatchException | Thrown when the string delimeter symbols don't add up.
See Also
Reference
GH_TreeFilter Class
Grasshopper.Kernel.Data Namespace