Grasshopper SDK
GH_Interval2D.CastTo<T> Method (T)
 Local to Remote caster function. this stuff is complex, don't concern yourself with casting logic.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CastTo<T>(
	ref T target
)
Public Overrides Function CastTo(Of T) (
	ByRef target As T
) As Boolean
Parameters
target
Type: T
Type Parameters
T
Return Value
Type: Boolean
See Also
Reference
GH_Interval2D Class
CastTo Overload
Grasshopper.Kernel.Types Namespace