Grasshopper SDK
GH_Author.PhoneReadonly Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string PhoneReadonly { get; }
Public ReadOnly Property PhoneReadonly As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Author.PhoneReadonly"]
Implements
IGH_Author.Phone
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace