Grasshopper SDK
Tracing.Assert Method (Guid, String)
 Display a typical assert dialog with stack information.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void Assert(
	Guid assert_id,
	string message
)
Public Shared Sub Assert (
	assert_id As Guid,
	message As String
)
Parameters
assert_id
Type: System.Guid
ID of assert message. Every assert must have a unique ID so individual messages can be ignored.
message
Type: System.String
The text to display as the assert message.
See Also
Reference
Tracing Class
Assert Overload
Grasshopper Namespace