Grasshopper SDK
GH_Material._rdkMaterialId Field
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected Guid _rdkMaterialId
Protected _rdkMaterialId As Guid
Field Value
Type: Guid
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace