Grasshopper SDK
GH_AssemblyInfo.Description Property
 Gets the human readable description of this assembly. Return null if you do not wish to associate a description with this assembly.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string Description { get; }
Public Overridable ReadOnly Property Description As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.Description"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace