Grasshopper SDK
GH_Component.Locked Property
 Gets or sets the Locked state for this Component. This also sets locked states for all input and output parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool Locked { get; set; }
Public Overrides Property Locked As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.Locked"]
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace