Grasshopper SDK
GH_GraphicsUtil.EtchFadingHorizontal Method
 Draw an etched line with fading on the extremes.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void EtchFadingHorizontal(
	Graphics g,
	int x0,
	int x1,
	int y,
	int alphaLight = 200,
	int alphaDark = 35
)
Public Shared Sub EtchFadingHorizontal (
	g As Graphics,
	x0 As Integer,
	x1 As Integer,
	y As Integer,
	Optional alphaLight As Integer = 200,
	Optional alphaDark As Integer = 35
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
x0
Type: System.Int32
Left x coordinate of etch.
x1
Type: System.Int32
Right x coordinate of etch.
y
Type: System.Int32
Y coordinate of etch.
alphaLight (Optional)
Type: System.Int32
Transparancy of bright etch line.
alphaDark (Optional)
Type: System.Int32
Transparency of dark etch line.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace