Grasshopper SDK
GH_RenderArgs.Viewport Property
 Gets the viewport details involved in this rendering.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public ViewportInfo Viewport { get; }
Public ReadOnly Property Viewport As ViewportInfo
	Get
Property Value
Type: ViewportInfo
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RenderArgs.Viewport"]
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace