Grasshopper SDK
IGH_StateTag.StateDescription Property
 Gets or sets the state description of this tag. The state description appears in the Tooltip info field.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string StateDescription { get; set; }
Property StateDescription As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_StateTag.StateDescription"]
See Also
Reference
IGH_StateTag Interface
Grasshopper.Kernel Namespace