Grasshopper SDK
GH_DragInfo.Point_Drag Property
 Gets the cursor location at the current moment.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point Point_Drag { get; }
Public ReadOnly Property Point_Drag As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DragInfo.Point_Drag"]
See Also
Reference
GH_DragInfo Class
Grasshopper.GUI Namespace