Grasshopper SDK
GH_DigitScroller Constructor
Initializes a new instance of the GH_DigitScroller class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DigitScroller()
Public Sub New
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace