Grasshopper SDK
GH_Box.DuplicateBox Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Box DuplicateBox()
Public Function DuplicateBox As GH_Box
Return Value
Type: GH_Box
See Also
Reference
GH_Box Class
Grasshopper.Kernel.Types Namespace