Grasshopper SDK
GH_DocDiagramPainter.Size Property
 Gets the width and height (in pixels) of this diagram image.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Size Size { get; }
Public ReadOnly Property Size As Size
	Get
Property Value
Type: Size
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_DocDiagramPainter.Size"]
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace