Grasshopper SDK
GH_Mesh.GH_MeshProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Mesh>
 Grasshopper.Kernel.Types.GH_Mesh.GH_MeshProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_MeshProxy : GH_GooProxy<GH_Mesh>
Public Class GH_MeshProxy
	Inherits GH_GooProxy(Of GH_Mesh)
The GH_Mesh.GH_MeshProxy type exposes the following members.
Constructors
Name | Description
GH_Mesh.GH_MeshProxy
Initializes a new instance of the GH_Mesh.GH_MeshProxy class
Top
Properties
Name | Description
Area
EdgeCount
FaceCount
Manifold
ObjectID
Solid
VertexCount
Volume
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace