Grasshopper SDK
GH_DocumentEventServer.GuidTableRefCount Property
 Gets the number of stored ids in the Guid Table.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int GuidTableRefCount { get; }
Public ReadOnly Property GuidTableRefCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentEventServer.GuidTableRefCount"]
See Also
Reference
GH_DocumentEventServer Class
Grasshopper.Kernel Namespace