Grasshopper SDK
GH_TooltipComponent.PopulateTooltip Event
 This event is raised just prior to the tooltip display.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_TooltipComponent.PopulateTooltipEventHandler PopulateTooltip
Public Event PopulateTooltip As GH_TooltipComponent.PopulateTooltipEventHandler
Value
Type: Grasshopper.GUI.GH_TooltipComponent.PopulateTooltipEventHandler
See Also
Reference
GH_TooltipComponent Class
Grasshopper.GUI Namespace