Grasshopper SDK
GH_ComponentServer.ObjectProxies Property
 Returns a list of all cached GH_ObjectProxy instances.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<IGH_ObjectProxy> ObjectProxies { get; }
Public ReadOnly Property ObjectProxies As IList(Of IGH_ObjectProxy)
	Get
Property Value
Type: IList<IGH_ObjectProxy>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.ObjectProxies"]
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace