Grasshopper SDK
IGH_IndexRule Interface
 Interface for index rules. An index rule is a way to determine whether a specific integer is considered valid, invalid or neutral. Index rules are used for selecting elements in DataTrees.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_IndexRule
Public Interface IGH_IndexRule
The IGH_IndexRule type exposes the following members.
Methods
Name | Description
Evaluate
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace