Grasshopper SDK
GH_DragInfo.Box_Drag Property
 Gets the dimensions of the box as a result of the dragging op.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle Box_Drag { get; }
Public ReadOnly Property Box_Drag As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DragInfo.Box_Drag"]
See Also
Reference
GH_DragInfo Class
Grasshopper.GUI Namespace