Grasshopper SDK
GH_ZuiAction Class
 Basic implementation of IGH_ZuiAction.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_ZuiAction
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_ZuiAction : IGH_ZuiAction
Public MustInherit Class GH_ZuiAction
	Implements IGH_ZuiAction
The GH_ZuiAction type exposes the following members.
Constructors
Name | Description
GH_ZuiAction
Initializes a new instance of the GH_ZuiAction class
Top
Properties
Name | Description
Name
TooltipEnabled
Top
Methods
Name | Description
IsTooltipRegion
Perform
SetupTooltip
Top
See Also
Reference
Grasshopper.Kernel Namespace