Grasshopper SDK
GH_MeshFace Constructor (Int32, Int32, Int32)
 Create a triangular mesh face from 3 corners indices.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MeshFace(
	int nA,
	int nB,
	int nC
)
Public Sub New (
	nA As Integer,
	nB As Integer,
	nC As Integer
)
Parameters
nA
Type: System.Int32
First corner index
nB
Type: System.Int32
Second corner index
nC
Type: System.Int32
Third corner index
See Also
Reference
GH_MeshFace Class
GH_MeshFace Overload
Grasshopper.Kernel.Types Namespace