Grasshopper SDK
GH_Convert.ToSurface Method
 Convert data into Rhino.Geometry.Surface.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToSurface(
	Object data,
	ref Surface rc,
	GH_Conversion conversion_level
)
Public Shared Function ToSurface (
	data As Object,
	ByRef rc As Surface,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Surface
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace