Grasshopper SDK
GH_Component.ComputeData Method
 Compute all data and fill out all output parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void ComputeData()
Public Overrides Sub ComputeData
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace