Grasshopper SDK
GH_FileSystemEventServer.RemoveWatcher Method (Object, String)
 Remove all watchers that are linked to a specific object and a specific file path.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RemoveWatcher(
	Object owner,
	string path
)
Public Shared Sub RemoveWatcher (
	owner As Object,
	path As String
)
Parameters
owner
Type: System.Object
path
Type: System.String
See Also
Reference
GH_FileSystemEventServer Class
RemoveWatcher Overload
Grasshopper.Kernel Namespace