Grasshopper SDK
GH_Component.Hidden Property
 Gets or sets the hidden flag for this component. Does not affect Hidden flags on parameters associated with this component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Hidden { get; set; }
Public Property Hidden As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.Hidden"]
Implements
IGH_PreviewObject.Hidden
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace