Grasshopper SDK
GH_Canvas.GH_ImageSettings.TileSize Property
 Gets the default tile size for high-resolution export. This is a constant value.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Size TileSize { get; }
Public Shared ReadOnly Property TileSize As Size
	Get
Property Value
Type: Size
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.TileSize"]
See Also
Reference
GH_Canvas.GH_ImageSettings Class
Grasshopper.GUI.Canvas Namespace