Grasshopper SDK
GH_PersistentParam<T>.Menu_CustomSingleValueItem Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual ToolStripMenuItem Menu_CustomSingleValueItem()
Protected Overridable Function Menu_CustomSingleValueItem As ToolStripMenuItem
Return Value
Type: ToolStripMenuItem
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace