Grasshopper SDK
GH_ValueProxy<T>.IsValid Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool IsValid { get; }
Public Overridable ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ValueProxy`1.IsValid"]
Implements
IGH_ValueProxy.IsValid
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace