Grasshopper SDK
GH_Curve.LoadGeometry Method (RhinoDoc)
 If the curve is referenced and not yet loaded, attempts to load the curve.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool LoadGeometry(
	RhinoDoc doc
)
Public Overrides Function LoadGeometry (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: RhinoDoc
Return Value
Type: Boolean
True if the curve is loaded (or if it was already loaded), False on failure.
See Also
Reference
GH_Curve Class
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace