Grasshopper SDK
GH_RuleResult Enumeration
 Enumerates the possible opinions a rule can have.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_RuleResult
Public Enumeration GH_RuleResult
Members
Member name | Value | Description
NoOpinion | 0 |  The rule does not prohibit or enforce any behaviour.
Include | 1 |  The rule claims a certain index ought to be included.
Exclude | -1 |  The rule claims a certain index ought to be exluded.
See Also
Reference
Grasshopper.Kernel.Data Namespace