Grasshopper SDK
IGH_Goo.IsValid Property
 Gets a value indicating whether or not the current value is valid.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsValid { get; }
ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_Goo.IsValid"]
See Also
Reference
IGH_Goo Interface
Grasshopper.Kernel.Types Namespace