Grasshopper SDK
IGH_TypeHint Interface
 Represents conversion logic for a certain data type.
Namespace: Grasshopper.Kernel.Parameters
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_TypeHint
Public Interface IGH_TypeHint
The IGH_TypeHint type exposes the following members.
Properties
Name | Description
HintID
 Unique ID for every type of Hint.
TypeName
 Name of target Type
Top
Methods
Name | Description
Cast
 Apply conversion logic to a specific object. This function should not throw exceptions.
Top
See Also
Reference
Grasshopper.Kernel.Parameters Namespace