Grasshopper SDK
GH_Document.DestroyAttributeCache Method
 Destroys the Attribute cache. Call this function whenever you do something which might affect attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DestroyAttributeCache()
Public Sub DestroyAttributeCache
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace