Grasshopper SDK
GH_Canvas.OnViewportChanged Method
 Ensure the canvas and document viewport data are synchronised and raises the ViewportChanged event.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnViewportChanged()
Public Sub OnViewportChanged
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace