Grasshopper SDK
GH_CanvasDocumentChangedEventArgs Class
 These arguments are used in the DocumentChanged event on GH_Canvas.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.GUI.Canvas.GH_CanvasDocumentChangedEventArgs
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_CanvasDocumentChangedEventArgs : EventArgs
Public Class GH_CanvasDocumentChangedEventArgs
	Inherits EventArgs
The GH_CanvasDocumentChangedEventArgs type exposes the following members.
Constructors
Name | Description
GH_CanvasDocumentChangedEventArgs
Initializes a new instance of the GH_CanvasDocumentChangedEventArgs class
Top
Properties
Name | Description
NewDocument
 Gets the document which has just been loaded into the canvas.
OldDocument
 Gets the document which was previously loaded into the canvas.
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace