Grasshopper SDK
IGH_EventConsumer.IsRelevantEvent Method
 Whenever a new object event is handled, this function will be called to determine whether it will cause an update.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsRelevantEvent(
	RhinoObject obj
)
Function IsRelevantEvent (
	obj As RhinoObject
) As Boolean
Parameters
obj
Type: RhinoObject
Object that is the pivot of the event.
Return Value
Type: Boolean
True if the object should cause an update, false if not.
See Also
Reference
IGH_EventConsumer Interface
Grasshopper.Kernel Namespace