Grasshopper SDK
Scale Constructor (Plane, Double, Double, Double)
Initializes a new instance of the Scale class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Scale(
	Plane frame,
	double xscale,
	double yscale,
	double zscale
)
Public Sub New (
	frame As Plane,
	xscale As Double,
	yscale As Double,
	zscale As Double
)
Parameters
frame
Type: Plane
xscale
Type: System.Double
yscale
Type: System.Double
zscale
Type: System.Double
See Also
Reference
Scale Class
Scale Overload
Grasshopper.Kernel.Types.Transforms Namespace