Grasshopper SDK
GH_Gradient.OnGradientChangedIntermediate Method
 Raise the GradientChanged event.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnGradientChangedIntermediate()
Public Sub OnGradientChangedIntermediate
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace