Grasshopper SDK
IGH_Attributes.PathName Property
 Get a description of the location of these attributes within the local attribute tree.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string PathName { get; }
ReadOnly Property PathName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.PathName"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace