Grasshopper SDK
GH_SliderBase.SnapDistance Property
 Gets or sets the snap distance in absolute values.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal SnapDistance { get; set; }
Public Property SnapDistance As Decimal
	Get
	Set
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.SnapDistance"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace