Grasshopper SDK
GH_GraphicsUtil.RenderColourIcon Method
 Render a colour icon into a graphics context. A colour icon contains a black outer and white inner edge.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderColourIcon(
	Graphics g,
	Rectangle rec,
	Color colour
)
Public Shared Sub RenderColourIcon (
	g As Graphics,
	rec As Rectangle,
	colour As Color
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
rec
Type: System.Drawing.Rectangle
Rectangle describing icon dimensions.
colour
Type: System.Drawing.Color
Colour for icon.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace