Grasshopper SDK
GH_MemoryBitmap Constructor (Bitmap, WrapMode)
 Constructor with Wrap mode override.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MemoryBitmap(
	Bitmap bitmap,
	WrapMode wrap
)
Public Sub New (
	bitmap As Bitmap,
	wrap As WrapMode
)
Parameters
bitmap
Type: System.Drawing.Bitmap
Bitmap to operate on. This bitmap will be in an invalid state until the Release() function has been called.
wrap
Type: System.Drawing.Drawing2D.WrapMode
Wrap mode to use during sampling.
See Also
Reference
GH_MemoryBitmap Class
GH_MemoryBitmap Overload
Grasshopper.Kernel Namespace