Grasshopper SDK
GH_Point.CreateFromPointObject Method
 Create a new point geometry instance based on point object ID
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateFromPointObject(
	Guid id
)
Public Sub CreateFromPointObject (
	id As Guid
)
Parameters
id
Type: System.Guid
The identifier of the point object
Remarks
This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace