Grasshopper SDK
GH_Param<T>.RemoveAllSources Method
 Remove all sources from this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void RemoveAllSources()
Public Overridable Sub RemoveAllSources
Implements
IGH_Param.RemoveAllSources()
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace