Grasshopper SDK
GH_Format.FormatCurveValidity Method
 If the curve is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatCurveValidity(
	Curve val,
	string identifier = "Curve"
)
Public Shared Function FormatCurveValidity (
	val As Curve,
	Optional identifier As String = "Curve"
) As String
Parameters
val
Type: Curve
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the curve is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace