Grasshopper SDK
GH_PaletteStyle Class
 Contains all the colours for a single capsule palette.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Canvas.GH_PaletteStyle
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PaletteStyle
Public Class GH_PaletteStyle
The GH_PaletteStyle type exposes the following members.
Constructors
Name | Description
GH_PaletteStyle(Color)
 Construct a new GH_Box_Palette_Colours instance with a single base colour.
GH_PaletteStyle(Color, Color)
 Construct a new GH_Box_Palette_Colours instance.
GH_PaletteStyle(Color, Color, Color)
 Construct a new GH_Box_Palette_Colours instance.
Top
Properties
Name | Description
Edge
 Gets or sets the edge of this style.
Fill
 Gets or sets the fill of this style.
Text
 Gets or sets the text of this style.
Top
Methods
Name | Description
CreateBrush
 Create a fill brush. At low zoom levels the brush will be solid colour, at medium to high zoom levels the brush will have a gradient.
Top
Fields
Name | Description
m_edge
m_fill
m_text
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace