Grasshopper SDK
GH_Document.ObjectCount Property
 Returns the total number of top-level objects in the document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ObjectCount { get; }
Public ReadOnly Property ObjectCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.ObjectCount"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace