Grasshopper SDK
GH_FadeAnimation.Evaluate Method (GH_Canvas, Single)
 Reevaluate the fade animation parameters. You should call this method from within the Render method of your attributes. If an animation is currently in progress a redraw of the canvas will be scheduled, whether or not the attributes are actually visible on the canvas. You should therefore only call this method if your attributes are already drawing themselves.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Evaluate(
	GH_Canvas canvas,
	float value
)
Public Sub Evaluate (
	canvas As GH_Canvas,
	value As Single
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas currently drawing in.
value
Type: System.Single
See Also
Reference
GH_FadeAnimation Class
Evaluate Overload
Grasshopper.GUI Namespace