Grasshopper SDK
Projection Constructor (Plane)
Initializes a new instance of the Projection class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Projection(
	Plane plane
)
Public Sub New (
	plane As Plane
)
Parameters
plane
Type: Plane
See Also
Reference
Projection Class
Projection Overload
Grasshopper.Kernel.Types.Transforms Namespace