Grasshopper SDK
GH_RuntimeFile.TagSeeAlso Field
 String tag used to identify See Also collections in documentation source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagSeeAlso = "SEEALSO"
Public Const TagSeeAlso As String = "SEEALSO"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace