Grasshopper SDK
DataTree<T>.Clear Method
 Clears the entire tree.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
DataTree<T> Class
Grasshopper Namespace