Grasshopper SDK
GH_Document.Attributes Property
 Returns a list of all the attributes in this document. This includes attributes for nested objects such as input or output parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<IGH_Attributes> Attributes { get; }
Public ReadOnly Property Attributes As IList(Of IGH_Attributes)
	Get
Property Value
Type: IList<IGH_Attributes>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.Attributes"]
Remarks
If the attribute cache is empty, it will be rebuild. Hence, this could be quite an expensive call to make.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace