Grasshopper SDK
CentralSettings.CanvasFancyWiresChanged Event
 Raised whenever the CanvasFancyWires setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.CanvasFancyWiresChangedEventHandler CanvasFancyWiresChanged
Public Shared Event CanvasFancyWiresChanged As CentralSettings.CanvasFancyWiresChangedEventHandler
Value
Type: Grasshopper.CentralSettings.CanvasFancyWiresChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace