Grasshopper SDK
GH_Gradient Constructor (GH_Gradient)
 Create a duplicate of another gradient.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Gradient(
	GH_Gradient other
)
Public Sub New (
	other As GH_Gradient
)
Parameters
other
Type: Grasshopper.GUI.Gradient.GH_Gradient
Gradient to duplicate.
See Also
Reference
GH_Gradient Class
GH_Gradient Overload
Grasshopper.GUI.Gradient Namespace