Grasshopper SDK
GH_RenderArgs.PluginId Property
 Gets the render plugin id that is about to render this geometry.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid PluginId { get; }
Public ReadOnly Property PluginId As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RenderArgs.PluginId"]
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace