Grasshopper SDK
GH_HorizontalSeparator Methods
The GH_HorizontalSeparator type exposes the following members.
Methods
Name | Description
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
Top
See Also
Reference
GH_HorizontalSeparator Class
Grasshopper.GUI Namespace