Grasshopper SDK
GH_FontServer.ConsoleFamilyChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ConsoleFamilyChangedEventHandler()
Public Delegate Sub ConsoleFamilyChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace