Grasshopper SDK
GH_Canvas.DocumentChanged Event
 This event is raised whenever a different document is loaded into this canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.DocumentChangedEventHandler DocumentChanged
Public Event DocumentChanged As GH_Canvas.DocumentChangedEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.DocumentChangedEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace