Grasshopper SDK
GH_ActiveObject.ClearRuntimeMessages Method
 Destroy all warning and error lists
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void ClearRuntimeMessages()
Public Overridable Sub ClearRuntimeMessages
Implements
IGH_ActiveObject.ClearRuntimeMessages()
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace