Grasshopper SDK
IGH_ObjectProxy.Exposure Property
 Gets or sets the Exposure of the target object. Only set the exposure if you know what you are doing.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_Exposure Exposure { get; set; }
Property Exposure As GH_Exposure
	Get
	Set
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ObjectProxy.Exposure"]
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace