Grasshopper SDK
IGH_DocumentObject.Icon_24x24 Property
 The icon associated with this object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Bitmap Icon_24x24 { get; }
ReadOnly Property Icon_24x24 As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_DocumentObject.Icon_24x24"]
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace