Grasshopper SDK
GH_DocumentObject.IsolateObject Method
 Destroy all connections to other objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void IsolateObject()
Public Overridable Sub IsolateObject
Implements
IGH_DocumentObject.IsolateObject()
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace