Grasshopper SDK
GH_Param<T>.CollectVolatileData_FromSources Method
 This method collects volatile data from all the source parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void CollectVolatileData_FromSources()
Protected Overridable Sub CollectVolatileData_FromSources
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace