Grasshopper SDK
SliderSnapRange.CanMerge Method
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool CanMerge(
	SliderSnapRange other
)
Public Function CanMerge (
	other As SliderSnapRange
) As Boolean
Parameters
other
Type: Grasshopper.GUI.Base.SliderSnapRange
Return Value
Type: Boolean
See Also
Reference
SliderSnapRange Structure
Grasshopper.GUI.Base Namespace