Grasshopper SDK
GH_ComponentServer.SaveAliases Method
 Save the alias table to the settings directory. Use this function if you change the alias table while ignoring usual channels.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SaveAliases()
Public Sub SaveAliases
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace