Grasshopper SDK
GH_Document.Enabled Property
 Gets or sets the enabled state for this document. Enabled documents respond to events and display their previews in the Rhino viewport.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.Enabled"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace