Grasshopper SDK
GH_Skin.LoadSkin Method
 Instantiate all palette and gui defaults. This function reads the colour values out of grasshopper_gui.xml settings database if it exists.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void LoadSkin()
Public Shared Sub LoadSkin
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace