Grasshopper SDK
GH_IndexRange Structure
 Represents a range of indices.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public struct GH_IndexRange : GH_ISerializable
Public Structure GH_IndexRange
	Implements GH_ISerializable
The GH_IndexRange type exposes the following members.
Constructors
Name | Description
GH_IndexRange(Int32)
 Create a new singular range.
GH_IndexRange(Int32, Int32)
 Create a new range.
Top
Properties
Name | Description
Index0
 Gets the first index in the range.
Index1
 Gets the last index in the range.
InvalidRange
 Gets the predefined invalid range.
IsSingular
 Gets whether the range has zero length.
IsValid
 Gets whether this range is valid.
Length
 Gets the length of the range.
MaxValue
Top
Methods
Name | Description
AdjacentTo
 Tests whether this range is adjacent to another.
Contains(Int32)
 Tests whether a specified index is defined by this range.
Contains(GH_IndexRange)
 Tests whether a specified range is entirely contained within this range.
Intersection
 Create the intersection between two ranges.
IntersectsWith
 Tests whether certain indices are described by both this and another range.
Read
Split
 Split a range into two using an integer index.
ToString |  (Overrides ValueType.ToString().)
Union
 Create a range which contains both input ranges.
Write
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace