Grasshopper SDK
IGH_ActiveObject.CollectData Method
 This function is called whenever the object is required to collect all data. Either from Persistent records, from source params or whatever. This step is only performed if the phase flag is Blank or Failed. Upon completion, the phase flag will be set to Collected
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void CollectData()
Sub CollectData
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace