Grasshopper SDK
GH_UndoRecord.Name Property
 Gets or sets the name of the undo record (as displayed in the menu)
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoRecord.Name"]
See Also
Reference
GH_UndoRecord Class
Grasshopper.Kernel.Undo Namespace