Grasshopper SDK
GH_LonLatCoordinate.ScriptVariable Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Object ScriptVariable()
Public Function ScriptVariable As Object
Return Value
Type: Object
Implements
IGH_Goo.ScriptVariable()
See Also
Reference
GH_LonLatCoordinate Class
Grasshopper.Kernel.Types Namespace