Grasshopper SDK
GH_TagArtist.ID Property
 Gets the ID of this TagArtist object.
Namespace: Grasshopper.GUI.Canvas.TagArtists
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid ID { get; }
Public ReadOnly Property ID As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.TagArtists.GH_TagArtist.ID"]
Implements
IGH_TagArtist.ID
See Also
Reference
GH_TagArtist Class
Grasshopper.GUI.Canvas.TagArtists Namespace