Grasshopper SDK
GH_DocObjectEventArgs.Object Property
 Gets the object to which this event pertains.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_DocumentObject this[
	int index
] { get; }
Public ReadOnly Default Property Object (
	index As Integer
) As IGH_DocumentObject
	Get
Parameters
index
Type: System.Int32
Property Value
Type: IGH_DocumentObject
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocObjectEventArgs.Object(System.Int32)"]
See Also
Reference
GH_DocObjectEventArgs Class
Grasshopper.Kernel Namespace