Grasshopper SDK
GH_Convert.CommonObjectToByteArray Method
 Convert a RhinoCommon object into a compressed byte-array using safe Rhino 4.0 OpenNurbs serialization.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static byte[] CommonObjectToByteArray(
	CommonObject data
)
Public Shared Function CommonObjectToByteArray (
	data As CommonObject
) As Byte()
Parameters
data
Type: CommonObject
Object to serialize.
Return Value
Type: Byte[]
A byte array representing the object or null on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace