Grasshopper SDK
GH_Param<T>.VolatileDataCount Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int VolatileDataCount { get; }
Public ReadOnly Property VolatileDataCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.VolatileDataCount"]
Implements
IGH_Param.VolatileDataCount
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace