Grasshopper SDK
GH_Gradient.NormalizeGrips Method
 Normalize all grips. This will scale all grip parameters so that the full gradient extend equals 0~1.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void NormalizeGrips()
Public Sub NormalizeGrips
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace