Grasshopper SDK
GH_SliderBase Class
 Provides Numeric slider GUI not tied to a control-handle.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Base.GH_TextBoxInputBase
 Grasshopper.GUI.Base.GH_SliderBase
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_SliderBase : GH_TextBoxInputBase
Public Class GH_SliderBase
	Inherits GH_TextBoxInputBase
The GH_SliderBase type exposes the following members.
Constructors
Name | Description
GH_SliderBase
Initializes a new instance of the GH_SliderBase class
Top
Properties
Name | Description
Bounds
 Gets or sets the bounds of the slider.
 (Overrides GH_TextBoxInputBase.Bounds.)
ControlBackColour
 Gets or sets the BackColour for this slider control.
ControlEdgeColour
 Gets or sets the EdgeColor for this slider control.
ControlShadowColour
 Gets or sets the Shadow colour for this control.
DecimalPlaces
 Gets or sets the number of decimal places allowed for floating point type sliders. Valid values between zero and 12.
DrawControlBackground
 Gets or sets whether the background of the slider should be drawn.
DrawControlBorder
 Gets or sets whether the border of the slider should be drawn.
DrawControlShadows
 Gets or sets whether the drop shadows of the slider should be drawn.
Epsilon
 Gets the smallest value change supported by the current slider properties.
Font
 Gets or sets the font for this slider.
 (Overrides GH_TextBoxInputBase.Font.)
FormatMask
 Gets or sets the string format mask to use for the display. Should contain at least one "{0}" element.
Grip
 Gets the box of the current grip. If the slider value/limits are not set up correctly then this rectangle may well be outside of the bounds. If the limits are coincident, this will fail (divide by zero).
GripBottomColour
 Gets or sets the fill colour for the bottom edge of the slider grip.
GripDisplay
 Gets or sets how the slider grip (or thumb) is drawn.
GripEdgeColour
 Gets or sets the edge colour for the slider grip.
GripText
 Gets the text that will be drawn on the slider.
GripTextPure
 Gets the text format of the number of this slider value.
GripTopColour
 Gets or sets the fill colour for the top edge of the slider grip.
GripWidth
 Gets an estimate of the maximum number of pixels taken up by the grip. This property depends on many different factors, though should remain constant when other properties are not changed. If the Font hasn't been specified, the default Windows.Forms.Control font is used.
Maximum
 Gets or sets the upper limit of the slider.
Minimum
 Gets or sets the lower limit of the slider.
NormalizedValue
 Gets or sets the normalized value within the slider domain.
Padding
 Gets or sets the padding around the slider border.
Rail
 Gets the shape of the rail. The height of the rectangle will be zero, but the y-position will be rounded to integer precision.
RailBrightColour
 Gets or sets the bright colour used to draw rails and ticks.
RailDarkColour
 Gets or sets the dark colour used to draw rails and ticks.
RailDisplay
 Gets or sets how the slider rail (or track) is drawn.
RailEmptyColour
 Gets or sets the fill colour for the empty portion of the rail.
RailFullColour
 Gets or sets the fill colour for the full portion of the rail.
RaiseEvents
 Gets or sets a value indicating whether this slider raises the ValueChanged event.
RenderDelegate_Background
 Gets or sets the delegate called after the background of the slider has been drawn.
RenderDelegate_Border
 Gets or sets the delegate called after the border of the slider has been drawn.
RenderDelegate_Grip
 Gets or sets the delegate called after the grip of the slider has been drawn.
RenderDelegate_Rail
 Gets or sets the delegate called after the rail of the slider has been drawn.
RenderDelegate_Ticks
 Gets or sets the delegate called after the ticks of the slider have been drawn.
ShadowSize
 Gets or sets the size of the border shadow along all edges of the box.
SnapDistance
 Gets or sets the snap distance in absolute values.
TextColour
 Gets or sets the fill colour for the slider text.
TextInputHandlerDelegate
 Gets or sets the custom handler for text input. If you do not set a custom handler the default behaviour will be used.
TickCount
 Gets or sets the number of ticks displayed.
TickDisplay
 Gets or sets how the slider ticks are drawn.
TickFrequency
 Gets or sets the frequency of large ticks vs small ticks.
Ticks
 Gets a list of all the tick offset x positions.
Type
 Gets or sets the accuracy type of the slider.
Value
 Gets or sets the value of the slider.
ValueF
 Gets or sets the value of the slider in single precision.
Top
Methods
Name | Description
FixDomain
 Fix the limits of the slider. Limits will be rounded according to slider type and accuracy. Also, a minimum range for all types is ensured.
FixValue
 Fix the value of the slider. The value will be rounded according to slider type and accuracy. Also, the value will be clipped to the limits. Before you call this function, ensure the limits are set up correctly.
HandleTextInputAccepted |  (Overrides GH_TextBoxInputBase.HandleTextInputAccepted(String).)
KeyDown
 Respond to a KeyDown event.
MouseDown
 Respond to mouse-down events.
MouseMove
 Respond to mouse-move events.
MouseUp
 Respond to mouse-up events.
OnValueChanged
 Raise the ValueChanged event.
ProcessNumber
 Process a number using the given slider characteristics.
Render
 Render this slider into a Graphics context.
SetSnapRanges
 Assign a collection of snap ranges to this slider.
ShowTextInputBox(Control)
ShowTextInputBox(Control, Boolean)
ShowTextInputBox(Control, Boolean, Matrix)
ShowTextInputBox(Control, Boolean, Matrix, String)
Top
Events
Name | Description
ValueChanged
 Raised whenever the value of this slider is changed due to User-Interface methods.
Top
See Also
Reference
Grasshopper.GUI.Base Namespace