Grasshopper SDK
GH_Capsule.MaxRadius Property
 Gets the largest radius defined for this capsule.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int MaxRadius { get; }
Public ReadOnly Property MaxRadius As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.MaxRadius"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace