Grasshopper SDK
GH_ScriptVariant Constructor (Vector3d)
Initializes a new instance of the GH_ScriptVariant class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ScriptVariant(
	Vector3d val
)
Public Sub New (
	val As Vector3d
)
Parameters
val
Type: Vector3d
See Also
Reference
GH_ScriptVariant Class
GH_ScriptVariant Overload
Grasshopper.Kernel.Expressions Namespace