Grasshopper SDK
GH_AsynchFileData.FileLastChanged Property
 Gets the date at which the file was last changed.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime FileLastChanged { get; }
Public ReadOnly Property FileLastChanged As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.GUI.GH_AsynchFileData.FileLastChanged"]
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace