Grasshopper SDK
GH_Author Class
 Maintains author information such as name, company, copyright, address etc.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_Author
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Author : GH_ISerializable, IGH_Author
Public Class GH_Author
	Implements GH_ISerializable, IGH_Author
The GH_Author type exposes the following members.
Constructors
Name | Description
GH_Author()
Initializes a new instance of the GH_Author class
GH_Author(IGH_Author)
Initializes a new instance of the GH_Author class
Top
Properties
Name | Description
Address
AddressReadonly
Company
CompanyReadonly
Copyright
CopyrightReadonly
EMail
EMailReadonly
IsEmpty
 Gets whether any of the fields have been assigned.
Name
NameReadonly
Phone
PhoneReadonly
Website
WebsiteReadonly
Top
Methods
Name | Description
Clear
 Erase all fields.
Read
Write
Top
See Also
Reference
Grasshopper.Kernel Namespace