Grasshopper SDK
Folders.AssemblyFolders Property
 Gets a list of all the directories from which GHA assemblies are loaded. Note: this is not the same as all folders from which GHA files were loaded at startup. This list includes the default Grasshopper folders, custom GHA folders and the locations provided by Rhino.Runtime.HostUtils.GetAssemblySearchPaths(). Folders which do not contain GHA files are omitted, as are duplicate entries.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<GH_AssemblyFolderInfo> AssemblyFolders { get; }
Public Shared ReadOnly Property AssemblyFolders As List(Of GH_AssemblyFolderInfo)
	Get
Property Value
Type: List<GH_AssemblyFolderInfo>
[Missing <value> documentation for "P:Grasshopper.Folders.AssemblyFolders"]
Return Value
Type: List<GH_AssemblyFolderInfo>
A list of load target directories.
See Also
Reference
Folders Class
Grasshopper Namespace