Grasshopper SDK
GH_DocumentAssociations Constructor
Initializes a new instance of the GH_DocumentAssociations class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentAssociations()
Public Sub New
See Also
Reference
GH_DocumentAssociations Class
Grasshopper.Kernel Namespace