Grasshopper SDK
GH_ResourceGate.OK_24x24 Property
 Returns a 24x24 round green icon
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Bitmap OK_24x24 { get; }
Public Shared ReadOnly Property OK_24x24 As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Plugin.GH_ResourceGate.OK_24x24"]
See Also
Reference
GH_ResourceGate Class
Grasshopper.Plugin Namespace