Grasshopper SDK
GH_Grip Constructor
Initializes a new instance of the GH_Grip class
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Grip()
Public Sub New
See Also
Reference
GH_Grip Class
GH_Grip Overload
Grasshopper.GUI.Gradient Namespace