Grasshopper SDK
GH_DocumentObject.ColourEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ColourEventHandler(
	GH_ColourPicker sender,
	GH_ColourPickerEventArgs e
)
Public Delegate Sub ColourEventHandler (
	sender As GH_ColourPicker,
	e As GH_ColourPickerEventArgs
)
Parameters
sender
Type: Grasshopper.GUI.GH_ColourPicker
e
Type: Grasshopper.GUI.Base.GH_ColourPickerEventArgs
See Also
Reference
Grasshopper.Kernel Namespace