Grasshopper SDK
GH_MaterialPreviewControl Constructor
Initializes a new instance of the GH_MaterialPreviewControl class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MaterialPreviewControl()
Public Sub New
See Also
Reference
GH_MaterialPreviewControl Class
Grasshopper.GUI Namespace