Grasshopper SDK
GH_DocFilePathEventArgs.NewFilePath Property
 Gets the new filepath, the one currently assigned to this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string NewFilePath { get; }
Public ReadOnly Property NewFilePath As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocFilePathEventArgs.NewFilePath"]
See Also
Reference
GH_DocFilePathEventArgs Class
Grasshopper.Kernel Namespace