Grasshopper SDK
GH_Format.FormatRectangleValidity Method
 If the rectangle is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatRectangleValidity(
	Rectangle3d val,
	string identifier = "Rectangle"
)
Public Shared Function FormatRectangleValidity (
	val As Rectangle3d,
	Optional identifier As String = "Rectangle"
) As String
Parameters
val
Type: Rectangle3d
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the rectangle is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace