Grasshopper SDK
GH_Path Constructor (Int32)
 Creates a new path with a single element.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Path(
	int index
)
Public Sub New (
	index As Integer
)
Parameters
index
Type: System.Int32
The index of the first element.
See Also
Reference
GH_Path Class
GH_Path Overload
Grasshopper.Kernel.Data Namespace