Grasshopper SDK
GH_ContentCollection.Item Property
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Content this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As IGH_Content
	Get
Parameters
index
Type: System.Int32
Property Value
Type: IGH_Content
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_ContentCollection.Item(System.Int32)"]
See Also
Reference
GH_ContentCollection Class
Grasshopper.Documentation Namespace