Grasshopper SDK
GH_RelevantObjectData.IsTopLevelObject Property
 Gets a value indicating whether or not the Object is a top-level object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsTopLevelObject { get; }
Public ReadOnly Property IsTopLevelObject As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RelevantObjectData.IsTopLevelObject"]
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace