Grasshopper SDK
GH_DigitScrollerBase.Radix Property
 Gets or sets the radix index of this scroller.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Radix { get; set; }
Public Property Radix As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.Radix"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace