Grasshopper SDK
GH_DocumentServer.PromoteDocument Method
 Push a document to the top of the list, meaning it will be first in line when a new default document needs to be selected.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void PromoteDocument(
	GH_Document document
)
Public Sub PromoteDocument (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document to promote.
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace