Grasshopper SDK
GH_Path.Read Method
 Read this path from an archive.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Read(
	GH_IReader reader
)
Public Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Object to read with.
Return Value
Type: Boolean
True on success, false on failure.
Implements
GH_ISerializable.Read(GH_IReader)
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace