Grasshopper SDK
IGH_TooltipAwareObject.IsTooltipRegion Method
 Determine whether the specified pixel should result in a tooltip when the cursor hovers over it.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsTooltipRegion(
	PointF canvasPoint
)
Function IsTooltipRegion (
	canvasPoint As PointF
) As Boolean
Parameters
canvasPoint
Type: System.Drawing.PointF
Point in Canvas coordinates.
Return Value
Type: Boolean
See Also
Reference
IGH_TooltipAwareObject Interface
Grasshopper.GUI.Canvas Namespace