Grasshopper SDK
GH_Culture Constructor
 Blank constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Culture()
Public Sub New
See Also
Reference
GH_Culture Class
GH_Culture Overload
Grasshopper.Kernel.Types Namespace