Grasshopper SDK
Node3d<T>.TrimExcess Method
 Trim the excess space on all index lists. You can call this method to reduce memory usage. It will not modify the tree in any functional way.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void TrimExcess()
Public Sub TrimExcess
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace