Grasshopper SDK
GH_PointRefData.SetSurfaceParam Method
 Set the surface reference parameters
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool SetSurfaceParam(
	Surface srf,
	double u,
	double v
)
Public Function SetSurfaceParam (
	srf As Surface,
	u As Double,
	v As Double
) As Boolean
Parameters
srf
Type: Surface
The surface to act on
u
Type: System.Double
The parameter on the surface u domain
v
Type: System.Double
The parameter on the surface v domain
Return Value
Type: Boolean
True on success
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace