Grasshopper SDK
GH_RotationalFrame Structure
 Represents a single frame in a rotational tuning history.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public struct GH_RotationalFrame
Public Structure GH_RotationalFrame
The GH_RotationalFrame type exposes the following members.
Properties
Name | Description
Angle
 Gets or sets the local angle of the rotation event.
Pivot
 Gets or sets the pivot of the event.
Point
 Gets or sets the location of the rotation event.
Time
 Gets or sets the time when the event was recorded.
Top
Remarks
See Also
Reference
Grasshopper.GUI Namespace