Grasshopper SDK
IGH_Param.Type Property
 Gets the Framework Type descriptor for the stored Data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Type Type { get; }
ReadOnly Property Type As Type
	Get
Property Value
Type: Type
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.Type"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace