Grasshopper SDK
IGH_ObjectProxy.Type Property
 Gets the Type for the target object. If the proxy references a User Object, the Type member will be null.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Type Type { get; }
ReadOnly Property Type As Type
	Get
Property Value
Type: Type
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ObjectProxy.Type"]
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace