Grasshopper SDK
GH_ResizableAttributes<T>.SizingBorders Property
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected abstract Padding SizingBorders { get; }
Protected MustOverride ReadOnly Property SizingBorders As Padding
	Get
Property Value
Type: Padding
[Missing <value> documentation for "P:Grasshopper.Kernel.Attributes.GH_ResizableAttributes`1.SizingBorders"]
See Also
Reference
GH_ResizableAttributes<T> Class
Grasshopper.Kernel.Attributes Namespace