Grasshopper SDK
GH_Structure<T> Constructor (GH_Structure<T>, Boolean)
 Copy constructor, duplicate another data structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Structure(
	GH_Structure<T> other,
	bool shallowCopy
)
Public Sub New (
	other As GH_Structure(Of T),
	shallowCopy As Boolean
)
Parameters
other
Type: Grasshopper.Kernel.Data.GH_Structure<T>
Structure to copy, if null, this structure will be empty.
shallowCopy
Type: System.Boolean
If True, data item pointers are shared among this and the [other] structure.
See Also
Reference
GH_Structure<T> Class
GH_Structure<T> Overload
Grasshopper.Kernel.Data Namespace