Grasshopper SDK
GH_Canvas.RemoveTagArtist Method (IGH_TagArtist)
 Remove a specific tag artist from this canvas. If the instance occurs multiple times in the TagArtist list, all instances will be removed.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int RemoveTagArtist(
	IGH_TagArtist artist
)
Public Function RemoveTagArtist (
	artist As IGH_TagArtist
) As Integer
Parameters
artist
Type: Grasshopper.GUI.Canvas.TagArtists.IGH_TagArtist
TagArtist to remove.
Return Value
Type: Int32
The number of IGH_TagArtist instances removed.
See Also
Reference
GH_Canvas Class
RemoveTagArtist Overload
Grasshopper.GUI.Canvas Namespace