Grasshopper SDK
GH_Document.SelectedObjects Method
 Returns all selected objects in the document
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_DocumentObject> SelectedObjects()
Public Function SelectedObjects As List(Of IGH_DocumentObject)
Return Value
Type: List<IGH_DocumentObject>
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace