Grasshopper SDK
GH_ConnectivityDisparity.SubSet Property
 Gets a pointer to the subset diagram stored in this disparity class.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ConnectivityDiagram SubSet { get; }
Public ReadOnly Property SubSet As GH_ConnectivityDiagram
	Get
Property Value
Type: GH_ConnectivityDiagram
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ConnectivityDisparity.SubSet"]
See Also
Reference
GH_ConnectivityDisparity Class
Grasshopper.Kernel Namespace