Grasshopper SDK
GH_TooltipComponent Class
 This component provides Grasshopper tooltip functionality through a winforms Component.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 Grasshopper.GUI.GH_TooltipComponent
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_TooltipComponent : Component
Public NotInheritable Class GH_TooltipComponent
	Inherits Component
The GH_TooltipComponent type exposes the following members.
Constructors
Name | Description
GH_TooltipComponent
Initializes a new instance of the GH_TooltipComponent class
Top
Properties
Name | Description
Delay
 Gets or sets the delay (in milliseconds) for this tooltip to appear.
Enabled
 Gets or sets the Enabled flag.
Tag
 Provides an easy way to store information on this Tooltip.
Target
 Gets or sets the control this tooltip is tied to.
Top
Methods
Name | Description
Hide
IsTag
 Test whether the current Tooltip tag matches the object.
Top
Events
Name | Description
PopulateTooltip
 This event is raised just prior to the tooltip display.
Top
See Also
Reference
Grasshopper.GUI Namespace