Grasshopper SDK
GH_Convert.ToGoo Method
 Converts an object into Goo. Does not duplicate the data if a lossless conversion is possible.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static IGH_Goo ToGoo(
	Object data
)
Public Shared Function ToGoo (
	data As Object
) As IGH_Goo
Parameters
data
Type: System.Object
Data to convert.
Return Value
Type: IGH_Goo
IGH_Goo instance. If Data is not a null reference this function ALWAYS returns a GOO instance.
Remarks
This function calls a whole sh*tload of other conversion functions. IT IS SLOW.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace