Grasshopper SDK
GH_State.CreateStateFromDocument Method
 Creates a state database from a document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int CreateStateFromDocument(
	GH_Document doc
)
Public Function CreateStateFromDocument (
	doc As GH_Document
) As Integer
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
Document to parse.
Return Value
Type: Int32
Number of states saved or -1 if the user aborted.
See Also
Reference
GH_State Class
Grasshopper.Kernel Namespace