Grasshopper SDK
GH_Plane Constructor
 Default constructor. Creates a world XY plane.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Plane()
Public Sub New
See Also
Reference
GH_Plane Class
GH_Plane Overload
Grasshopper.Kernel.Types Namespace