Grasshopper SDK
GH_Param<T>.DependsOn Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool DependsOn(
	IGH_ActiveObject potential_source
)
Public Overrides Function DependsOn (
	potential_source As IGH_ActiveObject
) As Boolean
Parameters
potential_source
Type: Grasshopper.Kernel.IGH_ActiveObject
Return Value
Type: Boolean
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace