Grasshopper SDK
GH_DocumentAssociations.GetGrasshopperAssociations Method
 Find all the Grasshopper ghx files that have been associated with a given Rhino file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string> GetGrasshopperAssociations(
	string rhinoFile
)
Public Function GetGrasshopperAssociations (
	rhinoFile As String
) As List(Of String)
Parameters
rhinoFile
Type: System.String
Rhino file path.
Return Value
Type: List<String>
A list of files, ordered chronologically (most recent association first)
See Also
Reference
GH_DocumentAssociations Class
Grasshopper.Kernel Namespace