Grasshopper SDK
GH_FontScroller Constructor
Initializes a new instance of the GH_FontScroller class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_FontScroller()
Public Sub New
See Also
Reference
GH_FontScroller Class
Grasshopper.GUI Namespace