Grasshopper SDK
GH_Document.GH_UndoUtil.RecordReplaceStateEvent Method
 Create and Record a new CreateReplaceStateEvent undo record.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid RecordReplaceStateEvent(
	string name,
	int stateIndex,
	GH_State oldState,
	GH_State newState
)
Public Function RecordReplaceStateEvent (
	name As String,
	stateIndex As Integer,
	oldState As GH_State,
	newState As GH_State
) As Guid
Parameters
name
Type: System.String
Name of undo record.
stateIndex
Type: System.Int32
Index of state.
oldState
Type: Grasshopper.Kernel.GH_State
Solution state to remove.
newState
Type: Grasshopper.Kernel.GH_State
Solution state to insert.
Return Value
Type: Guid
The ID of the newly added undo record or Guid.Empty on failure.
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace