Grasshopper SDK
GH_QuickImageEditor Constructor
Initializes a new instance of the GH_QuickImageEditor class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_QuickImageEditor()
Public Sub New
See Also
Reference
GH_QuickImageEditor Class
Grasshopper.GUI Namespace