Grasshopper SDK
GH_CodeString.m_Segments Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected List<GH_CodeStringSegment> m_Segments
Protected m_Segments As List(Of GH_CodeStringSegment)
Field Value
Type: List<GH_CodeStringSegment>
See Also
Reference
GH_CodeString Class
Grasshopper.Kernel.Expressions Namespace