Grasshopper SDK
GH_DocumentIO.SaveDocumentDialog Method
 Display the Save GH/GHX dialog.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string SaveDocumentDialog(
	string path = null,
	string title = "Save…"
)
Public Function SaveDocumentDialog (
	Optional path As String = Nothing,
	Optional title As String = "Save…"
) As String
Parameters
path (Optional)
Type: System.String
Optional default path.
title (Optional)
Type: System.String
Title of dialog.
Return Value
Type: String
FileName specified via the Save dialog or null if the dialog was cancelled.
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace