Grasshopper SDK
GH_ConnectivityDisparity.SubNodes Property
 Gets a proxy for all the Nodes in the Subset diagram.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public ReadOnlyCollection<Guid> SubNodes { get; }
Public ReadOnly Property SubNodes As ReadOnlyCollection(Of Guid)
	Get
Property Value
Type: ReadOnlyCollection<Guid>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ConnectivityDisparity.SubNodes"]
See Also
Reference
GH_ConnectivityDisparity Class
Grasshopper.Kernel Namespace