Grasshopper SDK
GH_ScrollBarVerticalBase Constructor
Initializes a new instance of the GH_ScrollBarVerticalBase class
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ScrollBarVerticalBase()
Public Sub New
See Also
Reference
GH_ScrollBarVerticalBase Class
Grasshopper.GUI.Base Namespace