Grasshopper SDK
GH_ScriptVariant.IntegerDivision Operator
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
C# does not support this operator.
Public Shared Operator \ (
	A As GH_ScriptVariant,
	B As GH_ScriptVariant
) As GH_ScriptVariant
Parameters
A
Type: Grasshopper.Kernel.Expressions.GH_ScriptVariant
B
Type: Grasshopper.Kernel.Expressions.GH_ScriptVariant
Return Value
Type: GH_ScriptVariant
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace