Grasshopper SDK
GH_Format.FormatColour Method (Color)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatColour(
	Color data
)
Public Shared Function FormatColour (
	data As Color
) As String
Parameters
data
Type: System.Drawing.Color
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatColour Overload
Grasshopper.Kernel Namespace