Grasshopper SDK
GH_Link.CreateSharedLink Method (String, String)
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Link CreateSharedLink(
	string linkId,
	string target
)
Public Shared Function CreateSharedLink (
	linkId As String,
	target As String
) As GH_Link
Parameters
linkId
Type: System.String
target
Type: System.String
Return Value
Type: GH_Link
See Also
Reference
GH_Link Class
CreateSharedLink Overload
Grasshopper.Documentation Namespace