Grasshopper SDK
GH_Field.SolveSteps Method
 Move a point through a succession of steps.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point3dList SolveSteps(
	Point3d location,
	double accuracy,
	int count,
	GH_DifferentialSolver method
)
Public Function SolveSteps (
	location As Point3d,
	accuracy As Double,
	count As Integer,
	method As GH_DifferentialSolver
) As Point3dList
Parameters
location
Type: Point3d
Point to move.
accuracy
Type: System.Double
Rough accuracy.
count
Type: System.Int32
Number of samples to take.
method
Type: Grasshopper.Kernel.Types.GH_DifferentialSolver
Estimator to use.
Return Value
Type: Point3dList
A track (including the original location) of all the samples.
See Also
Reference
GH_Field Class
Grasshopper.Kernel.Types Namespace