Grasshopper SDK
GH_ColourPickerEventArgs.Intermediate Property
 Gets a value indicating whether the change was an intermediate one.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Intermediate { get; }
Public ReadOnly Property Intermediate As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerEventArgs.Intermediate"]
See Also
Reference
GH_ColourPickerEventArgs Class
Grasshopper.GUI.Base Namespace