Grasshopper SDK
GH_ComponentParamServer.UnregisterInputParameter Method (IGH_Param)
 Removes the specified parameter from this component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool UnregisterInputParameter(
	IGH_Param param
)
Public Function UnregisterInputParameter (
	param As IGH_Param
) As Boolean
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
Parameter to remove
Return Value
Type: Boolean
See Also
Reference
GH_ComponentParamServer Class
UnregisterInputParameter Overload
Grasshopper.Kernel Namespace