Grasshopper SDK
GH_DocumentObject Constructor (IGH_InstanceDescription)
Initializes a new instance of the GH_DocumentObject class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_DocumentObject(
	IGH_InstanceDescription tag
)
Protected Sub New (
	tag As IGH_InstanceDescription
)
Parameters
tag
Type: Grasshopper.Kernel.IGH_InstanceDescription
See Also
Reference
GH_DocumentObject Class
GH_DocumentObject Overload
Grasshopper.Kernel Namespace