Grasshopper SDK
GH_Surface.DuplicateSurface Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Surface DuplicateSurface()
Public Function DuplicateSurface As GH_Surface
Return Value
Type: GH_Surface
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace