Grasshopper SDK
GH_Document.UpdateAllSubsidiaries Method
 Iterate over all subsidiary documents and update them with their respective owners. If a subsidiary hasn't been modified, it will not be updated and it will not be counted.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int UpdateAllSubsidiaries()
Public Function UpdateAllSubsidiaries As Integer
Return Value
Type: Int32
The number of subsidiary documents updated.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace