Grasshopper SDK
CentralSettings.CreateSolutionUndoRecordChanged Event
 Raised whenever the CreateSolutionUndoRecord setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.CreateSolutionUndoRecordChangedEventHandler CreateSolutionUndoRecordChanged
Public Shared Event CreateSolutionUndoRecordChanged As CentralSettings.CreateSolutionUndoRecordChangedEventHandler
Value
Type: Grasshopper.CentralSettings.CreateSolutionUndoRecordChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace