Grasshopper SDK
IGH_DocumentObject.AppendMenuItems Method
 This function is called when a context menu is about to be displayed. Override it to set custom items.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool AppendMenuItems(
	ToolStripDropDown menu
)
Function AppendMenuItems (
	menu As ToolStripDropDown
) As Boolean
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
Menu object to populate.
Return Value
Type: Boolean
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace