Grasshopper SDK
GH_DisplayExpiredEventArgs Constructor
Initializes a new instance of the GH_DisplayExpiredEventArgs class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DisplayExpiredEventArgs(
	bool eForceRedraw
)
Public Sub New (
	eForceRedraw As Boolean
)
Parameters
eForceRedraw
Type: System.Boolean
See Also
Reference
GH_DisplayExpiredEventArgs Class
Grasshopper.Kernel Namespace