Grasshopper SDK
GH_DragInfo.Constraint Property
 Gets or sets the directional constraint for the drag operation.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Constraint Constraint { get; set; }
Public Property Constraint As GH_Constraint
	Get
	Set
Property Value
Type: GH_Constraint
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DragInfo.Constraint"]
See Also
Reference
GH_DragInfo Class
Grasshopper.GUI Namespace