Grasshopper SDK
GH_Document.ExpandSelection Method
 Grow or shift the selection set based on source and recipient links
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ExpandSelection(
	bool Upstream = true,
	bool Downstream = true,
	bool GrowSelection = true
)
Public Sub ExpandSelection (
	Optional Upstream As Boolean = true,
	Optional Downstream As Boolean = true,
	Optional GrowSelection As Boolean = true
)
Parameters
Upstream (Optional)
Type: System.Boolean
If True, the selection will grow/shift upstream
Downstream (Optional)
Type: System.Boolean
If True, the selection will grow/shift downstream
GrowSelection (Optional)
Type: System.Boolean
If True, the current selection set is retained. If False, the current selection set is discarded
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace