Grasshopper SDK
GH_CanvasMouseEvent.Delta Property
 Gets a signed count of the number of detents the mouse wheel has rotated. A detent is one notch of the mouse wheel.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Delta { get; }
Public ReadOnly Property Delta As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasMouseEvent.Delta"]
See Also
Reference
GH_CanvasMouseEvent Class
Grasshopper.GUI Namespace