Grasshopper SDK
GH_PageSettings.FillColour Property
 Gets or sets the page fill colour to be used.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color FillColour { get; set; }
Public Property FillColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_PageSettings.FillColour"]
See Also
Reference
GH_PageSettings Class
Grasshopper.GUI.Theme Namespace