Grasshopper SDK
GH_GooProxy<T>.FormatInstance Method
 Returns a String description of the current value.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string FormatInstance()
Public Overridable Function FormatInstance As String
Return Value
Type: String
Implements
IGH_GooProxy.FormatInstance()
Remarks
If the implementation IsParsable(), then this representation must be in parsable format.
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace