Grasshopper SDK
GH_ActiveObject.IsDataProvider Property
 Returns a boolean indicating whether or not the current object can seed data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract bool IsDataProvider { get; }
Public MustOverride ReadOnly Property IsDataProvider As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ActiveObject.IsDataProvider"]
Implements
IGH_ActiveObject.IsDataProvider
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace