Grasshopper SDK
GH_Param<T>.TypeName Property
 Calls TypeName() on the first instance of T it can find. This is either an item in the volatile list, or a newly constructed instance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string TypeName { get; }
Public Overridable ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.TypeName"]
Implements
IGH_Param.TypeName
Remarks
Override this for improved performance, but this function is only likely to be called from the GUI.
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace