Grasshopper SDK
GH_DocumentObject.Icon_24x24_Locked Property
 The greyscale icon of this object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap Icon_24x24_Locked { get; }
Public ReadOnly Property Icon_24x24_Locked As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentObject.Icon_24x24_Locked"]
Implements
IGH_DocumentObject.Icon_24x24_Locked
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace