Grasshopper SDK
GH_ComponentParamServer.IndexOfOutputParam Method (Guid)
 Finds the index of the output parameter that matches the specified search mask.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int IndexOfOutputParam(
	Guid id
)
Public Function IndexOfOutputParam (
	id As Guid
) As Integer
Parameters
id
Type: System.Guid
ID to search for.
Return Value
Type: Int32
The index of the parameter, or -1 if no parameter was found to match
See Also
Reference
GH_ComponentParamServer Class
IndexOfOutputParam Overload
Grasshopper.Kernel Namespace