Grasshopper SDK
GH_StructurePath Constructor
 Blank constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_StructurePath()
Public Sub New
See Also
Reference
GH_StructurePath Class
GH_StructurePath Overload
Grasshopper.Kernel.Types Namespace