Grasshopper SDK
IGH_DataAccess.Iteration Property
 Gets the current iteration count. The first time the SolveInstance() function is called on a component during a solution the Iteration counter will be zero. It will be incremented by one for every subsequent call.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int Iteration { get; }
ReadOnly Property Iteration As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_DataAccess.Iteration"]
Return Value
Type: Int32
An integer representing the iteration count.
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace