Grasshopper SDK
GH_DocObjectEventArgs.ObjectCount Property
 Gets the number of objects in this event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ObjectCount { get; }
Public ReadOnly Property ObjectCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocObjectEventArgs.ObjectCount"]
See Also
Reference
GH_DocObjectEventArgs Class
Grasshopper.Kernel Namespace