Grasshopper SDK
IGH_ActiveObject.ClearData Method
 This function is called whenever the object needs to clear all solution data. This usually amounts to wiping volatile caches and messages. This function will not affect any other objects, but it will set the Phase flag to Blank
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void ClearData()
Sub ClearData
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace