Grasshopper SDK
GH_Convert.ToSHA_Hash Method (Byte[])
 Create a SHA hash. The hash algorithm is only guaranteed to yield the same results from within a unique application domain.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Guid ToSHA_Hash(
	byte[] data
)
Public Shared Function ToSHA_Hash (
	data As Byte()
) As Guid
Parameters
data
Type: System.Byte[]
Data to hash.
Return Value
Type: Guid
A guid representing the (partial) SHA hash.
See Also
Reference
GH_Convert Class
ToSHA_Hash Overload
Grasshopper.Kernel Namespace