Grasshopper SDK
GH_Animator.SingleAnimator Method (Single, Single)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<float> SingleAnimator(
	float A,
	float B
)
Public Shared Function SingleAnimator (
	A As Single,
	B As Single
) As GH_Animator(Of Single)
Parameters
A
Type: System.Single
B
Type: System.Single
Return Value
Type: GH_Animator<Single>
See Also
Reference
GH_Animator Class
SingleAnimator Overload
Grasshopper.GUI Namespace