Grasshopper SDK
GH_Line Constructor (GH_Line)
 Create a duplicate of another line.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Line(
	GH_Line other
)
Public Sub New (
	other As GH_Line
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Line
Line to copy. If null, a default line will be created.
See Also
Reference
GH_Line Class
GH_Line Overload
Grasshopper.Kernel.Types Namespace