Grasshopper SDK
GH_Lexer.IsItem Property
 Gets a value indicating whether or not the item portion of the lexer has been set.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsItem { get; }
Public ReadOnly Property IsItem As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Lexer.IsItem"]
See Also
Reference
GH_Lexer Class
Grasshopper.Kernel.Data Namespace