Grasshopper SDK
GH_MouseTracker.Frame Property
 Gets the position (in control coordinates) of the frame at the given index.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_TrackerFrame this[
	int index
] { get; }
Public ReadOnly Default Property Frame (
	index As Integer
) As GH_TrackerFrame
	Get
Parameters
index
Type: System.Int32
Property Value
Type: GH_TrackerFrame
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MouseTracker.Frame(System.Int32)"]
See Also
Reference
GH_MouseTracker Class
Grasshopper.GUI Namespace