Grasshopper SDK
GH_TreeFilter Constructor
Initializes a new instance of the GH_TreeFilter class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_TreeFilter()
Public Sub New
See Also
Reference
GH_TreeFilter Class
Grasshopper.Kernel.Data Namespace