Grasshopper SDK
CentralSettings.CanvasObjectIconsChanged Event
 Raised whenever the CanvasObjectIcons setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.CanvasObjectIconsChangedEventHandler CanvasObjectIconsChanged
Public Shared Event CanvasObjectIconsChanged As CentralSettings.CanvasObjectIconsChangedEventHandler
Value
Type: Grasshopper.CentralSettings.CanvasObjectIconsChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace