Grasshopper SDK
GH_CanvasDropTargetValidator.AppliesToDocument Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool AppliesToDocument(
	Guid id
)
Public Overrides Function AppliesToDocument (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
Return Value
Type: Boolean
See Also
Reference
GH_CanvasDropTargetValidator Class
Grasshopper.GUI.Canvas Namespace