Grasshopper SDK
GH_DocumentEditor.AggregateShortcutMenuItemsEventHandler Delegate
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void AggregateShortcutMenuItemsEventHandler(
	Object sender,
	GH_MenuShortcutEventArgs e
)
Public Delegate Sub AggregateShortcutMenuItemsEventHandler (
	sender As Object,
	e As GH_MenuShortcutEventArgs
)
Parameters
sender
Type: System.Object
e
Type: GH_MenuShortcutEventArgs
See Also
Reference
Grasshopper.GUI Namespace