Grasshopper SDK
IGH_SettingCategory.Name Property
 Category name (not case sensitive). Use dots to separate subcategories.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Name { get; }
ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_SettingCategory.Name"]
See Also
Reference
IGH_SettingCategory Interface
Grasshopper.GUI Namespace