Grasshopper SDK
GH_CanvasValidator Constructor
Initializes a new instance of the GH_CanvasValidator class
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_CanvasValidator()
Protected Sub New
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace