Grasshopper SDK
GH_Document.CreateAutomaticClusterHooks Method
 Add an input hook for every non-optional input parameter with no persistent data and no sources. Then add an output hook for every floating parameter without recipients, and for every first component output parameter where the parent component has no recipients.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateAutomaticClusterHooks()
Public Sub CreateAutomaticClusterHooks
Remarks
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace