Grasshopper SDK
GH_PreviewExpiredEventArgs Class
 Arguments for preview events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_PreviewExpiredEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PreviewExpiredEventArgs : EventArgs
Public Class GH_PreviewExpiredEventArgs
	Inherits EventArgs
The GH_PreviewExpiredEventArgs type exposes the following members.
Constructors
Name | Description
GH_PreviewExpiredEventArgs
Initializes a new instance of the GH_PreviewExpiredEventArgs class
Top
Properties
Name | Description
ForceRedraw
Top
Fields
Name | Description
m_redraw
Top
See Also
Reference
Grasshopper.Kernel Namespace