Grasshopper SDK
GH_ColourSpace Enumeration
 Enumerates the different colour spaces supported by the GH_ColourPickerBase class.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ColourSpace
Public Enumeration GH_ColourSpace
Members
Member name | Value | Description
None | 0 |  Unset value. Do not use. Seriously. Stay away.
RGB | 1 |  Colour picker operates in RGB mode.
HSV | 2 |  Colour picker operates in HSV mode.
Remarks
See Also
Reference
Grasshopper.GUI.Base Namespace