Grasshopper SDK
GH_Structure<T>.IsEmpty Property
 Gets the Empty state of the structure. If the structure is Empty it contains no paths and no branches.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsEmpty { get; }
Public ReadOnly Property IsEmpty As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.IsEmpty"]
Implements
IGH_Structure.IsEmpty
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace