Grasshopper SDK
GH_Document.FindObject<T> Method (Guid, Boolean)
 Find the object that matches the ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public T FindObject<T>(
	Guid id,
	bool topLevelOnly
)
where T : IGH_DocumentObject
Public Function FindObject(Of T As IGH_DocumentObject) (
	id As Guid,
	topLevelOnly As Boolean
) As T
Parameters
id
Type: System.Guid
The ID to search for.
topLevelOnly
Type: System.Boolean
If True, only top-level objects are included. If False, the entire object attribute tree is recursed
Type Parameters
T
Object type constraint.
Return Value
Type: T
See Also
Reference
GH_Document Class
FindObject Overload
Grasshopper.Kernel Namespace