Grasshopper SDK
GH_DocumentObject.RecordUndoEvent Method (GH_UndoRecord)
 Record an entire undo record.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RecordUndoEvent(
	GH_UndoRecord record
)
Public Sub RecordUndoEvent (
	record As GH_UndoRecord
)
Parameters
record
Type: Grasshopper.Kernel.Undo.GH_UndoRecord
Record to push.
Implements
IGH_DocumentObject.RecordUndoEvent(GH_UndoRecord)
See Also
Reference
GH_DocumentObject Class
RecordUndoEvent Overload
Grasshopper.Kernel Namespace