Grasshopper SDK
GH_Document.RemoveSelection Method
 Delete all the objects in the selection set. This method does not record an Undo event, that is the responsibility of the caller.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RemoveSelection(
	bool update
)
Public Sub RemoveSelection (
	update As Boolean
)
Parameters
update
Type: System.Boolean
If True, the solution will be recomputed.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace