Grasshopper SDK
GH_StateServer.RemoveState Method
 Remove a certain state. This method adds an undo record to the document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RemoveState(
	int index
)
Public Function RemoveState (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Index of state to remove.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_StateServer Class
Grasshopper.Kernel Namespace