Grasshopper SDK
GH_Viewport.UnprojectY Method
 Project a value along constant Y from control coordinates into canvas coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float UnprojectY(
	float y
)
Public Function UnprojectY (
	y As Single
) As Single
Parameters
y
Type: System.Single
The constant Y value in control coordinates.
Return Value
Type: Single
The associated Y value in canvas coordinates.
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace