Grasshopper SDK
GH_Version.Equality Operator
 Compares two version structures for equality.
Namespace: GH_IO.Types
Assembly: GH_IO (in GH_IO.dll) Version: Rhino 6.0
Syntax
public static bool operator ==(
	GH_Version A,
	GH_Version B
)
Public Shared Operator = (
	A As GH_Version,
	B As GH_Version
) As Boolean
Parameters
A
Type: GH_IO.Types.GH_Version
Version to compare.
B
Type: GH_IO.Types.GH_Version
Version to compare with.
Return Value
Type: Boolean
True if all version fields in A and B are equal.
See Also
Reference
GH_Version Structure
GH_IO.Types Namespace