Grasshopper SDK
GH_CapsuleRenderEngine.CreateHighlightBar Method (Rectangle, Int32, Int32, Int32)
 Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath CreateHighlightBar(
	Rectangle rec,
	int R0,
	int R1,
	int size
)
Public Shared Function CreateHighlightBar (
	rec As Rectangle,
	R0 As Integer,
	R1 As Integer,
	size As Integer
) As GraphicsPath
Parameters
rec
Type: System.Drawing.Rectangle
Rectangle for entire fill.
R0
Type: System.Int32
Radius of upper left corner.
R1
Type: System.Int32
Radius of upper right corner.
size
Type: System.Int32
Highlight fill height.
Return Value
Type: GraphicsPath
Graphics path that describes the highlight fill shape.
See Also
Reference
GH_CapsuleRenderEngine Class
CreateHighlightBar Overload
Grasshopper.GUI.Canvas Namespace