Grasshopper SDK
IGH_Goo Interface
 Base interface for all Data inside Grasshopper. Every parameter must implement a type of Goo.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_Goo : GH_ISerializable
Public Interface IGH_Goo
	Inherits GH_ISerializable
The IGH_Goo type exposes the following members.
Properties
Name | Description
IsValid
 Gets a value indicating whether or not the current value is valid.
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
TypeDescription
 Gets a description of the type of the implementation.
TypeName
 Gets the name of the type of the implementation.
Top
Methods
Name | Description
CastFrom
 Attempt a cast from generic object
CastTo<T>
 Attempt a cast to type T
Duplicate
 Make a complete duplicate of this instance. No shallow copies.
EmitProxy
 Create a new proxy for this instance. Return Null if this class does not support proxies.
ScriptVariable
 This function will be called when the local IGH_Goo instance disapears into a user Script. This would be an excellent place to cast your IGH_Goo type to a simple data type.
ToString
 Creates a string description of the current instance value
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace