Grasshopper SDK
GH_DocumentEditor.ScriptAccess_NewDocument Method
 Creates a new document and loads it into the Canvas.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ScriptAccess_NewDocument()
Public Function ScriptAccess_NewDocument As Boolean
Return Value
Type: Boolean
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace