Grasshopper SDK
GH_UndoAction.Internal_Undo Method
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected abstract void Internal_Undo(
	GH_Document doc
)
Protected MustOverride Sub Internal_Undo (
	doc As GH_Document
)
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
See Also
Reference
GH_UndoAction Class
Grasshopper.Kernel.Undo Namespace