Grasshopper SDK
GH_Field.SolveStep Method
 Move a point through the field.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Vector3d SolveStep(
	Point3d location,
	double factor,
	GH_DifferentialSolver method
)
Public Function SolveStep (
	location As Point3d,
	factor As Double,
	method As GH_DifferentialSolver
) As Vector3d
Parameters
location
Type: Point3d
Point to move from.
factor
Type: System.Double
Multiplication factor to apply to sampling. A low factor results in more accurate sampling, but smaller steps.
method
Type: Grasshopper.Kernel.Types.GH_DifferentialSolver
Estimator to use.
Return Value
Type: Vector3d
New point location.
See Also
Reference
GH_Field Class
Grasshopper.Kernel.Types Namespace