Grasshopper SDK
GH_ExternalFileConflictDialog.LoadFileCode Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int LoadFileCode { get; }
Public ReadOnly Property LoadFileCode As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_ExternalFileConflictDialog.LoadFileCode"]
See Also
Reference
GH_ExternalFileConflictDialog Class
Grasshopper.GUI Namespace