Grasshopper SDK
GH_IndexRuleSet.AddDigitPatternRule Method (Int32, Int32, Int32)
 Append a rule for filtering digit patterns.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddDigitPatternRule(
	int firstDigit,
	int nextDigit,
	int lastDigit
)
Public Sub AddDigitPatternRule (
	firstDigit As Integer,
	nextDigit As Integer,
	lastDigit As Integer
)
Parameters
firstDigit
Type: System.Int32
First digit in pattern.
nextDigit
Type: System.Int32
Next digit in pattern.
lastDigit
Type: System.Int32
Last digit in pattern.
See Also
Reference
GH_IndexRuleSet Class
AddDigitPatternRule Overload
Grasshopper.Kernel.Data Namespace