Grasshopper SDK
GH_GeometricGoo<T>.EmitProxy Method
 Create a new proxy for this instance. Return Null if this class does not support proxies.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IGH_GooProxy EmitProxy()
Public Overrides Function EmitProxy As IGH_GooProxy
Return Value
Type: IGH_GooProxy
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace