Grasshopper SDK
GH_Format.FormatSingle Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatSingle(
	float data
)
Public Shared Function FormatSingle (
	data As Single
) As String
Parameters
data
Type: System.Single
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace