Grasshopper SDK
GH_UndoServer.PerformUndo Method
 Performs a single Undo step when possible and migrates the record onto the redo stack. This function may throw all kinds of exceptions, if you're calling it from a UI thread, use a Try..Catch block to prevent crashes.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void PerformUndo()
Public Sub PerformUndo
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace