Grasshopper SDK
GH_ColourSwatchEventArgs.Colour Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Colour { get; }
Public ReadOnly Property Colour As Color
	Get
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_ColourSwatchEventArgs.Colour"]
See Also
Reference
GH_ColourSwatchEventArgs Class
Grasshopper.GUI Namespace