Grasshopper SDK
GH_Slider_Obsolete.ValueChanged Event
 Raised whenever the value of the slider is changed via GUI interaction.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Slider_Obsolete.ValueChangedEventHandler ValueChanged
Public Event ValueChanged As GH_Slider_Obsolete.ValueChangedEventHandler
Value
Type: Grasshopper.GUI.GH_Slider_Obsolete.ValueChangedEventHandler
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace