Grasshopper SDK
GH_UndoException Class
 Exception associated with undo events
Inheritance Hierarchy
System.Object
 System.Exception
 Grasshopper.Kernel.Undo.GH_UndoException
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_UndoException : Exception
Public Class GH_UndoException
	Inherits Exception
Constructors
Name | Description
GH_UndoException(String)
Initializes a new instance of the GH_UndoException class
GH_UndoException(String, Object[])
Initializes a new instance of the GH_UndoException class
Top
See Also
Reference
Grasshopper.Kernel.Undo Namespace