Grasshopper SDK
GH_DocDiagramPainter.MapPoint Method (PointF)
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF MapPoint(
	PointF pt
)
Public Function MapPoint (
	pt As PointF
) As PointF
Parameters
pt
Type: System.Drawing.PointF
Return Value
Type: PointF
See Also
Reference
GH_DocDiagramPainter Class
MapPoint Overload
Grasshopper.GUI.Canvas Namespace