Grasshopper SDK
GH_CanvasDocumentChangedEventArgs.NewDocument Property
 Gets the document which has just been loaded into the canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document NewDocument { get; }
Public ReadOnly Property NewDocument As GH_Document
	Get
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasDocumentChangedEventArgs.NewDocument"]
See Also
Reference
GH_CanvasDocumentChangedEventArgs Class
Grasshopper.GUI.Canvas Namespace