Grasshopper SDK
GH_ComponentServer.UpdateRibbonUI Method
 Forces an update of the Ribbon control on the Grasshopper main form.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void UpdateRibbonUI()
Public Shared Sub UpdateRibbonUI
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace