Grasshopper SDK
GH_UndoAction.ExpiresSolution Property
 Override this property if you want the Grasshopper solution to refresh upon undo completion.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool ExpiresSolution { get; }
Public Overridable ReadOnly Property ExpiresSolution As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoAction.ExpiresSolution"]
Implements
IGH_UndoAction.ExpiresSolution
See Also
Reference
GH_UndoAction Class
Grasshopper.Kernel.Undo Namespace