Grasshopper SDK
GH_Gradient.AddGrip Method (Double, Color)
 Add a new single-colour grip.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Grip AddGrip(
	double t,
	Color c
)
Public Function AddGrip (
	t As Double,
	c As Color
) As GH_Grip
Parameters
t
Type: System.Double
Parameter for grip.
c
Type: System.Drawing.Color
Colour of grip.
Return Value
Type: GH_Grip
See Also
Reference
GH_Gradient Class
AddGrip Overload
Grasshopper.GUI.Gradient Namespace