Grasshopper SDK
Complex.Modulus Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Modulus()
Public Function Modulus As Double
Return Value
Type: Double
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace