Grasshopper SDK
IGH_DocumentObject.PingDocument Event
 Raised whenever an object needs to know which GH_Document it belongs to.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
event IGH_DocumentObject.PingDocumentEventHandler PingDocument
Event PingDocument As IGH_DocumentObject.PingDocumentEventHandler
Value
Type: Grasshopper.Kernel.IGH_DocumentObject.PingDocumentEventHandler
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace