Grasshopper SDK
IGH_UserPromptAware.PromptMultipleItems Method
 Get multiple items from the user.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_Structure PromptMultipleItems()
Function PromptMultipleItems As IGH_Structure
Return Value
Type: IGH_Structure
A data tree of items if successful or nothing on abort/failure.
See Also
Reference
IGH_UserPromptAware Interface
Grasshopper.Kernel Namespace