Grasshopper SDK
GH_GeometricGoo<T>.IsReferencedGeometry Property
 Gets a value indicating whether or not this geometry is referenced. Not all IGH_GeometricGoo implementations support referenced geometry.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool IsReferencedGeometry { get; }
Public Overridable ReadOnly Property IsReferencedGeometry As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometricGoo`1.IsReferencedGeometry"]
Implements
IGH_GeometricGoo.IsReferencedGeometry
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace