Grasshopper SDK
IGH_SettingFrontend.Keywords Property
 Optional keywords for this setting.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IEnumerable<string> Keywords { get; }
ReadOnly Property Keywords As IEnumerable(Of String)
	Get
Property Value
Type: IEnumerable<String>
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_SettingFrontend.Keywords"]
See Also
Reference
IGH_SettingFrontend Interface
Grasshopper.GUI Namespace