Grasshopper SDK
GH_LibraryLicense Enumeration
 Enumerates the possible library types for GHA assemblies.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_LibraryLicense
Public Enumeration GH_LibraryLicense
Members
Member name | Value | Description
unset | 0 |  Unset library type. You should not return this value.
expired | 1 |  The license for this library has expired and it can no longer be used.
alpha | 2 |  This library is an Alpha release.
beta | 3 |  This library is a Beta release.
free | 4 |  This library is freeware.
opensource | 5 |  This library is distributed under an open source license.
trial | 6 |  This library is running in Trial mode.
commercial | 7 |  This library is running under a Commercial license.
educational | 8 |  This library is running under an Educational license.
developer | 9 |  This library is running under a Developer license.
reseller | 10 |  This library is running under a Reseller license.
other | 11 |  Undefined library type.
See Also
Reference
Grasshopper.Kernel Namespace