Grasshopper SDK
GH_Component.DocumentTolerance Method
 Gets the Absolute tolerance for the currently active Rhino document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected static double DocumentTolerance()
Protected Shared Function DocumentTolerance As Double
Return Value
Type: Double
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace