Grasshopper SDK
GH_SliderGripDisplay Enumeration
 Enumerates the possible slider grip displays.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_SliderGripDisplay
Public Enumeration GH_SliderGripDisplay
Members
Member name | Value | Description
None | 0 |  No grip is drawn.
Numeric | 1 |  A single box containing the slider value is drawn.
Shape | 2 |  A constant shape grip is drawn (round for floating point, diamond for integers)
ShapeAndText | 3 |  Same as Shape, but text with the slider value is drawn besides the grip.
See Also
Reference
Grasshopper.GUI.Base Namespace