Grasshopper SDK
GH_SolutionSpan Structure
 Represents the time interval for a GH_Document solution.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public struct GH_SolutionSpan
Public Structure GH_SolutionSpan
The GH_SolutionSpan type exposes the following members.
Constructors
Name | Description
GH_SolutionSpan
 Creates a new instance of the GH_SolutionSpan structure.
Top
Properties
Name | Description
EndTime
 Gets the time at which this solution was finished.
StartTime
 Gets the time at which this solution was started.
Top
See Also
Reference
Grasshopper.Kernel Namespace