Grasshopper SDK
GH_Format.FormatDoubleValidity Method
 If the number is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatDoubleValidity(
	double val,
	string identifier = "Number"
)
Public Shared Function FormatDoubleValidity (
	val As Double,
	Optional identifier As String = "Number"
) As String
Parameters
val
Type: System.Double
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the number is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace