Grasshopper SDK
Instances.CanvasDestroyed Event
 Raised when the main canvas is destroyed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event Instances.CanvasDestroyedEventHandler CanvasDestroyed
Public Shared Event CanvasDestroyed As Instances.CanvasDestroyedEventHandler
Value
Type: Grasshopper.Instances.CanvasDestroyedEventHandler
See Also
Reference
Instances Class
Grasshopper Namespace