Grasshopper SDK
GH_GeometryGroup.GH_GeometryGroupProxy Constructor
Initializes a new instance of the GH_GeometryGroup.GH_GeometryGroupProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_GeometryGroupProxy(
	GH_GeometryGroup owner
)
Public Sub New (
	owner As GH_GeometryGroup
)
Parameters
owner
Type: Grasshopper.Kernel.Types.GH_GeometryGroup
See Also
Reference
GH_GeometryGroup.GH_GeometryGroupProxy Class
Grasshopper.Kernel.Types Namespace