Grasshopper SDK
GH_Canvas.NavigationZoomFactor Property
 Gets or sets the zoom factor for navigation zoom operations.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static double NavigationZoomFactor { get; set; }
Public Shared Property NavigationZoomFactor As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.NavigationZoomFactor"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace