Grasshopper SDK
GH_DigitScrollerBase.Digits Property
 Gets or sets the number of digits available in this scroller.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Digits { get; set; }
Public Property Digits As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.Digits"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace