Grasshopper SDK
IGH_Structure.ExpandPath Method
 Expand a path in this structure by appending an element.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void ExpandPath(
	GH_Path path,
	int element,
	GH_ExpandMode mode
)
Sub ExpandPath (
	path As GH_Path,
	element As Integer,
	mode As GH_ExpandMode
)
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to expand, if the path doesn't exist, nothing will happen.
element
Type: System.Int32
Element to append to the path.
mode
Type: Grasshopper.Kernel.Data.GH_ExpandMode
Expansion mode.
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace