Grasshopper SDK
CentralSettings.RibbonDrawTabIcons Property
 Gets or sets whether tab icons are drawn for the ribbon.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool RibbonDrawTabIcons { get; set; }
Public Shared Property RibbonDrawTabIcons As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.RibbonDrawTabIcons"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace