Grasshopper SDK
GH_Document.Objects Property
 Returns a list of all normal, top-level objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<IGH_DocumentObject> Objects { get; }
Public ReadOnly Property Objects As IList(Of IGH_DocumentObject)
	Get
Property Value
Type: IList<IGH_DocumentObject>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.Objects"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace