Grasshopper SDK
GH_Animator.InterpolateDecimal Method
 Utility interpolation delegate for System.Decimal values.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static decimal InterpolateDecimal(
	decimal A,
	decimal B,
	double factor
)
Public Shared Function InterpolateDecimal (
	A As Decimal,
	B As Decimal,
	factor As Double
) As Decimal
Parameters
A
Type: System.Decimal
B
Type: System.Decimal
factor
Type: System.Double
Return Value
Type: Decimal
See Also
Reference
GH_Animator Class
Grasshopper.GUI Namespace