Grasshopper SDK
GH_ListUtil.RemoveNullRefs<T> Method
 Remove all null references from a list of items.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<T> RemoveNullRefs<T>(
	List<T> L
)
Public Shared Function RemoveNullRefs(Of T) (
	L As List(Of T)
) As List(Of T)
Parameters
L
Type: System.Collections.Generic.List<T>
List to filter
Type Parameters
T
Type of list
Return Value
Type: List<T>
List containing only non-null items. References are shared with L
See Also
Reference
GH_ListUtil Class
Grasshopper.Kernel Namespace