Grasshopper SDK
GH_FontServer.Console Property
 FontFamily.GenericMonospace, 10pt, regular
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font Console { get; }
Public Shared ReadOnly Property Console As Font
	Get
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FontServer.Console"]
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace