Grasshopper SDK
IGH_StateTag Interface
 A StateTag is a visual feedback mechanism that reflects a certain local setting of an Object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_StateTag
Public Interface IGH_StateTag
The IGH_StateTag type exposes the following members.
Properties
Name | Description
Description
 Gets the description of this state tag.
Icon
 Gets the 16 by 16 pixel icon associated with this state tag.
Name
 Gets the name field of this state tag.
Stage
 Gets or sets the Stage rectangle for this state tag. Stages are assigned during Attribute Layout operations by owner objects.
StateDescription
 Gets or sets the state description of this tag. The state description appears in the Tooltip info field.
Top
Methods
Name | Description
Render
 Render this tag into a graphics surface.
Top
See Also
Reference
Grasshopper.Kernel Namespace