Grasshopper SDK
GH_TextBoxInputBase Constructor
Initializes a new instance of the GH_TextBoxInputBase class
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_TextBoxInputBase()
Protected Sub New
See Also
Reference
GH_TextBoxInputBase Class
Grasshopper.GUI.Base Namespace