Grasshopper SDK
GH_Convert.ToGHMatrix_Primary Method
 Converts similar data into a GH_Matrix instance. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToGHMatrix_Primary(
	Object data,
	ref GH_Matrix target
)
Public Shared Function ToGHMatrix_Primary (
	data As Object,
	ByRef target As GH_Matrix
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_Matrix
Target instance. If null, a new GH_Matrix will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace