Grasshopper SDK
GH_DebugDescriptionWriter Constructor
Initializes a new instance of the GH_DebugDescriptionWriter class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DebugDescriptionWriter()
Public Sub New
See Also
Reference
GH_DebugDescriptionWriter Class
Grasshopper.Kernel Namespace