Grasshopper SDK
GH_Canvas.GH_ImageSettings.Folder Property
 Gets or sets the folder in which the target image will be saved.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Folder { get; set; }
Public Property Folder As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.Folder"]
See Also
Reference
GH_Canvas.GH_ImageSettings Class
Grasshopper.GUI.Canvas Namespace