Grasshopper SDK
GH_TooltipComponent.Delay Property
 Gets or sets the delay (in milliseconds) for this tooltip to appear.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Delay { get; set; }
Public Property Delay As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipComponent.Delay"]
See Also
Reference
GH_TooltipComponent Class
Grasshopper.GUI Namespace