Grasshopper SDK
GH_Interval2D Constructor
 Default constructor. Creates two empty intervals.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Interval2D()
Public Sub New
See Also
Reference
GH_Interval2D Class
GH_Interval2D Overload
Grasshopper.Kernel.Types Namespace