Grasshopper SDK
GH_FontServer.FontToString Method
 Convert a font to a string.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FontToString(
	Font font
)
Public Shared Function FontToString (
	font As Font
) As String
Parameters
font
Type: System.Drawing.Font
Font to convert.
Return Value
Type: String
Strig representing the font family, size, bold and italic flags.
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace