Grasshopper SDK
GH_RuntimeFile.TagDescription Field
 String tag used t o identify Description fields in glossary source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagDescription = "DESCRIPTION"
Public Const TagDescription As String = "DESCRIPTION"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace