Grasshopper SDK
GH_ResizableAttributes<T>.MaximumSize Property
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual Size MaximumSize { get; }
Protected Overridable ReadOnly Property MaximumSize As Size
	Get
Property Value
Type: Size
[Missing <value> documentation for "P:Grasshopper.Kernel.Attributes.GH_ResizableAttributes`1.MaximumSize"]
See Also
Reference
GH_ResizableAttributes<T> Class
Grasshopper.Kernel.Attributes Namespace