Grasshopper SDK
GH_Tooltip.Clear Method
 Hides the tooltip and clears all references and caches.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void Clear()
Public Shared Sub Clear
See Also
Reference
GH_Tooltip Class
Grasshopper.GUI Namespace