Grasshopper SDK
GH_Point.Value Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point3d Value { get; set; }
Public Property Value As Point3d
	Get
	Set
Property Value
Type: Point3d
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Point.Value"]
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace