Grasshopper SDK
GH_ColourPickerEventArgs.Original Property
 Gets the original value of the colour picker. This value is cached, so even if the picker subsequently updates, this property remains constant.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Original { get; }
Public ReadOnly Property Original As Color
	Get
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerEventArgs.Original"]
See Also
Reference
GH_ColourPickerEventArgs Class
Grasshopper.GUI.Base Namespace