Grasshopper SDK
GH_RuntimeFile.TagBeginner Field
 String tag used t o identify Beginner Level Help Content in documentation source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagBeginner = "BEGINNER"
Public Const TagBeginner As String = "BEGINNER"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace