Grasshopper SDK
GH_Slider_Obsolete.ValueChangedEventHandler Delegate
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ValueChangedEventHandler(
	GH_Slider_Obsolete sender,
	double nValue,
	bool bIntermediate
)
Public Delegate Sub ValueChangedEventHandler (
	sender As GH_Slider_Obsolete,
	nValue As Double,
	bIntermediate As Boolean
)
Parameters
sender
Type: Grasshopper.GUI.GH_Slider_Obsolete
nValue
Type: System.Double
bIntermediate
Type: System.Boolean
See Also
Reference
Grasshopper.GUI Namespace