Grasshopper SDK
GH_SolverException Constructor
Initializes a new instance of the GH_SolverException class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SolverException(
	string nMessage
)
Public Sub New (
	nMessage As String
)
Parameters
nMessage
Type: System.String
See Also
Reference
GH_SolverException Class
Grasshopper.Kernel.Expressions Namespace