Grasshopper SDK
GH_Component.GH_OutputParamManager.Register_GenericParam Method (String, String, String, GH_ParamAccess)
 Register a new Generic (Object) parameter
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Register_GenericParam(
	string name,
	string nickname,
	string description,
	GH_ParamAccess access
)
Public Sub Register_GenericParam (
	name As String,
	nickname As String,
	description As String,
	access As GH_ParamAccess
)
Parameters
name
Type: System.String
The name of the parameter. Keep it short, single words are best.
nickname
Type: System.String
The nickname of the parameter. Keep it short, single characters are best.
description
Type: System.String
The description of the parameter. Be succinct but clear.
access
Type: Grasshopper.Kernel.GH_ParamAccess
Parameter access, you should set this field if you intend to output lists here.
See Also
Reference
GH_Component.GH_OutputParamManager Class
Register_GenericParam Overload
Grasshopper.Kernel Namespace