Grasshopper SDK
IGH_DocumentObject.OnSolutionExpired Method
 Raises the SolutionExpired event on the toplevel object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void OnSolutionExpired(
	bool recompute
)
Sub OnSolutionExpired (
	recompute As Boolean
)
Parameters
recompute
Type: System.Boolean
If True, the solution will be immediately recalculated.
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace