Grasshopper SDK
GH_Variant._Vector Property
 Gets the contents of this Variant as a Vector.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Vector3d _Vector { get; }
Public ReadOnly Property _Vector As Vector3d
	Get
Property Value
Type: Vector3d
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_Variant._Vector"]
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace