Grasshopper SDK
GH_Convert.CreatePureTime Method (DateTime)
 Convert a datetime structure into a pure time, i.e. remove the date portion. As per convention, this means setting the year, month and day to 1.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static DateTime CreatePureTime(
	DateTime date
)
Public Shared Function CreatePureTime (
	date As DateTime
) As DateTime
Parameters
date
Type: System.DateTime
Return Value
Type: DateTime
See Also
Reference
GH_Convert Class
CreatePureTime Overload
Grasshopper.Kernel Namespace