Grasshopper SDK
GH_DigitScroller.Input_Parse Method
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override bool Input_Parse(
	string text
)
Protected Overrides Function Input_Parse (
	text As String
) As Boolean
Parameters
text
Type: System.String
Return Value
Type: Boolean
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace