Grasshopper SDK
GH_TreeFilter.ParsePattern Method
 Parses a textual filter and returns an instance of the GH_TreeFilter. If the filter cannot be parsed an exception will be thrown.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_TreeFilter ParsePattern(
	string filter
)
Public Shared Function ParsePattern (
	filter As String
) As GH_TreeFilter
Parameters
filter
Type: System.String
Filter to parse.
Return Value
Type: GH_TreeFilter
An instance of GH_TreeFilter describing the textual filter.
See Also
Reference
GH_TreeFilter Class
Grasshopper.Kernel.Data Namespace