Grasshopper SDK
GH_StateTagList.BoundingBox Property
 Gets the boundingbox of all StateTags.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle BoundingBox { get; }
Public ReadOnly Property BoundingBox As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_StateTagList.BoundingBox"]
See Also
Reference
GH_StateTagList Class
Grasshopper.Kernel Namespace