Grasshopper SDK
Folders.AppDataFolder Property
 Gets the appdata folder for Grasshopper. This folder is defined as %appdata%\Grasshopper\ and the physical uri may differ depending on Windows version.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string AppDataFolder { get; }
Public Shared ReadOnly Property AppDataFolder As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.AppDataFolder"]
See Also
Reference
Folders Class
Grasshopper Namespace