Grasshopper SDK
GH_ZuiAction Constructor
Initializes a new instance of the GH_ZuiAction class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_ZuiAction(
	string name
)
Protected Sub New (
	name As String
)
Parameters
name
Type: System.String
See Also
Reference
GH_ZuiAction Class
Grasshopper.Kernel Namespace