Grasshopper SDK
GH_DocumentObject.OnObjectChanged Method (String)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnObjectChanged(
	string customEvent
)
Public Sub OnObjectChanged (
	customEvent As String
)
Parameters
customEvent
Type: System.String
Implements
IGH_DocumentObject.OnObjectChanged(String)
See Also
Reference
GH_DocumentObject Class
OnObjectChanged Overload
Grasshopper.Kernel Namespace