Grasshopper SDK
IGH_DataAccess.GetDataTree<T> Method (Int32, GH_Structure<T>)
 Retrieve an entire data tree from an input parameter during GH_Component.SolveInstance().
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool GetDataTree<T>(
	int index,
	out GH_Structure<T> tree
)
where T : IGH_Goo
Function GetDataTree(Of T As IGH_Goo) (
	index As Integer,
	<OutAttribute> ByRef tree As GH_Structure(Of T)
) As Boolean
Parameters
index
Type: System.Int32
tree
Type: Grasshopper.Kernel.Data.GH_Structure<T>
Type Parameters
T
Type of the data to retrieve. Must be identical to the type stored in the parameter.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
IGH_DataAccess Interface
GetDataTree Overload
Grasshopper.Kernel Namespace