Grasshopper SDK
GH_UndoException Constructor (String)
Initializes a new instance of the GH_UndoException class
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoException(
	string message
)
Public Sub New (
	message As String
)
Parameters
message
Type: System.String
See Also
Reference
GH_UndoException Class
GH_UndoException Overload
Grasshopper.Kernel.Undo Namespace