Grasshopper SDK
GH_UndoServer.RedoNames Property
 Gets a sorted list of all the redo Guids in this server.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string> RedoNames { get; }
Public ReadOnly Property RedoNames As List(Of String)
	Get
Property Value
Type: List<String>
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoServer.RedoNames"]
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace