Grasshopper SDK
GH_PingDocumentEventArgs Constructor
Initializes a new instance of the GH_PingDocumentEventArgs class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PingDocumentEventArgs()
Public Sub New
See Also
Reference
GH_PingDocumentEventArgs Class
Grasshopper.Kernel Namespace