Grasshopper SDK
GH_DocDiagramPainter.IgnoreSelectedStates Property
 Gets or sets the Ignore Selected State flag. When set to True, selected objects are not drawn in a different colour.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IgnoreSelectedStates { get; set; }
Public Property IgnoreSelectedStates As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_DocDiagramPainter.IgnoreSelectedStates"]
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace