Grasshopper SDK
GH_InstanceDescription.WriteFull Method
 GH_InstanceDescription does not by default serialize all fields. Use this function to write all fields to the archive. This method is compatible with the default Write()/Read() operations.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool WriteFull(
	GH_IWriter writer
)
Public Overridable Function WriteFull (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Writer for serialization.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace