Grasshopper SDK
GH_Format.Style Property
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Style Style { get; }
Public ReadOnly Property Style As GH_Style
	Get
Property Value
Type: GH_Style
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_Format.Style"]
See Also
Reference
GH_Format Class
Grasshopper.Documentation Namespace