Grasshopper SDK
GH_DocumentIO.Copy Method (GH_ClipboardType, Boolean)
 Copy the internal document into the clipboard.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Copy(
	GH_ClipboardType clipboard,
	bool limitToSelection
)
Public Function Copy (
	clipboard As GH_ClipboardType,
	limitToSelection As Boolean
) As Boolean
Parameters
clipboard
Type: Grasshopper.Kernel.GH_ClipboardType
Specifies the clipboard type to use.
limitToSelection
Type: System.Boolean
If true, only the selected objects will be copied.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentIO Class
Copy Overload
Grasshopper.Kernel Namespace