Grasshopper SDK
Translation Class
 Implements a translation (Move) transformation.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.Transforms.Translation
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class Translation : ITransform
Public Class Translation
	Implements ITransform
The Translation type exposes the following members.
Constructors
Name | Description
Translation()
Initializes a new instance of the Translation class
Translation(Vector3d)
Initializes a new instance of the Translation class
Top
Properties
Name | Description
Name
TranslationVector
Top
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Grasshopper.Kernel.Types.Transforms Namespace