Grasshopper SDK
GH_Capsule.DefaultRadius Field
 The default radius (in pixel units) of the rounded corners.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int DefaultRadius = 3
Public Const DefaultRadius As Integer = 3
Field Value
Type: Int32
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace