Grasshopper SDK
Instances.RedrawCanvas Method
 Forces a redraw of the currently active Grasshopper Canvas.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RedrawCanvas()
Public Shared Sub RedrawCanvas
See Also
Reference
Instances Class
Grasshopper Namespace