Grasshopper SDK
GH_Tooltip.Layout Method
 Layout the tooltip fields. Layout happens automatically if you use the AssigTooltipField method, if however you poke values directly in the tooltip form you must place a call to Layout() before showing the tooltip.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void Layout()
Public Shared Sub Layout
See Also
Reference
GH_Tooltip Class
Grasshopper.GUI Namespace