Grasshopper SDK
Generic Class
 Implements a generic matrix transformation.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.Transforms.Generic
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class Generic : ITransform
Public Class Generic
	Implements ITransform
The Generic type exposes the following members.
Constructors
Name | Description
Generic()
Initializes a new instance of the Generic class
Generic(Transform)
Initializes a new instance of the Generic class
Top
Properties
Name | Description
Name
Transform
Top
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Grasshopper.Kernel.Types.Transforms Namespace