Grasshopper SDK
GH_ComponentServer Events
The GH_ComponentServer type exposes the following members.
Events
Name | Description
GHAFileLoaded
 Raised whenever a GHA file has been successfully loaded.
Top
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace