Grasshopper SDK
GH_Document.NewSolution Method (Boolean, GH_SolutionMode)
 Start a new solution.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void NewSolution(
	bool expireAllObjects,
	GH_SolutionMode mode
)
Public Sub NewSolution (
	expireAllObjects As Boolean,
	mode As GH_SolutionMode
)
Parameters
expireAllObjects
Type: System.Boolean
If True, all objects will be recalculated. If False, only already expired objects will be recalculated.
mode
Type: Grasshopper.Kernel.GH_SolutionMode
Solution mode. Only use CommandLine or Silent if your solution runs in the background.
See Also
Reference
GH_Document Class
NewSolution Overload
Grasshopper.Kernel Namespace