Grasshopper SDK
GH_DocModifiedEventArgs Class
 These arguments are passed along with ModifiedChanged events on GH_Document.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_DocModifiedEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocModifiedEventArgs : EventArgs
Public Class GH_DocModifiedEventArgs
	Inherits EventArgs
The GH_DocModifiedEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document that raised the event.
Modified
 Gets the value of the document Modified flag at the time the event was raised, it may have been changed in between by other event handlers.
Top
See Also
Reference
Grasshopper.Kernel Namespace