Grasshopper SDK
IGH_SettingCategory Interface
 Represents a single category in the Settings UI. Implement this interface or derive from GH_SettingsCategory to add a new Category to the Grasshopper Settings interface.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_SettingCategory
Public Interface IGH_SettingCategory
The IGH_SettingCategory type exposes the following members.
Properties
Name | Description
Description
 Category description.
Icon
 Category icon. Image should be 48x48 pixels.
Name
 Category name (not case sensitive). Use dots to separate subcategories.
Parent
 Gets the name of the parent category. If the category is supposed to be top-level, this property will return null or a String.Empty.
Top
See Also
Reference
Grasshopper.GUI Namespace