Grasshopper SDK
GH_CanvasDropTargetValidator Constructor
Initializes a new instance of the GH_CanvasDropTargetValidator class
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CanvasDropTargetValidator()
Public Sub New
See Also
Reference
GH_CanvasDropTargetValidator Class
Grasshopper.GUI.Canvas Namespace