Grasshopper SDK
IGH_DocumentObject.PreviewExpiredEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void PreviewExpiredEventHandler(
	IGH_DocumentObject sender,
	GH_PreviewExpiredEventArgs e
)
Public Delegate Sub PreviewExpiredEventHandler (
	sender As IGH_DocumentObject,
	e As GH_PreviewExpiredEventArgs
)
Parameters
sender
Type: Grasshopper.Kernel.IGH_DocumentObject
e
Type: Grasshopper.Kernel.GH_PreviewExpiredEventArgs
See Also
Reference
Grasshopper.Kernel Namespace