Grasshopper SDK
GH_Document.AssociateWithRhinoDocument Method
 Associate this GH_Document with the currently active Rhino document. This only works if both the 3dm and the ghx file have been saved at least once.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AssociateWithRhinoDocument()
Public Sub AssociateWithRhinoDocument
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace