Grasshopper SDK
IGH_CanvasValidator.AddedToCanvas Method
 This method will be called by the Canvas when this validator is added to it.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void AddedToCanvas(
	GH_Canvas canvas
)
Sub AddedToCanvas (
	canvas As GH_Canvas
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas which just added this validator.
See Also
Reference
IGH_CanvasValidator Interface
Grasshopper.GUI.Canvas Namespace