Grasshopper SDK
GH_IconDisplayAction Class
 Records a single icon display mode event.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ObjectUndoAction
 Grasshopper.Kernel.Undo.Actions.GH_IconDisplayAction
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_IconDisplayAction : GH_ObjectUndoAction
Public Class GH_IconDisplayAction
	Inherits GH_ObjectUndoAction
The GH_IconDisplayAction type exposes the following members.
Constructors
Name | Description
GH_IconDisplayAction
Initializes a new instance of the GH_IconDisplayAction class
Top
Properties
Name | Description
Top
Methods
Name | Description
Object_Redo |  (Overrides GH_ObjectUndoAction.Object_Redo(GH_Document, IGH_DocumentObject).)
Object_Undo |  (Overrides GH_ObjectUndoAction.Object_Undo(GH_Document, IGH_DocumentObject).)
Top
See Also
Reference
Grasshopper.Kernel.Undo.Actions Namespace