Grasshopper SDK
GH_CanvasWireValidator.WireDelegate Property
 Gets or sets the delegate to be invoked when a wire is created.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Action WireDelegate { get; set; }
Public Property WireDelegate As Action
	Get
	Set
Property Value
Type: Action
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasWireValidator.WireDelegate"]
See Also
Reference
GH_CanvasWireValidator Class
Grasshopper.GUI.Canvas Namespace