Grasshopper SDK
IGH_VarParamComponent.ParametersModified Method
 This function will be called wheneven the param collection of a component has been altered through the ParamManager. If your parameters have a peculiar naming scheme, this is the best place to assign those.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void ParametersModified(
	GH_VarParamSide side
)
Sub ParametersModified (
	side As GH_VarParamSide
)
Parameters
side
Type: Grasshopper.Kernel.GH_VarParamSide
See Also
Reference
IGH_VarParamComponent Interface
Grasshopper.Kernel Namespace