Grasshopper SDK
CentralSettings.RibbonSeparatorsChangedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void RibbonSeparatorsChangedEventHandler()
Public Delegate Sub RibbonSeparatorsChangedEventHandler
See Also
Reference
Grasshopper Namespace