Grasshopper SDK
IGH_Structure.PathExists Method
 Returns True if the specified path is already defined inside the structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool PathExists(
	GH_Path path
)
Function PathExists (
	path As GH_Path
) As Boolean
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
The data path to search for
Return Value
Type: Boolean
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace