Grasshopper SDK
GH_Param<T>.AddVolatileData Method (GH_Path, Int32, T)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AddVolatileData(
	GH_Path path,
	int index,
	T data
)
Public Function AddVolatileData (
	path As GH_Path,
	index As Integer,
	data As T
) As Boolean
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
index
Type: System.Int32
data
Type: T
Return Value
Type: Boolean
See Also
Reference
GH_Param<T> Class
AddVolatileData Overload
Grasshopper.Kernel Namespace