Grasshopper SDK
GH_RhinoScriptInterface.EnableBanner Method
 Enables the display of the Grasshopper banner during Component loading. The banner is typically only shown once during a Grasshopper session, namely when the Editor is first loaded.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void EnableBanner()
Public Sub EnableBanner
Examples
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
  Dim GH
  Set GH = Rhino.GetPlugInObject("Grasshopper")
  Call GH.EnableBanner()
  Call GH.ShowEditor()
  Set GH = Nothing
End Sub
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace