Grasshopper SDK
GH_CursorServer.AttachCursor Method
 Attach a cursor to a control.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AttachCursor(
	Control control,
	string name
)
Public Function AttachCursor (
	control As Control,
	name As String
) As Boolean
Parameters
control
Type: System.Windows.Forms.Control
Control to assign cursor to.
name
Type: System.String
Name of cursor to assign. This is the filename of the original cursor file minus the extension.
Return Value
Type: Boolean
True if cursor was assigned, or false if no matching cursor could be found.
See Also
Reference
GH_CursorServer Class
Grasshopper.GUI Namespace