Grasshopper SDK
GH_DigitNumber.PrimaryDigits Property
 Gets the internal list of primary digits. Do not modify this list.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<int> PrimaryDigits { get; }
Public ReadOnly Property PrimaryDigits As IList(Of Integer)
	Get
Property Value
Type: IList<Int32>
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitNumber.PrimaryDigits"]
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace