Grasshopper SDK
GH_Line Constructor (Line)
 Create a duplicate of another line.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Line(
	Line line
)
Public Sub New (
	line As Line
)
Parameters
line
Type: Line
Line to copy. If null, a default line will be created.
See Also
Reference
GH_Line Class
GH_Line Overload
Grasshopper.Kernel.Types Namespace