Grasshopper SDK
GH_Point.CreateFromCoordinate Method
 Create a new point geometry instance based on a fixed coordinate
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateFromCoordinate(
	Point3d pt
)
Public Sub CreateFromCoordinate (
	pt As Point3d
)
Parameters
pt
Type: Point3d
The coordinate for the point
Remarks
This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace