Grasshopper SDK
GH_DigitScroller.ValueChanged Event
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_DigitScroller.ValueChangedEventHandler ValueChanged
Public Event ValueChanged As GH_DigitScroller.ValueChangedEventHandler
Value
Type: Grasshopper.GUI.GH_DigitScroller.ValueChangedEventHandler
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace