Grasshopper SDK
GH_Document.DocumentID Property
 Gets the document Id. The Id is assigned at construction and never changed. Note: clusters may choose to modify the Id of their internal documents.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid DocumentID { get; }
Public ReadOnly Property DocumentID As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.DocumentID"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace