Grasshopper SDK
GH_ConnectivityDisparity.TopSet Property
 Gets a pointer to the complete diagram stored in this disparity class.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ConnectivityDiagram TopSet { get; }
Public ReadOnly Property TopSet As GH_ConnectivityDiagram
	Get
Property Value
Type: GH_ConnectivityDiagram
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ConnectivityDisparity.TopSet"]
See Also
Reference
GH_ConnectivityDisparity Class
Grasshopper.Kernel Namespace