Grasshopper SDK
GH_Plane Class
 Represents a 3D plane. GH_Plane re-implements the OpenNURBS OnPlane class.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Plane>
 Grasshopper.Kernel.Types.GH_GeometricGoo<Plane>
 Grasshopper.Kernel.Types.GH_Plane
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Plane : GH_GeometricGoo<Plane>,
	IGH_BakeAwareData, IGH_PreviewData
Public Class GH_Plane
	Inherits GH_GeometricGoo(Of Plane)
	Implements IGH_BakeAwareData, IGH_PreviewData
The GH_Plane type exposes the following members.
Constructors
Name | Description
GH_Plane()
 Default constructor. Creates a world XY plane.
GH_Plane(Plane)
 Create a duplicate of another plane.
GH_Plane(GH_Plane)
 Create a duplicate of another plane.
Top
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsValid
 Gets the validity of the plane. If the plane is invalid, attempts are made to fix the data. If the plane remains invalid, False is returned.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
DrawPlane(DisplayPipeline, Plane)
 Draw a plane with default colours and default size.
DrawPlane(DisplayPipeline, Plane, Double, Int32)
DrawPlane(DisplayPipeline, Plane, Double, Int32, Color, Color, Color)
DrawPlane(DisplayPipeline, Plane, Double, Int32, Color, Color, Color, Color)
DrawPlaneIcon
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateGeometry
 Create a duplicate of this plane.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
DuplicatePlane
 Create a duplicate of this plane.
EmitProxy
 Returns a proxy that represents this plane. Do not call this function unless you're
 (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString
 Format the plane using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace