Grasshopper SDK
GH_ObjectChangedEventArgs.m_sender Field
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected IGH_DocumentObject m_sender
Protected m_sender As IGH_DocumentObject
Field Value
Type: IGH_DocumentObject
See Also
Reference
GH_ObjectChangedEventArgs Class
Grasshopper.Kernel Namespace