Grasshopper SDK
IGH_PreviewArgs.Viewport Property
 Gets the Viewport in which the current preview is drawn.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
RhinoViewport Viewport { get; }
ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_PreviewArgs.Viewport"]
See Also
Reference
IGH_PreviewArgs Interface
Grasshopper.Kernel Namespace