Grasshopper SDK
GH_DocumentIO.SubsidiaryDocumentSavePrompt Method (String, Boolean, Int32)
 Display a 'stuff has changed do you want to save' message box with Yes/No/Cancel options.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static DialogResult SubsidiaryDocumentSavePrompt(
	string documentName,
	bool modified,
	int modifiedSubsidiaries
)
Public Shared Function SubsidiaryDocumentSavePrompt (
	documentName As String,
	modified As Boolean,
	modifiedSubsidiaries As Integer
) As DialogResult
Parameters
documentName
Type: System.String
Name of top level document.
modified
Type: System.Boolean
Boolean indicating whether top-level document is modified.
modifiedSubsidiaries
Type: System.Int32
Number of modified subsidiary documents.
Return Value
Type: DialogResult
Yes, No, Cancel or None state.
See Also
Reference
GH_DocumentIO Class
SubsidiaryDocumentSavePrompt Overload
Grasshopper.Kernel Namespace