Grasshopper SDK
GH_Convert.ToPoint3d Method
 Convert data into Rhino.Geometry.Point3d.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToPoint3d(
	Object data,
	ref Point3d rc,
	GH_Conversion conversion_level
)
Public Shared Function ToPoint3d (
	data As Object,
	ByRef rc As Point3d,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Point3d
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace