Grasshopper SDK
CentralSettings.LoadProtectionChanged Event
 Raised whenever the load protection of a certain plugin changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.LoadProtectionChangedEventHandler LoadProtectionChanged
Public Shared Event LoadProtectionChanged As CentralSettings.LoadProtectionChangedEventHandler
Value
Type: Grasshopper.CentralSettings.LoadProtectionChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace