Grasshopper SDK
IGH_CanvasValidator.RemovedFromCanvas Method
 This method will be called by the Canvas when this validator is removed from it.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void RemovedFromCanvas(
	GH_Canvas canvas
)
Sub RemovedFromCanvas (
	canvas As GH_Canvas
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas which just removed this validator.
See Also
Reference
IGH_CanvasValidator Interface
Grasshopper.GUI.Canvas Namespace