Grasshopper SDK
GH_SettingsServer.GetValue Method (String, Color)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color GetValue(
	string key,
	Color default
)
Public Function GetValue (
	key As String,
	default As Color
) As Color
Parameters
key
Type: System.String
default
Type: System.Drawing.Color
Return Value
Type: Color
See Also
Reference
GH_SettingsServer Class
GetValue Overload
Grasshopper.Kernel Namespace