Grasshopper SDK
GH_Gradient.NearestGrip Method (Double, GH_GripSide)
 Find the nearest grip to a parameter.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int NearestGrip(
	double t,
	GH_GripSide side
)
Public Function NearestGrip (
	t As Double,
	side As GH_GripSide
) As Integer
Parameters
t
Type: System.Double
Parameter to search from.
side
Type: Grasshopper.GUI.Gradient.GH_GripSide
Side to search.
Return Value
Type: Int32
The grip nearest to the parameter.
See Also
Reference
GH_Gradient Class
NearestGrip Overload
Grasshopper.GUI.Gradient Namespace