Grasshopper SDK
GH_FontServer.StringWidth Method (IEnumerable<String>, Font)
 Measure the maximum width of a collection of strings
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int StringWidth(
	IEnumerable<string> text,
	Font font
)
Public Shared Function StringWidth (
	text As IEnumerable(Of String),
	font As Font
) As Integer
Parameters
text
Type: System.Collections.Generic.IEnumerable<String>
The strings to measure
font
Type: System.Drawing.Font
The font to measure with
Return Value
Type: Int32
See Also
Reference
GH_FontServer Class
StringWidth Overload
Grasshopper.Kernel Namespace