Grasshopper SDK
GH_PreviewUtil.AddCurve Method
 Add a curve to the temporary Preview lists.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddCurve(
	Curve curve
)
Public Sub AddCurve (
	curve As Curve
)
Parameters
curve
Type: Curve
Curve to add. Invalid curves will be ignored.
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace