Grasshopper SDK
GH_Grip.IsValid Property
 Gets whether this grip is valid. A valid grip must have a non-empty Id and a non-NaN parameter.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_Grip.IsValid"]
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace