Grasshopper SDK
GH_ColourPickerBase Class
 Provides Colour picker GUI not tied to a control-handle.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Base.GH_ColourPickerBase
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ColourPickerBase
Public Class GH_ColourPickerBase
The GH_ColourPickerBase type exposes the following members.
Constructors
Name | Description
GH_ColourPickerBase
 Create a new instance of the Colour Picker base control. This constructor assigns the default Colour space model and involves a call to the Grasshopper core settings server. You must call SetupColourPicker() prior to rendering this control on screen.
Top
Properties
Name | Description
AutoSize
 Gets or sets a value indicating whether the width and height of the Bounds are adjusted to fit the UI.
BackColour
 Gets or sets the background colour of the picker.
BaseColour
 Gets the original base colour for this picker. Use SetupColourPicker to assign this colour.
BaseColourBox
 Gets the rectangle containing the base colour swatch.
Bounds
 Gets or sets the Bounds for this control.
ChannelBox0
 Gets the rectangle containing the tag string for the first channel slider.
ChannelBox1
 Gets the rectangle containing the tag string for the second channel slider.
ChannelBox2
 Gets the rectangle containing the tag string for the third channel slider.
ChannelBox3
 Gets the rectangle containing the tag string for the fourth channel slider.
ColourCubeBox
 Gets the rectangle that contains the colour space cube.
ColourSpace
 Gets the Colour space mode used in this picker.
Cube
 Gets the graphics object that describes the current colour cube.
DesiredHeight
 Gets the ideal height for this colour picker given it's width and UI settings.
DrawAlphaSlider
 Gets or sets whether or not the alpha slider is included in the UI.
DrawBackground
 Gets or sets whether the background of the picker is drawn.
DrawChannelSliders
 Gets or sets whether or not the three basic channel sliders are included in the UI.
DropperPreviewBox
 Gets the rectangle in which the eye-dropped preview will be drawn.
Font
 Gets or sets the Font used in this Colour Picker. Do not Dispose the Font returned by this property.
HSVSpaceBox
 Gets the rectangle containing the base colour space.
IsTextInput
 Gets whether any of the slider is currently displaying a text input box.
Padding
 Gets or sets the Padding for this control.
PickColour
 Gets the picked colour.
PickColourBox
 Gets the rectangle containing the pick colour swatch.
RGBSpaceBox
 Gets the rectangle containing the pick colour space.
SRCSpaceBox
 Gets the rectangle containing the eye-dropper function.
Top
Methods
Name | Description
Invalidate
 Raise the Invalidated event.
MouseClick
 Respond to mouse-click events.
MouseDoubleClick
 Respond to mouse-doubleclick events.
MouseDown
 Respond to mouse-down events.
MouseMove
 Respond to mouse-move events.
MouseUp
 Respond to mouse-up events.
OnColorChanged
 Raise the ColorChanged event.
Render
 Render this slider into a Graphics context.
RespondToEnter
RespondToEscape
SetupColourPicker(Color, Point4d, GH_ColourSpace)
 Setup all UI elements.
SetupColourPicker(Color, Color, GH_ColourSpace)
 Setup all UI elements.
Top
Events
Name | Description
ColorChanged
 Raised whenever the color of this picker is changed due to User-Interface methods.
Invalidated
 Raised whenever a redraw is required.
Top
Fields
Name | Description
MinWidth
SliderSize
Spacing
SwatchSize
Top
See Also
Reference
Grasshopper.GUI.Base Namespace