Grasshopper SDK
GH_ColourPickerBase.ColourSpace Property
 Gets the Colour space mode used in this picker.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ColourSpace ColourSpace { get; }
Public ReadOnly Property ColourSpace As GH_ColourSpace
	Get
Property Value
Type: GH_ColourSpace
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.ColourSpace"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace