Grasshopper SDK
IGH_TagArtist.ID Property
 Gets the ID of this Tag Artist object.
Namespace: Grasshopper.GUI.Canvas.TagArtists
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid ID { get; }
ReadOnly Property ID As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.TagArtists.IGH_TagArtist.ID"]
See Also
Reference
IGH_TagArtist Interface
Grasshopper.GUI.Canvas.TagArtists Namespace