Grasshopper SDK
GH_DocumentObject.CreateAttributes Method
 This function creates the stand-alone attributes for this object. If you wish to supply your own Attributes, you must override this function.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract void CreateAttributes()
Public MustOverride Sub CreateAttributes
Implements
IGH_DocumentObject.CreateAttributes()
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace