Grasshopper SDK
GH_Convert.ToGeometricGoo Method
 Converts an object into GeometricGoo. Does not duplicate the data if a lossless conversion is possible.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static IGH_GeometricGoo ToGeometricGoo(
	Object data
)
Public Shared Function ToGeometricGoo (
	data As Object
) As IGH_GeometricGoo
Parameters
data
Type: System.Object
Data to convert.
Return Value
Type: IGH_GeometricGoo
An instance that implements IGH_GeometricGoo on success or null on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace