Grasshopper SDK
GH_ExpressionParser.Evaluate Method
 Evaluate the expression currently loaded in the Symbols cache using the currently loaded variables.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant Evaluate()
Public Function Evaluate As GH_Variant
Return Value
Type: GH_Variant
See Also
Reference
GH_ExpressionParser Class
Evaluate Overload
Grasshopper.Kernel.Expressions Namespace