Grasshopper SDK
GH_AutoSaveSettings.EnableAutoSaveChanged Event
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_AutoSaveSettings.EnableAutoSaveChangedEventHandler EnableAutoSaveChanged
Public Shared Event EnableAutoSaveChanged As GH_AutoSaveSettings.EnableAutoSaveChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_AutoSaveSettings.EnableAutoSaveChangedEventHandler
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace