Grasshopper SDK
IGH_DataAccess.AbortComponentSolution Method
 Call this method if you wish to stop solving this component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void AbortComponentSolution()
Sub AbortComponentSolution
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace