Grasshopper SDK
GH_VerticalScrollBar Class
 Scroll bar control with floating point accuracy.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.Panel
 Grasshopper.GUI.GH_DoubleBufferedPanel
 Grasshopper.GUI.GH_VerticalScrollBar
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_VerticalScrollBar : GH_DoubleBufferedPanel
Public Class GH_VerticalScrollBar
	Inherits GH_DoubleBufferedPanel
The GH_VerticalScrollBar type exposes the following members.
Constructors
Name | Description
GH_VerticalScrollBar
Initializes a new instance of the GH_VerticalScrollBar class
Top
Properties
Name | Description
Grip
 Gets the actual dimensions of the scroll bar grip.
GripRegion
 Gets the grip region for this scroll bar. The Grip Region is the area in which the grip can be found. It is essentially the Client area minus the padding.
ImpliedVerticalOffset
 Gets or sets the offset of the target region as implied by the scroll ratio. If you set this value, the ratio is reverse engineered.
ScreenHeight
 Gets or sets the height of the screen area (the visible area)
TargetHeight
 Gets or sets the height of the target area (the area being scrolled)
TargetRatio
 Gets or sets the scroll ration. If the scroll ratio is changed, the OnScrollRatioChanged event will be raised.
Top
Methods
Name | Description
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
Top
Events
Name | Description
ScrollRatioChanged
Top
See Also
Reference
Grasshopper.GUI Namespace