Grasshopper SDK
GH_TypeLib.id_gh_material Field
Grasshopper.Kernel.Types.GH_Material
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Guid id_gh_material
Public Shared id_gh_material As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace