Grasshopper SDK
GH_Document.FindAttribute Method (PointF, Boolean)
 Search for attributes that contain a certain point. The attribute balloon boxes are also taken into account.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Attributes FindAttribute(
	PointF pt,
	bool topLevelOnly
)
Public Function FindAttribute (
	pt As PointF,
	topLevelOnly As Boolean
) As IGH_Attributes
Parameters
pt
Type: System.Drawing.PointF
The point in Canvas coordinates
topLevelOnly
Type: System.Boolean
If true, child attributes will be skipped.
Return Value
Type: IGH_Attributes
See Also
Reference
GH_Document Class
FindAttribute Overload
Grasshopper.Kernel Namespace