Grasshopper SDK
IGH_CanvasValidator Interface
 'Interface used for limiting a collection of typical actions on the canvas. Do not implement this interface directly if you can help it, instead inherit from GH_CanvasValidator.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_CanvasValidator
Public Interface IGH_CanvasValidator
The IGH_CanvasValidator type exposes the following members.
Methods
Name | Description
AddedToCanvas
 This method will be called by the Canvas when this validator is added to it.
AppliesToDocument
 Test whether this validator applies to a specific document.
CanAcceptObject
 Validates whether a specific component can be accepted by the canvas at all.
CanCreateObject
 Validates whether a specific component may be inserted at a specific point.
CanCreateWire
 Validates whether a wire-operation can commence.
CanDeleteObject
 Validates whether a specific object can be deleted.
CanDeleteWire
 Validates whether a wire can be deleted.
CanDragObject
 Validates whether some components can be dragged.
CanNavigateCanvas
 Validates whether the canvas can be navigated (panning, zooming etc)
CanShowCanvasMenu
 Validates whether the canvas menus (both the radial and the old-fashioned one) are allowed to pop up at a specific point.
CanShowComponentSearchBox
 Validates whether the double-click-component-search-window is allowed to pop up at a specific point.
CanShowObjectMenu
 Validates whether the object menu can be shown.
RemovedFromCanvas
 This method will be called by the Canvas when this validator is removed from it.
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace