Grasshopper SDK
GH_DoubleBufferedPanel Class
 Derives from Windows.Forms.Panel but overrides certain flags that improve on-screen rendering. Use panel if you want to have a custom drawn control that is under the control of the owner form.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.Panel
 Grasshopper.GUI.GH_DoubleBufferedPanel
 Grasshopper.GUI.GH_FontList
 Grasshopper.GUI.GH_FontScroller
 Grasshopper.GUI.GH_HorizontalSeparator
 Grasshopper.GUI.GH_VerticalScrollBar
 Grasshopper.GUI.GH_VerticalSeparator
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DoubleBufferedPanel : Panel
Public Class GH_DoubleBufferedPanel
	Inherits Panel
The GH_DoubleBufferedPanel type exposes the following members.
Constructors
Name | Description
GH_DoubleBufferedPanel
Initializes a new instance of the GH_DoubleBufferedPanel class
Top
See Also
Reference
Grasshopper.GUI Namespace