Grasshopper SDK
GH_DocDiagramPainter.BoundingBox Property
 Gets the 2D domain of the diagram in canvas coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RectangleF BoundingBox { get; }
Public ReadOnly Property BoundingBox As RectangleF
	Get
Property Value
Type: RectangleF
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_DocDiagramPainter.BoundingBox"]
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace