Grasshopper SDK
GH_ComponentParamServer.IndexOfInputParam Method (Guid)
 Finds the index of the input parameter that matches the specified search mask.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int IndexOfInputParam(
	Guid id
)
Public Function IndexOfInputParam (
	id As Guid
) As Integer
Parameters
id
Type: System.Guid
ID to search for
Return Value
Type: Int32
The index of the parameter, or -1 if no parameter was found to match
See Also
Reference
GH_ComponentParamServer Class
IndexOfInputParam Overload
Grasshopper.Kernel Namespace