Grasshopper SDK
GH_Param<T>.Preview_DrawWires Method
 This function can be used to iterate over all items in the Volatile data tree and call DrawViewportWires on each item that implements Preview.IGH_PreviewData. This function requires a lot of TypeOf and DirectCasting, so if you're worried about performance you should consider doing this yourself.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void Preview_DrawWires(
	IGH_PreviewArgs args
)
Protected Sub Preview_DrawWires (
	args As IGH_PreviewArgs
)
Parameters
args
Type: Grasshopper.Kernel.IGH_PreviewArgs
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace