Grasshopper SDK
GH_GraphicsUtil.BoxClosestArcPoint Method
 Find the closest point on or in a box given a test point. Arc extension is implied.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static PointF BoxClosestArcPoint(
	PointF pt,
	RectangleF box
)
Public Shared Function BoxClosestArcPoint (
	pt As PointF,
	box As RectangleF
) As PointF
Parameters
pt
Type: System.Drawing.PointF
Sample point.
box
Type: System.Drawing.RectangleF
Box to evaluate.
Return Value
Type: PointF
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace