Grasshopper SDK
GH_Canvas.ValidGraphics Property
 Gets or sets the Valid Graphics flag. Even if the flag is set to true, though, the property may still return false if there is a problem with the internal graphics object.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ValidGraphics { get; set; }
Public Property ValidGraphics As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.ValidGraphics"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace