Grasshopper SDK
IGH_GooProxy.UserString Property
 Gets or sets the user-defined string that describes this proxy. This only really makes sense if the Proxy is Parsable.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string UserString { get; set; }
Property UserString As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_GooProxy.UserString"]
Return Value
Type: String
The UserString value or the value of FormatInstance() if UserString has not been assigned.
See Also
Reference
IGH_GooProxy Interface
Grasshopper.Kernel.Types Namespace