Grasshopper SDK
GH_DocObjectEventArgs Class
 These arguments are passed along with ObjectsAdded and ObjectsRemoved events on GH_Document.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_DocObjectEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocObjectEventArgs : EventArgs
Public Class GH_DocObjectEventArgs
	Inherits EventArgs
The GH_DocObjectEventArgs type exposes the following members.
Properties
Name | Description
Attributes
 Gets all the attributes that are associated with all objects in the event.
Document
 Gets the document that raised the event.
Object
 Gets the object to which this event pertains.
ObjectCount
 Gets the number of objects in this event.
Objects
 Gets a readonly list of the objects to which this event pertains.
Top
See Also
Reference
Grasshopper.Kernel Namespace