Grasshopper SDK
GH_InstanceDescription.InstanceDescription Property
 Gets a description of the current state of the object. This field is usually the same as the Description() field, but it might be variable when overridden.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string InstanceDescription { get; }
Public Overridable ReadOnly Property InstanceDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_InstanceDescription.InstanceDescription"]
Implements
IGH_InstanceDescription.InstanceDescription
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace