Grasshopper SDK
Instances.Settings Property
 Represents the default settings database. Feel free to add your own settings to this database.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_SettingsServer Settings { get; }
Public Shared ReadOnly Property Settings As GH_SettingsServer
	Get
Property Value
Type: GH_SettingsServer
[Missing <value> documentation for "P:Grasshopper.Instances.Settings"]
See Also
Reference
Instances Class
Grasshopper Namespace