Grasshopper SDK
GH_Tooltip.IsOwner Method
 Returns true if the test control matches the internal Owner control. Use this method to make sure you actually own this tooltip prior to clearing it.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsOwner(
	Control test
)
Public Shared Function IsOwner (
	test As Control
) As Boolean
Parameters
test
Type: System.Windows.Forms.Control
Return Value
Type: Boolean
Remarks
See Also
Reference
GH_Tooltip Class
Grasshopper.GUI Namespace