Grasshopper SDK
GH_FontPicker.ShowFontPickerWindow Method (Font)
 Display the fontpicker in a window.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font ShowFontPickerWindow(
	Font font
)
Public Shared Function ShowFontPickerWindow (
	font As Font
) As Font
Parameters
font
Type: System.Drawing.Font
Default font.
Return Value
Type: Font
A newly picked font.
See Also
Reference
GH_FontPicker Class
ShowFontPickerWindow Overload
Grasshopper.GUI Namespace