Grasshopper SDK
GH_UpgradeUtil.SwapComponents Method (IGH_Component, IGH_Component, Boolean)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool SwapComponents(
	IGH_Component oldComponent,
	IGH_Component newComponent,
	bool migrateParameters
)
Public Shared Function SwapComponents (
	oldComponent As IGH_Component,
	newComponent As IGH_Component,
	migrateParameters As Boolean
) As Boolean
Parameters
oldComponent
Type: Grasshopper.Kernel.IGH_Component
Component current in a GH_Document.
newComponent
Type: Grasshopper.Kernel.IGH_Component
Component to swap.
migrateParameters
Type: System.Boolean
If true, all parameters will be moved from old to new.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_UpgradeUtil Class
SwapComponents Overload
Grasshopper.Kernel Namespace