Grasshopper SDK
GH_FontServer Events
The GH_FontServer type exposes the following members.
Events
Name | Description
ConsoleFamilyChanged
 Raised whenever the MonospacedFamily is changed.
ScriptFamilyChanged
 Raised whenever the ScriptFamily is changed.
StandardFamilyChanged
 Raised whenever the StandardFamily is changed.
Top
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace