Grasshopper SDK
IGH_Attributes.RenderToCanvas Method
 Render these attributes into a Canvas control.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void RenderToCanvas(
	GH_Canvas canvas,
	GH_CanvasChannel channel
)
Sub RenderToCanvas (
	canvas As GH_Canvas,
	channel As GH_CanvasChannel
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas to draw on.
channel
Type: Grasshopper.GUI.Canvas.GH_CanvasChannel
Current drawing channel.
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace