Grasshopper SDK
GH_Viewport.GH_DisplayMatrix Enumeration
 Enumerates the possible Display Transformation matrices.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_DisplayMatrix
Public Enumeration GH_DisplayMatrix
Members
Member name | Value | Description
CanvasToControl | 0
ControlToCanvas | 1
See Also
Reference
Grasshopper.GUI.Canvas Namespace