Grasshopper SDK
GH_FileSystemEventServer.RemoveWatcher Method (Object)
 Remove all watchers that are linked to a specific object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RemoveWatcher(
	Object owner
)
Public Shared Sub RemoveWatcher (
	owner As Object
)
Parameters
owner
Type: System.Object
See Also
Reference
GH_FileSystemEventServer Class
RemoveWatcher Overload
Grasshopper.Kernel Namespace