Grasshopper SDK
GH_Surface.ReferenceID Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override Guid ReferenceID { get; set; }
Public Overrides Property ReferenceID As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Surface.ReferenceID"]
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace