Grasshopper SDK
GH_Component.GenerateParameterHelp Method
 Create an HTML string that lists names and descriptions for input and output parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected string GenerateParameterHelp()
Protected Function GenerateParameterHelp As String
Return Value
Type: String
See Also
Reference
GH_Component Class
GenerateParameterHelp Overload
Grasshopper.Kernel Namespace