Grasshopper SDK
IGH_BakeAwareData.BakeGeometry Method
 Bake an object in the given Rhino document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool BakeGeometry(
	RhinoDoc doc,
	ObjectAttributes att,
	out Guid obj_guid
)
Function BakeGeometry (
	doc As RhinoDoc,
	att As ObjectAttributes,
	<OutAttribute> ByRef obj_guid As Guid
) As Boolean
Parameters
doc
Type: RhinoDoc
Document to bake into.
att
Type: ObjectAttributes
Attributes to bake with (should not be null).
obj_guid
Type: System.Guid
The id of the baked object.
Return Value
Type: Boolean
True on success. If False, obj_guid and obj_inst are not guaranteed to be valid pointers.
See Also
Reference
IGH_BakeAwareData Interface
Grasshopper.Kernel Namespace