Grasshopper SDK
IGH_ActiveObject.AddRuntimeMessage Method
 Add a new message to this object. Valid message type flags are Warning and Error. If the Message string is empty or zero-length no message is added.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void AddRuntimeMessage(
	GH_RuntimeMessageLevel Type,
	string Message
)
Sub AddRuntimeMessage (
	Type As GH_RuntimeMessageLevel,
	Message As String
)
Parameters
Type
Type: Grasshopper.Kernel.GH_RuntimeMessageLevel
Type of message. Only Warnings and Errors are recorded.
Message
Type: System.String
Content of message.
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace