Grasshopper SDK
GH_ConnectivityDisparity.InternalInputs Method
 Find all internal sources for a given id in the subset.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Guid> InternalInputs(
	Guid id
)
Public Function InternalInputs (
	id As Guid
) As List(Of Guid)
Parameters
id
Type: System.Guid
ID of parameter.
Return Value
Type: List<Guid>
A list containing all sources that are present in the subset topology.
See Also
Reference
GH_ConnectivityDisparity Class
Grasshopper.Kernel Namespace