Grasshopper SDK
GH_PointRefData.m_RefParam Field
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double[] m_RefParam
Public m_RefParam As Double()
Field Value
Type: Double[]
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace