Grasshopper SDK
GH_Structure<T>.Path Property
 Gets the data path at the specified index.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Path this[
	int index
] { get; }
Public ReadOnly Property Path (
	index As Integer
) As GH_Path
	Get
Parameters
index
Type: System.Int32
Index of path to retrieve.
Property Value
Type: GH_Path
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.Path(System.Int32)"]
Implements
IGH_Structure.Path[Int32]
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown if the index does not represent a valid path.
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace