Grasshopper SDK
Node3d<T>.ContentAverage Property
 Returns the average coordinate of all items in this node. If this node does not contain any items, Point3d.Unset is returned.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point3d ContentAverage { get; }
Public ReadOnly Property ContentAverage As Point3d
	Get
Property Value
Type: Point3d
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ContentAverage"]
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace