Grasshopper SDK
GH_ObjectChangedEventArgs Fields
The GH_ObjectChangedEventArgs type exposes the following members.
Fields
Name | Description
m_custom
m_sender
m_tag
m_type
Top
See Also
Reference
GH_ObjectChangedEventArgs Class
Grasshopper.Kernel Namespace