Grasshopper SDK
GH_Plane.DrawPlane Method (DisplayPipeline, Plane)
 Draw a plane with default colours and default size.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void DrawPlane(
	DisplayPipeline display,
	Plane plane
)
Public Shared Sub DrawPlane (
	display As DisplayPipeline,
	plane As Plane
)
Parameters
display
Type: DisplayPipeline
plane
Type: Plane
See Also
Reference
GH_Plane Class
DrawPlane Overload
Grasshopper.Kernel.Types Namespace