Grasshopper SDK
IGH_DebugDescription Interface
 Implement this interface to participate in Debug Logging.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_DebugDescription
Public Interface IGH_DebugDescription
The IGH_DebugDescription type exposes the following members.
Methods
Name | Description
AppendToDebugLog
 Write important debugging data to a debug writer object.
Top
See Also
Reference
Grasshopper.Kernel Namespace