Grasshopper SDK
GH_Canvas.ZoomFadeMedium Property
 Gets the ZUI fade alpha value for the medium zoom level threshold. This static field gets set on every Canvas paint start. The medium threshold is typically used for non-informative UI elements such as highlights.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int ZoomFadeMedium { get; }
Public Shared ReadOnly Property ZoomFadeMedium As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.ZoomFadeMedium"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace