Grasshopper SDK
GH_SliderBase.NormalizedValue Property
 Gets or sets the normalized value within the slider domain.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double NormalizedValue { get; set; }
Public Property NormalizedValue As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.NormalizedValue"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace