Grasshopper SDK
GH_AsynchFileData.FileExists Property
 Gets whether the file exists. Note that this property returns false if DataExists=False, regardless of whether the file exists.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool FileExists { get; }
Public ReadOnly Property FileExists As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_AsynchFileData.FileExists"]
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace