Grasshopper SDK
GH_ScriptVariant Constructor (Double)
Initializes a new instance of the GH_ScriptVariant class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ScriptVariant(
	double val
)
Public Sub New (
	val As Double
)
Parameters
val
Type: System.Double
See Also
Reference
GH_ScriptVariant Class
GH_ScriptVariant Overload
Grasshopper.Kernel.Expressions Namespace