Grasshopper SDK
GH_AssemblyFolderInfo Structure
 Represents a folder from which GHA files are loaded.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public struct GH_AssemblyFolderInfo
Public Structure GH_AssemblyFolderInfo
The GH_AssemblyFolderInfo type exposes the following members.
Constructors
Name | Description
GH_AssemblyFolderInfo
Initializes a new instance of the GH_AssemblyFolderInfo class
Top
Properties
Name | Description
SearchOption
 Gets the search option to use when looking for GHA files in this folder.
Top
Methods
Name | Description
ToString |  (Overrides ValueType.ToString().)
Top
Fields
Name | Description
Folder
 The actual full path to the folder.
Type
 Identifies the type of assembly folder.
Top
See Also
Reference
Grasshopper.Kernel Namespace