Grasshopper SDK
GH_DocumentObject.SolutionExpired Event
 Raised whenever the solution of a certain object becomes invalid.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event IGH_DocumentObject.SolutionExpiredEventHandler SolutionExpired
Public Event SolutionExpired As IGH_DocumentObject.SolutionExpiredEventHandler
Value
Type: Grasshopper.Kernel.IGH_DocumentObject.SolutionExpiredEventHandler
Implements
IGH_DocumentObject.SolutionExpired
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace