Grasshopper SDK
IGH_GeometricGoo Interface
 Base interface for all Data inside Grasshoper that could pass for Geometry
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_GeometricGoo : IGH_Goo
Public Interface IGH_GeometricGoo
	Inherits IGH_Goo
The IGH_GeometricGoo type exposes the following members.
Properties
Name | Description
Boundingbox
 Gets the (cached) boundingbox for this geometry. Not all geometry types cache boundingbox results.
IsGeometryLoaded
 Gets a value indicating whether or not this geometry is currently loaded (assuming it is referenced). Not all IGH_GeometricGoo implementations support referenced geometry.
IsReferencedGeometry
 Gets a value indicating whether or not this geometry is referenced. Not all IGH_GeometricGoo implementations support referenced geometry.
ReferenceID
 Gets or sets the Guid of the object that is referenced. Not all IGH_GeometricGoo implementations support referenced geometry.
Top
Methods
Name | Description
ClearCaches
 Clears all caches. Typically if the geometry is referenced, this will erase the local copy.
DuplicateGeometry
 Make a complete duplicate of this geometry. No shallow copies.
GetBoundingBox
 Compute an aligned boundingbox.
LoadGeometry()
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry.
LoadGeometry(RhinoDoc)
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry.
Morph
 Morph the object or a deformable representation of the object.
Transform
 Transforms the object or a deformable representation of the object.
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace