Grasshopper SDK
GH_FontServer.LargeAdjusted Property
 SystemFonts.CaptionFont, 10pt, bold, adjusted for logical pixel size.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font LargeAdjusted { get; }
Public Shared ReadOnly Property LargeAdjusted As Font
	Get
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FontServer.LargeAdjusted"]
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace