Grasshopper SDK
GH_LinkedParamAttributes Constructor
Initializes a new instance of the GH_LinkedParamAttributes class
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LinkedParamAttributes(
	IGH_Param param,
	IGH_Attributes parent
)
Public Sub New (
	param As IGH_Param,
	parent As IGH_Attributes
)
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
parent
Type: Grasshopper.Kernel.IGH_Attributes
See Also
Reference
GH_LinkedParamAttributes Class
Grasshopper.Kernel.Attributes Namespace