Grasshopper SDK
GH_Format.Create Method (String, GH_Style)
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Format Create(
	string content,
	GH_Style style
)
Public Shared Function Create (
	content As String,
	style As GH_Style
) As GH_Format
Parameters
content
Type: System.String
style
Type: Grasshopper.Documentation.GH_Style
Return Value
Type: GH_Format
See Also
Reference
GH_Format Class
Create Overload
Grasshopper.Documentation Namespace