Grasshopper SDK
GH_FontList.FontSize Property
 Gets or sets the font size.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float FontSize { get; set; }
Public Property FontSize As Single
	Get
	Set
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FontList.FontSize"]
See Also
Reference
GH_FontList Class
Grasshopper.GUI Namespace