Grasshopper SDK
GH_Parser.IsLinkLine Method (String)
 Test whether a line represents a referenced link target. Note; this is a quick check. The link might still be invalid, use the IsLinkLine overload to include validity checks.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsLinkLine(
	string line
)
Public Shared Function IsLinkLine (
	line As String
) As Boolean
Parameters
line
Type: System.String
Line to test.
Return Value
Type: Boolean
True if the line is a referenced link.
See Also
Reference
GH_Parser Class
IsLinkLine Overload
Grasshopper.Documentation Namespace