Grasshopper SDK
GH_ExpressionParser.Evaluate Method (String)
 Store a new expression in the Symbols cache and evaluate it using the current variables
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant Evaluate(
	string Expression
)
Public Function Evaluate (
	Expression As String
) As GH_Variant
Parameters
Expression
Type: System.String
Return Value
Type: GH_Variant
See Also
Reference
GH_ExpressionParser Class
Evaluate Overload
Grasshopper.Kernel.Expressions Namespace