Grasshopper SDK
GH_GraphicsUtil.BoxViewCone Method
 Computes the graphicspath that represents the viewcone for a point and a rectangle. If the rectangle contains the point, null is returned.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath BoxViewCone(
	PointF pt,
	RectangleF box
)
Public Shared Function BoxViewCone (
	pt As PointF,
	box As RectangleF
) As GraphicsPath
Parameters
pt
Type: System.Drawing.PointF
box
Type: System.Drawing.RectangleF
Return Value
Type: GraphicsPath
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace