Grasshopper SDK
DataTree<T>.MergeTree Method
 Merges two trees together. Data inside similar branches will be merged into single lists and unique paths will be appended. The other tree will not be altered, so beware that data is now shared among both trees.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void MergeTree(
	DataTree<T> other
)
Public Sub MergeTree (
	other As DataTree(Of T)
)
Parameters
other
Type: Grasshopper.DataTree<T>
Tree to merge with.
Exceptions
Exception | Condition
ArgumentNullException | Thrown if other is a null reference.
See Also
Reference
DataTree<T> Class
Grasshopper Namespace