Grasshopper SDK
GH_ValueProxy<T>.IsParsable Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsParsable { get; }
Public ReadOnly Property IsParsable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ValueProxy`1.IsParsable"]
Implements
IGH_ValueProxy.IsParsable
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace