Grasshopper SDK
GH_SettingsCategory Class
 Base implementation of IGH_SettingsCategory. Derive from this class and provide an empty constructor to play ball.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_SettingsCategory
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_SettingsCategory : IGH_SettingCategory
Public MustInherit Class GH_SettingsCategory
	Implements IGH_SettingCategory
The GH_SettingsCategory type exposes the following members.
Constructors
Name | Description
GH_SettingsCategory(String, Bitmap)
 Create a new top-level category.
GH_SettingsCategory(String, String, Bitmap)
 Create a new nested category.
Top
Properties
Name | Description
Description
Icon
Name
Parent
Top
See Also
Reference
Grasshopper.GUI Namespace