Grasshopper SDK
GH_MouseTracker.TemporalAccuracy Property
 Gets or sets the maximum temporal accuracy. Frames that are closer together than the accuracy will not be recorded. The default accuracy equals 5ms.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public TimeSpan TemporalAccuracy { get; set; }
Public Property TemporalAccuracy As TimeSpan
	Get
	Set
Property Value
Type: TimeSpan
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MouseTracker.TemporalAccuracy"]
See Also
Reference
GH_MouseTracker Class
Grasshopper.GUI Namespace