Grasshopper SDK
GH_IndexRuleSet.Rule Property
 Gets the rule at the specified index.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_IndexRule this[
	int index
] { get; }
Public ReadOnly Default Property Rule (
	index As Integer
) As IGH_IndexRule
	Get
Parameters
index
Type: System.Int32
Property Value
Type: IGH_IndexRule
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_IndexRuleSet.Rule(System.Int32)"]
See Also
Reference
GH_IndexRuleSet Class
Grasshopper.Kernel.Data Namespace