Grasshopper SDK
GH_Slider_Obsolete.Min Property
 Gets or sets the minimum allowed value.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Min { get; set; }
Public Property Min As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider_Obsolete.Min"]
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace