Grasshopper SDK
GH_RuleSequence Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_RuleSequence
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_RuleSequence : IGH_Rule
Public Class GH_RuleSequence
	Implements IGH_Rule
The GH_RuleSequence type exposes the following members.
Constructors
Name | Description
GH_RuleSequence
Initializes a new instance of the GH_RuleSequence class
Top
Properties
Name | Description
Kind
Notation
Top
Methods
Name | Description
Apply
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace