Grasshopper SDK
IGH_Author.Copyright Property
 Gets the copyright message for these details.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Copyright { get; }
ReadOnly Property Copyright As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Author.Copyright"]
See Also
Reference
IGH_Author Interface
Grasshopper.Kernel Namespace