Grasshopper SDK
GH_Viewport.Target Property
 Gets or sets the location of the target pixel. The target represents where the canvas origin is drawn.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point Target { get; set; }
Public Property Target As Point
	Get
	Set
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.Target"]
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace