Grasshopper SDK
GH_Goo<T>.ToString Method
 Creates a string description of the current instance value.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract string ToString()
Public MustOverride Function ToString As String
Return Value
Type: String
Implements
IGH_Goo.ToString()
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace