Grasshopper SDK
GH_Slider.TickCount Property
 Gets or sets the number of ticks.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int TickCount { get; set; }
Public Property TickCount As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.TickCount"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace