Grasshopper SDK
GH_ExternalFile Constructor
 Create a new instance of the file info class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ExternalFile(
	string path
)
Public Sub New (
	path As String
)
Parameters
path
Type: System.String
See Also
Reference
GH_ExternalFile Class
Grasshopper.Kernel Namespace