Grasshopper SDK
IGH_TypeHint.TypeName Property
 Name of target Type
Namespace: Grasshopper.Kernel.Parameters
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string TypeName { get; }
ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.IGH_TypeHint.TypeName"]
See Also
Reference
IGH_TypeHint Interface
Grasshopper.Kernel.Parameters Namespace