Grasshopper SDK
GH_RuntimeFile.Tags Property
 Gets a collection of all the pre-defined keywords. Use IsKeyword(string) if you want to know whether a string equals a keyword. It's both faster and more reliable than comparing against this collection.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static IEnumerable<string> Tags { get; }
Public Shared ReadOnly Property Tags As IEnumerable(Of String)
	Get
Property Value
Type: IEnumerable<String>
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_RuntimeFile.Tags"]
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace