Grasshopper SDK
GH_SolutionSpan.StartTime Property
 Gets the time at which this solution was started.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime StartTime { get; }
Public ReadOnly Property StartTime As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_SolutionSpan.StartTime"]
See Also
Reference
GH_SolutionSpan Structure
Grasshopper.Kernel Namespace