Grasshopper SDK
GH_FontList.Filter Property
 Gets or sets the filter string. You must call RecreateFontList() before the new font list is created.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Filter { get; set; }
Public Property Filter As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FontList.Filter"]
See Also
Reference
GH_FontList Class
Grasshopper.GUI Namespace