Grasshopper SDK
GH_DocumentAssociations Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_DocumentAssociations
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocumentAssociations
Public Class GH_DocumentAssociations
The GH_DocumentAssociations type exposes the following members.
Constructors
Name | Description
GH_DocumentAssociations
Initializes a new instance of the GH_DocumentAssociations class
Top
Methods
Name | Description
Associate
 Add an association between a Rhino and a Grasshopper file. If a similar association already exists, it will be overwritten. This function reads and writes to the disk, it is SLOW. Only call it when you KNOW something changed.
GetGrasshopperAssociations
 Find all the Grasshopper ghx files that have been associated with a given Rhino file.
GetRhinoAssociations
 Find all the Rhino 3dm files that have been associated with a given Grasshopper file.
Top
See Also
Reference
Grasshopper.Kernel Namespace