Grasshopper SDK
GH_Document.ContainsClusterHooks Method
 Tests whether this document contains at least one cluster hook.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ContainsClusterHooks()
Public Function ContainsClusterHooks As Boolean
Return Value
Type: Boolean
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace