Grasshopper SDK
GH_Structure<T>.Graft Method (GH_GraftMode, GH_Path)
 Grafts a specific path by reallocating all data into child paths. If a grafted path coincides with an existing path, the data item in question will be appended to the existing path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Graft(
	GH_GraftMode mode,
	GH_Path path
)
Public Sub Graft (
	mode As GH_GraftMode,
	path As GH_Path
)
Parameters
mode
Type: Grasshopper.Kernel.Data.GH_GraftMode
Graft mode.
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to graft
Implements
IGH_Structure.Graft(GH_GraftMode, GH_Path)
See Also
Reference
GH_Structure<T> Class
Graft Overload
Grasshopper.Kernel.Data Namespace