Grasshopper SDK
IGH_DataAccess.Util_CountNullRefs<T> Method
 Count all null references in L
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int Util_CountNullRefs<T>(
	List<T> L
)
Function Util_CountNullRefs(Of T) (
	L As List(Of T)
) As Integer
Parameters
L
Type: System.Collections.Generic.List<T>
List to parse
Type Parameters
T
Type of list
Return Value
Type: Int32
Number of nulls in L
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace