Grasshopper SDK
GH_FontScroller.PostPaint Delegate
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void PostPaint(
	Graphics graphics
)
Public Delegate Sub PostPaint (
	graphics As Graphics
)
Parameters
graphics
Type: System.Drawing.Graphics
See Also
Reference
Grasshopper.GUI Namespace