Grasshopper SDK
GH_MenuTextBox.Width Property
 Gets or sets the width of the control.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Width { get; set; }
Public Property Width As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MenuTextBox.Width"]
See Also
Reference
GH_MenuTextBox Class
Grasshopper.GUI Namespace