Grasshopper SDK
GH_DocumentEventServer.Enabled Property
 Gets or sets the enabled state flag for this event watcher.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentEventServer.Enabled"]
Return Value
Type: Boolean
Remarks
See Also
Reference
GH_DocumentEventServer Class
Grasshopper.Kernel Namespace