Grasshopper SDK
GH_TooltipDisplayEventArgs.Icon Property
 Gets or sets the icon that is displayed in the upper left hand corner of the tooltip. This field is optional.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap Icon { get; set; }
Public Property Icon As Bitmap
	Get
	Set
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipDisplayEventArgs.Icon"]
See Also
Reference
GH_TooltipDisplayEventArgs Class
Grasshopper.GUI Namespace