Grasshopper SDK
GH_Lexer Constructor (String)
 Create a new mask from a textual string.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Lexer(
	string M
)
Public Sub New (
	M As String
)
Parameters
M
Type: System.String
Mask string.
See Also
Reference
GH_Lexer Class
GH_Lexer Overload
Grasshopper.Kernel.Data Namespace