Grasshopper SDK
CentralSettings.IsLoadProtected Method
 Gets whether a certain plugin is load protected.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsLoadProtected(
	string pluginName
)
Public Shared Function IsLoadProtected (
	pluginName As String
) As Boolean
Parameters
pluginName
Type: System.String
The name of the plugin file (without the extension).
Return Value
Type: Boolean
True if the plugin is load protected, false if not.
See Also
Reference
CentralSettings Class
Grasshopper Namespace