Grasshopper SDK
GH_InstanceDescription.HasSubCategory Property
 Gets whether or not the SubCategory field has been set.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool HasSubCategory { get; }
Public ReadOnly Property HasSubCategory As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_InstanceDescription.HasSubCategory"]
Implements
IGH_InstanceDescription.HasSubCategory
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace