Grasshopper SDK
GH_GHALoadingEventArgs.FileName Property
 Gets the location of the gha file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_GHALoadingEventArgs.FileName"]
See Also
Reference
GH_GHALoadingEventArgs Class
Grasshopper.Kernel Namespace