Grasshopper SDK
Complex.IsZero Property
 Gets whether or not this complex number equals {0.0; 0.0}
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsZero { get; }
Public ReadOnly Property IsZero As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Complex.IsZero"]
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace