Grasshopper SDK
IGH_Param.TypeName Property
 Gets a human readable description of the data stored in this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string TypeName { get; }
ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.TypeName"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace