Grasshopper SDK
GH_DocDiagramPainter.UnmapY Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int UnmapY(
	int y
)
Public Function UnmapY (
	y As Integer
) As Integer
Parameters
y
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace