Grasshopper SDK
GH_Document.Profiler Property
 Gets or sets the profiler mode used in this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ProfilerMode Profiler { get; set; }
Public Property Profiler As GH_ProfilerMode
	Get
	Set
Property Value
Type: GH_ProfilerMode
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.Profiler"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace