Grasshopper SDK
Node3d<T> Constructor (Coordinates3d<T>, BoundingBox)
 Create a new spatial tree root.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Node3d(
	Coordinates3d<T> converter,
	BoundingBox region
)
Public Sub New (
	converter As Coordinates3d(Of T),
	region As BoundingBox
)
Parameters
converter
Type: Grasshopper.Kernel.Geometry.SpatialTrees.Coordinates3d<T>
Converter delegate.
region
Type: BoundingBox
Bounding box for this node. The region should be big enough to contain all items you're going to insert.
See Also
Reference
Node3d<T> Class
Node3d<T> Overload
Grasshopper.Kernel.Geometry.SpatialTrees Namespace