Grasshopper SDK
GH_DocumentObject.OnDisplayExpired Method
 Raises the DisplayExpired event on the toplevel object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnDisplayExpired(
	bool redraw
)
Public Sub OnDisplayExpired (
	redraw As Boolean
)
Parameters
redraw
Type: System.Boolean
If True, the canvas will be immediately redrawn.
Implements
IGH_DocumentObject.OnDisplayExpired(Boolean)
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace