Grasshopper SDK
GH_Component.PrincipalParameterIndex Property
 Gets or sets the principal parameter index override. Negative indices or indices larger than or equal to the input parameter count will be ignored and regular principal parameter detection will kick in.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int PrincipalParameterIndex { get; set; }
Public Property PrincipalParameterIndex As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.PrincipalParameterIndex"]
Implements
IGH_Component.MasterParameterIndex
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace