Grasshopper SDK
GH_Canvas.DocumentObjectMouseDown Event
 This event is raised whenever the left mouse button is pressed while over a Document object.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.DocumentObjectMouseDownEventHandler DocumentObjectMouseDown
Public Event DocumentObjectMouseDown As GH_Canvas.DocumentObjectMouseDownEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.DocumentObjectMouseDownEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace