Grasshopper SDK
GH_PreviewArgs.WireColour Property
 Gets the document default colour for unselected Wires.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color WireColour { get; }
Public ReadOnly Property WireColour As Color
	Get
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewArgs.WireColour"]
Implements
IGH_PreviewArgs.WireColour
See Also
Reference
GH_PreviewArgs Class
Grasshopper.Kernel Namespace