Grasshopper SDK
GH_SettingsServer.GetValue Method (String, Byte)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public byte GetValue(
	string key,
	byte default
)
Public Function GetValue (
	key As String,
	default As Byte
) As Byte
Parameters
key
Type: System.String
default
Type: System.Byte
Return Value
Type: Byte
See Also
Reference
GH_SettingsServer Class
GetValue Overload
Grasshopper.Kernel Namespace