Grasshopper SDK
DataTree<T>.Path Method
 Gets the data path at the specified index.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Path Path(
	int index
)
Public Function Path (
	index As Integer
) As GH_Path
Parameters
index
Type: System.Int32
Index of path to retrieve.
Return Value
Type: GH_Path
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown if the index does not represent a valid path.
See Also
Reference
DataTree<T> Class
Grasshopper Namespace