Grasshopper SDK
GH_Document.ObjectSpan Property
 Gets the total timespan for all objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public TimeSpan ObjectSpan { get; }
Public ReadOnly Property ObjectSpan As TimeSpan
	Get
Property Value
Type: TimeSpan
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.ObjectSpan"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace