Grasshopper SDK
GH_PointCharge Class
 Point charge implementation for IGH_Fields.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_FieldElement
 Grasshopper.Kernel.Types.GH_PointCharge
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PointCharge : GH_FieldElement
Public Class GH_PointCharge
	Inherits GH_FieldElement
The GH_PointCharge type exposes the following members.
Constructors
Name | Description
GH_PointCharge
Initializes a new instance of the GH_PointCharge class
Top
Properties
Name | Description
BoundingBox |  (Overrides GH_FieldElement.BoundingBox.)
Charge
Decay
ElementGuid |  (Overrides GH_FieldElement.ElementGuid.)
Location
Top
Methods
Name | Description
DrawViewportWires |  (Overrides GH_FieldElement.DrawViewportWires(GH_PreviewWireArgs).)
Duplicate |  (Overrides GH_FieldElement.Duplicate().)
Force |  (Overrides GH_FieldElement.Force(Point3d).)
IsCoincident |  (Overrides GH_FieldElement.IsCoincident(Point3d, Double).)
Read |  (Overrides GH_FieldElement.Read(GH_IReader).)
Write |  (Overrides GH_FieldElement.Write(GH_IWriter).)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace