Grasshopper SDK
ITransform.ToMatrix Method
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Transform ToMatrix()
Function ToMatrix As Transform
Return Value
Type: Transform
See Also
Reference
ITransform Interface
Grasshopper.Kernel.Types.Transforms Namespace