Grasshopper SDK
GH_ActiveObject Constructor (IGH_InstanceDescription)
Initializes a new instance of the GH_ActiveObject class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_ActiveObject(
	IGH_InstanceDescription Tag
)
Protected Sub New (
	Tag As IGH_InstanceDescription
)
Parameters
Tag
Type: Grasshopper.Kernel.IGH_InstanceDescription
See Also
Reference
GH_ActiveObject Class
GH_ActiveObject Overload
Grasshopper.Kernel Namespace