Grasshopper SDK
GH_Document.DestroyAutoSaveFiles Method
 Destroys all autosave files and backup files that are associated with this document. Only call this function when you are certain that the document has been properly saved and no changes have occured since.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DestroyAutoSaveFiles()
Public Sub DestroyAutoSaveFiles
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace