Grasshopper SDK
GH_CodeStringSegment.IsAlpha Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected bool IsAlpha(
	char C
)
Protected Function IsAlpha (
	C As Char
) As Boolean
Parameters
C
Type: System.Char
Return Value
Type: Boolean
See Also
Reference
GH_CodeStringSegment Class
Grasshopper.Kernel.Expressions Namespace