Grasshopper SDK
GH_ParamData Enumeration
 Enumerates the possible states of being for data inside a parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ParamData
Public Enumeration GH_ParamData
Members
Member name | Value | Description
unknown | 0 |  Unknown, this really shouldn't happen too often.
void | 1 |  Parameter contains no data.
local | 2 |  Parameter contains local data.
remote | 3 |  Parameter contains data that came from elsewhere.
Remarks
See Also
Reference
Grasshopper.Kernel Namespace