Grasshopper SDK
GH_TreeFilter.FindItemBrackets Method
 Locate the two parenthesis that delineate the index segment of an Index Rule set.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool FindItemBrackets(
	string text,
	out int index0,
	out int index1
)
Public Shared Function FindItemBrackets (
	text As String,
	<OutAttribute> ByRef index0 As Integer,
	<OutAttribute> ByRef index1 As Integer
) As Boolean
Parameters
text
Type: System.String
String to search.
index0
Type: System.Int32
Index of opening parenthesis.
index1
Type: System.Int32
Index of closing parenthesis.
Return Value
Type: Boolean
True if valid parenthesis were found, false if not.
See Also
Reference
GH_TreeFilter Class
Grasshopper.Kernel.Data Namespace