Grasshopper SDK
GH_NamedView.Type Property
 Gets or sets a value indicating whether the anchor point represents the target or the center.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_NamedViewType Type { get; set; }
Public Property Type As GH_NamedViewType
	Get
	Set
Property Value
Type: GH_NamedViewType
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_NamedView.Type"]
See Also
Reference
GH_NamedView Class
Grasshopper.GUI.Canvas Namespace