Grasshopper SDK
GH_Slider.RailEmptyColour Property
 Gets or sets the fill colour for the empty portion of the rail.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color RailEmptyColour { get; set; }
Public Property RailEmptyColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.RailEmptyColour"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace