Grasshopper SDK
GH_FloatingParamAttributes.ExpireLayout Method
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void ExpireLayout()
Public Overrides Sub ExpireLayout
See Also
Reference
GH_FloatingParamAttributes Class
Grasshopper.Kernel.Attributes Namespace