Grasshopper SDK
IGH_DataTree.MergeWithParameter Method
 Utility function for assigning Script Data Trees to parameters.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool MergeWithParameter(
	IGH_Param param
)
Function MergeWithParameter (
	param As IGH_Param
) As Boolean
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
Parameter to merge with.
Return Value
Type: Boolean
See Also
Reference
IGH_DataTree Interface
Grasshopper.Kernel.Data Namespace