Grasshopper SDK
IGH_TypeHint.Cast Method
 Apply conversion logic to a specific object. This function should not throw exceptions.
Namespace: Grasshopper.Kernel.Parameters
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool Cast(
	Object data,
	out Object target
)
Function Cast (
	data As Object,
	<OutAttribute> ByRef target As Object
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
target
Type: System.Object
Output instance.
Return Value
Type: Boolean
True on success, false on failure. If False is returned, target may be null.
See Also
Reference
IGH_TypeHint Interface
Grasshopper.Kernel.Parameters Namespace