Grasshopper SDK
GH_CanvasWireValidator Class
 Utility validator for restricting wire creation.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Canvas.GH_CanvasValidator
 Grasshopper.GUI.Canvas.GH_CanvasWireValidator
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_CanvasWireValidator : GH_CanvasValidator
Public Class GH_CanvasWireValidator
	Inherits GH_CanvasValidator
The GH_CanvasWireValidator type exposes the following members.
Constructors
Name | Description
GH_CanvasWireValidator
Initializes a new instance of the GH_CanvasWireValidator class
Top
Properties
Name | Description
WireDelegate
 Gets or sets the delegate to be invoked when a wire is created.
WireMotionText
 Gets or sets the text to draw at the wire interior.
WireSource
 Gets or sets the wire source filter.
WireSourceText
 Gets or sets the text to draw at the wire source location.
WireTarget
 Gets or sets the wire target filter.
WireTargetText
 Gets or sets the text to draw at the wire target location.
Top
Methods
Name | Description
AddedToCanvas |  (Overrides GH_CanvasValidator.AddedToCanvas(GH_Canvas).)
AppliesToDocument |  (Overrides GH_CanvasValidator.AppliesToDocument(Guid).)
CanAcceptObject |  (Overrides GH_CanvasValidator.CanAcceptObject(Guid).)
CanCreateObject |  (Overrides GH_CanvasValidator.CanCreateObject(Guid, PointF).)
CanCreateWire |  (Overrides GH_CanvasValidator.CanCreateWire(IGH_Param, IGH_Param).)
CanDeleteObject |  (Overrides GH_CanvasValidator.CanDeleteObject(IGH_DocumentObject).)
CanDeleteWire |  (Overrides GH_CanvasValidator.CanDeleteWire(IGH_Param, IGH_Param).)
CanDragObject |  (Overrides GH_CanvasValidator.CanDragObject(IGH_DocumentObject, PointF).)
CanShowCanvasMenu |  (Overrides GH_CanvasValidator.CanShowCanvasMenu(PointF).)
CanShowComponentSearchBox |  (Overrides GH_CanvasValidator.CanShowComponentSearchBox(PointF).)
RemovedFromCanvas |  (Overrides GH_CanvasValidator.RemovedFromCanvas(GH_Canvas).)
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace