Grasshopper SDK
IGH_GooProxy.FormatInstance Method
 Returns a String description of the current value.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string FormatInstance()
Function FormatInstance As String
Return Value
Type: String
Remarks
If the implementation IsParsable(), then this representation will be in parsable format.
See Also
Reference
IGH_GooProxy Interface
Grasshopper.Kernel.Types Namespace