Grasshopper SDK
IGH_VariableParameterComponent.DestroyParameter Method
 This function will be called when a parameter is about to be removed. You do not need to do anything, but this would be a good time to remove any event handlers that might be attached to the parameter in question.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool DestroyParameter(
	GH_ParameterSide side,
	int index
)
Function DestroyParameter (
	side As GH_ParameterSide,
	index As Integer
) As Boolean
Parameters
side
Type: Grasshopper.Kernel.GH_ParameterSide
Parameter side.
index
Type: System.Int32
Removal index of parameter.
Return Value
Type: Boolean
Return True if the parameter in question can indeed be removed. Note, this is only in emergencies, typically the CanRemoveParameter function should return false if the parameter in question is not removable.
See Also
Reference
IGH_VariableParameterComponent Interface
Grasshopper.Kernel Namespace