Grasshopper SDK
GH_ActiveObject.IconCapableUI Property
 By default the NickName menu item supports the Icon Mode override toggle. If your UI is not capable of displaying icons, then override this property and return False.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool IconCapableUI { get; }
Public Overridable ReadOnly Property IconCapableUI As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ActiveObject.IconCapableUI"]
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace