Grasshopper SDK
CentralSettings.AuthorEMailChanged Event
 Raised whenever the AuthorEMail field is changed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.AuthorEMailChangedEventHandler AuthorEMailChanged
Public Shared Event AuthorEMailChanged As CentralSettings.AuthorEMailChangedEventHandler
Value
Type: Grasshopper.CentralSettings.AuthorEMailChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace