Grasshopper SDK
GH_Canvas.ThumbnailHeight Field
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static readonly int ThumbnailHeight
Public Shared ReadOnly ThumbnailHeight As Integer
Field Value
Type: Int32
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace