Grasshopper SDK
GH_UpgradeUtil.MigrateOutputParameters Method (IGH_Component, IGH_Component, Int32[], Int32[])
 Migrate a bunch of output parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool MigrateOutputParameters(
	IGH_Component source,
	IGH_Component target,
	int[] index0,
	int[] index1
)
Public Shared Function MigrateOutputParameters (
	source As IGH_Component,
	target As IGH_Component,
	index0 As Integer(),
	index1 As Integer()
) As Boolean
Parameters
source
Type: Grasshopper.Kernel.IGH_Component
Source component.
target
Type: Grasshopper.Kernel.IGH_Component
Target component.
index0
Type: System.Int32[]
List of output indices to migrate.
index1
Type: System.Int32[]
Matching list of target indices.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_UpgradeUtil Class
MigrateOutputParameters Overload
Grasshopper.Kernel Namespace