Grasshopper SDK
GH_NamedView Constructor (Rectangle, RectangleF)
 Create a new view useful for box-fit transitions.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_NamedView(
	Rectangle view_box,
	RectangleF target_box
)
Public Sub New (
	view_box As Rectangle,
	target_box As RectangleF
)
Parameters
view_box
Type: System.Drawing.Rectangle
The dimensions of the area into which we want to display something in control coordinates. For example, the Visible area in a Viewport.
target_box
Type: System.Drawing.RectangleF
The dimensions of the area we want to display in viewport coordinates. For example, the bounding box of some objects.
See Also
Reference
GH_NamedView Class
GH_NamedView Overload
Grasshopper.GUI.Canvas Namespace