Grasshopper SDK
GH_Arc Constructor (GH_Arc)
 Create a duplicate of another arc
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Arc(
	GH_Arc other
)
Public Sub New (
	other As GH_Arc
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Arc
Arc to copy. If null, a default arc will be created.
See Also
Reference
GH_Arc Class
GH_Arc Overload
Grasshopper.Kernel.Types Namespace