Grasshopper SDK
GH_Border.Size_Cursor Property
 Gets the cursor associated with this border.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Cursor Size_Cursor { get; }
Public ReadOnly Property Size_Cursor As Cursor
	Get
Property Value
Type: Cursor
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Border.Size_Cursor"]
See Also
Reference
GH_Border Class
Grasshopper.GUI.Canvas Namespace