Grasshopper SDK
GH_TrackerFrame.Time Field
 The time at which this frame was recorded.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime Time
Public Time As DateTime
Field Value
Type: DateTime
See Also
Reference
GH_TrackerFrame Structure
Grasshopper.GUI Namespace