Grasshopper SDK
GH_ColourPicker.Colour Property
 Gets or sets the colour currently specified in the picker.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Colour { get; set; }
Public Property Colour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_ColourPicker.Colour"]
See Also
Reference
GH_ColourPicker Class
Grasshopper.GUI Namespace