Grasshopper SDK
GH_Structure<T>.DataList Property (GH_Path)
 Gets a direct pointer to the list of data under a specific path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<T> this[
	GH_Path path
] { get; }
Public ReadOnly Default Property DataList (
	path As GH_Path
) As List(Of T)
	Get
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path of the data branch to retrieve. If the path doesn't exist, null is returned.
Property Value
Type: List<T>
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.DataList(Grasshopper.Kernel.Data.GH_Path)"]
See Also
Reference
GH_Structure<T> Class
DataList Overload
Grasshopper.Kernel.Data Namespace