Grasshopper SDK
GH_Box.Geometry Method
 Convert the box to a GeometryBase instance.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Geometry(
	ref Brep brp,
	ref Curve crv,
	ref Point pt
)
Public Function Geometry (
	ByRef brp As Brep,
	ByRef crv As Curve,
	ByRef pt As Point
) As Boolean
Parameters
brp
Type: Brep
If the box is at most degenerate in one direction, the brp parameter will be filled out.
crv
Type: Curve
If the box is degenerate in exactly two directions, the crv parameter will be filled out.
pt
Type: Point
If the box is degenerate in all three directions, the pt parameter will be filled out.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Box Class
Grasshopper.Kernel.Types Namespace