Grasshopper SDK
GH_Tooltip.TooltipForm Property
 Gets the internal instance of GH_TooltipForm.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_ToolTipForm TooltipForm { get; }
Public Shared ReadOnly Property TooltipForm As GH_ToolTipForm
	Get
Property Value
Type: GH_ToolTipForm
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Tooltip.TooltipForm"]
See Also
Reference
GH_Tooltip Class
Grasshopper.GUI Namespace