Grasshopper SDK
GH_ComponentParamServer.RepairProxyParams Method
 Attempt to fix all proxy params. Returns false if a single one fails.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RepairProxyParams(
	GH_Document document
)
Public Function RepairProxyParams (
	document As GH_Document
) As Boolean
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document that contains potential proxy targets.
Return Value
Type: Boolean
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace