Grasshopper SDK
GH_DocumentEditor.ExpandForm Method
 Expands the form if it is currenly collapsed.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ExpandForm()
Public Sub ExpandForm
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace