Grasshopper SDK
GH_SliderBase.ControlShadowColour Property
 Gets or sets the Shadow colour for this control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color ControlShadowColour { get; set; }
Public Property ControlShadowColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.ControlShadowColour"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace