Grasshopper SDK
GH_NamedView Constructor (GH_Viewport, Rectangle, PointF)
 Create a new view useful for point inclusion transitions.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_NamedView(
	GH_Viewport view,
	Rectangle region,
	PointF target
)
Public Sub New (
	view As GH_Viewport,
	region As Rectangle,
	target As PointF
)
Parameters
view
Type: Grasshopper.GUI.Canvas.GH_Viewport
Viewport this transition is supposed to work in.
region
Type: System.Drawing.Rectangle
Region into which the target is supposed to be visible in control coordinates. For example, the contents of the viewport.
target
Type: System.Drawing.PointF
Point to ensure.
See Also
Reference
GH_NamedView Class
GH_NamedView Overload
Grasshopper.GUI.Canvas Namespace