Grasshopper SDK
GH_AutoSaveSettings.SaveOnObjectChangeChanged Event
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_AutoSaveSettings.SaveOnObjectChangeChangedEventHandler SaveOnObjectChangeChanged
Public Shared Event SaveOnObjectChangeChanged As GH_AutoSaveSettings.SaveOnObjectChangeChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_AutoSaveSettings.SaveOnObjectChangeChangedEventHandler
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace