Grasshopper SDK
GH_DigitNumber Class
 Maintains and provides functionality for evaluating and modifying numbers as used in the GH_DigitScrollerBase control.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Base.GH_DigitNumber
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DigitNumber
Public Class GH_DigitNumber
The GH_DigitNumber type exposes the following members.
Constructors
Name | Description
GH_DigitNumber(Int32)
 Create a new GH_DigitNumber instance with the specified number of decimal places.
GH_DigitNumber(GH_DigitNumber)
 Create an exact duplicate of another GH_DigitNumber instance.
GH_DigitNumber(Int32, Int32)
 Create a new GH_DigitNumber instance with the specified number of decimal places and a given radix position.
Top
Properties
Name | Description
DigitCount
 Gets or sets the amount of digits in this number.
Epsilon
 Gets the smallest possible change.
IsPrimaryDigitSignificant
 Gets whether the primary digit at the given index is significant.
IsSecondaryDigitSignificant
 Gets whether the secondary digit at the given index is significant.
Maximum
 Gets the maximum value allowed in this number.
Minimum
 Gets the minimum value allowed in this number.
Offset
 Gets the offset between the primary and secondary digits.
PrimaryDigits
 Gets the internal list of primary digits. Do not modify this list.
PrimaryPositive
 Gets or sets a value indicating whether the number is positive.
Radix
 Gets or sets the radix point index. A negative radix index disables the radix point, zero is not a valid index.
RadixIndex
 Gets the mapped radix.
SecondaryDigits
 Gets the internal list of secondary digits. Do not modify this list.
SecondaryPositive
 Gets a value indicating whether the secondary number is positive.
Value
 Gets or sets the value of this number.
Top
Methods
Name | Description
AssignOffset
 Assign an offset to a given digit and recursively adjust all leftwards offsets if needed.
LimitValue
 Limits the value to the minimum and maximum domain.
Reset
 Reset all parts to zero.
Round
 Round the number by cancelling the offset in the proper direction.
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
Grasshopper.GUI.Base Namespace