Grasshopper SDK
GH_Viewport.ZoomMaximum Field
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const float ZoomMaximum = 50f
Public Const ZoomMaximum As Single = 50F
Field Value
Type: Single
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace