Grasshopper SDK
GH_Text Class
 Represents a single string.
Inheritance Hierarchy
System.Object
 Grasshopper.Documentation.GH_Text
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Text : IGH_Content
Public Class GH_Text
	Implements IGH_Content
The GH_Text type exposes the following members.
Properties
Name | Description
Text
 Gets the text string.
Top
Methods
Name | Description
Create
 Create a new instance of GH_Text.
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
Grasshopper.Documentation Namespace