Grasshopper SDK
GH_TooltipComponent.Target Property
 Gets or sets the control this tooltip is tied to.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Control Target { get; set; }
Public Property Target As Control
	Get
	Set
Property Value
Type: Control
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipComponent.Target"]
See Also
Reference
GH_TooltipComponent Class
Grasshopper.GUI Namespace