Grasshopper SDK
CentralSettings.CanvasObsoleteTagsChanged Event
 Raised whenever the CanvasObsoleteTags setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.CanvasObsoleteTagsChangedEventHandler CanvasObsoleteTagsChanged
Public Shared Event CanvasObsoleteTagsChanged As CentralSettings.CanvasObsoleteTagsChangedEventHandler
Value
Type: Grasshopper.CentralSettings.CanvasObsoleteTagsChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace