Grasshopper SDK
GH_Param<T>.CollectData Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override sealed void CollectData()
Public Overrides NotOverridable Sub CollectData
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace