Grasshopper SDK
UVInterval.U Property
 Gets or sets the U interval.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Interval U { get; set; }
Public Property U As Interval
	Get
	Set
Property Value
Type: Interval
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.UVInterval.U"]
See Also
Reference
UVInterval Structure
Grasshopper.Kernel.Types Namespace