Grasshopper SDK
GH_Canvas.Document_SettingsChanged Event
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.Document_SettingsChangedEventHandler Document_SettingsChanged
Public Event Document_SettingsChanged As GH_Canvas.Document_SettingsChangedEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.Document_SettingsChangedEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace