Grasshopper SDK
GH_Attributes<T>.GetTopLevel Property
 Gets the top-level attributes of the attribute stack these attributes belong to.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Attributes GetTopLevel { get; }
Public ReadOnly Property GetTopLevel As IGH_Attributes
	Get
Property Value
Type: IGH_Attributes
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.GetTopLevel"]
Implements
IGH_Attributes.GetTopLevel
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace