Grasshopper SDK
GH_ParamAccess Enumeration
 Enumerates the types of access that parameters support.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ParamAccess
Public Enumeration GH_ParamAccess
Members
Member name | Value | Description
item | 0 |  Every data item is to be treated individually.
list | 1 |  All data branches will be treated at the same time.
tree | 2 |  The entire data structure will be treated at once.
See Also
Reference
Grasshopper.Kernel Namespace