Grasshopper SDK
GH_ComponentServer.RemoveCachedGraph Method
 Remove a cache entry from the graph cache. This cannot be undone.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RemoveCachedGraph(
	Guid id
)
Public Function RemoveCachedGraph (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
The id to remove.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace