Grasshopper SDK
GH_MemoryBitmap.OpaqueArea Method
 Find the opaque area of a bitmap. The opaque area is the rectangle that contains pixels with a colour that is not fully transparent.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle OpaqueArea()
Public Function OpaqueArea As Rectangle
Return Value
Type: Rectangle
Area of bitmap containing all non-transparent pixels.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace