Grasshopper SDK
GH_Convert.ToSurface_Primary Method
 Performs a direct cast from OnSurface or GH_Surface. Data is not quaranteed to be duplicated. If data is of type GH_Surface, then trim curves are ignored.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToSurface_Primary(
	Object data,
	ref Surface rc
)
Public Shared Function ToSurface_Primary (
	data As Object,
	ByRef rc As Surface
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Surface
Return Value
Type: Boolean
An OnSurface instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace