Grasshopper SDK
GH_ActiveObject.Menu_AppendRuntimeMessages Method
 Append the default warnings and errors menu items.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void Menu_AppendRuntimeMessages(
	ToolStripDropDown menu
)
Protected Sub Menu_AppendRuntimeMessages (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace