Grasshopper SDK
GH_ObjectChangedEventArgs.m_custom Field
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected string m_custom
Protected m_custom As String
Field Value
Type: String
See Also
Reference
GH_ObjectChangedEventArgs Class
Grasshopper.Kernel Namespace