Grasshopper SDK
Node3d<T>.ItemsGlobal Property
 Gets the list of all items stored inside this entire tree. Do not modify this collection unless you know what you are doing.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<T> ItemsGlobal { get; }
Public ReadOnly Property ItemsGlobal As List(Of T)
	Get
Property Value
Type: List<T>
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ItemsGlobal"]
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace