Grasshopper SDK
GH_FileWatcher.InvokeOnDefaultThread Property
 Gets or sets invoke behaviour for events. If true, then the event delegate is called via the Grasshopper main UI thread. This is almost always what you need.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool InvokeOnDefaultThread { get; set; }
Public Property InvokeOnDefaultThread As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FileWatcher.InvokeOnDefaultThread"]
See Also
Reference
GH_FileWatcher Class
Grasshopper.Kernel Namespace