Grasshopper SDK
IGH_PreviewMeshData Interface
 Implement this interface if your data deals with preview meshes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_PreviewMeshData
Public Interface IGH_PreviewMeshData
The IGH_PreviewMeshData type exposes the following members.
Methods
Name | Description
DestroyPreviewMeshes
 Erase all cached preview meshes.
GetPreviewMeshes
 Gets all the preview meshes associated with this data.
Top
See Also
Reference
Grasshopper.Kernel Namespace