Grasshopper SDK
GH_DigitScrollerBase.TopColour Property
 Gets or sets the colour used along the top edge of the control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color TopColour { get; set; }
Public Property TopColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.TopColour"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace