Grasshopper SDK
Complex.Real Property
 Gets or sets the real component of the Complex number.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Real { get; set; }
Public Property Real As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Complex.Real"]
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace