Grasshopper SDK
IGH_InstanceGuidDependent Interface
 Implement this interface in your IGH_DocumentObject class if you want to be informed when the InstanceGuids of objects in the document are mutated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_InstanceGuidDependent
Public Interface IGH_InstanceGuidDependent
The IGH_InstanceGuidDependent type exposes the following members.
Methods
Name | Description
InstanceGuidsChanged
 This method will be called by the GH_Document that owns this object after it mutates some or all of it's object InstanceIds.
Top
See Also
Reference
Grasshopper.Kernel Namespace