Grasshopper SDK
GH_ActiveObject.Menu_AppendBakeItem Method
 Append the default Bake menu item.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void Menu_AppendBakeItem(
	ToolStripDropDown menu
)
Protected Sub Menu_AppendBakeItem (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace