Grasshopper SDK
IGH_SettingCategory.Description Property
 Category description.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Description { get; }
ReadOnly Property Description As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_SettingCategory.Description"]
See Also
Reference
IGH_SettingCategory Interface
Grasshopper.GUI Namespace