Grasshopper SDK
GH_Mesh.GH_MeshProxy Constructor
Initializes a new instance of the GH_Mesh.GH_MeshProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MeshProxy(
	GH_Mesh Value
)
Public Sub New (
	Value As GH_Mesh
)
Parameters
Value
Type: Grasshopper.Kernel.Types.GH_Mesh
See Also
Reference
GH_Mesh.GH_MeshProxy Class
Grasshopper.Kernel.Types Namespace