Grasshopper SDK
GH_StructurePath Constructor (GH_Path)
Initializes a new instance of the GH_StructurePath class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_StructurePath(
	GH_Path path
)
Public Sub New (
	path As GH_Path
)
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
See Also
Reference
GH_StructurePath Class
GH_StructurePath Overload
Grasshopper.Kernel.Types Namespace