Grasshopper SDK
GH_GeometryGroup.GH_GeometryGroupProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_GeometryGroup>
 Grasshopper.Kernel.Types.GH_GeometryGroup.GH_GeometryGroupProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_GeometryGroupProxy : GH_GooProxy<GH_GeometryGroup>
Public Class GH_GeometryGroupProxy
	Inherits GH_GooProxy(Of GH_GeometryGroup)
The GH_GeometryGroup.GH_GeometryGroupProxy type exposes the following members.
Constructors
Name | Description
GH_GeometryGroup.GH_GeometryGroupProxy
Initializes a new instance of the GH_GeometryGroup.GH_GeometryGroupProxy class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace