Grasshopper SDK
GH_Canvas.GenerateHiResImage Method
 Generate a collection of hi-res images of the document.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string> GenerateHiResImage(
	Rectangle rec,
	GH_Canvas.GH_ImageSettings settings,
	out Size totalSize
)
Public Function GenerateHiResImage (
	rec As Rectangle,
	settings As GH_Canvas.GH_ImageSettings,
	<OutAttribute> ByRef totalSize As Size
) As List(Of String)
Parameters
rec
Type: System.Drawing.Rectangle
BoundingBox rectangle of export.
settings
Type: Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings
Hi-res settings.
totalSize
Type: System.Drawing.Size
Return Value
Type: List<String>
List of file paths that indicate the individual images.
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace