Grasshopper SDK
CentralSettings.FormatMultiplesOfOne Property
 Gets or sets whether floating point numbers close to whole integers should be special cased.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool FormatMultiplesOfOne { get; set; }
Public Shared Property FormatMultiplesOfOne As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.FormatMultiplesOfOne"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace