Grasshopper SDK
DataTree<T>.Branch Method (GH_Path)
 Gets the list of data which belongs to a given Branch path.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<T> Branch(
	GH_Path path
)
Public Function Branch (
	path As GH_Path
) As List(Of T)
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Data path to retrieve.
Return Value
Type: List<T>
See Also
Reference
DataTree<T> Class
Branch Overload
Grasshopper Namespace