Grasshopper SDK
GH_Structure<T>.PathExists Method
 Returns True if the specified path is already defined inside the structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool PathExists(
	GH_Path path
)
Public Function PathExists (
	path As GH_Path
) As Boolean
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
The data path to search for
Return Value
Type: Boolean
Implements
IGH_Structure.PathExists(GH_Path)
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace