Grasshopper SDK
GH_RuleComplex Constructor
Initializes a new instance of the GH_RuleComplex class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RuleComplex(
	IEnumerable<IGH_Rule> fragments,
	IEnumerable<GH_RuleOperator> operators
)
Public Sub New (
	fragments As IEnumerable(Of IGH_Rule),
	operators As IEnumerable(Of GH_RuleOperator)
)
Parameters
fragments
Type: System.Collections.Generic.IEnumerable<IGH_Rule>
operators
Type: System.Collections.Generic.IEnumerable<GH_RuleOperator>
See Also
Reference
GH_RuleComplex Class
Grasshopper.Kernel.Data Namespace