Grasshopper SDK
GH_Structure<T>.AppendRange Method (IEnumerable<T>, GH_Path)
 Append a list of data items to the specified branch in the structure. If the branch doesn't exist yet, it will be created.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AppendRange(
	IEnumerable<T> data,
	GH_Path path
)
Public Sub AppendRange (
	data As IEnumerable(Of T),
	path As GH_Path
)
Parameters
data
Type: System.Collections.Generic.IEnumerable<T>
Data to append
path
Type: Grasshopper.Kernel.Data.GH_Path
Data path
See Also
Reference
GH_Structure<T> Class
AppendRange Overload
Grasshopper.Kernel.Data Namespace