Grasshopper SDK
Utility.InvokeMethod Method (Object, String, Object[])
 Call a method via its name.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Object InvokeMethod(
	Object target,
	string method,
	params Object[] params
)
Public Shared Function InvokeMethod (
	target As Object,
	method As String,
	ParamArray params As Object()
) As Object
Parameters
target
Type: System.Object
Object to invoke on.
method
Type: System.String
Name of method to invoke.
params
Type: System.Object[]
Arguments for method.
Return Value
Type: Object
The return value of the method.
See Also
Reference
Utility Class
InvokeMethod Overload
Grasshopper Namespace