Grasshopper SDK
GH_VerticalScrollBar.ScrollRatioChanged Event
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_VerticalScrollBar.ScrollRatioChangedEventHandler ScrollRatioChanged
Public Event ScrollRatioChanged As GH_VerticalScrollBar.ScrollRatioChangedEventHandler
Value
Type: Grasshopper.GUI.GH_VerticalScrollBar.ScrollRatioChangedEventHandler
See Also
Reference
GH_VerticalScrollBar Class
Grasshopper.GUI Namespace