Grasshopper SDK
GH_State Constructor
Initializes a new instance of the GH_State class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_State()
Public Sub New
See Also
Reference
GH_State Class
GH_State Overload
Grasshopper.Kernel Namespace