Grasshopper SDK
GH_Canvas.OnPaintBackground Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override void OnPaintBackground(
	PaintEventArgs e
)
Protected Overrides Sub OnPaintBackground (
	e As PaintEventArgs
)
Parameters
e
Type: System.Windows.Forms.PaintEventArgs
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace