Grasshopper SDK
GH_Skin.zui_edge Field
 Specifies the default edge colour for ZUI elements.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color zui_edge
Public Shared zui_edge As Color
Field Value
Type: Color
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace