Grasshopper SDK
GH_Viewport.ZoomDefault Field
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static readonly float ZoomDefault
Public Shared ReadOnly ZoomDefault As Single
Field Value
Type: Single
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace