Grasshopper SDK
GH_FontList Constructor
Initializes a new instance of the GH_FontList class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_FontList()
Public Sub New
See Also
Reference
GH_FontList Class
Grasshopper.GUI Namespace