Grasshopper SDK
UVInterval Structure
 UVInterval data type. Do not confuse this with GH_Interval2D.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public struct UVInterval
Public Structure UVInterval
The UVInterval type exposes the following members.
Constructors
Name | Description
UVInterval
Initializes a new instance of the UVInterval class
Top
Properties
Name | Description
IsValid
 Gets a value indicating whether or not this UVInterval is valid.
U
 Gets or sets the U interval.
U0
 Gets or sets the T0 value of the U domain.
U1
 Gets or sets the T1 value of the U domain.
V
 Gets or sets the V interval.
V0
 Gets or sets the T0 value of the V domain.
V1
 Gets or sets the T1 value of the V domain.
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace