Grasshopper SDK
GH_Canvas.ScheduleRegen Method
 Schedule a regen to occur after the specified number of milliseconds have elapsed. If a Regen is called in this time frame, the schedule will be cleared. Only a single schedule can be active at any time, so any call to ScheduleRegen will clear existing schedules.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ScheduleRegen(
	int delay
)
Public Sub ScheduleRegen (
	delay As Integer
)
Parameters
delay
Type: System.Int32
Number of milliseconds to wait until repainting the canvas. intervals equal to or less than zero will be ignored.
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace