Grasshopper SDK
GH_DocEnabledEventArgs.Enabled Property
 Gets the value of the document Enabled flag at the time the event was raised, it may have been changed in between by other event handlers.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Enabled { get; }
Public ReadOnly Property Enabled As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocEnabledEventArgs.Enabled"]
See Also
Reference
GH_DocEnabledEventArgs Class
Grasshopper.Kernel Namespace