Grasshopper SDK
GH_AutoSaveSettings Constructor
Initializes a new instance of the GH_AutoSaveSettings class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_AutoSaveSettings()
Public Sub New
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace