Grasshopper SDK
IGH_PreviewData.DrawViewportMeshes Method
 Implement this function to draw all shaded meshes. If the viewport does not support shading, this function will not be called.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void DrawViewportMeshes(
	GH_PreviewMeshArgs args
)
Sub DrawViewportMeshes (
	args As GH_PreviewMeshArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_PreviewMeshArgs
Drawing arguments.
See Also
Reference
IGH_PreviewData Interface
Grasshopper.Kernel Namespace