Grasshopper SDK
GH_DragInfo.Drag Method
 Call this method to adjust the drag data. Results will be automatically constrained and limited.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Drag(
	Point new_point
)
Public Sub Drag (
	new_point As Point
)
Parameters
new_point
Type: System.Drawing.Point
New location of cursor.
See Also
Reference
GH_DragInfo Class
Grasshopper.GUI Namespace