Grasshopper SDK
GH_Path.LessThan Operator
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool operator <(
	GH_Path A,
	GH_Path B
)
Public Shared Operator < (
	A As GH_Path,
	B As GH_Path
) As Boolean
Parameters
A
Type: Grasshopper.Kernel.Data.GH_Path
B
Type: Grasshopper.Kernel.Data.GH_Path
Return Value
Type: Boolean
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace