Grasshopper SDK
IGH_DebugDescription.AppendToDebugLog Method
 Write important debugging data to a debug writer object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void AppendToDebugLog(
	GH_DebugDescriptionWriter writer
)
Sub AppendToDebugLog (
	writer As GH_DebugDescriptionWriter
)
Parameters
writer
Type: Grasshopper.Kernel.GH_DebugDescriptionWriter
Object to write to.
See Also
Reference
IGH_DebugDescription Interface
Grasshopper.Kernel Namespace