Grasshopper SDK
Instances.CursorServer Property
 Gets the CursorServer instance cached by the Instance Server. The CursorServer will be instantiated the first time this property is accessed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_CursorServer CursorServer { get; }
Public Shared ReadOnly Property CursorServer As GH_CursorServer
	Get
Property Value
Type: GH_CursorServer
[Missing <value> documentation for "P:Grasshopper.Instances.CursorServer"]
See Also
Reference
Instances Class
Grasshopper Namespace