Grasshopper SDK
GH_Document.FindComponent Method (Point)
 Search for components that contain the locus
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Component FindComponent(
	Point pt
)
Public Function FindComponent (
	pt As Point
) As IGH_Component
Parameters
pt
Type: System.Drawing.Point
The point to search for
Return Value
Type: IGH_Component
See Also
Reference
GH_Document Class
FindComponent Overload
Grasshopper.Kernel Namespace