Grasshopper SDK
GH_GraphicsUtil.CreateColourIcon Method
 Create a colour swatch icon.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Bitmap CreateColourIcon(
	int width,
	int height,
	Color colour
)
Public Shared Function CreateColourIcon (
	width As Integer,
	height As Integer,
	colour As Color
) As Bitmap
Parameters
width
Type: System.Int32
Width of icon.
height
Type: System.Int32
Height of icon.
colour
Type: System.Drawing.Color
Colour for swatch, if colour contains an alpha component, you should draw an alpha-grid behind the icon.
Return Value
Type: Bitmap
A bitmap with the requested icon colour.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace