Grasshopper SDK
GH_ParamServerEventArgs Class
 Arguments used in events for the GH_ComponentParamServer type.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_ParamServerEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ParamServerEventArgs : EventArgs
Public Class GH_ParamServerEventArgs
	Inherits EventArgs
The GH_ParamServerEventArgs type exposes the following members.
Properties
Name | Description
OriginalArguments
 Gets access to the original parameter event arguments.
Parameter
 Gets the parameter that caused the original event.
ParameterIndex
 Gets the index of the parameter that caused the original event.
ParameterSide
 Gets the side of the parameter that caused the original event.
Server
 Gets the GH_ComponentParamServer object that raised the event.
Top
See Also
Reference
Grasshopper.Kernel Namespace