Grasshopper SDK
GH_Document.TranslateObjects Method
 Offset objects by a certain distance in X and Y
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void TranslateObjects(
	Size trXForm,
	bool bLimitToSelection
)
Public Sub TranslateObjects (
	trXForm As Size,
	bLimitToSelection As Boolean
)
Parameters
trXForm
Type: System.Drawing.Size
Translation vector
bLimitToSelection
Type: System.Boolean
If True, only selected objects are affected
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace