Grasshopper SDK
GH_DocumentObject.GetValue Method (String, String)
 Get a string value from the component value table.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected string GetValue(
	string name,
	string default
)
Protected Function GetValue (
	name As String,
	default As String
) As String
Parameters
name
Type: System.String
Name of string to retrieve.
default
Type: System.String
Default value to return in case of missing named value.
Return Value
Type: String
The string value with the given name of the default value.
See Also
Reference
GH_DocumentObject Class
GetValue Overload
Grasshopper.Kernel Namespace