Grasshopper SDK
IGH_GooProxy.FromString Method
 If IsParsable(), then attempts to convert the string to a generic type value
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool FromString(
	string in
)
Function FromString (
	in As String
) As Boolean
Parameters
in
Type: System.String
The String to parse.
Return Value
Type: Boolean
True on success, false on failure. This method should not throw exceptions.
See Also
Reference
IGH_GooProxy Interface
Grasshopper.Kernel.Types Namespace