Grasshopper SDK
GH_Capsule.Font Property
 Gets or sets the Font to use for text rendering.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Font Font { get; set; }
Public Property Font As Font
	Get
	Set
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.Font"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace