Grasshopper SDK
GH_PreviewUtil.Enabled Property
 Gets or sets the enabled state of this Preview util.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewUtil.Enabled"]
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace