Grasshopper SDK
IGH_InitCodeAware.SetInitCode Method
 This method will be called when the user inserts an object via the Canvas Search popup and supplies an "=XXXX" string init code. Do not throw exceptions in this method! Either handle the code correctly or ignore it.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void SetInitCode(
	string code
)
Sub SetInitCode (
	code As String
)
Parameters
code
Type: System.String
The portion after the first "=" symbol.
See Also
Reference
IGH_InitCodeAware Interface
Grasshopper.Kernel Namespace