Grasshopper SDK
GH_NamedView.Name Property
 Gets or sets the name of the view.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_NamedView.Name"]
See Also
Reference
GH_NamedView Class
Grasshopper.GUI.Canvas Namespace