Grasshopper SDK
GH_ScriptVariant.DateTime Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime DateTime { get; }
Public ReadOnly Property DateTime As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ScriptVariant.DateTime"]
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace