Grasshopper SDK
GH_Structure<T>.ReplacePath Method
 Replace an existing path with a different one. If the operation is successfull, then the 'find' path will be deleted. If the 'replace' path is already defined, the items in 'find' will be appended to the existing path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ReplacePath(
	GH_Path find,
	GH_Path replace
)
Public Sub ReplacePath (
	find As GH_Path,
	replace As GH_Path
)
Parameters
find
Type: Grasshopper.Kernel.Data.GH_Path
The path to search for.
replace
Type: Grasshopper.Kernel.Data.GH_Path
The new path.
Implements
IGH_Structure.ReplacePath(GH_Path, GH_Path)
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace