Grasshopper SDK
GH_Document.FilePathChanged Event
 Raised whenever the FilePath of the document is modified.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Document.FilePathChangedEventHandler FilePathChanged
Public Event FilePathChanged As GH_Document.FilePathChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.FilePathChangedEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace