Grasshopper SDK
GH_ActiveObject.ExpireSolution Method
 Informs the document that owns this object that the solution has expired. The current object will be set to BLANK as a result. This method is recursive, it will also expire any and all objects which depend on this object. If you want a less destructive expiration, consider using ClearData(). If this object is already Blank, you should consider not expiring it.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void ExpireSolution(
	bool recompute
)
Public Overrides Sub ExpireSolution (
	recompute As Boolean
)
Parameters
recompute
Type: System.Boolean
If True, the document will be instructed to solve the new state.
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace