Grasshopper SDK
IGH_ObjectProxy.Guid Property
 Gets the Guid of the target object. In the case of Compiled Objects, the Guid represents the ComponentID, in the case of User Objects, the Guid is a hash of the file path.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid Guid { get; }
ReadOnly Property Guid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ObjectProxy.Guid"]
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace