Grasshopper SDK
GH_GraphicsUtil.RenderUnscaledIcon Method (Graphics, Image, Int32, Int32, Double)
Note: This API is now obsolete.
 Draws an image file at 1:1 scale centered on the given coordinates.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("This method is obsolete, use a RenderIcon() overload instead.")]
public static void RenderUnscaledIcon(
	Graphics g,
	Image icon,
	int cx,
	int cy,
	double fade
)
<ObsoleteAttribute("This method is obsolete, use a RenderIcon() overload instead.")>
Public Shared Sub RenderUnscaledIcon (
	g As Graphics,
	icon As Image,
	cx As Integer,
	cy As Integer,
	fade As Double
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
icon
Type: System.Drawing.Image
Image to draw.
cx
Type: System.Int32
X center of image in Graphics coordinate.
cy
Type: System.Int32
Y center of image in Graphics coordinate.
fade
Type: System.Double
Alpha fading factor.
See Also
Reference
GH_GraphicsUtil Class
RenderUnscaledIcon Overload
Grasshopper.GUI Namespace