Grasshopper SDK
GH_ParserOperator.CompareTo Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int CompareTo(
	GH_ParserOperator other
)
Public Function CompareTo (
	other As GH_ParserOperator
) As Integer
Parameters
other
Type: Grasshopper.Kernel.Expressions.GH_ParserOperator
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
GH_ParserOperator Class
Grasshopper.Kernel.Expressions Namespace