Grasshopper SDK
GH_UserObject.Icon Property
 Gets or sets the icon associated with this User Object. If the icon hasn't been overridden, then a Default icon is returned.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap Icon { get; set; }
Public Property Icon As Bitmap
	Get
	Set
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_UserObject.Icon"]
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace