Grasshopper SDK
GH_CharPatternParamNameConstructor Constructor
Initializes a new instance of the GH_CharPatternParamNameConstructor class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CharPatternParamNameConstructor()
Public Sub New
See Also
Reference
GH_CharPatternParamNameConstructor Class
GH_CharPatternParamNameConstructor Overload
Grasshopper.Kernel Namespace