Grasshopper SDK
IGH_ObjectProxy.Icon Property
 Gets the icon for this object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Bitmap Icon { get; }
ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ObjectProxy.Icon"]
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace