Grasshopper SDK
IGH_FieldElement.IsLimited Property
 Gets or sets whether this element affects a limited region.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsLimited { get; set; }
Property IsLimited As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_FieldElement.IsLimited"]
See Also
Reference
IGH_FieldElement Interface
Grasshopper.Kernel.Types Namespace