Grasshopper SDK
GH_ScriptVariant.True Operator
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool operator true(
	GH_ScriptVariant A
)
Public Shared Operator IsTrue (
	A As GH_ScriptVariant
) As Boolean
Parameters
A
Type: Grasshopper.Kernel.Expressions.GH_ScriptVariant
Return Value
Type: Boolean
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace