Grasshopper SDK
GH_Gradient.DisplayGripColourPicker Method
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DisplayGripColourPicker(
	GH_Grip grip
)
Public Sub DisplayGripColourPicker (
	grip As GH_Grip
)
Parameters
grip
Type: Grasshopper.GUI.Gradient.GH_Grip
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace