Grasshopper SDK
GH_Orientation Enumeration
 Enumerates possible alignments.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_Orientation
Public Enumeration GH_Orientation
Members
Member name | Value | Description
horizontal_center | 0 |  Text is drawn horizontally, centered in the middle of the context.
horizontal_near | 1 |  Text is drawn horizontally, aligned near to the context edge.
horizontal_far | 2 |  Text is drawn horizontally, aligned far from the context edge.
vertical_center | 10 |  Text is drawn vertically, centered in the middle of the context.
vertical_near | 11 |  Text is drawn vertically, aligned near to the context edge.
vertical_far | 12 |  Text is drawn vertically, aligned far from the context edge.
See Also
Reference
Grasshopper.GUI.Canvas Namespace