Grasshopper SDK
IGH_Attributes.Bounds Property
 Gets the rectangle that contains the active content of the attributes. Typically the Contents determine the active area for menus, tooltips etc. Attributes are not supposed to draw objects beyond the Bounds.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
RectangleF Bounds { get; set; }
Property Bounds As RectangleF
	Get
	Set
Property Value
Type: RectangleF
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.Bounds"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace