Grasshopper SDK
CentralSettings.PreviewPlaneRadiusChangedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void PreviewPlaneRadiusChangedEventHandler()
Public Delegate Sub PreviewPlaneRadiusChangedEventHandler
See Also
Reference
Grasshopper Namespace