Grasshopper SDK
GH_Format.FormatInteger Method (GH_Integer)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatInteger(
	GH_Integer data
)
Public Shared Function FormatInteger (
	data As GH_Integer
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Integer
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatInteger Overload
Grasshopper.Kernel Namespace