Grasshopper SDK
GH_Structure<T>.EnsurePath Method (GH_Path)
 Create a new branch with the specified path if it doesn't already exists.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<T> EnsurePath(
	GH_Path path
)
Public Function EnsurePath (
	path As GH_Path
) As List(Of T)
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path of the branch to ensure.
Return Value
Type: List<T>
The list that belongs to the specified path.
See Also
Reference
GH_Structure<T> Class
EnsurePath Overload
Grasshopper.Kernel.Data Namespace