Grasshopper SDK
GH_Document.ReplaceProxySources Method
 Replace all remaining proxy sources in the document with UnresolvedProxy Objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ReplaceProxySources()
Public Sub ReplaceProxySources
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace