Grasshopper SDK
GH_FontServer Class
 Maintains a collection of standard fonts and mays to measure them.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_FontServer
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_FontServer
Public NotInheritable Class GH_FontServer
The GH_FontServer type exposes the following members.
Properties
Name | Description
Console
 FontFamily.GenericMonospace, 10pt, regular
ConsoleAdjusted
 FontFamily.GenericMonospace, 10pt, regular, adjusted to counter UI scaling.
ConsoleSmall
 FontFamily.GenericMonospace, 8pt, regular
ConsoleSmallAdjusted
 FontFamily.GenericMonospace, 8pt, regular, adjusted to counter UI scaling.
FamilyConsole
 Gets or sets the FontFamily used for monospaced fonts in Grasshopper.
FamilyScript
 Gets or sets the FontFamily used for scripted fonts in Grasshopper.
FamilyStandard
 Gets or sets the FontFamily used for standard fonts in Grasshopper.
Large
 SystemFonts.CaptionFont, 10pt, bold
LargeAdjusted
 SystemFonts.CaptionFont, 10pt, bold, adjusted for logical pixel size.
Script
 FontFamily.GenericSansSerif, 10pt, italic
ScriptSmall
 FontFamily.GenericSansSerif, 8pt, italic
Small
 SystemFonts.CaptionFont, 6pt, regular
Standard
 SystemFonts.CaptionFont, 8pt, regular
StandardAdjusted
 SystemFonts.CaptionFont, 8pt, regular, adjusted for logical pixel size.
StandardBold
 SystemFonts.CaptionFont, 8pt, bold
StandardItalic
 SystemFonts.CaptionFont, 8pt, italic
Top
Methods
Name | Description
FontToString
 Convert a font to a string.
MeasureString(String, Font)
 Measure the size of a string
MeasureString(String, Font, SizeF)
 Measure the size of a string
MeasureString(String, Font, Single)
 Measure the size of a string
NewFont(Font, FontStyle)
 Safe font constructor.
NewFont(Font, Single)
 Safe font constructor.
NewFont(FontFamily, Single)
 Safe font constructor.
NewFont(Font, Single, FontStyle)
 Safe font constructor.
NewFont(FontFamily, Single, FontStyle)
 Safe font constructor.
NewFont(String, Single, FontStyle)
 High level function for Font creation. We've ran into loads of trouble in the past with missing Fonts. Never create a font directly via GDI+, always use this method.
StringToFont
 Convert a font description string back into a font.
StringWidth(IEnumerable<String>, Font)
 Measure the maximum width of a collection of strings
StringWidth(String, Font)
 Measure the width of a string in pixels
Top
Events
Name | Description
ConsoleFamilyChanged
 Raised whenever the MonospacedFamily is changed.
ScriptFamilyChanged
 Raised whenever the ScriptFamily is changed.
StandardFamilyChanged
 Raised whenever the StandardFamily is changed.
Top
See Also
Reference
Grasshopper.Kernel Namespace