Grasshopper SDK
GH_Document.PreviewCurrentMeshParameters Method
 Gets the currently relevant meshing parameters (do not modify the instance as it may be shared).
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public MeshingParameters PreviewCurrentMeshParameters()
Public Function PreviewCurrentMeshParameters As MeshingParameters
Return Value
Type: MeshingParameters
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace