Grasshopper SDK
GH_ExpandMode Enumeration
 Enumerates the possible expansion modes for structure paths.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ExpandMode
Public Enumeration GH_ExpandMode
Members
Member name | Value | Description
None | 0 |  Indicates no expansion should take place.
SimpleReplace | 1 |  Paths are expanded and collisions are erased.
SimpleAppend | 2 |  Paths are expanded and merged with colliding paths.
Recursive | 3 |  Before a path is expanded, any collision is expanded first.
See Also
Reference
Grasshopper.Kernel.Data Namespace