Grasshopper SDK
GH_ScrollBarVerticalBase.ContentOffset Property
 Gets the vertical offset (in pixels) of the scrolled content.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double ContentOffset { get; }
Public ReadOnly Property ContentOffset As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.ContentOffset"]
See Also
Reference
GH_ScrollBarVerticalBase Class
Grasshopper.GUI.Base Namespace