Grasshopper SDK
GH_Component.AssignInitCodeToInputParameter Method
 Utility function for parsing and assigning init codes. This only works for standard parameter types.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected bool AssignInitCodeToInputParameter(
	int paramIndex,
	string code
)
Protected Function AssignInitCodeToInputParameter (
	paramIndex As Integer,
	code As String
) As Boolean
Parameters
paramIndex
Type: System.Int32
Index of input parameter to assign.
code
Type: System.String
Code to parse and assign.
Return Value
Type: Boolean
True if the code was assigned, false if otherwise.
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace