Grasshopper SDK
IGH_RenderAwareObject.AppendRenderGeometry Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void AppendRenderGeometry(
	GH_RenderArgs args
)
Sub AppendRenderGeometry (
	args As GH_RenderArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_RenderArgs
See Also
Reference
IGH_RenderAwareObject Interface
Grasshopper.Kernel Namespace