Grasshopper SDK
GH_FontServer.StandardBold Property
 SystemFonts.CaptionFont, 8pt, bold
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font StandardBold { get; }
Public Shared ReadOnly Property StandardBold As Font
	Get
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FontServer.StandardBold"]
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace