Grasshopper SDK
GH_SettingsServer.EntryNames Method
 Gets a list of all the entry names in this settings.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string> EntryNames()
Public Function EntryNames As List(Of String)
Return Value
Type: List<String>
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace