Grasshopper SDK
GH_VerticalScrollBar.ScrollRatioChangedEventHandler Delegate
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ScrollRatioChangedEventHandler(
	GH_VerticalScrollBar sender,
	double ratio
)
Public Delegate Sub ScrollRatioChangedEventHandler (
	sender As GH_VerticalScrollBar,
	ratio As Double
)
Parameters
sender
Type: Grasshopper.GUI.GH_VerticalScrollBar
ratio
Type: System.Double
See Also
Reference
Grasshopper.GUI Namespace