Grasshopper SDK
GH_CanvasDropTargetValidator.DropRegion Property
 Gets or sets the dropregion for this validator. Regions are cloned so you can dispose of the original immedately after assignment.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RectangleF DropRegion { get; set; }
Public Property DropRegion As RectangleF
	Get
	Set
Property Value
Type: RectangleF
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasDropTargetValidator.DropRegion"]
See Also
Reference
GH_CanvasDropTargetValidator Class
Grasshopper.GUI.Canvas Namespace