Grasshopper SDK
IGH_ValueProxy.ProxyType Property
 Gets the System.Type description of the template type
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Type ProxyType { get; }
ReadOnly Property ProxyType As Type
	Get
Property Value
Type: Type
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ValueProxy.ProxyType"]
See Also
Reference
IGH_ValueProxy Interface
Grasshopper.Kernel Namespace