Grasshopper SDK
GH_Parser.IsParagraphHeaderLine Method
 Test whether a line represents a paragraph header underline. Paragraph header underlines contain at least 4 consecutive dashes preceded or followed by any amount of white space.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsParagraphHeaderLine(
	string line
)
Public Shared Function IsParagraphHeaderLine (
	line As String
) As Boolean
Parameters
line
Type: System.String
Line to test.
Return Value
Type: Boolean
True if the line is considered to be a paragraph header underline.
See Also
Reference
GH_Parser Class
Grasshopper.Documentation Namespace