Grasshopper SDK
GH_DigitScroller.Epsilon Property
 Gets the smallest possible change with the current settings.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Epsilon { get; }
Public ReadOnly Property Epsilon As Decimal
	Get
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DigitScroller.Epsilon"]
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace