Grasshopper SDK
GH_Parser.Whitespace Property
 Gets an array of characters that are considered to be whitespace. At the moment, this array contains the space char and the tab char, it does not contain feeds or breaks.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static char[] Whitespace { get; }
Public Shared ReadOnly Property Whitespace As Char()
	Get
Property Value
Type: Char[]
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_Parser.Whitespace"]
See Also
Reference
GH_Parser Class
Grasshopper.Documentation Namespace