Grasshopper SDK
GH_VariantType Enumeration
 Lists all possible variable types supported in the Grasshopper Expression Parser.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_VariantType
Public Enumeration GH_VariantType
Members
Member name | Value | Description
unknown | -1 |  Unknown type.
null | 0 |  Variant is a null reference.
bool | 1 |  Variant is of type System.Boolean
int | 2 |  Variant is of type System.Int32
double | 4 |  Variant is of type System.Double
string | 8 |  Variant is of type System.String
point | 16 |  Variant is of type Rhino.Geometry.Point3d
plane | 32 |  Variant is of type Rhino.Geometry.Plane
complex | 64 |  Variant is of type Grasshopper.Types.GH_Complex
See Also
Reference
Grasshopper.Kernel.Expressions Namespace