Grasshopper SDK
GH_Format.FormatBoolean Method (GH_Boolean)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatBoolean(
	GH_Boolean data
)
Public Shared Function FormatBoolean (
	data As GH_Boolean
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Boolean
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatBoolean Overload
Grasshopper.Kernel Namespace