Grasshopper SDK
GH_Convert.ToGUID Method
 Convert data into Guids.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToGUID(
	Object data,
	out Guid destination,
	GH_Conversion conversion_level
)
Public Shared Function ToGUID (
	data As Object,
	<OutAttribute> ByRef destination As Guid,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
destination
Type: System.Guid
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace