Grasshopper SDK
Instances.EnforceInvariantCulture Method
 If the Setting "EnforceInvariantCulture" is set to False, this function does nothing
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void EnforceInvariantCulture()
Public Shared Sub EnforceInvariantCulture
Remarks
See Also
Reference
Instances Class
Grasshopper Namespace