Grasshopper SDK
GH_GraphicsUtil.EtchFadingVertical Method
 Draw an etched line with fading on the extremes.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void EtchFadingVertical(
	Graphics g,
	int y0,
	int y1,
	int x,
	int alphaLight = 200,
	int alphaDark = 80
)
Public Shared Sub EtchFadingVertical (
	g As Graphics,
	y0 As Integer,
	y1 As Integer,
	x As Integer,
	Optional alphaLight As Integer = 200,
	Optional alphaDark As Integer = 80
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
y0
Type: System.Int32
Top y coordinate of etch.
y1
Type: System.Int32
Bottom y coordinate of etch.
x
Type: System.Int32
X coordinate of etch.
alphaLight (Optional)
Type: System.Int32
Transparancy of etch.
alphaDark (Optional)
Type: System.Int32
Transparancy of etch.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace