Grasshopper SDK
GH_VectorForce Class
 Linear vector force implementation for IGH_Fields.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_FieldElement
 Grasshopper.Kernel.Types.GH_VectorForce
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_VectorForce : GH_FieldElement
Public Class GH_VectorForce
	Inherits GH_FieldElement
The GH_VectorForce type exposes the following members.
Constructors
Name | Description
GH_VectorForce
Initializes a new instance of the GH_VectorForce class
Top
Properties
Name | Description
BoundingBox |  (Overrides GH_FieldElement.BoundingBox.)
Chord
ElementGuid |  (Overrides GH_FieldElement.ElementGuid.)
Top
Methods
Name | Description
DrawViewportWires |  (Overrides GH_FieldElement.DrawViewportWires(GH_PreviewWireArgs).)
Duplicate |  (Overrides GH_FieldElement.Duplicate().)
Force |  (Overrides GH_FieldElement.Force(Point3d).)
Read |  (Overrides GH_FieldElement.Read(GH_IReader).)
Write |  (Overrides GH_FieldElement.Write(GH_IWriter).)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace