Grasshopper SDK
GH_VectorForce.Duplicate Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IGH_FieldElement Duplicate()
Public Overrides Function Duplicate As IGH_FieldElement
Return Value
Type: IGH_FieldElement
See Also
Reference
GH_VectorForce Class
Grasshopper.Kernel.Types Namespace