Grasshopper SDK
GH_MaterialPreviewControl.MaterialImagePostPaint Event
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_MaterialPreviewControl.MaterialImagePostPaintEventHandler MaterialImagePostPaint
Public Event MaterialImagePostPaint As GH_MaterialPreviewControl.MaterialImagePostPaintEventHandler
Value
Type: Grasshopper.GUI.GH_MaterialPreviewControl.MaterialImagePostPaintEventHandler
See Also
Reference
GH_MaterialPreviewControl Class
Grasshopper.GUI Namespace