Grasshopper SDK
GH_GraphicsUtil.ColourARGB Method (Int32, Int32, Int32, Int32)
 Create a colour from integer ARGB channels. Channels are clipped to valid ranges.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color ColourARGB(
	int a,
	int r,
	int g,
	int b
)
Public Shared Function ColourARGB (
	a As Integer,
	r As Integer,
	g As Integer,
	b As Integer
) As Color
Parameters
a
Type: System.Int32
r
Type: System.Int32
g
Type: System.Int32
b
Type: System.Int32
Return Value
Type: Color
Returns the colour as implied by the ARGB channel values.
See Also
Reference
GH_GraphicsUtil Class
ColourARGB Overload
Grasshopper.GUI Namespace