Grasshopper SDK
GH_Format.FormatMatrix Method (GH_Matrix)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatMatrix(
	GH_Matrix data
)
Public Shared Function FormatMatrix (
	data As GH_Matrix
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Matrix
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatMatrix Overload
Grasshopper.Kernel Namespace