Grasshopper SDK
GH_WindowsFormUtil Class
 Exposes some static (Shared) utility functions for positioning custom windows.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_WindowsFormUtil
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_WindowsFormUtil
Public NotInheritable Class GH_WindowsFormUtil
The GH_WindowsFormUtil type exposes the following members.
Methods
Name | Description
CenterFormOnCursor
 Positions a Form so that it is centered around the cursor
CenterFormOnEditor
 Positions a Form so that it is centered on the active editor. If the editor doesn't exist or is hidden, the form will be centered on the screen instead.
CenterFormOnScreen
 Positions a Form so that it is centered on the current screen. The current screen being defined as the screen containing the cursor.
CenterFormOnWindow
 Positions a Form so that it is centered on the supplied window. If the window doesn't exist or is hidden, the form will be centered on the screen instead.
Top
See Also
Reference
Grasshopper.GUI Namespace