Grasshopper SDK
GH_Document.Thumbnail Property
 Gets or sets the thumbnail bitmap for this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap Thumbnail { get; set; }
Public Property Thumbnail As Bitmap
	Get
	Set
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.Thumbnail"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace