Grasshopper SDK
IGH_PreviewData.DrawViewportWires Method
 Implement this function to draw all wire and point previews.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void DrawViewportWires(
	GH_PreviewWireArgs args
)
Sub DrawViewportWires (
	args As GH_PreviewWireArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_PreviewWireArgs
Drawing arguments.
See Also
Reference
IGH_PreviewData Interface
Grasshopper.Kernel Namespace