Grasshopper SDK
GH_FileSystemEventServer.AllPaths Property
 Gets a list of all the paths currently under surveillance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static IEnumerable<string> AllPaths { get; }
Public Shared ReadOnly Property AllPaths As IEnumerable(Of String)
	Get
Property Value
Type: IEnumerable<String>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FileSystemEventServer.AllPaths"]
See Also
Reference
GH_FileSystemEventServer Class
Grasshopper.Kernel Namespace