Grasshopper SDK
GH_StateTagList Constructor
Initializes a new instance of the GH_StateTagList class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_StateTagList()
Public Sub New
See Also
Reference
GH_StateTagList Class
Grasshopper.Kernel Namespace