Grasshopper SDK
GH_Convert.IsPureTime Method
 Tests whether a DateTime instance represents a pure time (i.e. that the date portion is undefined). Pure times are a Grasshopper convention, basically a pure time is 2 ticks past any second.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsPureTime(
	DateTime potentialTime
)
Public Shared Function IsPureTime (
	potentialTime As DateTime
) As Boolean
Parameters
potentialTime
Type: System.DateTime
Date to test.
Return Value
Type: Boolean
True if the time is considered undefined.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace