Grasshopper SDK
GH_GeometryGroup Constructor
Initializes a new instance of the GH_GeometryGroup class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_GeometryGroup()
Public Sub New
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace