Grasshopper SDK
GH_DocumentIO.ClearClipboard Method
 Clear the Clipboard Text content. This function wipes both the Text and UnicodeText clipboard fields.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearClipboard(
	GH_ClipboardType clipboard
)
Public Sub ClearClipboard (
	clipboard As GH_ClipboardType
)
Parameters
clipboard
Type: Grasshopper.Kernel.GH_ClipboardType
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace