Grasshopper SDK
GH_PersistentGeometryParam<T>.RegisterRemoteIdsDespiteSources Method
 Call this method if you wish to register remote ids in the volatile data despite having one or more sources. You should only need to do this if you converted non-referenced data into volatile referenced data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void RegisterRemoteIdsDespiteSources()
Protected Sub RegisterRemoteIdsDespiteSources
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace