Grasshopper SDK
GH_PluginUtil.FocusOnRhino Method
 Set the focus to the Rhino command line.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void FocusOnRhino()
Public Shared Sub FocusOnRhino
See Also
Reference
GH_PluginUtil Class
Grasshopper.Plugin Namespace