Grasshopper SDK
GH_FadeAnimation Class
 Utility class for animating fade ZUI events on the canvas.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_FadeAnimation
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_FadeAnimation
Public Class GH_FadeAnimation
The GH_FadeAnimation type exposes the following members.
Constructors
Name | Description
GH_FadeAnimation()
 Creates a new instance of the Animator class with default settings.
GH_FadeAnimation(Single)
 Create a new instance of the Animator class with custom values for zoom threshold.
GH_FadeAnimation(Single, Int32)
 Create a new instance of the Animator class with custom values for zoom threshold and duration.
Top
Properties
Name | Description
Duration
 Gets or sets the duration (in milliseconds) for ZUI animations. Negative durations are not allowed. The default is 350 milliseconds.
FadeAlpha
 Gets the blend alpha byte for the current state. 0 means fully hidden, 255 means fully shown.
FadeFactor
 Gets the blend factor for the current state. 0.0 means fully hidden, 1.0 means fully shown.
IsFinished
 Gets a value indicating whether this animator has finished animating.
Phase
 Gets the current animation phase.
Threshold
 Gets or sets the threshold value for the fade animation trigger.
TriggerUpdate
 Gets or sets whether this animator triggers canvas updates.
Top
Methods
Name | Description
Evaluate(GH_Canvas)
 Reevaluate the fade animation parameters. You should call this method from within the Render method of your attributes. If an animation is currently in progress a redraw of the canvas will be scheduled, whether or not the attributes are actually visible on the canvas. You should therefore only call this method if your attributes are already drawing themselves.
Evaluate(GH_Canvas, Boolean)
 Reevaluate the fade animation parameters. You should call this method from within the Render method of your attributes. If an animation is currently in progress a redraw of the canvas will be scheduled, whether or not the attributes are actually visible on the canvas. You should therefore only call this method if your attributes are already drawing themselves.
Evaluate(GH_Canvas, Single)
 Reevaluate the fade animation parameters. You should call this method from within the Render method of your attributes. If an animation is currently in progress a redraw of the canvas will be scheduled, whether or not the attributes are actually visible on the canvas. You should therefore only call this method if your attributes are already drawing themselves.
Evaluate(GH_Canvas, Single, Boolean)
 Reevaluate the fade animation parameters. You should call this method from within the Render method of your attributes. If an animation is currently in progress a redraw of the canvas will be scheduled, whether or not the attributes are actually visible on the canvas. You should therefore only call this method if your attributes are already drawing themselves.
Top
Fields
Name | Description
Delay
 Gets the number of milliseconds between redraws (25 milliseconds, resulting in ~40 fps)
Top
See Also
Reference
Grasshopper.GUI Namespace