Grasshopper SDK
GH_RuntimeMessage.Message Property
 Gets the contents of the message.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Message { get; }
Public ReadOnly Property Message As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RuntimeMessage.Message"]
See Also
Reference
GH_RuntimeMessage Class
Grasshopper.Kernel Namespace