Grasshopper SDK
GH_Capsule.CreateTextCapsule Method (RectangleF, RectangleF, GH_Palette, String, Font, GH_Orientation, Int32[], Int32)
 Create a new capsule with content text.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Capsule CreateTextCapsule(
	RectangleF box,
	RectangleF textbox,
	GH_Palette palette,
	string text,
	Font font,
	GH_Orientation orientation,
	int[] radii,
	int highlight
)
Public Shared Function CreateTextCapsule (
	box As RectangleF,
	textbox As RectangleF,
	palette As GH_Palette,
	text As String,
	font As Font,
	orientation As GH_Orientation,
	radii As Integer(),
	highlight As Integer
) As GH_Capsule
Parameters
box
Type: System.Drawing.RectangleF
Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox
Type: System.Drawing.RectangleF
Box into which the text will be drawn.
palette
Type: Grasshopper.GUI.Canvas.GH_Palette
Colour palette to apply.
text
Type: System.String
Text to display inside the capsule.
font
Type: System.Drawing.Font
Font to draw text with.
orientation
Type: Grasshopper.GUI.Canvas.GH_Orientation
Orientation of text within box.
radii
Type: System.Int32[]
Radii of rounded corners. This array must contain at least 4 integers. Radii are defined clockwise, starting at the upper left corner.
highlight
Type: System.Int32
Height of the highlight bar. A value of zero or lower disables the highlight.
Return Value
Type: GH_Capsule
A new instance of GH_Capsule. Caller is responsible for disposing of the object.
See Also
Reference
GH_Capsule Class
CreateTextCapsule Overload
Grasshopper.GUI.Canvas Namespace