Grasshopper SDK
GH_Interval Constructor (GH_Interval)
 Create a duplicate from another interval.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Interval(
	GH_Interval other
)
Public Sub New (
	other As GH_Interval
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Interval
Interval start
See Also
Reference
GH_Interval Class
GH_Interval Overload
Grasshopper.Kernel.Types Namespace