Grasshopper SDK
GH_CharPatternParamNameConstructor Constructor (String, Int32)
Initializes a new instance of the GH_CharPatternParamNameConstructor class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CharPatternParamNameConstructor(
	string char_pool,
	int depth
)
Public Sub New (
	char_pool As String,
	depth As Integer
)
Parameters
char_pool
Type: System.String
depth
Type: System.Int32
See Also
Reference
GH_CharPatternParamNameConstructor Class
GH_CharPatternParamNameConstructor Overload
Grasshopper.Kernel Namespace