Grasshopper SDK
GH_Document.BringSelectionToTop Method
 Move the selection set to the top of the visible stack
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void BringSelectionToTop()
Public Sub BringSelectionToTop
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace