Grasshopper SDK
GH_Convert.ToComplex Method
 Convert data into Complex.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToComplex(
	Object data,
	out Complex destination,
	GH_Conversion conversion_level
)
Public Shared Function ToComplex (
	data As Object,
	<OutAttribute> ByRef destination As Complex,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
destination
Type: Grasshopper.Kernel.Types.Complex
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace