Grasshopper SDK
GH_Format.FormatInterval Method (GH_Interval)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatInterval(
	GH_Interval data
)
Public Shared Function FormatInterval (
	data As GH_Interval
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Interval
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatInterval Overload
Grasshopper.Kernel Namespace