Grasshopper SDK
GH_Viewport.Focus Method (IGH_Attributes)
 Look at a specific object.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Focus(
	IGH_Attributes attribute
)
Public Sub Focus (
	attribute As IGH_Attributes
)
Parameters
attribute
Type: Grasshopper.Kernel.IGH_Attributes
Object attribute to focus on.
See Also
Reference
GH_Viewport Class
Focus Overload
Grasshopper.GUI.Canvas Namespace