Grasshopper SDK
GH_UserObject.Description Property
 Gets or sets the Instance Description override for this User Object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_InstanceDescription Description { get; set; }
Public Property Description As GH_InstanceDescription
	Get
	Set
Property Value
Type: GH_InstanceDescription
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_UserObject.Description"]
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace