Grasshopper SDK
GH_Canvas.ShowComponentSearchBox Method (Point)
 Display the component Search dialog at the given coordinate. The dialog cannot be shown if ModifiersEnabled=False.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ShowComponentSearchBox(
	Point at
)
Public Function ShowComponentSearchBox (
	at As Point
) As Boolean
Parameters
at
Type: System.Drawing.Point
Location (in screen space) for the center of the search box.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Canvas Class
ShowComponentSearchBox Overload
Grasshopper.GUI.Canvas Namespace