Grasshopper SDK
GH_GeometryGroup.IsReferencedGeometry Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsReferencedGeometry { get; }
Public ReadOnly Property IsReferencedGeometry As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometryGroup.IsReferencedGeometry"]
Implements
IGH_GeometricGoo.IsReferencedGeometry
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace