Grasshopper SDK
Generic.Duplicate Method
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public ITransform Duplicate()
Public Function Duplicate As ITransform
Return Value
Type: ITransform
Implements
ITransform.Duplicate()
See Also
Reference
Generic Class
Grasshopper.Kernel.Types.Transforms Namespace