Grasshopper SDK
CentralSettings.LoadMechanismChanged Event
 Raised whenever the load mechanism of a certain plugin changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.LoadMechanismChangedEventHandler LoadMechanismChanged
Public Shared Event LoadMechanismChanged As CentralSettings.LoadMechanismChangedEventHandler
Value
Type: Grasshopper.CentralSettings.LoadMechanismChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace