Grasshopper SDK
GH_Mesh Constructor (Mesh)
Initializes a new instance of the GH_Mesh class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Mesh(
	Mesh mesh
)
Public Sub New (
	mesh As Mesh
)
Parameters
mesh
Type: Mesh
See Also
Reference
GH_Mesh Class
GH_Mesh Overload
Grasshopper.Kernel.Types Namespace