Grasshopper SDK
GH_CanvasMouseEvent Constructor (GH_Viewport, MouseEventArgs)
 Constructor.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CanvasMouseEvent(
	GH_Viewport vp,
	MouseEventArgs e_args
)
Public Sub New (
	vp As GH_Viewport,
	e_args As MouseEventArgs
)
Parameters
vp
Type: Grasshopper.GUI.Canvas.GH_Viewport
The current canvas viewport state.
e_args
Type: System.Windows.Forms.MouseEventArgs
Original mouse event args.
See Also
Reference
GH_CanvasMouseEvent Class
GH_CanvasMouseEvent Overload
Grasshopper.GUI Namespace