Grasshopper SDK
IGH_DataAccess.SetDataList Method (String, IEnumerable)
 Stores data in an output parameter during GH_Component.SolveInstance().
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool SetDataList(
	string paramName,
	IEnumerable data
)
Function SetDataList (
	paramName As String,
	data As IEnumerable
) As Boolean
Parameters
paramName
Type: System.String
Name of the parameter at which to store the data.
data
Type: System.Collections.IEnumerable
Data to store. Data will be converted if necessary, but it will not be duplicated automatically.
Return Value
Type: Boolean
Remarks
Parameter access by index is faster, consider using the other overload if possible.
See Also
Reference
IGH_DataAccess Interface
SetDataList Overload
Grasshopper.Kernel Namespace