Grasshopper SDK
IGH_UndoAction.ExpiresSolution Property
 Gets the solution expiration flag for this event. If True, the solution needs to be recalculated once the entire undo record has been completed.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool ExpiresSolution { get; }
ReadOnly Property ExpiresSolution As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.IGH_UndoAction.ExpiresSolution"]
See Also
Reference
IGH_UndoAction Interface
Grasshopper.Kernel.Undo Namespace