Grasshopper SDK
GH_Convert.FileToHash Method
 Create a hash of a file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Guid FileToHash(
	string path
)
Public Shared Function FileToHash (
	path As String
) As Guid
Parameters
path
Type: System.String
File to hash.
Return Value
Type: Guid
A hash of the file contents. File name and attributes are not taken into consideration.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace