Grasshopper SDK
GH_DocumentTreeNode Class
 Represents a single node in a document tree.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_DocumentTreeNode
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocumentTreeNode
Public Class GH_DocumentTreeNode
The GH_DocumentTreeNode type exposes the following members.
Constructors
Name | Description
GH_DocumentTreeNode
 Create a new node instance.
Top
Properties
Name | Description
Document
 Gets the document at this node.
SubNodes
 Gets a collection of subnodes.
Top
See Also
Reference
Grasshopper.Kernel Namespace