Grasshopper SDK
GH_Circle.GH_CircleProxy.Radius Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Radius { get; set; }
Public Property Radius As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Circle.GH_CircleProxy.Radius"]
See Also
Reference
GH_Circle.GH_CircleProxy Class
Grasshopper.Kernel.Types Namespace