Grasshopper SDK
Scale Constructor
Initializes a new instance of the Scale class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Scale()
Public Sub New
See Also
Reference
Scale Class
Scale Overload
Grasshopper.Kernel.Types.Transforms Namespace