Grasshopper SDK
GH_Canvas.CreateMRUPanels Method
 Create new MRU panels. This function only does something if there is no document loaded in the canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateMRUPanels()
Public Sub CreateMRUPanels
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace