Grasshopper SDK
GH_InstanceDescription.NewInstanceGuid Method
 Generate a new random instance GUID
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void NewInstanceGuid()
Public Sub NewInstanceGuid
Implements
IGH_InstanceDescription.NewInstanceGuid()
See Also
Reference
GH_InstanceDescription Class
NewInstanceGuid Overload
Grasshopper.Kernel Namespace