Grasshopper SDK
GH_Component.ClearRuntimeMessages Method
 Clears all runtime messages in me and my parameters
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override sealed void ClearRuntimeMessages()
Public Overrides NotOverridable Sub ClearRuntimeMessages
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace