Grasshopper SDK
GH_Border.CreateBorders Method (RectangleF, Int32, Int32, Int32, Int32)
 Static (Shared) method for creating a set of borders.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<GH_Border> CreateBorders(
	RectangleF box,
	int borderLeft,
	int borderRight,
	int borderTop,
	int borderBottom
)
Public Shared Function CreateBorders (
	box As RectangleF,
	borderLeft As Integer,
	borderRight As Integer,
	borderTop As Integer,
	borderBottom As Integer
) As List(Of GH_Border)
Parameters
box
Type: System.Drawing.RectangleF
Box for border creation.
borderLeft
Type: System.Int32
Width of the leftmost border.
borderRight
Type: System.Int32
Width of the rightmost border.
borderTop
Type: System.Int32
Width of the topmost border.
borderBottom
Type: System.Int32
Width of the bottommost border.
Return Value
Type: List<GH_Border>
A list of borders.
See Also
Reference
GH_Border Class
CreateBorders Overload
Grasshopper.GUI.Canvas Namespace