Grasshopper SDK
GH_ObjectWrapper Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Object>
 Grasshopper.Kernel.Types.GH_ObjectWrapper
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ObjectWrapper : GH_Goo<Object>,
	IGH_BakeAwareData, IGH_PreviewData
Public Class GH_ObjectWrapper
	Inherits GH_Goo(Of Object)
	Implements IGH_BakeAwareData, IGH_PreviewData
The GH_ObjectWrapper type exposes the following members.
Constructors
Name | Description
GH_ObjectWrapper()
Initializes a new instance of the GH_ObjectWrapper class
GH_ObjectWrapper(Object)
Initializes a new instance of the GH_ObjectWrapper class
Top
Properties
Name | Description
ClippingBox
IsValid |  (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
BakeGeometry
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateObject
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace