Grasshopper SDK
GH_Document.FindClusters Method (String)
 Find all the clusters that have a matching filepath.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<GH_Cluster> FindClusters(
	string filepath
)
Public Function FindClusters (
	filepath As String
) As List(Of GH_Cluster)
Parameters
filepath
Type: System.String
Cluster FilePath to search for.
Return Value
Type: List<GH_Cluster>
A list of all the clusters that match the filepath.
See Also
Reference
GH_Document Class
FindClusters Overload
Grasshopper.Kernel Namespace