Grasshopper SDK
GH_Path.FromString Method
 Try to deserialize a GH_Path from a String.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool FromString(
	string s
)
Public Function FromString (
	s As String
) As Boolean
Parameters
s
Type: System.String
Return Value
Type: Boolean
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace