Grasshopper SDK
GH_Point.GH_PointProxy.UVParameterRatio Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PointRefUV_Wrapper UVParameterRatio { get; }
Public ReadOnly Property UVParameterRatio As GH_PointRefUV_Wrapper
	Get
Property Value
Type: GH_PointRefUV_Wrapper
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Point.GH_PointProxy.UVParameterRatio"]
See Also
Reference
GH_Point.GH_PointProxy Class
Grasshopper.Kernel.Types Namespace