Grasshopper SDK
GH_ScriptVariant.ThrowOperatorException Method (String, String, String)
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected static void ThrowOperatorException(
	string op_name,
	string A,
	string B
)
Protected Shared Sub ThrowOperatorException (
	op_name As String,
	A As String,
	B As String
)
Parameters
op_name
Type: System.String
A
Type: System.String
B
Type: System.String
See Also
Reference
GH_ScriptVariant Class
ThrowOperatorException Overload
Grasshopper.Kernel.Expressions Namespace