Grasshopper SDK
GH_GHXHarvester.HarvestBoundingBoxes Method (String)
 Harvest all attribute bounding boxes from a GHX/GH archive.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<RectangleF> HarvestBoundingBoxes(
	string file
)
Public Shared Function HarvestBoundingBoxes (
	file As String
) As List(Of RectangleF)
Parameters
file
Type: System.String
File to parse.
Return Value
Type: List<RectangleF>
A list of all attribute bounding boxes or null on failure.
See Also
Reference
GH_GHXHarvester Class
HarvestBoundingBoxes Overload
Grasshopper.Kernel Namespace