Grasshopper SDK
GH_LexerCombo Class
 Contains both a source and a target lexer object.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_LexerCombo
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_LexerCombo
Public Class GH_LexerCombo
The GH_LexerCombo type exposes the following members.
Constructors
Name | Description
GH_LexerCombo()
Initializes a new instance of the GH_LexerCombo class
GH_LexerCombo(String, String)
Initializes a new instance of the GH_LexerCombo class
GH_LexerCombo(GH_Lexer, GH_Lexer)
Initializes a new instance of the GH_LexerCombo class
Top
Properties
Name | Description
Source
 Gets or sets the lexer object that represents the source of a lexical operation.
Target
 Gets or sets the lexer object that represents the target of a lexical operation.
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace