Grasshopper SDK
GH_NamedView Constructor (GH_Viewport, Point, PointF)
 Create a new view useful for point match transitions.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_NamedView(
	GH_Viewport view,
	Point point,
	PointF target
)
Public Sub New (
	view As GH_Viewport,
	point As Point,
	target As PointF
)
Parameters
view
Type: Grasshopper.GUI.Canvas.GH_Viewport
Viewport this transition is supposed to work in.
point
Type: System.Drawing.Point
Point in control coordinates that is supposed to be matched.
target
Type: System.Drawing.PointF
Point in canvas coordinates that will be matched.
See Also
Reference
GH_NamedView Class
GH_NamedView Overload
Grasshopper.GUI.Canvas Namespace