Grasshopper SDK
GH_Material.RefreshReferenceData Method
 If the material is a referenced material, this function will update the local values to match the reference.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Material.RdkMaterialResult RefreshReferenceData()
Public Function RefreshReferenceData As GH_Material.RdkMaterialResult
Return Value
Type: GH_Material.RdkMaterialResult
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace