Grasshopper SDK
GH_QuickImageEditor.CanvasImage Property
 Gets or sets the canvas image.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap CanvasImage { get; set; }
Public Property CanvasImage As Bitmap
	Get
	Set
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.GH_QuickImageEditor.CanvasImage"]
See Also
Reference
GH_QuickImageEditor Class
Grasshopper.GUI Namespace