Grasshopper SDK
GH_SliderEventArgs.Value Property
 Gets the new value of the slider. This value is cached, so even if the slider subsequently updates, this property remains constant.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Value { get; }
Public ReadOnly Property Value As Decimal
	Get
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderEventArgs.Value"]
See Also
Reference
GH_SliderEventArgs Class
Grasshopper.GUI.Base Namespace