Grasshopper SDK
GH_IconLabel Constructor
Initializes a new instance of the GH_IconLabel class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_IconLabel()
Public Sub New
See Also
Reference
GH_IconLabel Class
Grasshopper.GUI Namespace