Grasshopper SDK
IGH_SettingFrontend.SettingsUI Method
 Create the winforms UI portion for this setting.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Control SettingsUI()
Function SettingsUI As Control
Return Value
Type: Control
See Also
Reference
IGH_SettingFrontend Interface
Grasshopper.GUI Namespace