Grasshopper SDK
GH_GHALoadingEventArgs.Assembly Property
 Gets the assembly that was loaded from the GHA file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Assembly Assembly { get; }
Public ReadOnly Property Assembly As Assembly
	Get
Property Value
Type: Assembly
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_GHALoadingEventArgs.Assembly"]
See Also
Reference
GH_GHALoadingEventArgs Class
Grasshopper.Kernel Namespace