Grasshopper SDK
GH_DocumentEditor.WndProc Method
 WndProc is overridden in order to allow for title-bar double-click (un)folding.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override sealed void WndProc(
	ref Message m
)
Protected Overrides NotOverridable Sub WndProc (
	ByRef m As Message
)
Parameters
m
Type: System.Windows.Forms.Message
Proc message.
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace