Grasshopper SDK
GH_ResizeBorder.Setup Method (RectangleF, PointF, PointF, SizeF)
 Set up a new sizing operation.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Setup(
	RectangleF ShapeRegion,
	PointF ShapePivot,
	PointF MouseCursor,
	SizeF MinSize
)
Public Sub Setup (
	ShapeRegion As RectangleF,
	ShapePivot As PointF,
	MouseCursor As PointF,
	MinSize As SizeF
)
Parameters
ShapeRegion
Type: System.Drawing.RectangleF
Shape of the object to resize.
ShapePivot
Type: System.Drawing.PointF
Pivot of the object to resize.
MouseCursor
Type: System.Drawing.PointF
Location of cursor in shape space coordinates.
MinSize
Type: System.Drawing.SizeF
Minimum allowed size for shape.
See Also
Reference
GH_ResizeBorder Class
Setup Overload
Grasshopper.GUI.Canvas Namespace