Grasshopper SDK
GH_ComponentServer Constructor
Initializes a new instance of the GH_ComponentServer class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ComponentServer()
Public Sub New
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace