Grasshopper SDK
CentralSettings.AuthorWebsiteChanged Event
 Raised whenever the AuthorWebsite field is changed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.AuthorWebsiteChangedEventHandler AuthorWebsiteChanged
Public Shared Event AuthorWebsiteChanged As CentralSettings.AuthorWebsiteChangedEventHandler
Value
Type: Grasshopper.CentralSettings.AuthorWebsiteChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace