Grasshopper SDK
IGH_Param.CreateProxySources Method
 Convert all proper source parameters into proxy sources.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void CreateProxySources()
Sub CreateProxySources
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace