Grasshopper SDK
GH_Structure<T>.FlattenData Method
 Collects all data in the structure under a single list. Does not alter the state of this structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<T> FlattenData()
Public Function FlattenData As List(Of T)
Return Value
Type: List<T>
A linear list containing all data items in all branches.
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace