Grasshopper SDK
GH_Format.FormatComplexNumber Method (Complex)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatComplexNumber(
	Complex num
)
Public Shared Function FormatComplexNumber (
	num As Complex
) As String
Parameters
num
Type: Grasshopper.Kernel.Types.Complex
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatComplexNumber Overload
Grasshopper.Kernel Namespace