Grasshopper SDK
GH_Document.Write Method (GH_IWriter, IList<IGH_DocumentObject>)
 Special function that allows writing of a custom object list. This function is used when partial documents need to be serialized such as when exporting or during clipboard operations.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Write(
	GH_IWriter writer,
	IList<IGH_DocumentObject> objList
)
Public Function Write (
	writer As GH_IWriter,
	objList As IList(Of IGH_DocumentObject)
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Writer to serialize with.
objList
Type: System.Collections.Generic.IList<IGH_DocumentObject>
Object list override
Return Value
Type: Boolean
See Also
Reference
GH_Document Class
Write Overload
Grasshopper.Kernel Namespace