Grasshopper SDK
IGH_PreviewObject.IsPreviewCapable Property
 Gets a value indicating whether or not this object (in its current state) can draw geometric previews at all.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsPreviewCapable { get; }
ReadOnly Property IsPreviewCapable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_PreviewObject.IsPreviewCapable"]
See Also
Reference
IGH_PreviewObject Interface
Grasshopper.Kernel Namespace