Grasshopper SDK
GH_Slider Events
The GH_Slider type exposes the following members.
Events
Name | Description
ValueChanged
 Raised whenever the value of the slider is changed via GUI interaction.
Top
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace