Grasshopper SDK
GH_MaterialPreviewControl Events
The GH_MaterialPreviewControl type exposes the following members.
Events
Name | Description
ColourChanged
MaterialImagePostPaint
SelectedChanged
Top
See Also
Reference
GH_MaterialPreviewControl Class
Grasshopper.GUI Namespace