Grasshopper SDK
GH_Param<T>.ConversionCallback Method
 This method is called whenever a successful conversion takes place from some source data into local target data. Override it if you wish to keep tabs on conversions.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void ConversionCallback(
	Object source,
	T target
)
Protected Overridable Sub ConversionCallback (
	source As Object,
	target As T
)
Parameters
source
Type: System.Object
Source data (never null).
target
Type: T
Target data (never null).
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace