Grasshopper SDK
IGH_StateAwareObject.LoadState Method
 Override this function to load your state data. DO NOT START A NEW SOLUTION. This will be handled by the state manager.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void LoadState(
	string state
)
Sub LoadState (
	state As String
)
Parameters
state
Type: System.String
See Also
Reference
IGH_StateAwareObject Interface
Grasshopper.Kernel Namespace