Grasshopper SDK
GH_PageSettings.DrawPage Property
 Gets or sets whether the page ought to be drawn.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DrawPage { get; set; }
Public Property DrawPage As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_PageSettings.DrawPage"]
See Also
Reference
GH_PageSettings Class
Grasshopper.GUI.Theme Namespace