Grasshopper SDK
GH_Canvas.IsActiveObject Property
 Gets a value indicating whether or not an object is currently activated.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsActiveObject { get; }
Public ReadOnly Property IsActiveObject As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.IsActiveObject"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace