Grasshopper SDK
GH_DigitNumber Constructor (GH_DigitNumber)
 Create an exact duplicate of another GH_DigitNumber instance.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DigitNumber(
	GH_DigitNumber other
)
Public Sub New (
	other As GH_DigitNumber
)
Parameters
other
Type: Grasshopper.GUI.Base.GH_DigitNumber
Number to copy.
See Also
Reference
GH_DigitNumber Class
GH_DigitNumber Overload
Grasshopper.GUI.Base Namespace