Grasshopper SDK
GH_Format.FormatMatrix Method (Matrix)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatMatrix(
	Matrix data
)
Public Shared Function FormatMatrix (
	data As Matrix
) As String
Parameters
data
Type: Matrix
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatMatrix Overload
Grasshopper.Kernel Namespace