Grasshopper SDK
GH_ComponentServer.Libraries Property
 Returns a list of Assembly Info objects describing all loaded assemblies.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public ReadOnlyCollection<GH_AssemblyInfo> Libraries { get; }
Public ReadOnly Property Libraries As ReadOnlyCollection(Of GH_AssemblyInfo)
	Get
Property Value
Type: ReadOnlyCollection<GH_AssemblyInfo>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.Libraries"]
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace