Grasshopper SDK
IGH_DataAccess.GetDataList<T> Method (Int32, List<T>)
 Retrieve an entire list of data from an input parameter during GH_Component.SolveInstance().
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool GetDataList<T>(
	int index,
	List<T> list
)
Function GetDataList(Of T) (
	index As Integer,
	list As List(Of T)
) As Boolean
Parameters
index
Type: System.Int32
list
Type: System.Collections.Generic.List<T>
Type Parameters
T
Type of the data to retrieve. If the data type does not match the parameter type, a conversion will be attempted.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
IGH_DataAccess Interface
GetDataList Overload
Grasshopper.Kernel Namespace