Grasshopper SDK
GH_Viewport Constructor (Point, Single)
Initializes a new instance of the GH_Viewport class
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Viewport(
	Point target,
	float zoom
)
Public Sub New (
	target As Point,
	zoom As Single
)
Parameters
target
Type: System.Drawing.Point
zoom
Type: System.Single
See Also
Reference
GH_Viewport Class
GH_Viewport Overload
Grasshopper.GUI.Canvas Namespace