Grasshopper SDK
GH_GraphicsUtil.BlendColour Method (Color, Color)
 Overlays two colours. The Alpha component of the top colour controls the blend.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color BlendColour(
	Color bottom,
	Color top
)
Public Shared Function BlendColour (
	bottom As Color,
	top As Color
) As Color
Parameters
bottom
Type: System.Drawing.Color
Base colour.
top
Type: System.Drawing.Color
Overlay colour.
Return Value
Type: Color
The blended colour. Alpha channels are added together.
See Also
Reference
GH_GraphicsUtil Class
BlendColour Overload
Grasshopper.GUI Namespace