Grasshopper SDK
GH_Path.PathLengthComparer Class
 Use this comparer to sort lists of paths using a topological approach. Shorter paths are favoured over longer paths. Equal length paths use the default comparer.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_Path.PathLengthComparer
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class PathLengthComparer : IComparer<GH_Path>
Public Class PathLengthComparer
	Implements IComparer(Of GH_Path)
The GH_Path.PathLengthComparer type exposes the following members.
Constructors
Name | Description
GH_Path.PathLengthComparer
Initializes a new instance of the GH_Path.PathLengthComparer class
Top
Methods
Name | Description
Compare
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace