Grasshopper SDK
GH_GraphicsUtil.RenderObjectOverlay Method (Graphics, IGH_ObjectProxy, RectangleF)
 Render all overlay icons for a specific object. Overlays aren't drawn when the zoom is less than 80%
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderObjectOverlay(
	Graphics graphics,
	IGH_ObjectProxy obj,
	RectangleF target
)
Public Shared Sub RenderObjectOverlay (
	graphics As Graphics,
	obj As IGH_ObjectProxy,
	target As RectangleF
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
obj
Type: Grasshopper.Kernel.IGH_ObjectProxy
Proxy to draw overlay for.
target
Type: System.Drawing.RectangleF
Destination area for overlay icons.
See Also
Reference
GH_GraphicsUtil Class
RenderObjectOverlay Overload
Grasshopper.GUI Namespace