Grasshopper SDK
GH_Author.EMailReadonly Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string EMailReadonly { get; }
Public ReadOnly Property EMailReadonly As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Author.EMailReadonly"]
Implements
IGH_Author.Email
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace