Grasshopper SDK
GH_Paragraph Class
Inheritance Hierarchy
System.Object
 Grasshopper.Documentation.GH_Paragraph
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Paragraph : IGH_Content
Public Class GH_Paragraph
	Implements IGH_Content
The GH_Paragraph type exposes the following members.
Properties
Name | Description
Content
Top
Methods
Name | Description
Create(String)
Create(String[])
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
Grasshopper.Documentation Namespace