Grasshopper SDK
GH_Format.FormatSurfaceValidity Method
 If the surface is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatSurfaceValidity(
	Surface val,
	string identifier = "Surface"
)
Public Shared Function FormatSurfaceValidity (
	val As Surface,
	Optional identifier As String = "Surface"
) As String
Parameters
val
Type: Surface
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the surface is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace