Grasshopper SDK
GH_Audience Enumeration
 Enumerates the pre-defined target audiences used in the Grasshopper documentation.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_Audience
Public Enumeration GH_Audience
Members
Member name | Value | Description
Beginner | 0
Intermediate | 1
Expert | 2
See Also
Reference
Grasshopper.Documentation Namespace