Grasshopper SDK
GH_Attributes<T>.DocObject Property
 Gets the owner object of these attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_DocumentObject DocObject { get; }
Public ReadOnly Property DocObject As IGH_DocumentObject
	Get
Property Value
Type: IGH_DocumentObject
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.DocObject"]
Implements
IGH_Attributes.DocObject
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace