Grasshopper SDK
GH_SyntaxException Class
Inheritance Hierarchy
System.Object
 System.Exception
 Grasshopper.Kernel.Expressions.GH_SyntaxException
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_SyntaxException : Exception
Public Class GH_SyntaxException
	Inherits Exception
The GH_SyntaxException type exposes the following members.
Constructors
Name | Description
GH_SyntaxException
Initializes a new instance of the GH_SyntaxException class
Top
See Also
Reference
Grasshopper.Kernel.Expressions Namespace