Grasshopper SDK
GH_PreviewMode Enumeration
 Lists all possible Grasshopper preview modes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_PreviewMode
Public Enumeration GH_PreviewMode
Members
Member name | Value | Description
Disabled | 0 |  Preview is not drawn in the Rhino viewports.
Wireframe | 1 |  Only wireframe preview is drawn in the Rhino Viewports.
Shaded | 2 |  Wireframe and shaded previews are drawn in the Rhino Viewports.
See Also
Reference
Grasshopper.Kernel Namespace