Grasshopper SDK
GH_Archive Constructor
Initializes a new instance of the GH_Archive class
Namespace: GH_IO.Serialization
Assembly: GH_IO (in GH_IO.dll) Version: Rhino 6.0
Syntax
public GH_Archive()
Public Sub New
See Also
Reference
GH_Archive Class
GH_IO.Serialization Namespace