Grasshopper SDK
GH_ValueProxy<T>.Duplicate Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_ValueProxy Duplicate()
Public Function Duplicate As IGH_ValueProxy
Return Value
Type: IGH_ValueProxy
Implements
IGH_ValueProxy.Duplicate()
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace