Grasshopper SDK
GH_Document.SetPreviewFlags Method (Boolean)
 Set the preview flags of all selected objects to true or false
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetPreviewFlags(
	bool bPreview
)
Public Sub SetPreviewFlags (
	bPreview As Boolean
)
Parameters
bPreview
Type: System.Boolean
See Also
Reference
GH_Document Class
SetPreviewFlags Overload
Grasshopper.Kernel Namespace