Grasshopper SDK
GH_Param<T> Constructor (IGH_InstanceDescription)
Initializes a new instance of the GH_Param<T> class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_Param(
	IGH_InstanceDescription tag
)
Protected Sub New (
	tag As IGH_InstanceDescription
)
Parameters
tag
Type: Grasshopper.Kernel.IGH_InstanceDescription
See Also
Reference
GH_Param<T> Class
GH_Param<T> Overload
Grasshopper.Kernel Namespace