Grasshopper SDK
GH_GDI_Util.BoxUnion Method
 Create the outline of a set of boxes.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<Point[]> BoxUnion(
	IEnumerable<Rectangle> rectangles
)
Public Shared Function BoxUnion (
	rectangles As IEnumerable(Of Rectangle)
) As List(Of Point())
Parameters
rectangles
Type: System.Collections.Generic.IEnumerable<Rectangle>
Boxes to union.
Return Value
Type: List<Point[]>
A list of Point arrays, where each array describes the corners of each silhouette.
See Also
Reference
GH_GDI_Util Class
Grasshopper.GUI Namespace