Grasshopper SDK
GH_SolutionPhase Enumeration
 The Phase flags are used to track object states during solutions.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_SolutionPhase
Public Enumeration GH_SolutionPhase
Members
Member name | Value | Description
Blank | 0 |  There is no data available in this object. This object will be solved next time a solution begins.
Collecting | 1 |  This object is currently in the process of collecting data
Collected | 2 |  This object has finished collecting all data and is ready for computation.
Computing | 3 |  This object is currently in the process of computing new data
Computed | 4 |  This object has successfully completed data computation and it will be skipped in the next solution unless it expires in the meantime. This is the final step in a successful solution cycle.
Failed | 10 |  This object has failed to successfully complete the data computation stage. A new attempt at solving it will be made when the next solution starts. This is the final step in an unsuccessful solution cycle.
See Also
Reference
Grasshopper.Kernel Namespace