Grasshopper SDK
GH_Capsule.Radius Property
 Gets the radius of the rounded corners of this Capsule.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int this[
	int index
] { get; }
Public ReadOnly Property Radius (
	index As Integer
) As Integer
	Get
Parameters
index
Type: System.Int32
Corner index.
0 = upper left
1 = upper right
2 = lower right
3 = lower left
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.Radius(System.Int32)"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace