Grasshopper SDK
GH_UndoServer.RemoveRecord Method
 Remove the record with the specified ID from the undo or redo stack.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RemoveRecord(
	Guid id
)
Public Function RemoveRecord (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
ID of record to remove.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace