Grasshopper SDK
GH_Convert.ToVector3d_Secondary Method
 Attempts to convert other data types into a Vector. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToVector3d_Secondary(
	Object data,
	ref Vector3d rc
)
Public Shared Function ToVector3d_Secondary (
	data As Object,
	ByRef rc As Vector3d
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Vector3d
[out] Vector cast.
Return Value
Type: Boolean
True on success, false o failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace