Grasshopper SDK
GH_PersistentParam<T>.Prompt_Singular Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected abstract GH_GetterResult Prompt_Singular(
	ref T value
)
Protected MustOverride Function Prompt_Singular (
	ByRef value As T
) As GH_GetterResult
Parameters
value
Type: T
Return Value
Type: GH_GetterResult
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace