Grasshopper SDK
GH_DigitScroller.AllowTextInput Property
 Gets or sets whether the control accepts text input override.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AllowTextInput { get; set; }
Public Property AllowTextInput As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DigitScroller.AllowTextInput"]
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace