Grasshopper SDK
GH_ExpressionParser.AddVariableEx Method (String, GH_Variant)
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddVariableEx(
	string name,
	GH_Variant val
)
Public Sub AddVariableEx (
	name As String,
	val As GH_Variant
)
Parameters
name
Type: System.String
val
Type: Grasshopper.Kernel.Expressions.GH_Variant
See Also
Reference
GH_ExpressionParser Class
AddVariableEx Overload
Grasshopper.Kernel.Expressions Namespace