Grasshopper SDK
GH_Component.AppendRenderGeometry Method
 Append all geometry associated with this component to a render queue.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void AppendRenderGeometry(
	GH_RenderArgs args
)
Public Overridable Sub AppendRenderGeometry (
	args As GH_RenderArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_RenderArgs
Implements
IGH_RenderAwareObject.AppendRenderGeometry(GH_RenderArgs)
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace