Grasshopper SDK
IGH_VariableParameterComponent.CanRemoveParameter Method
 This function will get called before an attempt is made to remove a parameter. Since this method is potentially called on Canvas redraws, it must be fast.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool CanRemoveParameter(
	GH_ParameterSide side,
	int index
)
Function CanRemoveParameter (
	side As GH_ParameterSide,
	index As Integer
) As Boolean
Parameters
side
Type: Grasshopper.Kernel.GH_ParameterSide
Parameter side.
index
Type: System.Int32
Removal index of parameter.
Return Value
Type: Boolean
Return True if your component supports removing a parameter at the given location.
See Also
Reference
IGH_VariableParameterComponent Interface
Grasshopper.Kernel Namespace