Grasshopper SDK
GH_Line.GH_LineProxy Class
 Proxy description of GH_Line class. This class is used by the Generic Multivalue interfaces.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Line>
 Grasshopper.Kernel.Types.GH_Line.GH_LineProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_LineProxy : GH_GooProxy<GH_Line>
Public Class GH_LineProxy
	Inherits GH_GooProxy(Of GH_Line)
The GH_Line.GH_LineProxy type exposes the following members.
Constructors
Name | Description
GH_Line.GH_LineProxy
Initializes a new instance of the GH_Line.GH_LineProxy class
Top
Properties
Name | Description
Ax
Ay
Az
Bx
By
Bz
Length
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace