Grasshopper SDK
GH_Animator.RectangleAnimator Method (Rectangle, Rectangle, DateTime, DateTime)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<Rectangle> RectangleAnimator(
	Rectangle A,
	Rectangle B,
	DateTime time0,
	DateTime time1
)
Public Shared Function RectangleAnimator (
	A As Rectangle,
	B As Rectangle,
	time0 As DateTime,
	time1 As DateTime
) As GH_Animator(Of Rectangle)
Parameters
A
Type: System.Drawing.Rectangle
B
Type: System.Drawing.Rectangle
time0
Type: System.DateTime
time1
Type: System.DateTime
Return Value
Type: GH_Animator<Rectangle>
See Also
Reference
GH_Animator Class
RectangleAnimator Overload
Grasshopper.GUI Namespace