Grasshopper SDK
GH_GraphicsUtil.ShadowHorizontal Method (Graphics, Int32, Int32, Int32, Int32, Boolean, Color)
 Draws a horizontal shadow edge.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void ShadowHorizontal(
	Graphics g,
	int x0,
	int x1,
	int y,
	int size,
	bool below,
	Color color
)
Public Shared Sub ShadowHorizontal (
	g As Graphics,
	x0 As Integer,
	x1 As Integer,
	y As Integer,
	size As Integer,
	below As Boolean,
	color As Color
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
x0
Type: System.Int32
Start of shadow edge.
x1
Type: System.Int32
End of shadow edge.
y
Type: System.Int32
Elevation of shadow edge.
size
Type: System.Int32
Length of cast shadow.
below
Type: System.Boolean
If true, shadow is drawn below elevation line.
color
Type: System.Drawing.Color
Colour at shadow edge.
See Also
Reference
GH_GraphicsUtil Class
ShadowHorizontal Overload
Grasshopper.GUI Namespace