Grasshopper SDK
GH_Structure<T>.ShortestPathIndex Method
 Finds the path in this structure with the least dimensions. In case of multiple equally long longest paths, the first one will be returned.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ShortestPathIndex()
Public Function ShortestPathIndex As Integer
Return Value
Type: Int32
The index of the shortest path or -1 if there are no paths.
Implements
IGH_Structure.ShortestPathIndex()
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace