Grasshopper SDK
GH_Variant._Complex Property
 Gets the contents of this Variant as a complex number.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Complex _Complex { get; }
Public ReadOnly Property _Complex As Complex
	Get
Property Value
Type: Complex
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_Variant._Complex"]
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace