Grasshopper SDK
GH_GlossaryItem.Contact Property
 Gets the contact information for the glossary entry author. This field is optional and may not be defined.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Content Contact { get; }
Public ReadOnly Property Contact As IGH_Content
	Get
Property Value
Type: IGH_Content
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_GlossaryItem.Contact"]
See Also
Reference
GH_GlossaryItem Class
Grasshopper.Documentation Namespace