Grasshopper SDK
GH_DocDiagramPainter.MapY Method (Single)
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float MapY(
	float y
)
Public Function MapY (
	y As Single
) As Single
Parameters
y
Type: System.Single
Return Value
Type: Single
See Also
Reference
GH_DocDiagramPainter Class
MapY Overload
Grasshopper.GUI.Canvas Namespace