Grasshopper SDK
GH_DocumentObject.Menu_AppendObjectName Method
 Appends the old-fashioned object name menu item. If you also want the Display mode toggle then use Menu_AppendObjectNameEx()
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void Menu_AppendObjectName(
	ToolStripDropDown menu
)
Protected Sub Menu_AppendObjectName (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace