Grasshopper SDK
GH_ColourCube.RenderEdgeShadows Method
 Render the edge shadows of the cube due to GI.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderEdgeShadows(
	Graphics G
)
Public Sub RenderEdgeShadows (
	G As Graphics
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace