Grasshopper SDK
GH_DataMatchingAction.Object_Undo Method
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override void Object_Undo(
	GH_Document doc,
	IGH_DocumentObject obj
)
Protected Overrides Sub Object_Undo (
	doc As GH_Document,
	obj As IGH_DocumentObject
)
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
See Also
Reference
GH_DataMatchingAction Class
Grasshopper.Kernel.Undo.Actions Namespace