Grasshopper SDK
IGH_DataAccess.BlitData<Q> Method
 Creates a direct copy of an existing data structure. The existing generic instance must of the exact same type as the target parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool BlitData<Q>(
	int paramIndex,
	GH_Structure<Q> tree,
	bool overwrite
)
where Q : IGH_Goo
Function BlitData(Of Q As IGH_Goo) (
	paramIndex As Integer,
	tree As GH_Structure(Of Q),
	overwrite As Boolean
) As Boolean
Parameters
paramIndex
Type: System.Int32
Index of output parameter.
tree
Type: Grasshopper.Kernel.Data.GH_Structure<Q>
Parameter whose data to blit
overwrite
Type: System.Boolean
If true, any existing data will be removed.
Type Parameters
Q
Type specified for GH_Structure(Of Q) comparison.
Return Value
Type: Boolean
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace