Grasshopper SDK
GH_Skin.canvas_shade Field
 Specifies the colour of the canvas drop shadow.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color canvas_shade
Public Shared canvas_shade As Color
Field Value
Type: Color
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace