Grasshopper SDK
Node3d<T>.IndicesLocal Property
 Gets the list of item indices that are contained within this node.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<int> IndicesLocal { get; }
Public ReadOnly Property IndicesLocal As List(Of Integer)
	Get
Property Value
Type: List<Int32>
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.IndicesLocal"]
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace