Grasshopper SDK
GH_PageSettings.ShadowColour Property
 Gets or set the page shadow colour to be used.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color ShadowColour { get; set; }
Public Property ShadowColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_PageSettings.ShadowColour"]
See Also
Reference
GH_PageSettings Class
Grasshopper.GUI.Theme Namespace