Grasshopper SDK
GH_FileSystemEventServer Class
 Provides a easy-to-use way to keep tabs on files.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_FileSystemEventServer
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_FileSystemEventServer
Public NotInheritable Class GH_FileSystemEventServer
The GH_FileSystemEventServer type exposes the following members.
Properties
Name | Description
AllPaths
 Gets a list of all the paths currently under surveillance.
Top
Methods
Name | Description
AddWatcher
 Add a new file watcher instance.
RemoveWatcher(Object)
 Remove all watchers that are linked to a specific object.
RemoveWatcher(Object, String)
 Remove all watchers that are linked to a specific object and a specific file path.
Top
See Also
Reference
Grasshopper.Kernel Namespace