Grasshopper SDK
GH_Vector Constructor (Vector3d)
 Create a vector from x, y and z components.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Vector(
	Vector3d vector
)
Public Sub New (
	vector As Vector3d
)
Parameters
vector
Type: Vector3d
Vector to wrap.
See Also
Reference
GH_Vector Class
GH_Vector Overload
Grasshopper.Kernel.Types Namespace