Grasshopper SDK
GH_TextBoxInputBase.Bounds Property
 Gets or sets the Bounds of this control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual Rectangle Bounds { get; set; }
Public Overridable Property Bounds As Rectangle
	Get
	Set
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_TextBoxInputBase.Bounds"]
See Also
Reference
GH_TextBoxInputBase Class
Grasshopper.GUI.Base Namespace