Grasshopper SDK
GH_AsynchFileData.FileThumbnail Property
 Gets the thumbnail bitmap associated with the file.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap FileThumbnail { get; }
Public ReadOnly Property FileThumbnail As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.GH_AsynchFileData.FileThumbnail"]
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace