Grasshopper SDK
GH_CanvasDropTargetValidator.CanDragObject Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CanDragObject(
	IGH_DocumentObject object,
	PointF dragFromPoint
)
Public Overrides Function CanDragObject (
	object As IGH_DocumentObject,
	dragFromPoint As PointF
) As Boolean
Parameters
object
Type: Grasshopper.Kernel.IGH_DocumentObject
dragFromPoint
Type: System.Drawing.PointF
Return Value
Type: Boolean
See Also
Reference
GH_CanvasDropTargetValidator Class
Grasshopper.GUI.Canvas Namespace