Grasshopper SDK
GH_Surface.AppendRenderGeometry Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AppendRenderGeometry(
	GH_RenderArgs args,
	RenderMaterial materialHint
)
Public Sub AppendRenderGeometry (
	args As GH_RenderArgs,
	materialHint As RenderMaterial
)
Parameters
args
Type: Grasshopper.Kernel.GH_RenderArgs
materialHint
Type: RenderMaterial
Implements
IGH_RenderAwareData.AppendRenderGeometry(GH_RenderArgs, RenderMaterial)
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace