Grasshopper SDK
GH_Goo<T> Constructor (GH_Goo<T>)
 Copy constructor, copies the data from another GH_Goo(Of T) instance. Reference types will not be duplicated.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_Goo(
	GH_Goo<T> other
)
Protected Sub New (
	other As GH_Goo(Of T)
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Goo<T>
Goo instance to copy.
See Also
Reference
GH_Goo<T> Class
GH_Goo<T> Overload
Grasshopper.Kernel.Types Namespace