Grasshopper SDK
GH_Rectangle Class
 Represents a 3D rectangle. GH_Rectangle re-implements the RhinoCommon Rectangle3d.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Rectangle3d>
 Grasshopper.Kernel.Types.GH_GeometricGoo<Rectangle3d>
 Grasshopper.Kernel.Types.GH_Rectangle
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Rectangle : GH_GeometricGoo<Rectangle3d>,
	IGH_BakeAwareData, IGH_PreviewData
Public Class GH_Rectangle
	Inherits GH_GeometricGoo(Of Rectangle3d)
	Implements IGH_BakeAwareData, IGH_PreviewData
The GH_Rectangle type exposes the following members.
Constructors
Name | Description
GH_Rectangle()
 Default constructor
GH_Rectangle(Rectangle3d)
 Create a duplicate of another rectangle.
GH_Rectangle(GH_Rectangle)
 Create a duplicate of another circle.
Top
Properties
Name | Description
Boundingbox
 Gets the boundingbox for this geometry.
 (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsValid
 Gets the validity of this instance.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateGeometry
 Create a duplicate of this rectangle.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
DuplicateRectangle
 Create a duplicate of this rectangle.
EmitProxy
 Returns a proxy that represents this rectangle. Do not call this function unless you're
 (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString
 Format the circle using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace