Grasshopper SDK
GH_Capsule.Render Method (Graphics, Color)
 Have this capsule draw itself onto a Graphics surface with a custom colour override.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Render(
	Graphics G,
	Color colour
)
Public Sub Render (
	G As Graphics,
	colour As Color
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with. Zoom factor is implied by the G.Transform property.
colour
Type: System.Drawing.Color
Base colour for the capsule. Other colours will be derived from the base colour. If you want full control over every colour involved, then use the overload that allows you to supply a custom Style instead.
See Also
Reference
GH_Capsule Class
Render Overload
Grasshopper.GUI.Canvas Namespace