Grasshopper SDK
GH_Component.GH_InputParamManager Class
 This class is used during Component construction to add input parameters.
Inheritance Hierarchy
System.Object
 GH_ParamManager
 Grasshopper.Kernel.GH_Component.GH_InputParamManager
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected class GH_InputParamManager : GH_ParamManager
Protected Class GH_InputParamManager
	Inherits GH_ParamManager
The GH_Component.GH_InputParamManager type exposes the following members.
Properties
Name | Description
Param
 Gets the input parameter at the given index.
 (Overrides GH_ParamManager.Param.)
ParamCount
 Returns the number of input parameters already part of this component.
 (Overrides GH_ParamManager.ParamCount.)
Top
Methods
Name | Description
AddAngleParameter(String, String, String, GH_ParamAccess)
 Add a floating point Number parameter to the input list of this component. The parameter will be aware that it is representing angles.
AddAngleParameter(String, String, String, GH_ParamAccess, IEnumerable<Double>)
 Add a floating point Number parameter to the input list of this component. The parameter will be aware that it is representing angles.
AddAngleParameter(String, String, String, GH_ParamAccess, Double)
 Add a floating point Number parameter to the input list of this component. The parameter will be aware that it is representing angles.
AddArcParameter(String, String, String, GH_ParamAccess)
 Add a 3D Arc parameter to the input list of this component.
AddArcParameter(String, String, String, GH_ParamAccess, Arc)
 Add a 3D Arc parameter to the input list of this component.
AddBooleanParameter(String, String, String, GH_ParamAccess)
 Add a Boolean parameter to the input list of this component.
AddBooleanParameter(String, String, String, GH_ParamAccess, Boolean)
 Add a Boolean parameter to the input list of this component.
AddBooleanParameter(String, String, String, GH_ParamAccess, IEnumerable<Boolean>)
 Add a Boolean parameter to the input list of this component.
AddBoxParameter(String, String, String, GH_ParamAccess)
 Add a 3D Box parameter to the input list of this component.
AddBoxParameter(String, String, String, GH_ParamAccess, Box)
 Add a 3D Box parameter to the input list of this component.
AddBrepParameter
 Add a 3D Brep parameter to the input list of this component. Brep parameters can handle both trimmed and untrimmed single or multi-faced Breps.
AddCircleParameter(String, String, String, GH_ParamAccess)
 Add a 3D Circle parameter to the input list of this component.
AddCircleParameter(String, String, String, GH_ParamAccess, Circle)
 Add a 3D Circle parameter to the input list of this component.
AddColourParameter(String, String, String, GH_ParamAccess)
 Add an ARGB Colour parameter to the input list of this component.
AddColourParameter(String, String, String, GH_ParamAccess, IEnumerable<Color>)
 Add an ARGB Colour parameter to the input list of this component.
AddColourParameter(String, String, String, GH_ParamAccess, Color)
 Add an ARGB Colour parameter to the input list of this component.
AddComplexNumberParameter(String, String, String, GH_ParamAccess)
 Add a Complex Number parameter to the input list of this component.
AddComplexNumberParameter(String, String, String, GH_ParamAccess, GH_ComplexNumber)
 Add a Complex Number parameter to the input list of this component.
AddCultureParameter(String, String, String, GH_ParamAccess)
 Add a Cultue parameter to the input list of this component.
AddCultureParameter(String, String, String, GH_ParamAccess, CultureInfo)
 Add a Culture parameter to the input list of this component.
AddCurveParameter
 Add a 3D Curve parameter to the input list of this component. Curve parameters can handle all curve types (Lines, Polylines, Circles, Arcs, NurbsCurves etc.)
AddFieldParameter
 Add a Field parameter to the input list of this component.
AddGenericParameter
 Add a Generic parameter to the input list of this component. Generic parameters can handle all types of data.
AddGeometryParameter
 Add a generic 3D Geometry parameter to the input list of this component. Geometry parameters can handle all types that represent actual shapes.
AddGroupParameter
 Add a Transform Group parameter to the input list of this component. Groups are collections of geometry that are transformed as one, they are not the same as Rhino groups.
AddIntegerParameter(String, String, String, GH_ParamAccess)
 Add a Integer parameter to the input list of this component.
AddIntegerParameter(String, String, String, GH_ParamAccess, IEnumerable<Int32>)
 Add a Integer parameter to the input list of this component.
AddIntegerParameter(String, String, String, GH_ParamAccess, Int32)
 Add a Integer parameter to the input list of this component.
AddInterval2DParameter
 Add an Interval2D (i.e. uv domain) parameter to the input list of this component.
AddIntervalParameter(String, String, String, GH_ParamAccess)
 Add an Interval (i.e. numeric domain) parameter to the input list of this component.
AddIntervalParameter(String, String, String, GH_ParamAccess, Interval)
 Add an Interval (i.e. numeric domain) parameter to the input list of this component.
AddIntervalParameter(String, String, String, GH_ParamAccess, IEnumerable<Interval>)
 Add an Interval (i.e. numeric domain) parameter to the input list of this component.
AddLineParameter(String, String, String, GH_ParamAccess)
 Add a 3D Line parameter to the input list of this component.
AddLineParameter(String, String, String, GH_ParamAccess, Line)
 Add a 3D Line parameter to the input list of this component.
AddMatrixParameter
 Add a Matrix parameter to the input list of this component.
AddMeshFaceParameter
 Add a topological MeshFace parameter to the input list of this component.
AddMeshParameter
 Add a 3D Mesh parameter to the input list of this component.
AddNumberParameter(String, String, String, GH_ParamAccess)
 Add a floating point Number parameter to the input list of this component.
AddNumberParameter(String, String, String, GH_ParamAccess, IEnumerable<Double>)
 Add a floating point Number parameter to the input list of this component.
AddNumberParameter(String, String, String, GH_ParamAccess, Double)
 Add a floating point Number parameter to the input list of this component.
AddParameter(IGH_Param)
 Generic parameter addition. If you cannot use one of the utility methods provided by this class, you can register a customized parameter using this method.
AddParameter(IGH_Param, String, String, String, GH_ParamAccess)
 Generic parameter addition. If you cannot use one of the utility methods provided by this class, you can register a customized parameter using this method.
AddPathParameter
 Add a Data Path parameter to the input list of this component.
AddPlaneParameter(String, String, String, GH_ParamAccess)
 Add a 3D Plane parameter to the input list of this component.
AddPlaneParameter(String, String, String, GH_ParamAccess, Plane)
 Add a 3D Plane parameter to the input list of this component.
AddPointParameter(String, String, String, GH_ParamAccess)
 Add a 3D Point parameter to the input list of this component.
AddPointParameter(String, String, String, GH_ParamAccess, Point3d)
 Register a new 3D point param with a single default coordinate.
AddPointParameter(String, String, String, GH_ParamAccess, IEnumerable<Point3d>)
 Register a new 3D point param with multiple default coordinates.
AddRectangleParameter(String, String, String, GH_ParamAccess)
 Add a 3D Rectangle parameter to the input list of this component.
AddRectangleParameter(String, String, String, GH_ParamAccess, Rectangle3d)
 Add a 3D Rectangle parameter to the input list of this component.
AddScriptVariableParameter
 Add a Script Variable parameter to the input list of this component. Script variable parameters are used almost exclusively in VB/C#/Python components so you probably don't want this one.
AddSurfaceParameter
 Add a 3D Surface parameter to the input list of this component. Surface parameters can handle both trimmed and untrimmed single-faced Breps.
AddTextParameter(String, String, String, GH_ParamAccess)
 Add a Text parameter to the input list of this component.
AddTextParameter(String, String, String, GH_ParamAccess, IEnumerable<String>)
 Add a Text parameter to the input list of this component.
AddTextParameter(String, String, String, GH_ParamAccess, String)
 Add a Text parameter to the input list of this component.
AddTimeParameter(String, String, String, GH_ParamAccess)
 Add a Time parameter to the input list of this component.
AddTimeParameter(String, String, String, GH_ParamAccess, DateTime)
 Add a Time parameter to the input list of this component.
AddTransformParameter
 Add a Transformation parameter to the input list of this component.
AddVectorParameter(String, String, String, GH_ParamAccess)
 Add a 3D Vector parameter to the input list of this component.
AddVectorParameter(String, String, String, GH_ParamAccess, Vector3d)
 Add a 3D Vector parameter to the input list of this component.
HideParameter
 Hide a specific input parameter. If the parameter at the given index implements IGH_PreviewObject then the Hidden flag will be set to True. Otherwise, nothing will happen.
 (Overrides GH_ParamManager.HideParameter(Int32).)
Top
See Also
Reference
Grasshopper.Kernel Namespace