Grasshopper SDK
GH_CanvasObjectMouseDownEventArgs.Document Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document Document { get; }
Public ReadOnly Property Document As GH_Document
	Get
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasObjectMouseDownEventArgs.Document"]
See Also
Reference
GH_CanvasObjectMouseDownEventArgs Class
Grasshopper.GUI Namespace