Grasshopper SDK
GH_Lexer Constructor
 Blank constructor.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Lexer()
Public Sub New
See Also
Reference
GH_Lexer Class
GH_Lexer Overload
Grasshopper.Kernel.Data Namespace