Grasshopper SDK
GH_Param<T>.DataType Property
 Type is either Void if there are no sources or Remote. Derived classes should expand on this.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual GH_ParamData DataType { get; }
Public Overridable ReadOnly Property DataType As GH_ParamData
	Get
Property Value
Type: GH_ParamData
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.DataType"]
Implements
IGH_Param.DataType
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace