Grasshopper SDK
GH_ColourPickerBase.DrawChannelSliders Property
 Gets or sets whether or not the three basic channel sliders are included in the UI.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DrawChannelSliders { get; set; }
Public Property DrawChannelSliders As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.DrawChannelSliders"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace