Grasshopper SDK
GH_LineParser.ParseLine Method
 Parse a line of text and convert it to custom data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract Object ParseLine(
	string line,
	ref GH_LineParserAction action
)
Public MustOverride Function ParseLine (
	line As String,
	ByRef action As GH_LineParserAction
) As Object
Parameters
line
Type: System.String
Line to parse.
action
Type: Grasshopper.Kernel.GH_LineParserAction
Set the action to take after this function returns. The default is Include.
Return Value
Type: Object
The data represented by the line.
See Also
Reference
GH_LineParser Class
Grasshopper.Kernel Namespace