Grasshopper SDK
GH_GeometricGoo<T>.ClearCaches Method
 Clears all caches. Typically if the geometry is referenced, this will erase the local copy. If your T is a value-type, you must override this function and specifically unset the local value.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void ClearCaches()
Public Overridable Sub ClearCaches
Implements
IGH_GeometricGoo.ClearCaches()
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace