Grasshopper SDK
GH_AssemblyInfoStub Constructor
Initializes a new instance of the GH_AssemblyInfoStub class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_AssemblyInfoStub(
	Assembly assembly
)
Public Sub New (
	assembly As Assembly
)
Parameters
assembly
Type: System.Reflection.Assembly
See Also
Reference
GH_AssemblyInfoStub Class
Grasshopper.Kernel Namespace