Grasshopper SDK
GH_Transform.CompoundTransforms Property
 Gets the internal set of transforms. If you modify the compound transformations, you must call ClearCaches().
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<ITransform> CompoundTransforms { get; }
Public ReadOnly Property CompoundTransforms As List(Of ITransform)
	Get
Property Value
Type: List<ITransform>
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Transform.CompoundTransforms"]
See Also
Reference
GH_Transform Class
Grasshopper.Kernel.Types Namespace