Grasshopper SDK
GH_Document.FindClusters Method (Guid)
 Find all the clusters that have a matching ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<GH_Cluster> FindClusters(
	Guid id
)
Public Function FindClusters (
	id As Guid
) As List(Of GH_Cluster)
Parameters
id
Type: System.Guid
Cluster DocumentID to search for.
Return Value
Type: List<GH_Cluster>
A list of all the clusters that match the ID.
See Also
Reference
GH_Document Class
FindClusters Overload
Grasshopper.Kernel Namespace