Grasshopper SDK
GH_Painter.GenerateWirePen_Fill Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Brush GenerateWirePen_Fill(
	PointF a,
	PointF b,
	bool asel,
	bool bsel,
	bool empty
)
Public Function GenerateWirePen_Fill (
	a As PointF,
	b As PointF,
	asel As Boolean,
	bsel As Boolean,
	empty As Boolean
) As Brush
Parameters
a
Type: System.Drawing.PointF
b
Type: System.Drawing.PointF
asel
Type: System.Boolean
bsel
Type: System.Boolean
empty
Type: System.Boolean
Return Value
Type: Brush
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace