Grasshopper SDK
GH_GraphicsUtil.RenderVerticalString Method
 Render vertical text (rotated 90 degrees counter-clockwise) within a rectangle.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderVerticalString(
	Graphics g,
	string text,
	Font font,
	Color colour,
	RectangleF rec,
	StringFormat format
)
Public Shared Sub RenderVerticalString (
	g As Graphics,
	text As String,
	font As Font,
	colour As Color,
	rec As RectangleF,
	format As StringFormat
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
text
Type: System.String
Text to render.
font
Type: System.Drawing.Font
Font to render with.
colour
Type: System.Drawing.Color
Colour of text content.
rec
Type: System.Drawing.RectangleF
format
Type: System.Drawing.StringFormat
Formatting flags.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace