Grasshopper SDK
GH_DocumentRenderMeshProvider.WillBuildCustomMeshes Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool WillBuildCustomMeshes(
	ViewportInfo vp,
	RhinoObject obj,
	RhinoDoc doc,
	Guid requestingPlugIn,
	bool preview
)
Public Overrides Function WillBuildCustomMeshes (
	vp As ViewportInfo,
	obj As RhinoObject,
	doc As RhinoDoc,
	requestingPlugIn As Guid,
	preview As Boolean
) As Boolean
Parameters
vp
Type: ViewportInfo
obj
Type: RhinoObject
doc
Type: RhinoDoc
requestingPlugIn
Type: System.Guid
preview
Type: System.Boolean
Return Value
Type: Boolean
See Also
Reference
GH_DocumentRenderMeshProvider Class
Grasshopper.Kernel Namespace