Grasshopper SDK
GH_Viewport.Unproject Method
 Transform a point from control into canvas coordinate space.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Unproject(
	ref PointF pt
)
Public Sub Unproject (
	ByRef pt As PointF
)
Parameters
pt
Type: System.Drawing.PointF
Point to transform.
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace