Grasshopper SDK
GH_DigitScrollerBase.Epsilon Property
 Gets the smallest possible change in the value.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Epsilon { get; }
Public ReadOnly Property Epsilon As Decimal
	Get
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.Epsilon"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace