Grasshopper SDK
GH_Goo<T>.IsValidWhyNot Property
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string IsValidWhyNot { get; }
Public Overridable ReadOnly Property IsValidWhyNot As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Goo`1.IsValidWhyNot"]
Implements
IGH_Goo.IsValidWhyNot
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace