Grasshopper SDK
IGH_DocumentObject.Attributes Property
 Gets or sets the attributes that are associated with this object. Only set custom attributes if you know what you are doing.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_Attributes Attributes { get; set; }
Property Attributes As IGH_Attributes
	Get
	Set
Property Value
Type: IGH_Attributes
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_DocumentObject.Attributes"]
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace