Grasshopper SDK
GH_PersistentGeometryParam<T>.ExpireSolution Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void ExpireSolution(
	bool recompute
)
Public Overrides Sub ExpireSolution (
	recompute As Boolean
)
Parameters
recompute
Type: System.Boolean
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace