Grasshopper SDK
GH_Tooltip.IsTag Method
 Returns True if the test object matches the internal Tag object
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsTag(
	Object test
)
Public Shared Function IsTag (
	test As Object
) As Boolean
Parameters
test
Type: System.Object
Return Value
Type: Boolean
Remarks
See Also
Reference
GH_Tooltip Class
Grasshopper.GUI Namespace