Grasshopper SDK
GH_DocumentEditor.ScriptAccess_OpenDocument Method
 Displays a command line interface for File Open... then loads that file into the Canvas.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ScriptAccess_OpenDocument()
Public Function ScriptAccess_OpenDocument As Boolean
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentEditor Class
ScriptAccess_OpenDocument Overload
Grasshopper.GUI Namespace