Grasshopper SDK
GH_DigitScrollerBase.DrawShadows Property
 Gets or sets whether shadows are drawn in this control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DrawShadows { get; set; }
Public Property DrawShadows As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.DrawShadows"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace