Grasshopper SDK
GH_Line.GH_LineProxy Constructor
Initializes a new instance of the GH_Line.GH_LineProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LineProxy(
	GH_Line nOwner
)
Public Sub New (
	nOwner As GH_Line
)
Parameters
nOwner
Type: Grasshopper.Kernel.Types.GH_Line
See Also
Reference
GH_Line.GH_LineProxy Class
Grasshopper.Kernel.Types Namespace