Grasshopper SDK
GH_Attributes<T>.AppendToAttributeTree Method
 Recursively append these attributes and all child attributes to the attribute list.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void AppendToAttributeTree(
	List<IGH_Attributes> attributes
)
Public Overridable Sub AppendToAttributeTree (
	attributes As List(Of IGH_Attributes)
)
Parameters
attributes
Type: System.Collections.Generic.List<IGH_Attributes>
List to append to.
Implements
IGH_Attributes.AppendToAttributeTree(List<IGH_Attributes>)
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace