Grasshopper SDK
GH_RelevantObjectData.TopLevelObject Property
 Gets the top-level object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_DocumentObject TopLevelObject { get; }
Public ReadOnly Property TopLevelObject As IGH_DocumentObject
	Get
Property Value
Type: IGH_DocumentObject
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RelevantObjectData.TopLevelObject"]
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace