Grasshopper SDK
GH_Param<T>.ReplaceSource Method (IGH_Param, IGH_Param)
 Replace an existing source with a new one. If the old_source does not exist in this parameter, nothing happens.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void ReplaceSource(
	IGH_Param old_source,
	IGH_Param new_source
)
Public Overridable Sub ReplaceSource (
	old_source As IGH_Param,
	new_source As IGH_Param
)
Parameters
old_source
Type: Grasshopper.Kernel.IGH_Param
Source to replace.
new_source
Type: Grasshopper.Kernel.IGH_Param
Source to replace with.
Implements
IGH_Param.ReplaceSource(IGH_Param, IGH_Param)
See Also
Reference
GH_Param<T> Class
ReplaceSource Overload
Grasshopper.Kernel Namespace