Grasshopper SDK
IGH_Structure.Branch Property (GH_Path)
 Gets a limited access pointer to the data list associated with a certain path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IList this[
	GH_Path path
] { get; }
ReadOnly Property Branch (
	path As GH_Path
) As IList
	Get
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path of data to retrieve.
Property Value
Type: IList
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.IGH_Structure.Branch(Grasshopper.Kernel.Data.GH_Path)"]
See Also
Reference
IGH_Structure Interface
Branch Overload
Grasshopper.Kernel.Data Namespace