Grasshopper SDK
CentralSettings.CreateSolutionUndoRecord Property
 Gets or sets whether Grasshopper document solutions are wrapped in undo records.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool CreateSolutionUndoRecord { get; set; }
Public Shared Property CreateSolutionUndoRecord As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CreateSolutionUndoRecord"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace