Grasshopper SDK
GH_Painter.DrawMiddleGround Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DrawMiddleGround(
	GH_Document doc,
	GH_CanvasChannel channel
)
Public Sub DrawMiddleGround (
	doc As GH_Document,
	channel As GH_CanvasChannel
)
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
channel
Type: Grasshopper.GUI.Canvas.GH_CanvasChannel
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace