Grasshopper SDK
GH_SliderRailDisplay Enumeration
 Enumerates the possible slider rail displays.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_SliderRailDisplay
Public Enumeration GH_SliderRailDisplay
Members
Member name | Value | Description
None | 0 |  No rail is drawn.
Simple | 1 |  A rail consisting of a single line is drawn.
Etched | 2 |  A rail consisting of an etched line is drawn.
Filled | 3 |  A thick rail with a filled out left portion is drawn.
See Also
Reference
Grasshopper.GUI.Base Namespace