Grasshopper SDK
GH_GlossaryItem.Synonyms Property
 Gets the synonyms for this glossary entry.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public ReadOnlyCollection<string> Synonyms { get; }
Public ReadOnly Property Synonyms As ReadOnlyCollection(Of String)
	Get
Property Value
Type: ReadOnlyCollection<String>
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_GlossaryItem.Synonyms"]
See Also
Reference
GH_GlossaryItem Class
Grasshopper.Documentation Namespace