Grasshopper SDK
GH_GeometryGroup.Boundingbox Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public BoundingBox Boundingbox { get; }
Public ReadOnly Property Boundingbox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometryGroup.Boundingbox"]
Implements
IGH_GeometricGoo.Boundingbox
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace