Grasshopper SDK
GH_Point4D.w Field
 W coordinate of point.
Namespace: GH_IO.Types
Assembly: GH_IO (in GH_IO.dll) Version: Rhino 6.0
Syntax
public double w
Public w As Double
Field Value
Type: Double
See Also
Reference
GH_Point4D Structure
GH_IO.Types Namespace