Grasshopper SDK
GH_SpinForce.Plane Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_SpinForce.Plane"]
See Also
Reference
GH_SpinForce Class
Grasshopper.Kernel.Types Namespace