Grasshopper SDK
CentralSettings.SetLoadMechanism Method
 Sets the user defined load mechanism for a certain plugin.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void SetLoadMechanism(
	string pluginName,
	GH_LoadingDemand mechanism
)
Public Shared Sub SetLoadMechanism (
	pluginName As String,
	mechanism As GH_LoadingDemand
)
Parameters
pluginName
Type: System.String
The name of the plugin file (without the extension).
mechanism
Type: Grasshopper.Kernel.GH_LoadingDemand
Load mechanism for this plugin.
See Also
Reference
CentralSettings Class
Grasshopper Namespace