Grasshopper SDK
IGH_Structure.Simplify Method
 Simplify the data structure by removing path indices shared by all branches.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void Simplify(
	GH_SimplificationMode mode
)
Sub Simplify (
	mode As GH_SimplificationMode
)
Parameters
mode
Type: Grasshopper.Kernel.Data.GH_SimplificationMode
Simplification algorithm to use.
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace