Grasshopper SDK
GH_PageSettings.GridHeight Property
 Gets or sets the height of a page grid cell.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int GridHeight { get; set; }
Public Property GridHeight As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_PageSettings.GridHeight"]
See Also
Reference
GH_PageSettings Class
Grasshopper.GUI.Theme Namespace