Grasshopper SDK
GH_LineCharge.IsCoincident Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool IsCoincident(
	Point3d point,
	double tolerance
)
Public Overrides Function IsCoincident (
	point As Point3d,
	tolerance As Double
) As Boolean
Parameters
point
Type: Point3d
tolerance
Type: System.Double
Return Value
Type: Boolean
See Also
Reference
GH_LineCharge Class
Grasshopper.Kernel.Types Namespace