Grasshopper SDK
GH_IndexRuleSet.Count Property
 Gets the number of rules defined in this collection.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_IndexRuleSet.Count"]
See Also
Reference
GH_IndexRuleSet Class
Grasshopper.Kernel.Data Namespace