Grasshopper SDK
GH_Slider_Obsolete.ValueF Property
 Gets or sets the current value in single-floating-point precision.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float ValueF { get; set; }
Public Property ValueF As Single
	Get
	Set
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider_Obsolete.ValueF"]
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace