Grasshopper SDK
GH_SettingsServer.GetValue Method (String, Point)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point GetValue(
	string key,
	Point default
)
Public Function GetValue (
	key As String,
	default As Point
) As Point
Parameters
key
Type: System.String
default
Type: System.Drawing.Point
Return Value
Type: Point
See Also
Reference
GH_SettingsServer Class
GetValue Overload
Grasshopper.Kernel Namespace