Grasshopper SDK
GH_Param<T>.CreateProxySources Method
 Convert all proper source parameters into proxy sources.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void CreateProxySources()
Public Overridable Sub CreateProxySources
Implements
IGH_Param.CreateProxySources()
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace