Grasshopper SDK
GH_IconPicker.Icon Property
 Gets or sets the icon to be displayed in this picker.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap Icon { get; set; }
Public Property Icon As Bitmap
	Get
	Set
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.GH_IconPicker.Icon"]
See Also
Reference
GH_IconPicker Class
Grasshopper.GUI Namespace