Grasshopper SDK
GH_MemoryBitmap.B Method
 Gets the blue channel value at the given pixel coordinates.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public byte B(
	int x,
	int y
)
Public Function B (
	x As Integer,
	y As Integer
) As Byte
Parameters
x
Type: System.Int32
X coordinate (column) of pixel. Must be on image interior.
y
Type: System.Int32
Y coordinate (column) of pixel. Must be on image interior.
Return Value
Type: Byte
Value of Blue channel at given pixel.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace