Grasshopper SDK
GH_ResourceGate.Warning_16x16 Property
 Returns a 16x16 round yellow icon
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Bitmap Warning_16x16 { get; }
Public Shared ReadOnly Property Warning_16x16 As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Plugin.GH_ResourceGate.Warning_16x16"]
See Also
Reference
GH_ResourceGate Class
Grasshopper.Plugin Namespace