Grasshopper SDK
CentralSettings.PreviewGumballsChangedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void PreviewGumballsChangedEventHandler()
Public Delegate Sub PreviewGumballsChangedEventHandler
See Also
Reference
Grasshopper Namespace