Grasshopper SDK
GH_ComponentServer.GetAlias Method
 Gets the alias display string for a given object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string GetAlias(
	Guid target
)
Public Function GetAlias (
	target As Guid
) As String
Parameters
target
Type: System.Guid
Object id to retrieve aliases for.
Return Value
Type: String
A parsable display string of aliases.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace