Grasshopper SDK
GH_DocumentIO Constructor (GH_Document)
 Create a new instance of GH_DocumentIO with an internal document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentIO(
	GH_Document internal_doc
)
Public Sub New (
	internal_doc As GH_Document
)
Parameters
internal_doc
Type: Grasshopper.Kernel.GH_Document
Document to internalise.
See Also
Reference
GH_DocumentIO Class
GH_DocumentIO Overload
Grasshopper.Kernel Namespace