Grasshopper SDK
GH_DigitScrollerBase.ShowTextInputBox Method (Control, Boolean, Matrix)
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ShowTextInputBox(
	Control owner,
	bool limitToBoundary,
	Matrix transform
)
Public Sub ShowTextInputBox (
	owner As Control,
	limitToBoundary As Boolean,
	transform As Matrix
)
Parameters
owner
Type: System.Windows.Forms.Control
limitToBoundary
Type: System.Boolean
transform
Type: System.Drawing.Drawing2D.Matrix
See Also
Reference
GH_DigitScrollerBase Class
ShowTextInputBox Overload
Grasshopper.GUI.Base Namespace