Grasshopper SDK
GH_PointUtil.PullPointsToPlane Method
 Pull a list of points onto the plane. The result will be points in 3D world coordinates which are coincident with the given plane.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<GH_Point> PullPointsToPlane(
	IEnumerable<GH_Point> pts,
	Plane plane,
	bool include_nulls
)
Public Shared Function PullPointsToPlane (
	pts As IEnumerable(Of GH_Point),
	plane As Plane,
	include_nulls As Boolean
) As List(Of GH_Point)
Parameters
pts
Type: System.Collections.Generic.IEnumerable<GH_Point>
Points to pull.
plane
Type: Plane
Plane to pull onto.
include_nulls
Type: System.Boolean
If True, nulls in the pts list are maintained.
Return Value
Type: List<GH_Point>
See Also
Reference
GH_PointUtil Class
Grasshopper.Kernel.Types Namespace