Grasshopper SDK
GH_GeometryGroup.DrawViewportWires Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DrawViewportWires(
	GH_PreviewWireArgs args
)
Public Sub DrawViewportWires (
	args As GH_PreviewWireArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_PreviewWireArgs
Implements
IGH_PreviewData.DrawViewportWires(GH_PreviewWireArgs)
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace