Grasshopper SDK
GH_ExternalFileType Enumeration
 Enumerates the possible external files that Grasshopper is interested in.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ExternalFileType
Public Enumeration GH_ExternalFileType
Members
Member name | Value | Description
Unknown | 0 |  Unknown (invalid) file type.
Assembly | 1 |  File represents a GHA assembly.
UserObject | 2 |  File represents a GHUSER archive.
Cluster | 3 |  File represents a GHCLUSTER archive.
See Also
Reference
Grasshopper.Kernel Namespace