Grasshopper SDK
GH_ComponentAttributes.RenderComponentCapsule Method (GH_Canvas, Graphics)
 Utility function, draws the complete component capsule including all parameter data.
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void RenderComponentCapsule(
	GH_Canvas canvas,
	Graphics graphics
)
Protected Sub RenderComponentCapsule (
	canvas As GH_Canvas,
	graphics As Graphics
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas to draw into.
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
See Also
Reference
GH_ComponentAttributes Class
RenderComponentCapsule Overload
Grasshopper.Kernel.Attributes Namespace