Grasshopper SDK
GH_DigitNumber Constructor (Int32)
 Create a new GH_DigitNumber instance with the specified number of decimal places.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DigitNumber(
	int decimalPlaces
)
Public Sub New (
	decimalPlaces As Integer
)
Parameters
decimalPlaces
Type: System.Int32
Amount of decimal places.
See Also
Reference
GH_DigitNumber Class
GH_DigitNumber Overload
Grasshopper.GUI.Base Namespace