Grasshopper SDK
GH_MaterialPreviewControl Class
 Offers a frontend for Grasshopper Material previews.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Grasshopper.GUI.GH_MaterialPreviewControl
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_MaterialPreviewControl : UserControl
Public Class GH_MaterialPreviewControl
	Inherits UserControl
The GH_MaterialPreviewControl type exposes the following members.
Constructors
Name | Description
GH_MaterialPreviewControl
Initializes a new instance of the GH_MaterialPreviewControl class
Top
Properties
Name | Description
Colour
 Gets or sets the colour of this preview.
Selected
 Gets or sets the Selected state of this preview. Selected previews have thick borders drawn around them.
SelectOnClick
 Gets or sets whether this control can be selected.
Top
Methods
Name | Description
Dispose
Releases the unmanaged resources used by the GH_MaterialPreviewControl and optionally releases the managed resources
 (Overrides ContainerControl.Dispose(Boolean).)
Top
Events
Name | Description
ColourChanged
MaterialImagePostPaint
SelectedChanged
Top
See Also
Reference
Grasshopper.GUI Namespace