Grasshopper SDK
GH_PersistentGeometryParam<T>.ConversionCallback Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override void ConversionCallback(
	Object source,
	T target
)
Protected Overrides Sub ConversionCallback (
	source As Object,
	target As T
)
Parameters
source
Type: System.Object
target
Type: T
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace