Grasshopper SDK
GH_Point.EnsureReferenceData Method
 Creates new Reference data if it doesn't already exists
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void EnsureReferenceData()
Public Sub EnsureReferenceData
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace