Grasshopper SDK
GH_SliderBase.GripEdgeColour Property
 Gets or sets the edge colour for the slider grip.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color GripEdgeColour { get; set; }
Public Property GripEdgeColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.GripEdgeColour"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace