Grasshopper SDK
GH_Theme Constructor
 Create a new default theme.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Theme()
Public Sub New
See Also
Reference
GH_Theme Class
GH_Theme Overload
Grasshopper.GUI.Theme Namespace