Grasshopper SDK
GH_Mesh.DuplicateMesh Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Mesh DuplicateMesh()
Public Function DuplicateMesh As GH_Mesh
Return Value
Type: GH_Mesh
See Also
Reference
GH_Mesh Class
Grasshopper.Kernel.Types Namespace