Grasshopper SDK
GH_ComponentServer.GraphProxies Property
 Returns a list of all cached GH_GraphProxy instances.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<GH_GraphProxy> GraphProxies { get; }
Public ReadOnly Property GraphProxies As IList(Of GH_GraphProxy)
	Get
Property Value
Type: IList<GH_GraphProxy>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.GraphProxies"]
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace