Grasshopper SDK
GH_Transform.GetInverse Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Transform GetInverse()
Public Function GetInverse As GH_Transform
Return Value
Type: GH_Transform
See Also
Reference
GH_Transform Class
Grasshopper.Kernel.Types Namespace