Grasshopper SDK
GH_FontList.CreateFont Method
 Create a font that best approximates the current settings.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Font CreateFont()
Public Function CreateFont As Font
Return Value
Type: Font
See Also
Reference
GH_FontList Class
Grasshopper.GUI Namespace