Grasshopper SDK
GH_GeometricGoo<T>.CastTo<Q> Method (Q)
 Attempt a cast to type T.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CastTo<Q>(
	out Q target
)
Public Overrides Function CastTo(Of Q) (
	<OutAttribute> ByRef target As Q
) As Boolean
Parameters
target
Type: Q
Pointer to target of cast.
Type Parameters
Q
Type to cast to
Return Value
Type: Boolean
True on success, false on failure.
Remarks
If false, the target instance contents are not guaranteed to be valid.
See Also
Reference
GH_GeometricGoo<T> Class
CastTo Overload
Grasshopper.Kernel.Types Namespace