Grasshopper SDK
GH_ComponentParamServer.RegisterInputParam Method (IGH_Param)
 Add a parameter to the end of the input list.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RegisterInputParam(
	IGH_Param new_param
)
Public Function RegisterInputParam (
	new_param As IGH_Param
) As Boolean
Parameters
new_param
Type: Grasshopper.Kernel.IGH_Param
Return Value
Type: Boolean
See Also
Reference
GH_ComponentParamServer Class
RegisterInputParam Overload
Grasshopper.Kernel Namespace