Grasshopper SDK
GH_TreeIndex Structure
 Represents a single unique location in a DataTree.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public struct GH_TreeIndex
Public Structure GH_TreeIndex
The GH_TreeIndex type exposes the following members.
Constructors
Name | Description
GH_TreeIndex
 Create a new instance of the GH_TreeIndex structure with preset path and item index.
Top
Properties
Name | Description
Item
 Gets or sets the item index.
Path
 Gets or sets the Path identifier.
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace