Grasshopper SDK
IGH_ActiveObject.ClearRuntimeMessages Method
 Clear all message lists.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void ClearRuntimeMessages()
Sub ClearRuntimeMessages
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace