Grasshopper SDK
GH_WireSettings.DefaultColour Property
 Gets or sets the colour to use for standard wires.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color DefaultColour { get; set; }
Public Property DefaultColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_WireSettings.DefaultColour"]
See Also
Reference
GH_WireSettings Class
Grasshopper.GUI.Theme Namespace