Grasshopper SDK
GH_PreviewArgs.Document Property
 Gets the Grasshopper document that is currently drawing the preview.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document Document { get; }
Public ReadOnly Property Document As GH_Document
	Get
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewArgs.Document"]
Implements
IGH_PreviewArgs.Document
See Also
Reference
GH_PreviewArgs Class
Grasshopper.Kernel Namespace