Grasshopper SDK
GH_Goo<T>.IsValid Property
 Gets a value indicating whether or not the current value is valid.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract bool IsValid { get; }
Public MustOverride ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Goo`1.IsValid"]
Implements
IGH_Goo.IsValid
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace