Grasshopper SDK
GH_CursorServer.Count Property
 Gets the number of cached cursors.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CursorServer.Count"]
See Also
Reference
GH_CursorServer Class
Grasshopper.GUI Namespace