Grasshopper SDK
GH_Document.UndoServer Property
 Gets the UndoServer instance that belongs to this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoServer UndoServer { get; }
Public ReadOnly Property UndoServer As GH_UndoServer
	Get
Property Value
Type: GH_UndoServer
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.UndoServer"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace