Grasshopper SDK
GH_GHXHarvester.HarvestBoundingBoxes Method (GH_IReader)
 Harvest all attribute bounding boxes from a GHX/GH node.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<RectangleF> HarvestBoundingBoxes(
	GH_IReader node
)
Public Shared Function HarvestBoundingBoxes (
	node As GH_IReader
) As List(Of RectangleF)
Parameters
node
Type: GH_IO.Serialization.GH_IReader
Node to parse.
Return Value
Type: List<RectangleF>
A list of all attribute bounding boxes or null on failure.
See Also
Reference
GH_GHXHarvester Class
HarvestBoundingBoxes Overload
Grasshopper.Kernel Namespace