Grasshopper SDK
GH_Canvas.ShowSearchDialog Method
 Display the Find dialog. If a Find dialog is already active for this canvas, nothing will happen.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ShowSearchDialog(
	bool centerOnCursor
)
Public Sub ShowSearchDialog (
	centerOnCursor As Boolean
)
Parameters
centerOnCursor
Type: System.Boolean
If true, the dialog will be centered on the cursor, otherwise it will be put in the upper left corner of the canvas.
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace