Grasshopper SDK
GH_ParamServerEventArgs.ParameterSide Property
 Gets the side of the parameter that caused the original event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ParameterSide ParameterSide { get; }
Public ReadOnly Property ParameterSide As GH_ParameterSide
	Get
Property Value
Type: GH_ParameterSide
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ParamServerEventArgs.ParameterSide"]
See Also
Reference
GH_ParamServerEventArgs Class
Grasshopper.Kernel Namespace