Grasshopper SDK
IGH_Structure.StructureProxy Property
 Gets a proxy list of all the data-arrays in this structure
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IList<IList> StructureProxy { get; }
ReadOnly Property StructureProxy As IList(Of IList)
	Get
Property Value
Type: IList<IList>
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.IGH_Structure.StructureProxy"]
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace