Grasshopper SDK
GH_Document.OnObjectAdded Method
 Raise the ObjectsAdded event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnObjectAdded(
	IGH_DocumentObject doc_object
)
Public Sub OnObjectAdded (
	doc_object As IGH_DocumentObject
)
Parameters
doc_object
Type: Grasshopper.Kernel.IGH_DocumentObject
Object that was added.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace