Grasshopper SDK
GH_Component.RegisterRemoteIDs Method
 Registers all my input parameters with the UUID_LookUpTable
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void RegisterRemoteIDs(
	GH_GuidTable table
)
Public Overrides Sub RegisterRemoteIDs (
	table As GH_GuidTable
)
Parameters
table
Type: GH_GuidTable
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace