Grasshopper SDK
GH_BorderTopology Enumeration
 Enumerates all possble border types.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_BorderTopology
Public Enumeration GH_BorderTopology
Members
Member name | Value | Description
None | -2 |  Unset value.
All | -1 |  All possible types.
TopRight | 0 |  Corner border in the top right area of the box.
TopLeft | 1 |  Corner border in the top left area of the box.
BottomLeft | 2 |  Corner border in the bottom left area of the box.
BottomRight | 3 |  Corner border in the bottom right area of the box.
Top | 4 |  Edge border along the top area of the box.
Left | 5 |  Edge border along the left area of the box.
Bottom | 6 |  Edge border along the bottom area of the box.
Right | 7 |  Edge border along the right area of the box.
See Also
Reference
Grasshopper.GUI.Canvas Namespace