Grasshopper SDK
GH_Box.GH_BoxProxy.XSize Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Interval_Wrapper XSize { get; }
Public ReadOnly Property XSize As GH_Interval_Wrapper
	Get
Property Value
Type: GH_Interval_Wrapper
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Box.GH_BoxProxy.XSize"]
See Also
Reference
GH_Box.GH_BoxProxy Class
Grasshopper.Kernel.Types Namespace