Grasshopper SDK
GH_Canvas.NavigationPanPixels Property
 Gets or sets the number of pixels for each pan operation.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int NavigationPanPixels { get; set; }
Public Shared Property NavigationPanPixels As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.NavigationPanPixels"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace