Grasshopper SDK
GH_DocumentEditor.FadeIn Method
 Call this method if the prompt switches back to Grasshopper.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void FadeIn()
Public Sub FadeIn
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace