Grasshopper SDK
GH_Guid Constructor
 Blank constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Guid()
Public Sub New
See Also
Reference
GH_Guid Class
GH_Guid Overload
Grasshopper.Kernel.Types Namespace