Grasshopper SDK
GH_FontList.FontFamily Property
 Gets or sets the selected font family.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public FontFamily FontFamily { get; set; }
Public Property FontFamily As FontFamily
	Get
	Set
Property Value
Type: FontFamily
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FontList.FontFamily"]
See Also
Reference
GH_FontList Class
Grasshopper.GUI Namespace