Grasshopper SDK
GH_ColourPicker.ShowAlphaSlider Property
 Gets or sets whether the alpha channel slider is included.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ShowAlphaSlider { get; set; }
Public Property ShowAlphaSlider As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_ColourPicker.ShowAlphaSlider"]
See Also
Reference
GH_ColourPicker Class
Grasshopper.GUI Namespace