Grasshopper SDK
GH_SliderBase.Rail Property
 Gets the shape of the rail. The height of the rectangle will be zero, but the y-position will be rounded to integer precision.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle Rail { get; }
Public ReadOnly Property Rail As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.Rail"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace