Grasshopper SDK
GH_GeometricGooWrapper.EmitProxy Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_GooProxy EmitProxy()
Public Function EmitProxy As IGH_GooProxy
Return Value
Type: IGH_GooProxy
Implements
IGH_Goo.EmitProxy()
See Also
Reference
GH_GeometricGooWrapper Class
Grasshopper.Kernel.Types Namespace