Grasshopper SDK
GH_Document.EnableSolutions Property
 Gets or sets a global variable that indicates whether solutions are allowed to be recomputed. When this flag is off, the solver will be disabled and the event watchers should be silent.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool EnableSolutions { get; set; }
Public Shared Property EnableSolutions As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.EnableSolutions"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace