Grasshopper SDK
CentralSettings.FormatDecimalDigits Property
 Gets or sets how many digits ought to be used for decimal formatted numbers.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int FormatDecimalDigits { get; set; }
Public Shared Property FormatDecimalDigits As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.CentralSettings.FormatDecimalDigits"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace