Grasshopper SDK
GH_Surface Constructor (Brep)
Initializes a new instance of the GH_Surface class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Surface(
	Brep brep
)
Public Sub New (
	brep As Brep
)
Parameters
brep
Type: Brep
See Also
Reference
GH_Surface Class
GH_Surface Overload
Grasshopper.Kernel.Types Namespace