Grasshopper SDK
GH_Paragraph.Create Method (String[])
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Paragraph Create(
	string[] content
)
Public Shared Function Create (
	content As String()
) As GH_Paragraph
Parameters
content
Type: System.String[]
Return Value
Type: GH_Paragraph
See Also
Reference
GH_Paragraph Class
Create Overload
Grasshopper.Documentation Namespace