Grasshopper SDK
GH_IconLabel.LabelIcon Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap LabelIcon { get; set; }
Public Property LabelIcon As Bitmap
	Get
	Set
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.GH_IconLabel.LabelIcon"]
See Also
Reference
GH_IconLabel Class
Grasshopper.GUI Namespace