Grasshopper SDK
GH_Point.ReferenceParam Method (Int32, Double)
 Sets the index of the point reference data.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ReferenceParam(
	int index,
	double new_param
)
Public Sub ReferenceParam (
	index As Integer,
	new_param As Double
)
Parameters
index
Type: System.Int32
The index of the parameter. Only 0 and 1 are valid values.
new_param
Type: System.Double
The new value of the parameter
Remarks
If there is no reference data, this function will create a new instance.
See Also
Reference
GH_Point Class
ReferenceParam Overload
Grasshopper.Kernel.Types Namespace