Grasshopper SDK
GH_ComponentServer.TypeHints Property
 Gets a list of all IGH_TypeHint types in all loaded assemblies.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<Type> TypeHints { get; }
Public ReadOnly Property TypeHints As IList(Of Type)
	Get
Property Value
Type: IList<Type>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.TypeHints"]
Return Value
Type: IList<Type>
A list of System.Type containing all classes that implement IGH_TypeHint.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace