Grasshopper SDK
GH_DocumentEditor.ScriptAccess_SaveDocumentAs Method
 Saves the currently active document to disk.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ScriptAccess_SaveDocumentAs()
Public Function ScriptAccess_SaveDocumentAs As Boolean
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentEditor Class
ScriptAccess_SaveDocumentAs Overload
Grasshopper.GUI Namespace