Grasshopper SDK
GH_Alias Class
 Represents a single alias|target combo.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_Alias
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Alias : IComparable<GH_Alias>
Public Class GH_Alias
	Implements IComparable(Of GH_Alias)
The GH_Alias type exposes the following members.
Constructors
Name | Description
GH_Alias()
Initializes a new instance of the GH_Alias class
GH_Alias(GH_Alias)
Initializes a new instance of the GH_Alias class
GH_Alias(String, Guid)
Initializes a new instance of the GH_Alias class
Top
Properties
Name | Description
Alias
 Gets or sets the alias string.
Target
 Gets or sets the alias target.
Top
Methods
Name | Description
AliasToString
CompareTo
StringToAlias
Top
See Also
Reference
Grasshopper.Kernel Namespace