Grasshopper SDK
GH_UndoServer.MaxRecords Property
 Gets or sets the maximum number of undo records that can be stored.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int MaxRecords { get; set; }
Public Property MaxRecords As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoServer.MaxRecords"]
Remarks
The number of redo records is logically limited to the same number. THIS SETTING IS CURRENTLY IGNORED
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace