Grasshopper SDK
GH_Theme.Wires Property
 Gets the theme wire settings.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_WireSettings Wires { get; }
Public ReadOnly Property Wires As GH_WireSettings
	Get
Property Value
Type: GH_WireSettings
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_Theme.Wires"]
See Also
Reference
GH_Theme Class
Grasshopper.GUI.Theme Namespace