Grasshopper SDK
GH_IndexRange.IntersectsWith Method
 Tests whether certain indices are described by both this and another range.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IntersectsWith(
	GH_IndexRange range
)
Public Function IntersectsWith (
	range As GH_IndexRange
) As Boolean
Parameters
range
Type: Grasshopper.Kernel.Data.GH_IndexRange
Range to intersect with.
Return Value
Type: Boolean
True if the ranges intersect.
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace