Grasshopper SDK
GH_CanvasMouseEvent Class
 Class used in Canvas UI events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.GUI.GH_CanvasMouseEvent
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_CanvasMouseEvent : EventArgs
Public Class GH_CanvasMouseEvent
	Inherits EventArgs
The GH_CanvasMouseEvent type exposes the following members.
Constructors
Name | Description
GH_CanvasMouseEvent()
 Blank constructor.
GH_CanvasMouseEvent(GH_Viewport, MouseEventArgs)
 Constructor.
GH_CanvasMouseEvent(Point, PointF, MouseButtons, Int32, Int32)
 Constructor.
Top
Properties
Name | Description
Button
 Gets which mouse button was pressed.
CanvasLocation
 Gets the location of the cursor in canvas unit coordinates.
CanvasX
 Gets the x-coordinate of the cursor location in canvas unit coordinates.
CanvasY
 Gets the y-coordinate of the cursor location in canvas unit coordinates.
Clicks
 Gets the number of times the mouse button was pressed and released.
ControlLocation
 Gets the location of the cursor in control pixel coordinates.
ControlX
 Gets the x-coordinate of the cursor location in control pixel coordinates.
ControlY
 Gets the y-coordinate of the cursor location in control pixel coordinates.
Delta
 Gets a signed count of the number of detents the mouse wheel has rotated. A detent is one notch of the mouse wheel.
WinFormsEventArgs
 Downcast this data into a Windows.Forms.MouseEventArgs instance.
Top
See Also
Reference
Grasshopper.GUI Namespace