Grasshopper SDK
GH_BackgroundSettings.Colour1 Property
 First background colour. Depending on the background style, this colour is used in different ways.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Colour1 { get; set; }
Public Property Colour1 As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_BackgroundSettings.Colour1"]
See Also
Reference
GH_BackgroundSettings Class
Grasshopper.GUI.Theme Namespace