Grasshopper SDK
GH_Animator<T> Class
 Provides methods for animating values.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_Animator<T>
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Animator<T>
Public Class GH_Animator(Of T)
Type Parameters
T
Data type to animate.
The GH_Animator<T> type exposes the following members.
Constructors
Name | Description
GH_Animator<T>(T, T, TimeSpan, GH_Animator<T>.Interpolate)
 Create a new instance of the generic animator.
GH_Animator<T>(T, T, DateTime, DateTime, GH_Animator<T>.Interpolate)
 Create a new instance of the generic animator.
Top
Properties
Name | Description
Interpolation
 Gets or sets the interpolation mode. Changing the mode during an animation will result in discontinuous motion.
Phase
 Gets the current animation phase.
ValueA
 Gets or sets the start value of the animation. This value is set from within the constructor though you can change it at any time.
ValueB
 Gets or sets the end value of the animation. This value is set from within the constructor though you can change it at any time.
Top
Methods
Name | Description
AdjustAnimation(T)
 Adjust the animation.
AdjustAnimation(T, Int32)
 Adjust the animation.
AdjustAnimation(T, DateTime, DateTime)
 Adjust the animation.
CurrentValue
 Gets the current animated value.
Top
See Also
Reference
Grasshopper.GUI Namespace