Grasshopper SDK
GH_FloatingParamAttributes.Render Method
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override void Render(
	GH_Canvas canvas,
	Graphics graphics,
	GH_CanvasChannel channel
)
Protected Overrides Sub Render (
	canvas As GH_Canvas,
	graphics As Graphics,
	channel As GH_CanvasChannel
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
graphics
Type: System.Drawing.Graphics
channel
Type: Grasshopper.GUI.Canvas.GH_CanvasChannel
See Also
Reference
GH_FloatingParamAttributes Class
Grasshopper.Kernel.Attributes Namespace