Grasshopper SDK
GH_CanvasMode Enumeration
 Enumerates all pre-defined Canvas modes.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_CanvasMode
Public Enumeration GH_CanvasMode
Members
Member name | Value | Description
Control | 0 |  Indicates the canvas is currently drawing into the winforms control. This is the most common mode.
Thumbnail | 1 |  Indicates the canvas is currently drawing itself to a thumbnail image.
Export | 2 |  Indicates the canvas is currently drawing itself to an off-screen image. This typically happens during Hi-Res export operations.
See Also
Reference
Grasshopper.GUI.Canvas Namespace