Grasshopper SDK
GH_UndoAction.ExpiresDisplay Property
 Override this property if you want the Rhino viewport display to refresh upon undo completion.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool ExpiresDisplay { get; }
Public Overridable ReadOnly Property ExpiresDisplay As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoAction.ExpiresDisplay"]
Implements
IGH_UndoAction.ExpiresDisplay
See Also
Reference
GH_UndoAction Class
Grasshopper.Kernel.Undo Namespace