Grasshopper SDK
GH_MeshFace.GH_MeshFaceProxy.Kind Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Kind { get; }
Public ReadOnly Property Kind As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_MeshFace.GH_MeshFaceProxy.Kind"]
See Also
Reference
GH_MeshFace.GH_MeshFaceProxy Class
Grasshopper.Kernel.Types Namespace