Grasshopper SDK
GH_UserObject.Clear Method
 Destroy all data except the file path and the ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace