Grasshopper SDK
GH_DigitScrollerBase.AllowRadixDrag Property
 Gets or sets a value indicating whether the radix is allowed to be dragged around.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AllowRadixDrag { get; set; }
Public Property AllowRadixDrag As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.AllowRadixDrag"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace