Grasshopper SDK
GH_Surface Constructor (GH_Surface)
Initializes a new instance of the GH_Surface class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Surface(
	GH_Surface other
)
Public Sub New (
	other As GH_Surface
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Surface
See Also
Reference
GH_Surface Class
GH_Surface Overload
Grasshopper.Kernel.Types Namespace