Grasshopper SDK
GH_ColourCube.Blend Method
 Inteprolate between two colours.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Blend(
	Color A,
	Color B,
	double t
)
Public Function Blend (
	A As Color,
	B As Color,
	t As Double
) As Color
Parameters
A
Type: System.Drawing.Color
First colour.
B
Type: System.Drawing.Color
Second colour.
t
Type: System.Double
Interpolation parameter.
Return Value
Type: Color
Interpolated colour.
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace