Grasshopper SDK
GH_AsynchFileData.Location Field
 Gets the location this class is watching.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public readonly string Location
Public ReadOnly Location As String
Field Value
Type: String
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace