Grasshopper SDK
GH_RhinoScriptInterface Constructor
Initializes a new instance of the GH_RhinoScriptInterface class
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RhinoScriptInterface()
Public Sub New
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace