Grasshopper SDK
GH_Box.GH_BoxProxy Constructor
Initializes a new instance of the GH_Box.GH_BoxProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_BoxProxy(
	GH_Box Value
)
Public Sub New (
	Value As GH_Box
)
Parameters
Value
Type: Grasshopper.Kernel.Types.GH_Box
See Also
Reference
GH_Box.GH_BoxProxy Class
Grasshopper.Kernel.Types Namespace