Grasshopper SDK
GH_RuntimeFile.IsTagLine Method
 Tests whether a line of text starts with a Grasshopper Help keyword.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsTagLine(
	string line,
	out string keyword,
	out string remainder
)
Public Shared Function IsTagLine (
	line As String,
	<OutAttribute> ByRef keyword As String,
	<OutAttribute> ByRef remainder As String
) As Boolean
Parameters
line
Type: System.String
Line of text to test.
keyword
Type: System.String
This is where the keyword is returned.
remainder
Type: System.String
This is where the non-keyword part of the line is returned.
Return Value
Type: Boolean
True if the line starts with a keyword.
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace