Grasshopper SDK
Folders.TemplateFolders Property
 Gets a list of all the directories from which template files are loaded. Templates are not loaded from subfolders.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<string> TemplateFolders { get; }
Public Shared ReadOnly Property TemplateFolders As List(Of String)
	Get
Property Value
Type: List<String>
[Missing <value> documentation for "P:Grasshopper.Folders.TemplateFolders"]
Return Value
Type: List<String>
A list of load target directories.
See Also
Reference
Folders Class
Grasshopper Namespace