Grasshopper SDK
GH_GooProxy<T>.Valid Property
 Gets a value indicating whether this proxy represents valid data.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool Valid { get; }
Public Overridable ReadOnly Property Valid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GooProxy`1.Valid"]
Implements
IGH_GooProxy.Valid
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace