Grasshopper SDK
GH_Field.ToString Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string ToString()
Public Function ToString As String
Return Value
Type: String
Implements
IGH_Goo.ToString()
See Also
Reference
GH_Field Class
Grasshopper.Kernel.Types Namespace