Grasshopper SDK
GH_Animator.RectangleFAnimator Method (RectangleF, RectangleF)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<RectangleF> RectangleFAnimator(
	RectangleF A,
	RectangleF B
)
Public Shared Function RectangleFAnimator (
	A As RectangleF,
	B As RectangleF
) As GH_Animator(Of RectangleF)
Parameters
A
Type: System.Drawing.RectangleF
B
Type: System.Drawing.RectangleF
Return Value
Type: GH_Animator<RectangleF>
See Also
Reference
GH_Animator Class
RectangleFAnimator Overload
Grasshopper.GUI Namespace