Grasshopper SDK
GH_Animator<T>.AdjustAnimation Method (T, DateTime, DateTime)
 Adjust the animation.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AdjustAnimation(
	T newTarget,
	DateTime newStartTime,
	DateTime newEndTime
)
Public Sub AdjustAnimation (
	newTarget As T,
	newStartTime As DateTime,
	newEndTime As DateTime
)
Parameters
newTarget
Type: T
New B value.
newStartTime
Type: System.DateTime
newEndTime
Type: System.DateTime
See Also
Reference
GH_Animator<T> Class
AdjustAnimation Overload
Grasshopper.GUI Namespace