Grasshopper SDK
GH_Theme.Palettes Property
 Gets the theme palette settings.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PaletteSettings Palettes { get; }
Public ReadOnly Property Palettes As GH_PaletteSettings
	Get
Property Value
Type: GH_PaletteSettings
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_Theme.Palettes"]
See Also
Reference
GH_Theme Class
Grasshopper.GUI.Theme Namespace