Grasshopper SDK
GH_MeshFace.DuplicateMeshFace Method
 Create a duplicate of this Mesh face.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MeshFace DuplicateMeshFace()
Public Function DuplicateMeshFace As GH_MeshFace
Return Value
Type: GH_MeshFace
See Also
Reference
GH_MeshFace Class
Grasshopper.Kernel.Types Namespace