Grasshopper SDK
IGH_Param.Reverse Property
 Gets or sets the data reverse modifier of this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool Reverse { get; set; }
Property Reverse As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.Reverse"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace