Grasshopper SDK
GH_Component.DependsOn Method
 Returns True is any one of my input parameters depends on the source.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override sealed bool DependsOn(
	IGH_ActiveObject potentialSource
)
Public Overrides NotOverridable Function DependsOn (
	potentialSource As IGH_ActiveObject
) As Boolean
Parameters
potentialSource
Type: Grasshopper.Kernel.IGH_ActiveObject
Source to test for dependency.
Return Value
Type: Boolean
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace