Grasshopper SDK
GH_GDI_Util.FilletPolyline Method (PointF[], Single)
 Fillet all the corners of a freeform outline.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath FilletPolyline(
	PointF[] corners,
	float radius
)
Public Shared Function FilletPolyline (
	corners As PointF(),
	radius As Single
) As GraphicsPath
Parameters
corners
Type: System.Drawing.PointF[]
A list of corner points.
radius
Type: System.Single
Fillet to apply to all corners.
Return Value
Type: GraphicsPath
A graphics path describing the filleted shape, or Nothing on failure.
See Also
Reference
GH_GDI_Util Class
FilletPolyline Overload
Grasshopper.GUI Namespace