Grasshopper SDK
GH_DocumentEditor.EnableUI Method
 Enable all modifier UI.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void EnableUI()
Public Sub EnableUI
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace