Grasshopper SDK
GH_PreviewMeshArgs.MeshingParameters Property
 Gets the meshing parameters which ought to be used for meshing breps and surfaces. If this property returns a null reference, meshes are supposed to be omitted.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public MeshingParameters MeshingParameters { get; }
Public ReadOnly Property MeshingParameters As MeshingParameters
	Get
Property Value
Type: MeshingParameters
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewMeshArgs.MeshingParameters"]
See Also
Reference
GH_PreviewMeshArgs Class
Grasshopper.Kernel Namespace