Grasshopper SDK
Instances.IsRemotePanelVisible Property
 Gets whether the Remote Control Panel is currently visible.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsRemotePanelVisible { get; }
Public Shared ReadOnly Property IsRemotePanelVisible As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Instances.IsRemotePanelVisible"]
See Also
Reference
Instances Class
Grasshopper Namespace