Grasshopper SDK
IGH_EventConsumer Interface
 Implement this interface if you want to inter-operate with a GH_EventServer.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_EventConsumer
Public Interface IGH_EventConsumer
The IGH_EventConsumer type exposes the following members.
Methods
Name | Description
IsRelevantEvent
 Whenever a new object event is handled, this function will be called to determine whether it will cause an update.
PartialExpiration
 This method will be called by the GH_CustomEventServer to indicate one or more interesting object events can now be processed.
TotalExpiration
 This method will be called by the GH_CustomEventServer to indicate all interesting object events can now be processed.
Top
See Also
Reference
Grasshopper.Kernel Namespace