Grasshopper SDK
IGH_GeometricGoo.Morph Method
 Morph the object or a deformable representation of the object.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_GeometricGoo Morph(
	SpaceMorph xmorph
)
Function Morph (
	xmorph As SpaceMorph
) As IGH_GeometricGoo
Parameters
xmorph
Type: SpaceMorph
Spatial deform.
Return Value
Type: IGH_GeometricGoo
Deformed geometry. If the local geometry can be deformed accurately, then the returned instance equals this instance. Not all geometry types can be accurately deformed though, if this is the case, this function will return an instance of another IGH_GeometricGoo derived type which can be deformed.
See Also
Reference
IGH_GeometricGoo Interface
Grasshopper.Kernel.Types Namespace