Grasshopper SDK
GH_MeshingParameters.RhMesherSettings_Proxy.SimplePlanes Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool SimplePlanes { get; set; }
Public Property SimplePlanes As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_MeshingParameters.RhMesherSettings_Proxy.SimplePlanes"]
See Also
Reference
GH_MeshingParameters.RhMesherSettings_Proxy Class
Grasshopper.Kernel.Types Namespace