Grasshopper SDK
GH_Document.RepairProxySources Method
 Attempts to resolve all proxy sources in the document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RepairProxySources()
Public Function RepairProxySources As Boolean
Return Value
Type: Boolean
False if one or more proxies could not be resolved
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace