Grasshopper SDK
GH_CanvasViewportChangedEventArgs.Viewport Property
 Gets the new Viewport.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Viewport Viewport { get; }
Public ReadOnly Property Viewport As GH_Viewport
	Get
Property Value
Type: GH_Viewport
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasViewportChangedEventArgs.Viewport"]
See Also
Reference
GH_CanvasViewportChangedEventArgs Class
Grasshopper.GUI.Canvas Namespace