Grasshopper SDK
Complex Constructor (Double)
Initializes a new instance of the Complex class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Complex(
	double real_component
)
Public Sub New (
	real_component As Double
)
Parameters
real_component
Type: System.Double
See Also
Reference
Complex Structure
Complex Overload
Grasshopper.Kernel.Types Namespace