Grasshopper SDK
Instances.IsMruServer Property
 Gets a value indicating whether or not the MRU server has been initialized.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsMruServer { get; }
Public Shared ReadOnly Property IsMruServer As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Instances.IsMruServer"]
See Also
Reference
Instances Class
Grasshopper Namespace