Grasshopper SDK
GH_Theme.Page Property
 Gets the theme page and grid settings.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PageSettings Page { get; }
Public ReadOnly Property Page As GH_PageSettings
	Get
Property Value
Type: GH_PageSettings
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_Theme.Page"]
See Also
Reference
GH_Theme Class
Grasshopper.GUI.Theme Namespace