Grasshopper SDK
GH_RelevantObjectData.Object Property
 Gets the raw object cached in this data instance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_DocumentObject Object { get; }
Public ReadOnly Property Object As IGH_DocumentObject
	Get
Property Value
Type: IGH_DocumentObject
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RelevantObjectData.Object"]
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace