Grasshopper SDK
GH_Point.CreateFromEdgeRatio Method
 Create new point geometry instance based on an edge parameter ratio
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateFromEdgeRatio(
	Guid brp_id,
	Curve edge,
	int e_index,
	double t
)
Public Sub CreateFromEdgeRatio (
	brp_id As Guid,
	edge As Curve,
	e_index As Integer,
	t As Double
)
Parameters
brp_id
Type: System.Guid
ID of the brep this object references
edge
Type: Curve
The edge curve
e_index
Type: System.Int32
Index of edge to reference
t
Type: System.Double
Parameter on edge in edge domain space
Remarks
This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace