Grasshopper SDK
GH_PersistentParam<T>.RecoverFromPrompt Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void RecoverFromPrompt()
Protected Overridable Sub RecoverFromPrompt
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace