Grasshopper SDK
GH_RelevantObjectData.Attributes Property
 Gets the attributes that belong to the object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Attributes Attributes { get; }
Public ReadOnly Property Attributes As IGH_Attributes
	Get
Property Value
Type: IGH_Attributes
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RelevantObjectData.Attributes"]
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace