Grasshopper SDK
GH_Document.FindAllDownstreamObjects Method (List<IGH_ActiveObject>)
 Find all objects that depend in some way on the Source collection
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_ActiveObject> FindAllDownstreamObjects(
	List<IGH_ActiveObject> from
)
Public Function FindAllDownstreamObjects (
	from As List(Of IGH_ActiveObject)
) As List(Of IGH_ActiveObject)
Parameters
from
Type: System.Collections.Generic.List<IGH_ActiveObject>
Objects to start searching from.
Return Value
Type: List<IGH_ActiveObject>
See Also
Reference
GH_Document Class
FindAllDownstreamObjects Overload
Grasshopper.Kernel Namespace