Grasshopper SDK
GH_UserObject.Exposure Property
 Gets or sets the Exposure of this User Object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Exposure Exposure { get; set; }
Public Property Exposure As GH_Exposure
	Get
	Set
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_UserObject.Exposure"]
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace