Grasshopper SDK
GH_TooltipComponent.Tag Property
 Provides an easy way to store information on this Tooltip.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Object Tag { get; set; }
Public Property Tag As Object
	Get
	Set
Property Value
Type: Object
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipComponent.Tag"]
See Also
Reference
GH_TooltipComponent Class
Grasshopper.GUI Namespace