Grasshopper SDK
GH_SettingsServer.GetValue Method (String, Rectangle)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle GetValue(
	string key,
	Rectangle default
)
Public Function GetValue (
	key As String,
	default As Rectangle
) As Rectangle
Parameters
key
Type: System.String
default
Type: System.Drawing.Rectangle
Return Value
Type: Rectangle
See Also
Reference
GH_SettingsServer Class
GetValue Overload
Grasshopper.Kernel Namespace