Grasshopper SDK
IGH_PreviewObject.DrawViewportWires Method
 Implement this function to draw all wire and point geometry previews.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void DrawViewportWires(
	IGH_PreviewArgs args
)
Sub DrawViewportWires (
	args As IGH_PreviewArgs
)
Parameters
args
Type: Grasshopper.Kernel.IGH_PreviewArgs
Draw operation arguments.
See Also
Reference
IGH_PreviewObject Interface
Grasshopper.Kernel Namespace