Grasshopper SDK
GH_Convert.IsPureDate Method
 Tests whether a DateTime instance represents a pure date (i.e. that the time portion is undefined). Pure dates are a Grasshopper convention, basically a pure date is 1 tick past midnight.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsPureDate(
	DateTime potentialDate
)
Public Shared Function IsPureDate (
	potentialDate As DateTime
) As Boolean
Parameters
potentialDate
Type: System.DateTime
Date to test.
Return Value
Type: Boolean
True if the date is considered pure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace