Grasshopper SDK
GH_Convert.GetTimeKind Method (DateTime, DateTime)
 Gets the kind of time implied by two System.DateTime values.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_TimeKind GetTimeKind(
	DateTime A,
	DateTime B
)
Public Shared Function GetTimeKind (
	A As DateTime,
	B As DateTime
) As GH_TimeKind
Parameters
A
Type: System.DateTime
First time to evaluate.
B
Type: System.DateTime
Second time to evaluate.
Return Value
Type: GH_TimeKind
GH_TimeKind.PureTime, GH_TimeKind.PureDate or GH_TimeKind.DateAndTime if both kinds are the same. GH_TimeKind.DateAndTime is one is a pure date and the other a DateAndTime value. GH_TimeKind.Mixed is one is a pure time and the other one is not.
See Also
Reference
GH_Convert Class
GetTimeKind Overload
Grasshopper.Kernel Namespace