Grasshopper SDK
CentralSettings.PreviewPointStyle Property
 Gets or sets the point style for Grasshopper preview points.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static PointStyle PreviewPointStyle { get; set; }
Public Shared Property PreviewPointStyle As PointStyle
	Get
	Set
Property Value
Type: PointStyle
[Missing <value> documentation for "P:Grasshopper.CentralSettings.PreviewPointStyle"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace