Grasshopper SDK
GH_Viewport.IsVisible Method (PointF, Single)
 Test visibility of a point.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsVisible(
	ref PointF pt,
	float margin = 0f
)
Public Function IsVisible (
	ByRef pt As PointF,
	Optional margin As Single = 0F
) As Boolean
Parameters
pt
Type: System.Drawing.PointF
Point in canvas coordinates.
margin (Optional)
Type: System.Single
Fuzzy area around point to test.
Return Value
Type: Boolean
True if the point is visible in the control upon projection.
See Also
Reference
GH_Viewport Class
IsVisible Overload
Grasshopper.GUI.Canvas Namespace