Grasshopper SDK
GH_FontServer.FamilyScript Property
 Gets or sets the FontFamily used for scripted fonts in Grasshopper.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static FontFamily FamilyScript { get; set; }
Public Shared Property FamilyScript As FontFamily
	Get
	Set
Property Value
Type: FontFamily
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FontServer.FamilyScript"]
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace