Grasshopper SDK
GH_ComponentServer.ClearStaleUserObjects Method
 Remove all user objects that no longer point to existing files.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearStaleUserObjects()
Public Sub ClearStaleUserObjects
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace