Grasshopper SDK
GH_DocumentServer.AddDocument Method (GH_Document)
 Add a new document to the global list. If the document is already registered nothing will happen.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddDocument(
	GH_Document document
)
Public Sub AddDocument (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document to add.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the document is a null reference.
InvalidOperationException | Thrown when the document doesn't have top-level rank.
See Also
Reference
GH_DocumentServer Class
AddDocument Overload
Grasshopper.Kernel Namespace