Grasshopper SDK
GH_ComponentParamServer.IndexOfOutputParam Method (String)
 Finds the index of the output parameter that matches the specified search mask.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int IndexOfOutputParam(
	string name
)
Public Function IndexOfOutputParam (
	name As String
) As Integer
Parameters
name
Type: System.String
Name to search for.
Return Value
Type: Int32
The index of the parameter, or -1 if no parameter was found to match
See Also
Reference
GH_ComponentParamServer Class
IndexOfOutputParam Overload
Grasshopper.Kernel Namespace