Grasshopper SDK
GH_ScrollBarVerticalBase.ContinueDrag Method
 Continue a drag operation.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ContinueDrag(
	double position
)
Public Function ContinueDrag (
	position As Double
) As Boolean
Parameters
position
Type: System.Double
New offset hint.
Return Value
Type: Boolean
True if the drag resulted in an offset change, false if not.
See Also
Reference
GH_ScrollBarVerticalBase Class
Grasshopper.GUI.Base Namespace