Grasshopper SDK
IGH_Param.VolatileDataCount Property
 Gets the total number of volatile data items stored in this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int VolatileDataCount { get; }
ReadOnly Property VolatileDataCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.VolatileDataCount"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace