Grasshopper SDK
IGH_DataAccess.DisableGapLogic Method
 Call this function if you want to disable the gap null logic for the current iteration.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void DisableGapLogic()
Sub DisableGapLogic
See Also
Reference
IGH_DataAccess Interface
DisableGapLogic Overload
Grasshopper.Kernel Namespace