Grasshopper SDK
GH_Viewport.Zoom Property
 Gets or sets the Zoom factor of the viewport. Please assign only sensible values.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float Zoom { get; set; }
Public Property Zoom As Single
	Get
	Set
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.Zoom"]
See Also
Reference
GH_Viewport Class
Zoom Overload
Grasshopper.GUI.Canvas Namespace