Grasshopper SDK
GH_Gradient Events
The GH_Gradient type exposes the following members.
Events
Name | Description
GradientChanged
SelectionChanged
Top
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace