Grasshopper SDK
IGH_DocumentObject.RecordUndoEvent Method (GH_UndoRecord)
 Record an entire undo record.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void RecordUndoEvent(
	GH_UndoRecord record
)
Sub RecordUndoEvent (
	record As GH_UndoRecord
)
Parameters
record
Type: Grasshopper.Kernel.Undo.GH_UndoRecord
Record to push.
See Also
Reference
IGH_DocumentObject Interface
RecordUndoEvent Overload
Grasshopper.Kernel Namespace