Grasshopper SDK
GH_Canvas.UpdateDocumentPreview Method
 Call this method to update the preview thumbnail for the currently loaded document. If no document is currently loaded, nothing will happen.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void UpdateDocumentPreview()
Public Sub UpdateDocumentPreview
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace