Grasshopper SDK
GH_Grip.ColourLeft Property
 Gets the colour to the left of this grip.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color ColourLeft { get; set; }
Public Property ColourLeft As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_Grip.ColourLeft"]
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace