Grasshopper SDK
GH_AsynchFileData.StopPeriodicUpdate Method
 Stop any periodic updates.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void StopPeriodicUpdate()
Public Sub StopPeriodicUpdate
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace