Grasshopper SDK
GH_SpinForce Class
 Rotational spin force for IGH_Fields.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_FieldElement
 Grasshopper.Kernel.Types.GH_SpinForce
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_SpinForce : GH_FieldElement
Public Class GH_SpinForce
	Inherits GH_FieldElement
The GH_SpinForce type exposes the following members.
Constructors
Name | Description
GH_SpinForce
Initializes a new instance of the GH_SpinForce class
Top
Properties
Name | Description
BoundingBox |  (Overrides GH_FieldElement.BoundingBox.)
Decay
ElementGuid |  (Overrides GH_FieldElement.ElementGuid.)
Plane
Radius
Strength
Top
Methods
Name | Description
DrawViewportWires |  (Overrides GH_FieldElement.DrawViewportWires(GH_PreviewWireArgs).)
Duplicate |  (Overrides GH_FieldElement.Duplicate().)
Force |  (Overrides GH_FieldElement.Force(Point3d).)
Read |  (Overrides GH_FieldElement.Read(GH_IReader).)
Write |  (Overrides GH_FieldElement.Write(GH_IWriter).)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace