Grasshopper SDK
GH_SliderBase.TextInputHandlerDelegate Property
 Gets or sets the custom handler for text input. If you do not set a custom handler the default behaviour will be used.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SliderBase.TextInputHandler TextInputHandlerDelegate { get; set; }
Public Property TextInputHandlerDelegate As GH_SliderBase.TextInputHandler
	Get
	Set
Property Value
Type: GH_SliderBase.TextInputHandler
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.TextInputHandlerDelegate"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace