Grasshopper SDK
GH_Integer Constructor (Int32)
Initializes a new instance of the GH_Integer class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Integer(
	int number
)
Public Sub New (
	number As Integer
)
Parameters
number
Type: System.Int32
See Also
Reference
GH_Integer Class
GH_Integer Overload
Grasshopper.Kernel.Types Namespace