Grasshopper SDK
CentralSettings.AuthorCompanyChanged Event
 Raised whenever the AuthorCompany field is changed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.AuthorCompanyChangedEventHandler AuthorCompanyChanged
Public Shared Event AuthorCompanyChanged As CentralSettings.AuthorCompanyChangedEventHandler
Value
Type: Grasshopper.CentralSettings.AuthorCompanyChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace