Grasshopper SDK
GH_DocumentObject.OnObjectChanged Method (GH_ObjectEventType, Object)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnObjectChanged(
	GH_ObjectEventType eventType,
	Object tag
)
Public Sub OnObjectChanged (
	eventType As GH_ObjectEventType,
	tag As Object
)
Parameters
eventType
Type: Grasshopper.Kernel.GH_ObjectEventType
tag
Type: System.Object
Implements
IGH_DocumentObject.OnObjectChanged(GH_ObjectEventType, Object)
See Also
Reference
GH_DocumentObject Class
OnObjectChanged Overload
Grasshopper.Kernel Namespace