Grasshopper SDK
IGH_Structure.Flatten Method
 Flattens the entire structure into a single path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void Flatten(
	GH_Path path = null
)
Sub Flatten (
	Optional path As GH_Path = Nothing
)
Parameters
path (Optional)
Type: Grasshopper.Kernel.Data.GH_Path
The path of the flattened data. If null, the path will be {0}
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace