Grasshopper SDK
GH_GooProxy<T>.Owner Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected T Owner { get; }
Protected ReadOnly Property Owner As T
	Get
Property Value
Type: T
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GooProxy`1.Owner"]
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace