Grasshopper SDK
GH_Document.SelectedCount Property
 Gets the number of selected objects
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int SelectedCount { get; }
Public ReadOnly Property SelectedCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.SelectedCount"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace