Grasshopper SDK
GH_DigitScrollerBase.DigitBoxWidth Field
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static readonly int DigitBoxWidth
Public Shared ReadOnly DigitBoxWidth As Integer
Field Value
Type: Int32
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace