Grasshopper SDK
GH_Document.DestroyProxySources Method
 Remove all remaining proxy sources from the document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DestroyProxySources()
Public Sub DestroyProxySources
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace