Grasshopper SDK
GH_SliderBase.RailDarkColour Property
 Gets or sets the dark colour used to draw rails and ticks.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color RailDarkColour { get; set; }
Public Property RailDarkColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.RailDarkColour"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace