Grasshopper SDK
IGH_DocumentObject.TriggerAutoSave Method (GH_AutoSaveTrigger, Guid)
 Triggers the AutoSave function on the owner document with a custom flag.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void TriggerAutoSave(
	GH_AutoSaveTrigger trigger,
	Guid id
)
Sub TriggerAutoSave (
	trigger As GH_AutoSaveTrigger,
	id As Guid
)
Parameters
trigger
Type: Grasshopper.Kernel.GH_AutoSaveTrigger
Reason for the autosave operation. It is possible that a user has decided to avoid autosave events for specific types, so if you can, try and provide a correct trigger flag.
id
Type: System.Guid
ID of autosave event. Consecutive autosave requests with the same ID will be ignored.
See Also
Reference
IGH_DocumentObject Interface
TriggerAutoSave Overload
Grasshopper.Kernel Namespace