Grasshopper SDK
GH_GraphicsUtil.OffsetColour Method (Color, Int32, Int32, Int32)
 Add a fixed value to all the channels in a colour.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color OffsetColour(
	Color col,
	int redShift,
	int greenShift,
	int blueShift
)
Public Shared Function OffsetColour (
	col As Color,
	redShift As Integer,
	greenShift As Integer,
	blueShift As Integer
) As Color
Parameters
col
Type: System.Drawing.Color
The colour to mutate
redShift
Type: System.Int32
Offset value for red channel (-255 ~ +255).
greenShift
Type: System.Int32
Offset value for green channel (-255 ~ +255).
blueShift
Type: System.Int32
Offset value for blue channel (-255 ~ +255).
Return Value
Type: Color
The offsetted colour.
Remarks
The alpha channel of the colour is not offset.
See Also
Reference
GH_GraphicsUtil Class
OffsetColour Overload
Grasshopper.GUI Namespace