Grasshopper SDK
GH_PointRefData.SetCurveParam Method
 Set the curve reference parameter based on the value of m_RefType and the curve parameter
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool SetCurveParam(
	Curve c,
	double t
)
Public Function SetCurveParam (
	c As Curve,
	t As Double
) As Boolean
Parameters
c
Type: Curve
The curve to act on
t
Type: System.Double
The parameter on the curve domain which is to be translated
Return Value
Type: Boolean
True on success
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace