Grasshopper SDK
GH_Document.FindAllDownstreamObjects Method (IGH_ActiveObject, GH_Document.GH_ActiveObjectFilter)
 Find all objects that depend in some way on the Source.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_ActiveObject> FindAllDownstreamObjects(
	IGH_ActiveObject from,
	GH_Document.GH_ActiveObjectFilter filter
)
Public Function FindAllDownstreamObjects (
	from As IGH_ActiveObject,
	filter As GH_Document.GH_ActiveObjectFilter
) As List(Of IGH_ActiveObject)
Parameters
from
Type: Grasshopper.Kernel.IGH_ActiveObject
Object to start searching from.
filter
Type: Grasshopper.Kernel.GH_Document.GH_ActiveObjectFilter
The inclusion delegate
Return Value
Type: List<IGH_ActiveObject>
See Also
Reference
GH_Document Class
FindAllDownstreamObjects Overload
Grasshopper.Kernel Namespace