Grasshopper SDK
GH_ColourCube Constructor
 Create a new instance of this class.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ColourCube(
	Rectangle box,
	GH_ColourSpace space,
	Point4d color
)
Public Sub New (
	box As Rectangle,
	space As GH_ColourSpace,
	color As Point4d
)
Parameters
box
Type: System.Drawing.Rectangle
Rectangle containing entire colour cube. Should be square.
space
Type: Grasshopper.GUI.Base.GH_ColourSpace
color
Type: Point4d
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace