Grasshopper SDK
DataTree<T>.SimplifyPaths Method
 Simplify the branches in this tree by removing all identical path entries. The length of the shortest path will be indicative of the similarity search depth. If this tree only contains a single branch, the branch wil be simplified to its last index.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SimplifyPaths()
Public Sub SimplifyPaths
See Also
Reference
DataTree<T> Class
Grasshopper Namespace