Grasshopper SDK
GH_Path.ToString Method (Boolean)
 Concatenates the indices in the path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string ToString(
	bool includeBrackets
)
Public Function ToString (
	includeBrackets As Boolean
) As String
Parameters
includeBrackets
Type: System.Boolean
If True, brackets will be prepended and appended to the path string.
Return Value
Type: String
See Also
Reference
GH_Path Class
ToString Overload
Grasshopper.Kernel.Data Namespace