Grasshopper SDK
GH_DocumentObject.OnObjectChanged Method (GH_ObjectChangedEventArgs)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnObjectChanged(
	GH_ObjectChangedEventArgs e
)
Public Sub OnObjectChanged (
	e As GH_ObjectChangedEventArgs
)
Parameters
e
Type: Grasshopper.Kernel.GH_ObjectChangedEventArgs
Implements
IGH_DocumentObject.OnObjectChanged(GH_ObjectChangedEventArgs)
See Also
Reference
GH_DocumentObject Class
OnObjectChanged Overload
Grasshopper.Kernel Namespace