Grasshopper SDK
GH_Canvas.ActiveWidget Property
 Gets or sets the currently active widget.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Widget ActiveWidget { get; set; }
Public Property ActiveWidget As IGH_Widget
	Get
	Set
Property Value
Type: IGH_Widget
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.ActiveWidget"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace