Grasshopper SDK
DataTree<T>.BranchCount Property
 Gets the number of branches defined in this tree.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int BranchCount { get; }
Public ReadOnly Property BranchCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.DataTree`1.BranchCount"]
See Also
Reference
DataTree<T> Class
Grasshopper Namespace