Grasshopper SDK
GH_SettingsCategory.Description Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string Description { get; }
Public Overridable ReadOnly Property Description As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_SettingsCategory.Description"]
Implements
IGH_SettingCategory.Description
See Also
Reference
GH_SettingsCategory Class
Grasshopper.GUI Namespace