Grasshopper SDK
GH_LineCharge.Force Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override Vector3d Force(
	Point3d location
)
Public Overrides Function Force (
	location As Point3d
) As Vector3d
Parameters
location
Type: Point3d
Return Value
Type: Vector3d
See Also
Reference
GH_LineCharge Class
Grasshopper.Kernel.Types Namespace