Grasshopper SDK
IGH_ActiveObject.ProcessorTime Property
 Gets the most recent measured processor time.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
TimeSpan ProcessorTime { get; }
ReadOnly Property ProcessorTime As TimeSpan
	Get
Property Value
Type: TimeSpan
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ActiveObject.ProcessorTime"]
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace