Grasshopper SDK
Rotation Constructor (Point3d, Vector3d, Double)
Initializes a new instance of the Rotation class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rotation(
	Point3d center,
	Vector3d axis,
	double angle
)
Public Sub New (
	center As Point3d,
	axis As Vector3d,
	angle As Double
)
Parameters
center
Type: Point3d
axis
Type: Vector3d
angle
Type: System.Double
See Also
Reference
Rotation Class
Rotation Overload
Grasshopper.Kernel.Types.Transforms Namespace