Grasshopper SDK
GH_Document.TogglePreviewFlags Method (List<IGH_DocumentObject>)
 Toggle the preview flags of all specified objects
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void TogglePreviewFlags(
	List<IGH_DocumentObject> objects
)
Public Sub TogglePreviewFlags (
	objects As List(Of IGH_DocumentObject)
)
Parameters
objects
Type: System.Collections.Generic.List<IGH_DocumentObject>
See Also
Reference
GH_Document Class
TogglePreviewFlags Overload
Grasshopper.Kernel Namespace