Grasshopper SDK
GH_DocumentObject.OnPreviewExpired Method
 Raises the PreviewExpired event on the toplevel object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnPreviewExpired(
	bool redraw
)
Public Sub OnPreviewExpired (
	redraw As Boolean
)
Parameters
redraw
Type: System.Boolean
If True, the viewports will be immediately redrawn.
Implements
IGH_DocumentObject.OnPreviewExpired(Boolean)
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace