Grasshopper SDK
GH_Document.ConvertFullNamesToNickNames Method
 Convert all nicknames to original nicknames if they are equal to the default full name. There will be no undo record associated with this operation.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ConvertFullNamesToNickNames()
Public Sub ConvertFullNamesToNickNames
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace