Grasshopper SDK
GH_AutoSaveSettings.SaveOnObjectRemovedChanged Event
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_AutoSaveSettings.SaveOnObjectRemovedChangedEventHandler SaveOnObjectRemovedChanged
Public Shared Event SaveOnObjectRemovedChanged As GH_AutoSaveSettings.SaveOnObjectRemovedChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_AutoSaveSettings.SaveOnObjectRemovedChangedEventHandler
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace