Grasshopper SDK
GH_Canvas.GetGraphicsObject Method
 Gets a graphics object for this control. You are not allowed to draw with this object, use it only for visibility testing and such. If you're inside a canvas update, use the Graphics() property instead. You must dispose of the Graphics object returned by this method or resources will be leaked.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Graphics GetGraphicsObject(
	bool setupDisplayTransform
)
Public Function GetGraphicsObject (
	setupDisplayTransform As Boolean
) As Graphics
Parameters
setupDisplayTransform
Type: System.Boolean
If true, the display transform will be added to the graphics object.
Return Value
Type: Graphics
A non-drawing Graphics object on success or null on failure..
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace