Grasshopper SDK
IGH_DocumentObject.IconDisplayMode Property
 Gets the current display mode of the object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_IconDisplayMode IconDisplayMode { get; set; }
Property IconDisplayMode As GH_IconDisplayMode
	Get
	Set
Property Value
Type: GH_IconDisplayMode
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_DocumentObject.IconDisplayMode"]
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace