Grasshopper SDK
GH_Canvas.ShowComponentSearchBox Method
 Display the component Search dialog at the current mouse location. The dialog cannot be shown if ModifiersEnabled=False.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ShowComponentSearchBox()
Public Function ShowComponentSearchBox As Boolean
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Canvas Class
ShowComponentSearchBox Overload
Grasshopper.GUI.Canvas Namespace