Grasshopper SDK
GH_Guid Constructor (Guid)
Initializes a new instance of the GH_Guid class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Guid(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
GH_Guid Class
GH_Guid Overload
Grasshopper.Kernel.Types Namespace