Grasshopper SDK
GH_StructurePath.DuplicatePath Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_StructurePath DuplicatePath()
Public Function DuplicatePath As GH_StructurePath
Return Value
Type: GH_StructurePath
See Also
Reference
GH_StructurePath Class
Grasshopper.Kernel.Types Namespace