Grasshopper SDK
GH_Capsule.JaggedRight Property
 Gets whether the right edge of this capsule is jagged.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool JaggedRight { get; }
Public ReadOnly Property JaggedRight As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.JaggedRight"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace