Grasshopper SDK
GH_PreviewMesh Enumeration
 Enumerates possible meshing parameters for documents.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_PreviewMesh
Public Enumeration GH_PreviewMesh
Members
Member name | Value | Description
None | 0 |  No preview meshes.
LowQuality | 1 |  Rhino default for coarse meshes.
HighQuality | 2 |  Rhino default for smooth meshes.
Document | 3 |  Same meshing parameters as the current document.
Custom | 4 |  Custom meshing parameters.
See Also
Reference
Grasshopper.Kernel Namespace