Grasshopper SDK
GH_FontPicker.CreateFontPickerWindow Method
 Create a new window containing a Font Picker object and OK, Cancel buttons. Picked fonts will be stored in the Tag field of the form.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Form CreateFontPickerWindow(
	Font defaultFont
)
Public Shared Function CreateFontPickerWindow (
	defaultFont As Font
) As Form
Parameters
defaultFont
Type: System.Drawing.Font
Return Value
Type: Form
A window with a font picker.
See Also
Reference
GH_FontPicker Class
Grasshopper.GUI Namespace