Grasshopper SDK
GH_Document.ClusterInputHooks Method
 Gets a sorted list of all the cluster input hooks.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ClusterInputHook[] ClusterInputHooks()
Public Function ClusterInputHooks As GH_ClusterInputHook()
Return Value
Type: GH_ClusterInputHook[]
A list of hooks in the proper order (from top to bottom, left to right).
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace