Grasshopper SDK
IGH_PreviewData.ClippingBox Property
 Gets the clipping box for this data. The clipping box is typically the same as the boundingbox.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
BoundingBox ClippingBox { get; }
ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_PreviewData.ClippingBox"]
Return Value
Type: BoundingBox
The clipping box for this object.
See Also
Reference
IGH_PreviewData Interface
Grasshopper.Kernel Namespace