Grasshopper SDK
GH_GooProxy<T>.UserString Property
 Gets or sets the user-defined string that describes this proxy. This only really makes sense if the Proxy is Parsable.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string UserString { get; set; }
Public Property UserString As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GooProxy`1.UserString"]
Return Value
Type: String
The UserString value or the value of FormatInstance() if UserString has not been assigned.
Implements
IGH_GooProxy.UserString
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace