Grasshopper SDK
GH_PreviewArgs.Display Property
 Gets the Pipeline that is being used to draw the current preview.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DisplayPipeline Display { get; }
Public ReadOnly Property Display As DisplayPipeline
	Get
Property Value
Type: DisplayPipeline
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewArgs.Display"]
Implements
IGH_PreviewArgs.Display
See Also
Reference
GH_PreviewArgs Class
Grasshopper.Kernel Namespace