Grasshopper SDK
GH_Integer.DuplicateInteger Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Integer DuplicateInteger()
Public Function DuplicateInteger As GH_Integer
Return Value
Type: GH_Integer
See Also
Reference
GH_Integer Class
Grasshopper.Kernel.Types Namespace