Grasshopper SDK
GH_Circle Constructor (GH_Circle)
 Create a duplicate of another circle.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Circle(
	GH_Circle other
)
Public Sub New (
	other As GH_Circle
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Circle
Circle to mimic.
See Also
Reference
GH_Circle Class
GH_Circle Overload
Grasshopper.Kernel.Types Namespace