Grasshopper SDK
GH_Param<T>.Format Method
 Returns "Null" if the data is a null reference, otherwise calls ToString() on the Data instance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual string Format(
	T Data
)
Protected Overridable Function Format (
	Data As T
) As String
Parameters
Data
Type: T
Return Value
Type: String
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace