Grasshopper SDK
GH_Painter.DrawRecipientLinks Method (IGH_Param)
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void DrawRecipientLinks(
	IGH_Param param
)
Protected Sub DrawRecipientLinks (
	param As IGH_Param
)
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
See Also
Reference
GH_Painter Class
DrawRecipientLinks Overload
Grasshopper.GUI.Canvas Namespace