Grasshopper SDK
GH_VarParamEventArgs.Param Property
 Gets the parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Param Param { get; }
Public ReadOnly Property Param As IGH_Param
	Get
Property Value
Type: IGH_Param
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_VarParamEventArgs.Param"]
See Also
Reference
GH_VarParamEventArgs Class
Grasshopper.Kernel Namespace