Grasshopper SDK
GH_Document.GH_UndoUtil.CreateGenericObjectEvent Method
 Create a new undo record for a generic, single object change.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoRecord CreateGenericObjectEvent(
	string name,
	IGH_DocumentObject obj
)
Public Function CreateGenericObjectEvent (
	name As String,
	obj As IGH_DocumentObject
) As GH_UndoRecord
Parameters
name
Type: System.String
Name of undo record.
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
Object to be recorded.
Return Value
Type: GH_UndoRecord
A newly created undo record.
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace