Grasshopper SDK
GH_GraphicsUtil.AppendArc Method (Point3d, Point3d, Vector3d, GraphicsPath)
 Append an arc segment to a GraphicsPath. If the arc cannot be solved, a linear segment is appended instead.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void AppendArc(
	Point3d p0,
	Point3d p1,
	Vector3d dir,
	GraphicsPath path
)
Public Shared Sub AppendArc (
	p0 As Point3d,
	p1 As Point3d,
	dir As Vector3d,
	path As GraphicsPath
)
Parameters
p0
Type: Point3d
Start point of arc.
p1
Type: Point3d
End point of arc.
dir
Type: Vector3d
Tangent direction at start of arc.
path
Type: System.Drawing.Drawing2D.GraphicsPath
Path to append to.
See Also
Reference
GH_GraphicsUtil Class
AppendArc Overload
Grasshopper.GUI Namespace