Grasshopper SDK
GH_IndexRuleSet Class
 A collection of index rules.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_IndexRuleSet
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_IndexRuleSet
Public Class GH_IndexRuleSet
The GH_IndexRuleSet type exposes the following members.
Constructors
Name | Description
GH_IndexRuleSet
 Blank constructor. Creates an empty collection of rules.
Top
Properties
Name | Description
Count
 Gets the number of rules defined in this collection.
Rule
 Gets the rule at the specified index.
Top
Methods
Name | Description
AddAnyDigitRule
 Append a rule for any single digit.
AddAnyDigitsRule
 Append a rule for any amount of digits.
AddDigitPatternRule(Int32[])
 Append a rule for filtering digit patterns.
AddDigitPatternRule(Int32, Int32)
 Append a rule for filtering digit patterns. This pattern does not have an upper bound.
AddDigitPatternRule(Int32, Int32, Int32)
 Append a rule for filtering digit patterns.
AddDigitRule
 Append a single digit rule.
AddRangePatternRule
 Append a rule for filtering range patterns.
AddRangeRule
 Append a single range rule.
Evaluate
 Evaluate the index given the local rules.
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace