Grasshopper SDK
GH_DocumentIO.Paste Method
 Deserialize a Grasshopper document from the clipboard. On success, the internal document of this GH_DocumentIO instance will be set.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Paste(
	GH_ClipboardType clipboard
)
Public Function Paste (
	clipboard As GH_ClipboardType
) As Boolean
Parameters
clipboard
Type: Grasshopper.Kernel.GH_ClipboardType
Specifies the clipboard type to use.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace