Grasshopper SDK
GH_PersistentParam<T>.SetPersistentData Method (GH_Structure<T>)
 Assign a tree of items to the persistent data. This method will erase any existing data, record an undo event, raise the OnObjectChanged event for PersistentData flags and place a call to ExpireSolution(False). If you want to add a tree of data, you should use the appropriate overload for this method.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetPersistentData(
	GH_Structure<T> items
)
Public Sub SetPersistentData (
	items As GH_Structure(Of T)
)
Parameters
items
Type: Grasshopper.Kernel.Data.GH_Structure<T>
Items to add.
See Also
Reference
GH_PersistentParam<T> Class
SetPersistentData Overload
Grasshopper.Kernel Namespace