Grasshopper SDK
GH_Grip.Blend Method
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color Blend(
	Color A,
	Color B,
	double t
)
Public Shared Function Blend (
	A As Color,
	B As Color,
	t As Double
) As Color
Parameters
A
Type: System.Drawing.Color
B
Type: System.Drawing.Color
t
Type: System.Double
Return Value
Type: Color
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace