Grasshopper SDK
CentralSettings.GetLoadMechanism Method
 Gets what load mechanism has been specified for a certain plugin.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_LoadingDemand GetLoadMechanism(
	string pluginName
)
Public Shared Function GetLoadMechanism (
	pluginName As String
) As GH_LoadingDemand
Parameters
pluginName
Type: System.String
The name of the plugin file (without the extension).
Return Value
Type: GH_LoadingDemand
The user-defined load mechanism.
See Also
Reference
CentralSettings Class
Grasshopper Namespace