Grasshopper SDK
GH_GooProxy<T>.IsParsable Property
 Gets a value indicating whether or not the type can be instantiated from a String.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool IsParsable { get; }
Public Overridable ReadOnly Property IsParsable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GooProxy`1.IsParsable"]
Implements
IGH_GooProxy.IsParsable
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace