Grasshopper SDK
GH_DocumentObject.Menu_AppendSeparator Method
 Utility function for appending separators to a menu dropdown. If the dropdown is empty or if it already has a separator at the bottom, nothing will happen.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static ToolStripSeparator Menu_AppendSeparator(
	ToolStrip menu
)
Public Shared Function Menu_AppendSeparator (
	menu As ToolStrip
) As ToolStripSeparator
Parameters
menu
Type: System.Windows.Forms.ToolStrip
Menu to append separator to.
Return Value
Type: ToolStripSeparator
The appended separator or null if no separator was appended.
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace