Grasshopper SDK
GH_Field Constructor (GH_Field)
 Copy constructor.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Field(
	GH_Field other
)
Public Sub New (
	other As GH_Field
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Field
Field to duplicate.
See Also
Reference
GH_Field Class
GH_Field Overload
Grasshopper.Kernel.Types Namespace