Grasshopper SDK
GH_Line.A Field
 Start of line.
Namespace: GH_IO.Types
Assembly: GH_IO (in GH_IO.dll) Version: Rhino 6.0
Syntax
public GH_Point3D A
Public A As GH_Point3D
Field Value
Type: GH_Point3D
See Also
Reference
GH_Line Structure
GH_IO.Types Namespace