Grasshopper SDK
GH_ArchivedUndoAction.Serialize Method
 Serializes the obj into the local archive.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void Serialize(
	GH_ISerializable obj
)
Protected Sub Serialize (
	obj As GH_ISerializable
)
Parameters
obj
Type: GH_IO.GH_ISerializable
Object to serialize
See Also
Reference
GH_ArchivedUndoAction Class
Grasshopper.Kernel.Undo Namespace