Grasshopper SDK
GH_SliderBase.RailBrightColour Property
 Gets or sets the bright colour used to draw rails and ticks.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color RailBrightColour { get; set; }
Public Property RailBrightColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.RailBrightColour"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace