Grasshopper SDK
GH_Convert.GetBrepFromDocument Method
 Harvest a brep object from a Rhino document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool GetBrepFromDocument(
	RhinoDoc doc,
	Guid id,
	out Brep brp
)
Public Shared Function GetBrepFromDocument (
	doc As RhinoDoc,
	id As Guid,
	<OutAttribute> ByRef brp As Brep
) As Boolean
Parameters
doc
Type: RhinoDoc
Document to search.
id
Type: System.Guid
ID of brep object.
brp
Type: Brep
Brep result.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace