Grasshopper SDK
GH_NamedView.SetToViewport Method (GH_Viewport)
 Set the named view to a viewport.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetToViewport(
	GH_Viewport vp
)
Public Sub SetToViewport (
	vp As GH_Viewport
)
Parameters
vp
Type: Grasshopper.GUI.Canvas.GH_Viewport
Viewport to set.
See Also
Reference
GH_NamedView Class
SetToViewport Overload
Grasshopper.GUI.Canvas Namespace