Grasshopper SDK
IGH_ObjectProxy.DuplicateProxy Method
 Create a duplicate of this proxy.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_ObjectProxy DuplicateProxy()
Function DuplicateProxy As IGH_ObjectProxy
Return Value
Type: IGH_ObjectProxy
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace