Grasshopper SDK
GH_BitmapChannel Enumeration
 Lists all possible channels for 24 and 32 bit bitmaps.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[FlagsAttribute]
public enum GH_BitmapChannel
<FlagsAttribute>
Public Enumeration GH_BitmapChannel
Members
Member name | Value | Description
A | 1 | Alpha channel, not all bitmaps support this.
R | 2 | Red channel.
G | 4 | Green channel.
B | 8 | Blue channel.
RGB | 14 | Red, Green and Blue channel mashup.
ARGB | 15 | Alpha, Red, Green and Blue channel mashup.
See Also
Reference
Grasshopper.Kernel Namespace