Grasshopper SDK
Folders.ToolsFolder Property
Note: This API is now obsolete.
 Gets the directory that contains the additional executables that ship with Grasshopper.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("There no longer is a Tools folder, all tools are now directly in the PluginFolder")]
public static string ToolsFolder { get; }
<ObsoleteAttribute("There no longer is a Tools folder, all tools are now directly in the PluginFolder")>
Public Shared ReadOnly Property ToolsFolder As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.ToolsFolder"]
See Also
Reference
Folders Class
Grasshopper Namespace