Grasshopper SDK
IGH_Attributes.Selected Property
 Gets or sets the selected state of the top-level attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool Selected { get; set; }
Property Selected As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.Selected"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace