Grasshopper SDK
GH_PathOffset.OffsetPath Method (GH_Path, Int32, GH_Path, Int32)
 Offset a path + index value without wrapping.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool OffsetPath(
	GH_Path path,
	int index,
	ref GH_Path rel_path,
	ref int rel_index
)
Public Function OffsetPath (
	path As GH_Path,
	index As Integer,
	ByRef rel_path As GH_Path,
	ByRef rel_index As Integer
) As Boolean
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to offset.
index
Type: System.Int32
Item to offset.
rel_path
Type: Grasshopper.Kernel.Data.GH_Path
Offsetted path.
rel_index
Type: System.Int32
Offsetted index.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_PathOffset Class
OffsetPath Overload
Grasshopper.Kernel.Data Namespace