Grasshopper SDK
GH_ScrollBarVerticalBase.ScrollBar Method (RectangleF)
 Compute the size and position of the scroll bar in the scroll rail.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RectangleF ScrollBar(
	RectangleF rail
)
Public Function ScrollBar (
	rail As RectangleF
) As RectangleF
Parameters
rail
Type: System.Drawing.RectangleF
Rail for scroll bar to move around in.
Return Value
Type: RectangleF
A rectangle describing the location and extends of the scroll bar.
See Also
Reference
GH_ScrollBarVerticalBase Class
ScrollBar Overload
Grasshopper.GUI.Base Namespace