Grasshopper SDK
GH_ParserOperator.m_description Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string m_description
Public m_description As String
Field Value
Type: String
See Also
Reference
GH_ParserOperator Class
Grasshopper.Kernel.Expressions Namespace