Grasshopper SDK
GH_Format.FormatKeys Method
 Format a keys enumeration as though it's a menu shortcut
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatKeys(
	Keys keys
)
Public Shared Function FormatKeys (
	keys As Keys
) As String
Parameters
keys
Type: System.Windows.Forms.Keys
Key data to format
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace