Grasshopper SDK
GH_DocumentTreeNode.Document Property
 Gets the document at this node.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document Document { get; }
Public ReadOnly Property Document As GH_Document
	Get
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentTreeNode.Document"]
See Also
Reference
GH_DocumentTreeNode Class
Grasshopper.Kernel Namespace