Grasshopper SDK
GH_Interval2D Constructor (UVInterval)
 Duplicates a one-dimensional interval in both directions.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Interval2D(
	UVInterval uv
)
Public Sub New (
	uv As UVInterval
)
Parameters
uv
Type: Grasshopper.Kernel.Types.UVInterval
UVInterval value.
See Also
Reference
GH_Interval2D Class
GH_Interval2D Overload
Grasshopper.Kernel.Types Namespace