Grasshopper SDK
GH_Canvas.CanvasPostPaintWidgets Event
 Raised after widgets are drawn. This is the final event in the Drawing pipeline.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPostPaintWidgetsEventHandler CanvasPostPaintWidgets
Public Event CanvasPostPaintWidgets As GH_Canvas.CanvasPostPaintWidgetsEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPostPaintWidgetsEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace