Grasshopper SDK
GH_Format.FormatArc Method (Arc)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatArc(
	Arc data
)
Public Shared Function FormatArc (
	data As Arc
) As String
Parameters
data
Type: Arc
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatArc Overload
Grasshopper.Kernel Namespace