Grasshopper SDK
GH_ColourPickerEventArgs.ColourPicker Property
 Gets the instance of the picker that raised the event.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ColourPickerBase ColourPicker { get; }
Public ReadOnly Property ColourPicker As GH_ColourPickerBase
	Get
Property Value
Type: GH_ColourPickerBase
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerEventArgs.ColourPicker"]
See Also
Reference
GH_ColourPickerEventArgs Class
Grasshopper.GUI.Base Namespace