Grasshopper SDK
GH_ColourPickerBase.Render Method
 Render this slider into a Graphics context.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Render(
	Graphics G
)
Public Sub Render (
	G As Graphics
)
Parameters
G
Type: System.Drawing.Graphics
Graphics to render with.
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace