Grasshopper SDK
GH_DocumentEditor.EditorFoldStateChanged Event
 This event is raised whenever the main windows folds or unfolds.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_DocumentEditor.EditorFoldStateChangedEventHandler EditorFoldStateChanged
Public Event EditorFoldStateChanged As GH_DocumentEditor.EditorFoldStateChangedEventHandler
Value
Type: Grasshopper.GUI.GH_DocumentEditor.EditorFoldStateChangedEventHandler
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace