Grasshopper SDK
GH_Material Methods
The GH_Material type exposes the following members.
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
CreateRhinoMaterial
 Creates a standard Rhino material from a colour.
CreateStandardMaterial
 Creates a standard Grasshopper material from a colour.
Duplicate
 Duplicate this material.
 (Overrides GH_Goo<T>.Duplicate().)
DuplicateMaterial
 Duplicate this material.
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
RefreshReferenceData
 If the material is a referenced material, this function will update the local values to match the reference.
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace