Grasshopper SDK
GH_PersistentParam<T>.SetPersistentData Method (Object[])
 Add a collection of values to the persistent data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetPersistentData(
	params Object[] values
)
Public Sub SetPersistentData (
	ParamArray values As Object()
)
Parameters
values
Type: System.Object[]
Values to add.
See Also
Reference
GH_PersistentParam<T> Class
SetPersistentData Overload
Grasshopper.Kernel Namespace