Grasshopper SDK
IGH_ActiveObject.MutableNickName Property
 Gets or sets a value that enables Nick name changes through the menu. The default is TRUE.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool MutableNickName { get; set; }
Property MutableNickName As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ActiveObject.MutableNickName"]
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace