Grasshopper SDK
GH_DigitScroller.DigitScroller Property
 Gets the internal scroller object.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DigitScrollerBase DigitScroller { get; }
Public ReadOnly Property DigitScroller As GH_DigitScrollerBase
	Get
Property Value
Type: GH_DigitScrollerBase
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DigitScroller.DigitScroller"]
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace