Grasshopper SDK
GH_Point.GH_PointProxy Constructor
Initializes a new instance of the GH_Point.GH_PointProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PointProxy(
	GH_Point Value
)
Public Sub New (
	Value As GH_Point
)
Parameters
Value
Type: Grasshopper.Kernel.Types.GH_Point
See Also
Reference
GH_Point.GH_PointProxy Class
Grasshopper.Kernel.Types Namespace