Grasshopper SDK
GH_BackgroundStyle Enumeration
 Enumerates the pre-defined canvas background themes.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_BackgroundStyle
Public Enumeration GH_BackgroundStyle
Members
Member name | Value | Description
Solid | 0 |  Canvas background will be a single, solid colour.
Hatch | 1 |  Canvas background will be a GDI hatch brush.
GradientLeftRight | 10 |  Canvas background will be a linear horizontal gradient.
GradientTopBottom | 11 |  Canvas background will be a linear vertical gradient.
See Also
Reference
Grasshopper.GUI.Theme Namespace