Grasshopper SDK
GH_PathOffset.ParseString Method
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_PathOffset ParseString(
	string mask
)
Public Shared Function ParseString (
	mask As String
) As GH_PathOffset
Parameters
mask
Type: System.String
Return Value
Type: GH_PathOffset
See Also
Reference
GH_PathOffset Class
Grasshopper.Kernel.Data Namespace