Grasshopper SDK
GH_ComponentAttributes.RespondToMouseDown Method
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override GH_ObjectResponse RespondToMouseDown(
	GH_Canvas sender,
	GH_CanvasMouseEvent e
)
Public Overrides Function RespondToMouseDown (
	sender As GH_Canvas,
	e As GH_CanvasMouseEvent
) As GH_ObjectResponse
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
e
Type: Grasshopper.GUI.GH_CanvasMouseEvent
Return Value
Type: GH_ObjectResponse
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace