Grasshopper SDK
GH_DebugDescriptionWriter.CloseBlock Method
 Close the current block and decrease the depth by 1.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CloseBlock()
Public Sub CloseBlock
See Also
Reference
GH_DebugDescriptionWriter Class
Grasshopper.Kernel Namespace