Grasshopper SDK
GH_ParserSymbol Constructor (String, GH_ParserTokenClass, GH_ParserPrecedence)
Initializes a new instance of the GH_ParserSymbol class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ParserSymbol(
	string token,
	GH_ParserTokenClass class,
	GH_ParserPrecedence level
)
Public Sub New (
	token As String,
	class As GH_ParserTokenClass,
	level As GH_ParserPrecedence
)
Parameters
token
Type: System.String
class
Type: Grasshopper.Kernel.Expressions.GH_ParserTokenClass
level
Type: Grasshopper.Kernel.Expressions.GH_ParserPrecedence
See Also
Reference
GH_ParserSymbol Class
GH_ParserSymbol Overload
Grasshopper.Kernel.Expressions Namespace