Grasshopper SDK
GH_PluginUtil.SendKeyCodeToRhino Method (Int32)
 Send a key-code to the Rhino command line.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void SendKeyCodeToRhino(
	int key
)
Public Shared Sub SendKeyCodeToRhino (
	key As Integer
)
Parameters
key
Type: System.Int32
Key code.
See Also
Reference
GH_PluginUtil Class
SendKeyCodeToRhino Overload
Grasshopper.Plugin Namespace