Grasshopper SDK
GH_WindowsControlUtil Class
 Exposes some static (Shared) utility functions for setting text-rendering properties en masse.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_WindowsControlUtil
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_WindowsControlUtil
Public NotInheritable Class GH_WindowsControlUtil
Methods
Name | Description
FixTextRenderingDefault(Control)
 Sets the UseCompatibleTextRendering value to False on the control.
FixTextRenderingDefault(Control.ControlCollection)
 Recursively sets the UseCompatibleTextRendering value to False on each control.
Top
See Also
Reference
Grasshopper.GUI Namespace