Grasshopper SDK
GH_Variant Constructor (Complex)
 Create a new Complex variant.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant(
	Complex value
)
Public Sub New (
	value As Complex
)
Parameters
value
Type: Grasshopper.Kernel.Types.Complex
Value of Variant.
See Also
Reference
GH_Variant Class
GH_Variant Overload
Grasshopper.Kernel.Expressions Namespace