Grasshopper SDK
GH_Canvas.DocumentChangedEventHandler Delegate
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void DocumentChangedEventHandler(
	GH_Canvas sender,
	GH_CanvasDocumentChangedEventArgs e
)
Public Delegate Sub DocumentChangedEventHandler (
	sender As GH_Canvas,
	e As GH_CanvasDocumentChangedEventArgs
)
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
e
Type: Grasshopper.GUI.Canvas.GH_CanvasDocumentChangedEventArgs
See Also
Reference
Grasshopper.GUI.Canvas Namespace