Grasshopper SDK
Complex.Addition Operator (Complex, Complex)
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Complex operator +(
	Complex A,
	Complex B
)
Public Shared Operator + (
	A As Complex,
	B As Complex
) As Complex
Parameters
A
Type: Grasshopper.Kernel.Types.Complex
B
Type: Grasshopper.Kernel.Types.Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Addition Overload
Grasshopper.Kernel.Types Namespace