Grasshopper SDK
GH_SliderEventArgs.Slider Property
 Gets the instance of the slider that raised the event.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SliderBase Slider { get; }
Public ReadOnly Property Slider As GH_SliderBase
	Get
Property Value
Type: GH_SliderBase
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderEventArgs.Slider"]
See Also
Reference
GH_SliderEventArgs Class
Grasshopper.GUI.Base Namespace