Grasshopper SDK
IGH_Param.RemoveAllSources Method
 Remove all sources from this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void RemoveAllSources()
Sub RemoveAllSources
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace