Grasshopper SDK
GH_GraphicsUtil.ForegroundColour Method
 Calculates a suitable foreground color. If the background is lighter than 50%, the foreground will be darker, otherwise the foreground will be lighter.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color ForegroundColour(
	Color col,
	int contrast = 30
)
Public Shared Function ForegroundColour (
	col As Color,
	Optional contrast As Integer = 30
) As Color
Parameters
col
Type: System.Drawing.Color
Foreground colour that works well on the given background colour.
contrast (Optional)
Type: System.Int32
Contrast amount (in 0~255 range)
Return Value
Type: Color
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace