Grasshopper SDK
GH_SliderBase.Type Property
 Gets or sets the accuracy type of the slider.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SliderAccuracy Type { get; set; }
Public Property Type As GH_SliderAccuracy
	Get
	Set
Property Value
Type: GH_SliderAccuracy
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.Type"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace