Grasshopper SDK
GH_Param<T>.InstanceDescription Property
 Gets the description of this instance. The default description is about the amount and source of the local values.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string InstanceDescription { get; }
Public Overrides ReadOnly Property InstanceDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.InstanceDescription"]
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace