Grasshopper SDK
GH_Animator<T>.Interpolation Property
 Gets or sets the interpolation mode. Changing the mode during an animation will result in discontinuous motion.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Interpolation Interpolation { get; set; }
Public Property Interpolation As GH_Interpolation
	Get
	Set
Property Value
Type: GH_Interpolation
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Animator`1.Interpolation"]
See Also
Reference
GH_Animator<T> Class
Grasshopper.GUI Namespace