Grasshopper SDK
GH_Document.DestroyObjectTable Method
 Erase the Object fast lookup table. You must call this whenever you add or remove objects to or from the document while circumventing the regular channels.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DestroyObjectTable()
Public Sub DestroyObjectTable
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace