Grasshopper SDK
GH_IconPicker Class
 Provides a standard icon selection interface.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Grasshopper.GUI.GH_IconPicker
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_IconPicker : UserControl
Public Class GH_IconPicker
	Inherits UserControl
The GH_IconPicker type exposes the following members.
Constructors
Name | Description
GH_IconPicker
Initializes a new instance of the GH_IconPicker class
Top
Properties
Name | Description
Icon
 Gets or sets the icon to be displayed in this picker.
IconChanged
 Gets a value indicating whether or not the icon has been changed.
Top
Methods
Name | Description
Dispose
Releases the unmanaged resources used by the GH_IconPicker and optionally releases the managed resources
 (Overrides ContainerControl.Dispose(Boolean).)
Top
See Also
Reference
Grasshopper.GUI Namespace