Grasshopper SDK
GH_CanvasWireValidator.WireTarget Property
 Gets or sets the wire target filter.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid WireTarget { get; set; }
Public Property WireTarget As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasWireValidator.WireTarget"]
See Also
Reference
GH_CanvasWireValidator Class
Grasshopper.GUI.Canvas Namespace