Grasshopper SDK
GH_ExpressionParser.Op_BinaryLargerThanOrEqual Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_Variant Op_BinaryLargerThanOrEqual(
	GH_Variant A,
	GH_Variant B
)
Protected Function Op_BinaryLargerThanOrEqual (
	A As GH_Variant,
	B As GH_Variant
) As GH_Variant
Parameters
A
Type: Grasshopper.Kernel.Expressions.GH_Variant
B
Type: Grasshopper.Kernel.Expressions.GH_Variant
Return Value
Type: GH_Variant
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace