Grasshopper SDK
GH_ScrollBarVerticalBase Class
 Provides basic vertical scroll bar logic.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Base.GH_ScrollBarVerticalBase
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ScrollBarVerticalBase
Public Class GH_ScrollBarVerticalBase
The GH_ScrollBarVerticalBase type exposes the following members.
Constructors
Name | Description
GH_ScrollBarVerticalBase
Initializes a new instance of the GH_ScrollBarVerticalBase class
Top
Properties
Name | Description
Content
 Gets or sets the height of the content
ContentOffset
 Gets the vertical offset (in pixels) of the scrolled content.
Display
 Gets or sets the height of the display area.
Minimum
 Gets or sets the minimum height of the scrollbar.
Offset
 Gets the offset of the scroller.
OffsetNormalised
 Gets or sets the normalised offset of the scroller.
Top
Methods
Name | Description
BeginDrag
 Start a new drag operation.
ContinueDrag
 Continue a drag operation.
ScrollBar(Rectangle)
 Compute the size and position of the scroll bar in the scroll rail.
ScrollBar(RectangleF)
 Compute the size and position of the scroll bar in the scroll rail.
Top
See Also
Reference
Grasshopper.GUI.Base Namespace