Grasshopper SDK
GH_DocumentServer.SafeRemoveDocument Method
 Remove a document correctly from the server. This method shows user-interface prompts if there is unsaved data and will also save if needed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool SafeRemoveDocument(
	GH_Document document
)
Public Function SafeRemoveDocument (
	document As GH_Document
) As Boolean
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document to remove.
Return Value
Type: Boolean
True if the document was removed, false if otherwise.
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace