Grasshopper SDK
IGH_GooProxy.Valid Property
 Gets a value indicating whether this proxy represents valid data.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool Valid { get; }
ReadOnly Property Valid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_GooProxy.Valid"]
See Also
Reference
IGH_GooProxy Interface
Grasshopper.Kernel.Types Namespace