Grasshopper SDK
GH_GraphicsUtil.SolveArc Method (Double, Double, Double, Double, Double, Double, RectangleF, Single, Single)
 Create a GDI circular arc definition from start-point, end-point and tangent direction.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool SolveArc(
	double p0X,
	double p0Y,
	double p1X,
	double p1Y,
	double dx,
	double dy,
	ref RectangleF box,
	ref float angle,
	ref float sweep
)
Public Shared Function SolveArc (
	p0X As Double,
	p0Y As Double,
	p1X As Double,
	p1Y As Double,
	dx As Double,
	dy As Double,
	ByRef box As RectangleF,
	ByRef angle As Single,
	ByRef sweep As Single
) As Boolean
Parameters
p0X
Type: System.Double
p0Y
Type: System.Double
p1X
Type: System.Double
p1Y
Type: System.Double
dx
Type: System.Double
dy
Type: System.Double
box
Type: System.Drawing.RectangleF
angle
Type: System.Single
sweep
Type: System.Single
Return Value
Type: Boolean
See Also
Reference
GH_GraphicsUtil Class
SolveArc Overload
Grasshopper.GUI Namespace