Grasshopper SDK
GH_GraphicsUtil.InvertColour Method
 Computes the inverted colour. Alpha remains the same.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color InvertColour(
	Color col
)
Public Shared Function InvertColour (
	col As Color
) As Color
Parameters
col
Type: System.Drawing.Color
Return Value
Type: Color
Colour where RGB channels are set to 255-C.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace