Grasshopper SDK
GH_Convert.ToPoint Method
 Convert a floating point GDI point structure to an integer rounded point.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Point ToPoint(
	PointF in
)
Public Shared Function ToPoint (
	in As PointF
) As Point
Parameters
in
Type: System.Drawing.PointF
PointF to convert.
Return Value
Type: Point
Integer accuracy point.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace