Grasshopper SDK
GH_Link.CreateTopicLink Method (String, String, String)
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Link CreateTopicLink(
	string text,
	string topicName,
	string tooltip
)
Public Shared Function CreateTopicLink (
	text As String,
	topicName As String,
	tooltip As String
) As GH_Link
Parameters
text
Type: System.String
topicName
Type: System.String
tooltip
Type: System.String
Return Value
Type: GH_Link
See Also
Reference
GH_Link Class
CreateTopicLink Overload
Grasshopper.Documentation Namespace