Grasshopper SDK
GH_AssemblyInfo.IsCoreLibrary Property
 Gets whether this library is a Grasshopper core library. Core libraries are installed along with Grasshopper and thus should always be available anywhere.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsCoreLibrary { get; }
Public ReadOnly Property IsCoreLibrary As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.IsCoreLibrary"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace