Grasshopper SDK
GH_ListUtil.CountNonNullRefs<T> Method
 Count all object references in L
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int CountNonNullRefs<T>(
	List<T> L
)
Public Shared Function CountNonNullRefs(Of T) (
	L As List(Of T)
) As Integer
Parameters
L
Type: System.Collections.Generic.List<T>
List to parse
Type Parameters
T
Type of list
Return Value
Type: Int32
Number of proper objects in L
See Also
Reference
GH_ListUtil Class
Grasshopper.Kernel Namespace