Grasshopper SDK
GH_Plane.Origin Field
 Origin point of plane.
Namespace: GH_IO.Types
Assembly: GH_IO (in GH_IO.dll) Version: Rhino 6.0
Syntax
public GH_Point3D Origin
Public Origin As GH_Point3D
Field Value
Type: GH_Point3D
See Also
Reference
GH_Plane Structure
GH_IO.Types Namespace