Grasshopper SDK
GH_MemoryBitmap.Width Property
 Gets the width (in pixels) of the local image.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Width { get; }
Public ReadOnly Property Width As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_MemoryBitmap.Width"]
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace