Grasshopper SDK
GH_CapsuleRenderEngine.GetImpliedStyle Method (GH_Palette, IGH_Attributes)
 Static (Shared in VB) method for solving which palette style is implied by the properties.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_PaletteStyle GetImpliedStyle(
	GH_Palette palette,
	IGH_Attributes attributes
)
Public Shared Function GetImpliedStyle (
	palette As GH_Palette,
	attributes As IGH_Attributes
) As GH_PaletteStyle
Parameters
palette
Type: Grasshopper.GUI.Canvas.GH_Palette
Palette hint.
attributes
Type: Grasshopper.Kernel.IGH_Attributes
Attributes to parse for style details.
Return Value
Type: GH_PaletteStyle
See Also
Reference
GH_CapsuleRenderEngine Class
GetImpliedStyle Overload
Grasshopper.GUI.Canvas Namespace