Grasshopper SDK
GH_Structure<T>.Branch Property (Int32)
 Gets a limited access pointer to the data list at the specified index
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList this[
	int index
] { get; }
Public ReadOnly Property Branch (
	index As Integer
) As IList
	Get
Parameters
index
Type: System.Int32
Index of data to retrieve.
Property Value
Type: IList
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.Branch(System.Int32)"]
Implements
IGH_Structure.Branch[Int32]
See Also
Reference
GH_Structure<T> Class
Branch Overload
Grasshopper.Kernel.Data Namespace