Grasshopper SDK
GH_RelevantObjectData.ObjectType Property
 Gets the type of object indicated by this data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ObjectSpecies ObjectType { get; }
Public ReadOnly Property ObjectType As GH_ObjectSpecies
	Get
Property Value
Type: GH_ObjectSpecies
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RelevantObjectData.ObjectType"]
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace