Grasshopper SDK
GH_VarParamEventArgs.Side Property
 Gets the side of the parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_VarParamSide Side { get; }
Public ReadOnly Property Side As GH_VarParamSide
	Get
Property Value
Type: GH_VarParamSide
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_VarParamEventArgs.Side"]
See Also
Reference
GH_VarParamEventArgs Class
Grasshopper.Kernel Namespace