Grasshopper SDK
GH_CanvasDropTargetValidator.RemovedFromCanvas Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void RemovedFromCanvas(
	GH_Canvas canvas
)
Public Overrides Sub RemovedFromCanvas (
	canvas As GH_Canvas
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
See Also
Reference
GH_CanvasDropTargetValidator Class
Grasshopper.GUI.Canvas Namespace