Grasshopper SDK
GH_Viewport.Duplicate Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Viewport Duplicate()
Public Function Duplicate As GH_Viewport
Return Value
Type: GH_Viewport
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace