Grasshopper SDK
GH_AssemblyInfo.Location Property
 Gets the location this assembly was loaded from.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Location { get; }
Public ReadOnly Property Location As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.Location"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace