Grasshopper SDK
GH_Document.Modified Method
 Sets the modified flag of this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Modified()
Public Sub Modified
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace