Grasshopper SDK
GH_Circle.DuplicateGeometry Method
 Create a duplicate of this circle.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IGH_GeometricGoo DuplicateGeometry()
Public Overrides Function DuplicateGeometry As IGH_GeometricGoo
Return Value
Type: IGH_GeometricGoo
See Also
Reference
GH_Circle Class
Grasshopper.Kernel.Types Namespace