Grasshopper SDK
GH_Slider.RailFullColour Property
 Gets or sets the fill colour for the full portion of the rail.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color RailFullColour { get; set; }
Public Property RailFullColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.RailFullColour"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace