Grasshopper SDK
GH_Convert.ToNextPowerOfTen Method
 Round a number upwards to the nearest power of ten.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static double ToNextPowerOfTen(
	double num
)
Public Shared Function ToNextPowerOfTen (
	num As Double
) As Double
Parameters
num
Type: System.Double
Number to round.
Return Value
Type: Double
The power of ten equal to or higher than num.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace