Grasshopper SDK
GH_Convert.ToDouble Method
 Convert data into Doubles.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToDouble(
	Object data,
	out double destination,
	GH_Conversion conversion_level
)
Public Shared Function ToDouble (
	data As Object,
	<OutAttribute> ByRef destination As Double,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
destination
Type: System.Double
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace