Grasshopper SDK
GH_Variant.Evaluate Method
 If this variant represents a string, this function will attempt to evaluate that string and replace the data inside this variant.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Evaluate()
Public Function Evaluate As Boolean
Return Value
Type: Boolean
True if the string was evaluated, false if otherwise.
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace