Grasshopper SDK
GH_ResizableAttributes<T> Class
 These Attributes provide basic resizing logic.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_Attributes<T>
 Grasshopper.Kernel.Attributes.GH_ResizableAttributes<T>
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_ResizableAttributes<T> : GH_Attributes<T>
where T : IGH_DocumentObject
Public MustInherit Class GH_ResizableAttributes(Of T As IGH_DocumentObject)
	Inherits GH_Attributes(Of T)
Type Parameters
T
The GH_ResizableAttributes<T> type exposes the following members.
Constructors
Name | Description
GH_ResizableAttributes<T>
Initializes a new instance of the GH_ResizableAttributes<T> class
Top
Properties
Name | Description
MaximumSize
MinimumSize
SizingBorders
Top
Methods
Name | Description
RespondToMouseDown |  (Overrides GH_Attributes<T>.RespondToMouseDown(GH_Canvas, GH_CanvasMouseEvent).)
RespondToMouseMove |  (Overrides GH_Attributes<T>.RespondToMouseMove(GH_Canvas, GH_CanvasMouseEvent).)
RespondToMouseUp |  (Overrides GH_Attributes<T>.RespondToMouseUp(GH_Canvas, GH_CanvasMouseEvent).)
Top
See Also
Reference
Grasshopper.Kernel.Attributes Namespace