Grasshopper SDK
GH_Capsule.Contains Method
 Test a point for capsule containment.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Contains(
	PointF pt
)
Public Function Contains (
	pt As PointF
) As Boolean
Parameters
pt
Type: System.Drawing.PointF
Point to test.
Return Value
Type: Boolean
True if the point is on the interior of the capsule.
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace