Grasshopper SDK
GH_Variant Constructor (Double)
 Create a new Double variant.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant(
	double value
)
Public Sub New (
	value As Double
)
Parameters
value
Type: System.Double
Value of Variant.
See Also
Reference
GH_Variant Class
GH_Variant Overload
Grasshopper.Kernel.Expressions Namespace