Grasshopper SDK
GH_DocDiagramPainter.UnmapX Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int UnmapX(
	int x
)
Public Function UnmapX (
	x As Integer
) As Integer
Parameters
x
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace