Grasshopper SDK
GH_Path.IsCoincident Method (GH_Path)
 Test to see if this path is coincident with another path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsCoincident(
	GH_Path other
)
Public Function IsCoincident (
	other As GH_Path
) As Boolean
Parameters
other
Type: Grasshopper.Kernel.Data.GH_Path
Path to compare to.
Return Value
Type: Boolean
True if both paths are coincident (identical), false if not.
See Also
Reference
GH_Path Class
IsCoincident Overload
Grasshopper.Kernel.Data Namespace