Grasshopper SDK
GH_AutoSaveSettings.SaveOnObjectChangeChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void SaveOnObjectChangeChangedEventHandler()
Public Delegate Sub SaveOnObjectChangeChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace