Grasshopper SDK
SliderSnapRange.CompareTo Method
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int CompareTo(
	SliderSnapRange other
)
Public Function CompareTo (
	other As SliderSnapRange
) As Integer
Parameters
other
Type: Grasshopper.GUI.Base.SliderSnapRange
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
SliderSnapRange Structure
Grasshopper.GUI.Base Namespace