Grasshopper SDK
GH_DocFilePathEventArgs.OldFilePath Property
 Gets the old filepath, prior to the change that triggered this event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string OldFilePath { get; }
Public ReadOnly Property OldFilePath As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocFilePathEventArgs.OldFilePath"]
See Also
Reference
GH_DocFilePathEventArgs Class
Grasshopper.Kernel Namespace