Grasshopper SDK
GH_DragInfo.Box_Start Property
 Gets the dimensions of the drag box prior to dragging.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle Box_Start { get; }
Public ReadOnly Property Box_Start As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DragInfo.Box_Start"]
See Also
Reference
GH_DragInfo Class
Grasshopper.GUI Namespace