Grasshopper SDK
GH_Convert.ToCoordinates Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToCoordinates(
	Object data,
	ref double x,
	ref double y,
	ref double z,
	ref double w
)
Public Shared Function ToCoordinates (
	data As Object,
	ByRef x As Double,
	ByRef y As Double,
	ByRef z As Double,
	ByRef w As Double
) As Boolean
Parameters
data
Type: System.Object
x
Type: System.Double
y
Type: System.Double
z
Type: System.Double
w
Type: System.Double
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace