Grasshopper SDK
GH_Path.Length Property
 Returns the number of dimensions in the path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Length { get; }
Public ReadOnly Property Length As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Path.Length"]
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace