Grasshopper SDK
GH_ComponentParamServer.Sync Method (GH_ComponentParamServer.IGH_SyncObject, Int32)
 Sync changes from a prerecorded state. All param references in the sync object which are no longer present in the current server will be properly deleted. The sync object will be reset in the process, so you can only call this function with a specific Sync object once.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Sync(
	GH_ComponentParamServer.IGH_SyncObject sync_data,
	out int cleanup_count
)
Public Sub Sync (
	sync_data As GH_ComponentParamServer.IGH_SyncObject,
	<OutAttribute> ByRef cleanup_count As Integer
)
Parameters
sync_data
Type: Grasshopper.Kernel.GH_ComponentParamServer.IGH_SyncObject
Sync object. Should be obtained by calling EmitSyncObject()
cleanup_count
Type: System.Int32
Number of parameters that were cleaned up.
See Also
Reference
GH_ComponentParamServer Class
Sync Overload
Grasshopper.Kernel Namespace