Grasshopper SDK
GH_Convert.ToUVInterval_Primary Method
 Performs a direct cast from UVInterval or GH_Interval2D.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToUVInterval_Primary(
	Object data,
	ref UVInterval rc
)
Public Shared Function ToUVInterval_Primary (
	data As Object,
	ByRef rc As UVInterval
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Grasshopper.Kernel.Types.UVInterval
[out] Interval cast.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace