Grasshopper SDK
GH_DigitScrollerBase.RailColour Property
 Gets or sets the colour used for the rail line.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color RailColour { get; set; }
Public Property RailColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.RailColour"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace