Grasshopper SDK
GH_FieldElement.DrawViewportWires Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void DrawViewportWires(
	GH_PreviewWireArgs args
)
Public Overridable Sub DrawViewportWires (
	args As GH_PreviewWireArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_PreviewWireArgs
Implements
IGH_PreviewData.DrawViewportWires(GH_PreviewWireArgs)
See Also
Reference
GH_FieldElement Class
Grasshopper.Kernel.Types Namespace