Grasshopper SDK
GH_TooltipComponent.PopulateTooltipEventHandler Delegate
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void PopulateTooltipEventHandler(
	Object sender,
	GH_TooltipDisplayEventArgs e
)
Public Delegate Sub PopulateTooltipEventHandler (
	sender As Object,
	e As GH_TooltipDisplayEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.GUI.GH_TooltipDisplayEventArgs
See Also
Reference
Grasshopper.GUI Namespace