Grasshopper SDK
GH_Structure<T>.Read Method
 Read the entire GH_Structure from an archive. This method relies on the the serialization of the IGH_Goo items it contains. Also, the IGH_Goo T generic must have a public constructor that takes no arguments.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Read(
	GH_IReader reader
)
Public Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Archive to read from.
Return Value
Type: Boolean
True on success, false on failure.
Implements
GH_ISerializable.Read(GH_IReader)
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace