Grasshopper SDK
GH_Number Constructor
 Blank constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Number()
Public Sub New
See Also
Reference
GH_Number Class
GH_Number Overload
Grasshopper.Kernel.Types Namespace