Grasshopper SDK
GH_DocumentServer.DocumentNames Property
 Gets a string collection containing all the names of the documents in the global list.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string> DocumentNames { get; }
Public ReadOnly Property DocumentNames As List(Of String)
	Get
Property Value
Type: List<String>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentServer.DocumentNames"]
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace