Grasshopper SDK
GH_SliderBase.Bounds Property
 Gets or sets the bounds of the slider.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override Rectangle Bounds { get; set; }
Public Overrides Property Bounds As Rectangle
	Get
	Set
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.Bounds"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace