Grasshopper SDK
GH_Arrange Enumeration
 Enumerates possible types of object arrangement.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_Arrange
Public Enumeration GH_Arrange
Members
Member name | Value | Description
MoveToFront | 0 |  Put the objects on the top of the stack.
MoveForwards | 1 |  Objects are inserted above the first occluding object.
MoveToBack | 2 |  Put the objects on the bottom of the stack.
MoveBackwards | 3 |  Objects are inserted below the first occluded object.
See Also
Reference
Grasshopper.Kernel Namespace