Grasshopper SDK
GH_ColourPickerBase.MouseDoubleClick Method
 Respond to mouse-doubleclick events.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool MouseDoubleClick(
	MouseEventArgs args,
	PointF pt,
	Control owner,
	Matrix transform
)
Public Function MouseDoubleClick (
	args As MouseEventArgs,
	pt As PointF,
	owner As Control,
	transform As Matrix
) As Boolean
Parameters
args
Type: System.Windows.Forms.MouseEventArgs
Mouse Event arguments.
pt
Type: System.Drawing.PointF
Mouse cursor position in floating point accuracy.
owner
Type: System.Windows.Forms.Control
Owner control for this colour-picker.
transform
Type: System.Drawing.Drawing2D.Matrix
Display Transformation matrix of colour-picker.
Return Value
Type: Boolean
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace