Grasshopper SDK
GH_Document.ObjectsAdded Event
 Raised after a collection of objects was added to the document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Document.ObjectsAddedEventHandler ObjectsAdded
Public Event ObjectsAdded As GH_Document.ObjectsAddedEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.ObjectsAddedEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace