Grasshopper SDK
GH_Component.GH_OutputParamManager.ParamCount Property
 Returns the number of output parameters already part of this component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override int ParamCount { get; }
Public Overrides ReadOnly Property ParamCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.GH_OutputParamManager.ParamCount"]
See Also
Reference
GH_Component.GH_OutputParamManager Class
Grasshopper.Kernel Namespace