Grasshopper SDK
GH_ColourCube.S2 Property
 Gets the third point in the shadow point list. This point is the kink of the drop-shadow on the edge connecting C2 and C3.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point S2 { get; }
Public ReadOnly Property S2 As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourCube.S2"]
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace