Grasshopper SDK
GH_MeshingParameters.RhMesherSettings_Proxy.GridMaxCount Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int GridMaxCount { get; set; }
Public Property GridMaxCount As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_MeshingParameters.RhMesherSettings_Proxy.GridMaxCount"]
See Also
Reference
GH_MeshingParameters.RhMesherSettings_Proxy Class
Grasshopper.Kernel.Types Namespace