Grasshopper SDK
IGH_CanvasValidator.CanDeleteObject Method
 Validates whether a specific object can be deleted.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool CanDeleteObject(
	IGH_DocumentObject object
)
Function CanDeleteObject (
	object As IGH_DocumentObject
) As Boolean
Parameters
object
Type: Grasshopper.Kernel.IGH_DocumentObject
Return Value
Type: Boolean
See Also
Reference
IGH_CanvasValidator Interface
Grasshopper.GUI.Canvas Namespace