Grasshopper SDK
GH_Canvas.IsDocument Property
 Gets a value indicating whether or not a document is currently loaded in this canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsDocument { get; }
Public ReadOnly Property IsDocument As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.IsDocument"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace