Grasshopper SDK
GH_Component.Write Method
 Write all required data for deserialization to an IO archive.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool Write(
	GH_IWriter writer
)
Public Overrides Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Object to write with.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace