Grasshopper SDK
GH_PreviewUtil.AddVector Method
 Add a vector to the temporary Preview lists.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddVector(
	Line vector
)
Public Sub AddVector (
	vector As Line
)
Parameters
vector
Type: Line
Vector to add. Invalid vectors will be ignored.
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace