Grasshopper SDK
GH_Goo<T> Class
 Base class for IGH_Goo implementation. Takes care of some default behaviour.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<T>
 More...
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_Goo<T> : IGH_Goo
Public MustInherit Class GH_Goo(Of T)
	Implements IGH_Goo
Type Parameters
T
The GH_Goo<T> type exposes the following members.
Constructors
Name | Description
GH_Goo<T>()
 Blank constructor, m_value will be set to default (null for reference types, zeroes for value types)
GH_Goo<T>(T)
 Data constructor, m_value will be set to internal_data.
GH_Goo<T>(GH_Goo<T>)
 Copy constructor, copies the data from another GH_Goo(Of T) instance. Reference types will not be duplicated.
Top
Properties
Name | Description
IsValid
 Gets a value indicating whether or not the current value is valid.
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
TypeDescription
 Gets a description of the type of the implementation.
TypeName
 Gets the name of the type of the implementation.
Value
 Gets or sets the internal data.
Top
Methods
Name | Description
CastFrom
 Attempt a cast from generic data.
CastTo<Q>
 Attempt a cast to type Q.
Duplicate
 Make a complete duplicate of this instance. No shallow copies.
EmitProxy
 Create a new proxy for this instance. Return Null if this class does not support proxies.
Read
 Default behaviour is to return True.
ScriptVariable
 This function will be called when the local IGH_Goo instance disappears into a user Script. This would be an excellent place to cast your IGH_Goo type to a simple data type.
ToString
 Creates a string description of the current instance value.
 (Overrides Object.ToString().)
Write
 Default behaviour is to return True.
Top
Fields
Name | Description
m_value
Top
Remarks
Feel free to implement IGH_Goo directly though.
See Also
Reference
Grasshopper.Kernel.Types Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<T>
 Grasshopper.Kernel.Types.GH_Boolean
 Grasshopper.Kernel.Types.GH_Colour
 Grasshopper.Kernel.Types.GH_ComplexNumber
 Grasshopper.Kernel.Types.GH_Culture
 Grasshopper.Kernel.Types.GH_GeometricGoo<T>
 Grasshopper.Kernel.Types.GH_Guid
 Grasshopper.Kernel.Types.GH_Integer
 Grasshopper.Kernel.Types.GH_Interval
 Grasshopper.Kernel.Types.GH_Interval2D
 Grasshopper.Kernel.Types.GH_Material
 Grasshopper.Kernel.Types.GH_Matrix
 Grasshopper.Kernel.Types.GH_MeshFace
 Grasshopper.Kernel.Types.GH_MeshingParameters
 Grasshopper.Kernel.Types.GH_Number
 Grasshopper.Kernel.Types.GH_ObjectWrapper
 Grasshopper.Kernel.Types.GH_String
 Grasshopper.Kernel.Types.GH_StructurePath
 Grasshopper.Kernel.Types.GH_Time
 Grasshopper.Kernel.Types.GH_Transform
 Grasshopper.Kernel.Types.GH_Vector