Grasshopper SDK
GH_GraphicsUtil.ShadowRectangle Method (Graphics, Rectangle, Int32, Int32)
 Draws shadow edges on the interior of a rectangle.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void ShadowRectangle(
	Graphics g,
	Rectangle rec,
	int size = 10,
	int darkness = 50
)
Public Shared Sub ShadowRectangle (
	g As Graphics,
	rec As Rectangle,
	Optional size As Integer = 10,
	Optional darkness As Integer = 50
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
rec
Type: System.Drawing.Rectangle
Bounding rectangle.
size (Optional)
Type: System.Int32
Length of cast shadow.
darkness (Optional)
Type: System.Int32
Alpha component of darkness directly underneath the edge.
See Also
Reference
GH_GraphicsUtil Class
ShadowRectangle Overload
Grasshopper.GUI Namespace