Grasshopper SDK
IGH_VarParamComponent.ManagerConstructed Method
 This function is called whenever a new manager is constructed. You can override this function if you wish to modify the default behaviour of the manager.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void ManagerConstructed(
	GH_VarParamSide side,
	GH_VariableParameterManager manager
)
Sub ManagerConstructed (
	side As GH_VarParamSide,
	manager As GH_VariableParameterManager
)
Parameters
side
Type: Grasshopper.Kernel.GH_VarParamSide
manager
Type: GH_VariableParameterManager
See Also
Reference
IGH_VarParamComponent Interface
Grasshopper.Kernel Namespace