Grasshopper SDK
GH_DocumentObject.GetValue Method (String, Int32)
 Get an integer value from the component value table.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected int GetValue(
	string name,
	int default
)
Protected Function GetValue (
	name As String,
	default As Integer
) As Integer
Parameters
name
Type: System.String
Name of integer to retrieve.
default
Type: System.Int32
Default value to return in case of missing named value.
Return Value
Type: Int32
The integer value with the given name of the default value.
See Also
Reference
GH_DocumentObject Class
GetValue Overload
Grasshopper.Kernel Namespace