Grasshopper SDK
GH_CodeStringSegment.ReplaceToken Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ReplaceToken(
	string token,
	string replace,
	bool bIgnoreCase = true
)
Public Sub ReplaceToken (
	token As String,
	replace As String,
	Optional bIgnoreCase As Boolean = true
)
Parameters
token
Type: System.String
replace
Type: System.String
bIgnoreCase (Optional)
Type: System.Boolean
See Also
Reference
GH_CodeStringSegment Class
Grasshopper.Kernel.Expressions Namespace