Grasshopper SDK
GH_UndoRecord.ExpiresDisplay Property
 Gets the display expiration flag for this event. If True, the Rhino viewports will be redrawn once the entire undo record has been completed. If ExpiresSolution is set to true, ExpriresDisplay is implied.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ExpiresDisplay { get; }
Public ReadOnly Property ExpiresDisplay As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoRecord.ExpiresDisplay"]
See Also
Reference
GH_UndoRecord Class
Grasshopper.Kernel.Undo Namespace