Grasshopper SDK
GH_SettingsServer.DeleteValue Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DeleteValue(
	string key
)
Public Sub DeleteValue (
	key As String
)
Parameters
key
Type: System.String
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace