Grasshopper SDK
GH_DigitScrollerBase.PrefixBox Property
 Gets the box containing the prefix string. If there is no prefix the PrefixBox will be Rectangle.Empty
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle PrefixBox { get; }
Public ReadOnly Property PrefixBox As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.PrefixBox"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace