Grasshopper SDK
GH_AssemblyInfo.Version Property
 Gets the version code for this assembly.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string Version { get; }
Public Overridable ReadOnly Property Version As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.Version"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace