Grasshopper SDK
GH_Document.AutoSaveFileName Method
 Computes the autosave filename for a full grasshopper filepath.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string AutoSaveFileName(
	string filename
)
Public Shared Function AutoSaveFileName (
	filename As String
) As String
Parameters
filename
Type: System.String
Full path of Grasshopper file, including directories and extension.
Return Value
Type: String
The autosave filename (but not including the autosave directory).
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace