Grasshopper SDK
GH_Boolean Constructor
 Blank constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Boolean()
Public Sub New
See Also
Reference
GH_Boolean Class
GH_Boolean Overload
Grasshopper.Kernel.Types Namespace