Grasshopper SDK
GH_Canvas.CanvasPrePaintGroupsEventHandler Delegate
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void CanvasPrePaintGroupsEventHandler(
	GH_Canvas sender
)
Public Delegate Sub CanvasPrePaintGroupsEventHandler (
	sender As GH_Canvas
)
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
See Also
Reference
Grasshopper.GUI.Canvas Namespace