Grasshopper SDK
GH_Grip.MutateId Method
 Create a new grip ID.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void MutateId()
Public Sub MutateId
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace