Grasshopper SDK
GH_Slider.ShadowSize Property
 Gets or sets the size of the border shadow along all edges of the box.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Padding ShadowSize { get; set; }
Public Property ShadowSize As Padding
	Get
	Set
Property Value
Type: Padding
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.ShadowSize"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace