Grasshopper SDK
GH_Param<T>.Menu_AppendFlattenParameter Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void Menu_AppendFlattenParameter(
	ToolStripDropDown menu
)
Protected Sub Menu_AppendFlattenParameter (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace