Grasshopper SDK
GH_DocumentIO.Document Property
 Gets or sets the internal document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document Document { get; set; }
Public Property Document As GH_Document
	Get
	Set
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentIO.Document"]
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace