Grasshopper SDK
GH_ColourPickerBase.BaseColourBox Property
 Gets the rectangle containing the base colour swatch.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle BaseColourBox { get; }
Public ReadOnly Property BaseColourBox As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.BaseColourBox"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace