Grasshopper SDK
GH_CanvasMouseEvent.Button Property
 Gets which mouse button was pressed.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public MouseButtons Button { get; }
Public ReadOnly Property Button As MouseButtons
	Get
Property Value
Type: MouseButtons
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasMouseEvent.Button"]
See Also
Reference
GH_CanvasMouseEvent Class
Grasshopper.GUI Namespace