Grasshopper SDK
GH_TypeLib.id_gh_uvinterval Field
Grasshopper.Kernel.Types.UVInterval
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Guid id_gh_uvinterval
Public Shared id_gh_uvinterval As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace