Grasshopper SDK
SliderSnapRange Structure
 Represents a snap range on a slider.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public struct SliderSnapRange : IComparable<SliderSnapRange>
Public Structure SliderSnapRange
	Implements IComparable(Of SliderSnapRange)
The SliderSnapRange type exposes the following members.
Constructors
Name | Description
SliderSnapRange(Decimal)
Initializes a new instance of the SliderSnapRange class
SliderSnapRange(Decimal, Decimal)
Initializes a new instance of the SliderSnapRange class
Top
Properties
Name | Description
IsSingleton
Max
Min
Top
Methods
Name | Description
CanMerge
CompareTo
DistanceTo
 Compute the distance from a value to this snap range.
Merge
SnapValue
 Gets the snapped value of another value.
Top
See Also
Reference
Grasshopper.GUI.Base Namespace