Grasshopper SDK
GH_DocDiagramPainter.Image Property
 Gets the diagram image (only available after a call to PaintDiagram().
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap Image { get; }
Public ReadOnly Property Image As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_DocDiagramPainter.Image"]
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace