Grasshopper SDK
GH_Convert.ToGUID_Primary Method
 Performs a direct cast from Guid, GH_Guid, String and GH_String.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToGUID_Primary(
	Object data,
	ref Guid destination
)
Public Shared Function ToGUID_Primary (
	data As Object,
	ByRef destination As Guid
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.Guid
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace