Grasshopper SDK
GH_Point.ReferenceData Property
 Gets or sets the reference data of this point geometry.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PointRefData ReferenceData { get; set; }
Public Property ReferenceData As GH_PointRefData
	Get
	Set
Property Value
Type: GH_PointRefData
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Point.ReferenceData"]
Remarks
Reference data can be Null
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace