Grasshopper SDK
Translation.Reverse Method
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public ITransform Reverse()
Public Function Reverse As ITransform
Return Value
Type: ITransform
Implements
ITransform.Reverse()
See Also
Reference
Translation Class
Grasshopper.Kernel.Types.Transforms Namespace