Grasshopper SDK
Folders.VersionHistoryFile Property
 Gets the text file location where Grasshopper will save the latest version information.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string VersionHistoryFile { get; }
Public Shared ReadOnly Property VersionHistoryFile As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.VersionHistoryFile"]
See Also
Reference
Folders Class
Grasshopper Namespace