Grasshopper SDK
GH_Format.FormatDate Method (GH_Time)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatDate(
	GH_Time data
)
Public Shared Function FormatDate (
	data As GH_Time
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Time
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatDate Overload
Grasshopper.Kernel Namespace