Grasshopper SDK
Node3d<T>.ParentNode Property
 Gets the immediate parent of this node. Root nodes have no parent.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Node3d<T> ParentNode { get; }
Public ReadOnly Property ParentNode As Node3d(Of T)
	Get
Property Value
Type: Node3d<T>
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ParentNode"]
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace