Grasshopper SDK
GH_FileWatcher.IsDisposed Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsDisposed { get; }
Public ReadOnly Property IsDisposed As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FileWatcher.IsDisposed"]
See Also
Reference
GH_FileWatcher Class
Grasshopper.Kernel Namespace