Grasshopper SDK
GH_NamedView.SmoothFrame Event
 This event is raised during smooth animations.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_NamedView.SmoothFrameEventHandler SmoothFrame
Public Event SmoothFrame As GH_NamedView.SmoothFrameEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_NamedView.SmoothFrameEventHandler
See Also
Reference
GH_NamedView Class
Grasshopper.GUI.Canvas Namespace