Grasshopper SDK
GH_DigitScrollerBase.GH_MouseAction Enumeration
 Enumerates the possible actions due to mouse-down mouse-move events.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_MouseAction
Public Enumeration GH_MouseAction
Members
Member name | Value | Description
None | 0 |  No specific action.
SignDown | 1 |  Mouse down on sign symbol.
DigitDown | 2 |  Mouse down on scrolling digit.
DigitDrag | 3 |  Mouse move on scrolling digit.
RadixDown | 4 |  Mouse down on radix point.
RadixDrag | 5 |  Mouse move on radix point.
See Also
Reference
Grasshopper.GUI.Base Namespace