Grasshopper SDK
GH_Border.CreateBorders Method (RectangleF, Int32)
 Static (Shared) method for creating a set of borders.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<GH_Border> CreateBorders(
	RectangleF box,
	int borderSize
)
Public Shared Function CreateBorders (
	box As RectangleF,
	borderSize As Integer
) As List(Of GH_Border)
Parameters
box
Type: System.Drawing.RectangleF
Box for border creation.
borderSize
Type: System.Int32
The width of all borders.
Return Value
Type: List<GH_Border>
A list of borders.
See Also
Reference
GH_Border Class
CreateBorders Overload
Grasshopper.GUI.Canvas Namespace