Grasshopper SDK
GH_Convert.ToGHColour_Primary Method
 Converts similar data into a GH_Colour instance. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToGHColour_Primary(
	Object data,
	ref GH_Colour target
)
Public Shared Function ToGHColour_Primary (
	data As Object,
	ByRef target As GH_Colour
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_Colour
Target instance. If null, a new GH_Colour will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace