Grasshopper SDK
IGH_Structure.Graft Method (GH_Path, Boolean)
Note: This API is now obsolete.
 Grafts a specific path by reallocating all data into child paths. If a grafted path coincides with an existing path, the data item in question will be appended to the existing path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("this method has been replaced by Graft(GH_GraftMode, GH_Path)")]
void Graft(
	GH_Path path,
	bool clearSingleNulls
)
<ObsoleteAttribute("this method has been replaced by Graft(GH_GraftMode, GH_Path)")>
Sub Graft (
	path As GH_Path,
	clearSingleNulls As Boolean
)
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path of data to graft.
clearSingleNulls
Type: System.Boolean
If true, nulls will not be grafted.
See Also
Reference
IGH_Structure Interface
Graft Overload
Grasshopper.Kernel.Data Namespace