Grasshopper SDK
GH_CodeStringSegment.Replace Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Replace(
	string search,
	string replace,
	bool bIgnoreCase = true
)
Public Sub Replace (
	search As String,
	replace As String,
	Optional bIgnoreCase As Boolean = true
)
Parameters
search
Type: System.String
replace
Type: System.String
bIgnoreCase (Optional)
Type: System.Boolean
See Also
Reference
GH_CodeStringSegment Class
Grasshopper.Kernel.Expressions Namespace