Grasshopper SDK
IGH_Param.RemoveSource Method (Guid)
 Remove the specified source from this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void RemoveSource(
	Guid source_id
)
Sub RemoveSource (
	source_id As Guid
)
Parameters
source_id
Type: System.Guid
InstanceID of source to remove.
See Also
Reference
IGH_Param Interface
RemoveSource Overload
Grasshopper.Kernel Namespace