Grasshopper SDK
GH_Document.GH_UndoUtil.RecordWireEvent Method (String, IGH_Param)
 Create and Record a new WiresChanged undo record.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid RecordWireEvent(
	string name,
	IGH_Param param
)
Public Function RecordWireEvent (
	name As String,
	param As IGH_Param
) As Guid
Parameters
name
Type: System.String
Name of undo record.
param
Type: Grasshopper.Kernel.IGH_Param
Target parameter for undo record.
Return Value
Type: Guid
The ID of the newly added undo record or Guid.Empty on failure.
See Also
Reference
GH_Document.GH_UndoUtil Class
RecordWireEvent Overload
Grasshopper.Kernel Namespace