Grasshopper SDK
GH_WireDisplayAction Class
 Records a single wire display mode event.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ObjectUndoAction
 Grasshopper.Kernel.Undo.Actions.GH_WireDisplayAction
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_WireDisplayAction : GH_ObjectUndoAction
Public Class GH_WireDisplayAction
	Inherits GH_ObjectUndoAction
The GH_WireDisplayAction type exposes the following members.
Constructors
Name | Description
GH_WireDisplayAction
Initializes a new instance of the GH_WireDisplayAction class
Top
Properties
Name | Description
Top
Methods
Name | Description
Object_Redo |  (Overrides GH_ObjectUndoAction.Object_Redo(GH_Document, IGH_DocumentObject).)
Object_Undo |  (Overrides GH_ObjectUndoAction.Object_Undo(GH_Document, IGH_DocumentObject).)
Top
See Also
Reference
Grasshopper.Kernel.Undo.Actions Namespace