Grasshopper SDK
GH_Field.TensorAt Method
 Compute the field tensor at the given location as contributed by all the field elements.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Vector3d TensorAt(
	Point3d location
)
Public Function TensorAt (
	location As Point3d
) As Vector3d
Parameters
location
Type: Point3d
Location to sample field at.
Return Value
Type: Vector3d
The strength and direction of the field at the given location.
See Also
Reference
GH_Field Class
Grasshopper.Kernel.Types Namespace