Grasshopper SDK
GH_Vector.GH_VectorProxy.Length Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Length { get; set; }
Public Property Length As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Vector.GH_VectorProxy.Length"]
See Also
Reference
GH_Vector.GH_VectorProxy Class
Grasshopper.Kernel.Types Namespace