Grasshopper SDK
GH_SliderBase.GripDisplay Property
 Gets or sets how the slider grip (or thumb) is drawn.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SliderGripDisplay GripDisplay { get; set; }
Public Property GripDisplay As GH_SliderGripDisplay
	Get
	Set
Property Value
Type: GH_SliderGripDisplay
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.GripDisplay"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace