Grasshopper SDK
IGH_DocumentObject.IsolateObject Method
 Destroy all connections to other objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void IsolateObject()
Sub IsolateObject
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace