Grasshopper SDK
GH_ComponentServer.IsUpgrader Method
 Checks to see if at least one upgrader is defined for a collection of objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsUpgrader(
	IEnumerable<IGH_DocumentObject> objs
)
Public Function IsUpgrader (
	objs As IEnumerable(Of IGH_DocumentObject)
) As Boolean
Parameters
objs
Type: System.Collections.Generic.IEnumerable<IGH_DocumentObject>
Return Value
Type: Boolean
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace