Grasshopper SDK
GH_Convert.ToPlural Method
 Apply english rules to convert a noun into its plural form. This algorithm is not water-tight as it will not handle any irregular cases.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string ToPlural(
	string singular
)
Public Shared Function ToPlural (
	singular As String
) As String
Parameters
singular
Type: System.String
Singular form of noun.
Return Value
Type: String
Plural form of noun.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace