Grasshopper SDK
GH_IndexRanges Constructor
Initializes a new instance of the GH_IndexRanges class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_IndexRanges()
Public Sub New
See Also
Reference
GH_IndexRanges Class
Grasshopper.Kernel.Data Namespace