Grasshopper SDK
GH_Document.ObjectsDeleted Event
 Raised after a collection of objects was removed from the document. At this point, the objects still exist, but they no longer belong to this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Document.ObjectsDeletedEventHandler ObjectsDeleted
Public Event ObjectsDeleted As GH_Document.ObjectsDeletedEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.ObjectsDeletedEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace