Grasshopper SDK
GH_LexerCombo Constructor (GH_Lexer, GH_Lexer)
Initializes a new instance of the GH_LexerCombo class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LexerCombo(
	GH_Lexer n_source,
	GH_Lexer n_target
)
Public Sub New (
	n_source As GH_Lexer,
	n_target As GH_Lexer
)
Parameters
n_source
Type: Grasshopper.Kernel.Data.GH_Lexer
n_target
Type: Grasshopper.Kernel.Data.GH_Lexer
See Also
Reference
GH_LexerCombo Class
GH_LexerCombo Overload
Grasshopper.Kernel.Data Namespace