Grasshopper SDK
GH_Param<T>.AddVolatileDataTree Method (GH_Structure<T>)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AddVolatileDataTree(
	GH_Structure<T> tree
)
Public Function AddVolatileDataTree (
	tree As GH_Structure(Of T)
) As Boolean
Parameters
tree
Type: Grasshopper.Kernel.Data.GH_Structure<T>
Return Value
Type: Boolean
See Also
Reference
GH_Param<T> Class
AddVolatileDataTree Overload
Grasshopper.Kernel Namespace