Grasshopper SDK
GH_LoadProtectDialog.SetAssemblyName Method
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetAssemblyName(
	string name
)
Public Sub SetAssemblyName (
	name As String
)
Parameters
name
Type: System.String
See Also
Reference
GH_LoadProtectDialog Class
Grasshopper.GUI Namespace