Grasshopper SDK
GH_ComponentServer.GetCategoryShortName Method
 Get the abbreviation (short name) for a specific category. If the short name hasn't been defined, this method will return the full name instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string GetCategoryShortName(
	string fullName
)
Public Function GetCategoryShortName (
	fullName As String
) As String
Parameters
fullName
Type: System.String
Full name of category.
Return Value
Type: String
The abbreviated name or the full name.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace