Grasshopper SDK
GH_ComponentAttributes.RenderComponentCapsule Method (GH_Canvas, Graphics, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Utility function, draws the component capsule including all specified elements.
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void RenderComponentCapsule(
	GH_Canvas canvas,
	Graphics graphics,
	bool drawComponentBaseBox,
	bool drawComponentNameBox,
	bool drawJaggedEdges,
	bool drawParameterGrips,
	bool drawParameterNames,
	bool drawZuiElements
)
Protected Sub RenderComponentCapsule (
	canvas As GH_Canvas,
	graphics As Graphics,
	drawComponentBaseBox As Boolean,
	drawComponentNameBox As Boolean,
	drawJaggedEdges As Boolean,
	drawParameterGrips As Boolean,
	drawParameterNames As Boolean,
	drawZuiElements As Boolean
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas to draw into.
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
drawComponentBaseBox
Type: System.Boolean
If true, will draw the component background box.
drawComponentNameBox
Type: System.Boolean
If true, will draw component nickname/icon element.
drawJaggedEdges
Type: System.Boolean
If true, parameterless sides will have jagged edges drawn on them.
drawParameterGrips
Type: System.Boolean
If true, will draw parameter grips.
drawParameterNames
Type: System.Boolean
If true, will draw parameter nicknames.
drawZuiElements
Type: System.Boolean
If true, will draw ZUI variable parameter interface.
See Also
Reference
GH_ComponentAttributes Class
RenderComponentCapsule Overload
Grasshopper.Kernel.Attributes Namespace