Grasshopper SDK
GH_SettingsServer.GetValue Method (String, Size)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Size GetValue(
	string key,
	Size default
)
Public Function GetValue (
	key As String,
	default As Size
) As Size
Parameters
key
Type: System.String
default
Type: System.Drawing.Size
Return Value
Type: Size
See Also
Reference
GH_SettingsServer Class
GetValue Overload
Grasshopper.Kernel Namespace