Grasshopper SDK
GH_Attributes<T>.PrepareForRender Method
 This method will always be called exactly once prior to Render(). This would be a good place to make sure all the necessary GUI data is up and running.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void PrepareForRender(
	GH_Canvas canvas
)
Protected Overridable Sub PrepareForRender (
	canvas As GH_Canvas
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas that is about to render these attributes.
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace