Grasshopper SDK
GH_SliderBase.Minimum Property
 Gets or sets the lower limit of the slider.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Minimum { get; set; }
Public Property Minimum As Decimal
	Get
	Set
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.Minimum"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace