Grasshopper SDK
GH_MeshFace Constructor
 Default constructor. Sets all corners to 0.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MeshFace()
Public Sub New
See Also
Reference
GH_MeshFace Class
GH_MeshFace Overload
Grasshopper.Kernel.Types Namespace