Grasshopper SDK
GH_ComponentParamServer.SortInput Method (Double[])
 Sort the input parameter order based on a numeric key array.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SortInput(
	double[] keys
)
Public Sub SortInput (
	keys As Double()
)
Parameters
keys
Type: System.Double[]
Array of double precision numbers to function as sorting keys.
See Also
Reference
GH_ComponentParamServer Class
SortInput Overload
Grasshopper.Kernel Namespace