Grasshopper SDK
GH_DocumentObject.GetValue Method (String, Color)
 Get a color value from the component value table.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected Color GetValue(
	string name,
	Color default
)
Protected Function GetValue (
	name As String,
	default As Color
) As Color
Parameters
name
Type: System.String
Name of color to retrieve.
default
Type: System.Drawing.Color
Default value to return in case of missing named value.
Return Value
Type: Color
The color value with the given name of the default value.
See Also
Reference
GH_DocumentObject Class
GetValue Overload
Grasshopper.Kernel Namespace