Grasshopper SDK
GH_ExternalFile.FileHash Property
 Gets the file hash.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid FileHash { get; }
Public ReadOnly Property FileHash As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ExternalFile.FileHash"]
See Also
Reference
GH_ExternalFile Class
Grasshopper.Kernel Namespace