Grasshopper SDK
GH_CapsuleRenderEngine.RenderBackground Method
 Render a default capsule background fill. This is usually the third stage in a capsule rendering.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderBackground(
	Graphics G,
	float zoom,
	GH_PaletteStyle style
)
Public Sub RenderBackground (
	G As Graphics,
	zoom As Single,
	style As GH_PaletteStyle
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with.
zoom
Type: System.Single
Zoom of graphics object.
style
Type: Grasshopper.GUI.Canvas.GH_PaletteStyle
Final style to draw with.
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace