Grasshopper SDK
GH_Link.LinkId Property
 Gets the link ID. The link ID is only used for shared links.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string LinkId { get; }
Public ReadOnly Property LinkId As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_Link.LinkId"]
See Also
Reference
GH_Link Class
Grasshopper.Documentation Namespace