Grasshopper SDK
IGH_VariableParameterComponent.CanInsertParameter Method
 This function will get called before an attempt is made to insert a parameter. Since this method is potentially called on Canvas redraws, it must be fast.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool CanInsertParameter(
	GH_ParameterSide side,
	int index
)
Function CanInsertParameter (
	side As GH_ParameterSide,
	index As Integer
) As Boolean
Parameters
side
Type: Grasshopper.Kernel.GH_ParameterSide
Parameter side.
index
Type: System.Int32
Insertion index of parameter. Index=0 means the parameter will be in the topmost spot.
Return Value
Type: Boolean
Return True if your component supports a variable parameter at the given location.
See Also
Reference
IGH_VariableParameterComponent Interface
Grasshopper.Kernel Namespace