Grasshopper SDK
GH_Rectangle.Boundingbox Property
 Gets the boundingbox for this geometry.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override BoundingBox Boundingbox { get; }
Public Overrides ReadOnly Property Boundingbox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Rectangle.Boundingbox"]
Return Value
Type: BoundingBox
The boundingbox for this piece of geometry or Boundingbox.Empty if the geometry is null or invalid.
See Also
Reference
GH_Rectangle Class
Grasshopper.Kernel.Types Namespace