Grasshopper SDK
GH_Structure<T>.Simplify Method
 Simplify the data structure by collapsing path indices shared by all branches.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Simplify(
	GH_SimplificationMode mode
)
Public Sub Simplify (
	mode As GH_SimplificationMode
)
Parameters
mode
Type: Grasshopper.Kernel.Data.GH_SimplificationMode
Simplification algorithm to use.
Implements
IGH_Structure.Simplify(GH_SimplificationMode)
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace