Grasshopper SDK
GH_Colour Constructor (GH_Colour)
Initializes a new instance of the GH_Colour class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Colour(
	GH_Colour other
)
Public Sub New (
	other As GH_Colour
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Colour
See Also
Reference
GH_Colour Class
GH_Colour Overload
Grasshopper.Kernel.Types Namespace