Grasshopper SDK
GH_Canvas.WidgetListCreatedEventHandler Delegate
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void WidgetListCreatedEventHandler(
	Object sender,
	GH_CanvasWidgetListEventArgs e
)
Public Delegate Sub WidgetListCreatedEventHandler (
	sender As Object,
	e As GH_CanvasWidgetListEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.GUI.Canvas.GH_CanvasWidgetListEventArgs
See Also
Reference
Grasshopper.GUI.Canvas Namespace