Grasshopper SDK
GH_PrincipalState Enumeration
 Enumerates the different possible states in which the masterness of a parameter can occur.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_PrincipalState
Public Enumeration GH_PrincipalState
Members
Member name | Value | Description
CannotBePrincipal | 0 |  This parameter cannot be a principal parameter. It is not a valid component input.
IsPrincipal | 1 |  This parameter is the current principal parameter as defined by the component which owns it.
IsNotPrincipal | 2 |  This parameter is not the current principal parameter, but it could be.
See Also
Reference
Grasshopper.Kernel Namespace