Grasshopper SDK
GH_Format Class
 Represents a piece of formatted content.
Inheritance Hierarchy
System.Object
 Grasshopper.Documentation.GH_Format
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Format : IGH_Content
Public Class GH_Format
	Implements IGH_Content
The GH_Format type exposes the following members.
Properties
Name | Description
Content
Style
Top
Methods
Name | Description
Create(String, GH_Style)
Create(IGH_Content, GH_Style)
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
Grasshopper.Documentation Namespace