Grasshopper SDK
Scale Constructor (Plane, Double)
Initializes a new instance of the Scale class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Scale(
	Plane frame,
	double scale
)
Public Sub New (
	frame As Plane,
	scale As Double
)
Parameters
frame
Type: Plane
scale
Type: System.Double
See Also
Reference
Scale Class
Scale Overload
Grasshopper.Kernel.Types.Transforms Namespace