Grasshopper SDK
Node3d<T>.ChildNode Property
 Gets the child node at the given index.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Node3d<T> this[
	int index
] { get; }
Public ReadOnly Property ChildNode (
	index As Integer
) As Node3d(Of T)
	Get
Parameters
index
Type: System.Int32
Index of child node to retrieve. Valid indices are from 0 to 7 inclusive.
Property Value
Type: Node3d<T>
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ChildNode(System.Int32)"]
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace