Grasshopper SDK
GH_CanvasValidator.CanShowCanvasMenu Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool CanShowCanvasMenu(
	PointF pt
)
Public Overridable Function CanShowCanvasMenu (
	pt As PointF
) As Boolean
Parameters
pt
Type: System.Drawing.PointF
Return Value
Type: Boolean
Implements
IGH_CanvasValidator.CanShowCanvasMenu(PointF)
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace