Grasshopper SDK
DataTree<T>.ItemExists Method
 Test if the specified path + item index are defined inside the tree.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ItemExists(
	GH_Path path,
	int index
)
Public Function ItemExists (
	path As GH_Path,
	index As Integer
) As Boolean
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to test for.
index
Type: System.Int32
Item index to test.
Return Value
Type: Boolean
True if the specified path exists and contains the specified index.
See Also
Reference
DataTree<T> Class
Grasshopper Namespace