Grasshopper SDK
DataTree<T>.Branches Property
 Gets a list of all the data-arrays in this tree
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<List<T>> Branches { get; }
Public ReadOnly Property Branches As IList(Of List(Of T))
	Get
Property Value
Type: IList<List<T>>
[Missing <value> documentation for "P:Grasshopper.DataTree`1.Branches"]
See Also
Reference
DataTree<T> Class
Grasshopper Namespace