Grasshopper SDK
GH_GraphicsUtil.ScaleColour Method
 Multiply the channels of a colour construct with a fixed factor.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color ScaleColour(
	Color col,
	double factor
)
Public Shared Function ScaleColour (
	col As Color,
	factor As Double
) As Color
Parameters
col
Type: System.Drawing.Color
The colour to mutate
factor
Type: System.Double
An adjustment factor.
Return Value
Type: Color
The scaled colour.
Remarks
The alpha channel of the colour is not mutated.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace