Grasshopper SDK
IGH_VarParamComponent.ConstructVariable Method
 This function is called whenever a new parameter is required. You must provide a non-null instance for new_param, otherwise the addition will be cancelled. The Param field of the event arguments will typically be null.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_Param ConstructVariable(
	GH_VarParamEventArgs e
)
Function ConstructVariable (
	e As GH_VarParamEventArgs
) As IGH_Param
Parameters
e
Type: Grasshopper.Kernel.GH_VarParamEventArgs
Return Value
Type: IGH_Param
See Also
Reference
IGH_VarParamComponent Interface
Grasshopper.Kernel Namespace