Grasshopper SDK
GH_ComplexNumber Constructor (GH_ComplexNumber)
Initializes a new instance of the GH_ComplexNumber class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ComplexNumber(
	GH_ComplexNumber other
)
Public Sub New (
	other As GH_ComplexNumber
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_ComplexNumber
See Also
Reference
GH_ComplexNumber Class
GH_ComplexNumber Overload
Grasshopper.Kernel.Types Namespace