Grasshopper SDK
GH_ComponentParamServer.Owner Property
 Gets the owner component of this instance
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Component Owner { get; }
Public ReadOnly Property Owner As IGH_Component
	Get
Property Value
Type: IGH_Component
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentParamServer.Owner"]
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace