Grasshopper SDK
GH_MemoryBitmap.Filter_Equalize Method
 Set all the values in a specific channel to a specific value.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_Equalize(
	GH_BitmapChannel channel,
	byte value
)
Public Sub Filter_Equalize (
	channel As GH_BitmapChannel,
	value As Byte
)
Parameters
channel
Type: Grasshopper.Kernel.GH_BitmapChannel
Channel(s) to equalize.
value
Type: System.Byte
Value to equalize with.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace