Grasshopper SDK
Folders.FileViewerApplication Property
 Gets the location where the FileViewer.exe should be. If the application is not present, null is returned.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FileViewerApplication { get; }
Public Shared ReadOnly Property FileViewerApplication As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.FileViewerApplication"]
See Also
Reference
Folders Class
Grasshopper Namespace