Grasshopper SDK
Complex Structure
 Complex number type in Grasshopper. Do not confuse with GH_Complex which is the IGH_Goo implementation of ComplexNumber.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public struct Complex
Public Structure Complex
The Complex type exposes the following members.
Constructors
Name | Description
Complex(Double)
Initializes a new instance of the Complex class
Complex(Double, Double)
Initializes a new instance of the Complex class
Top
Properties
Name | Description
Argument
 Gets or sets the complex argument.
ComplexUnit
Imaginary
 Gets or sets the imaginary component of the Complex number.
Infinity
IsReal
 Gets whether this complex number only has a real component.
IsRealNonNegative
 Gets whether this complex number only has a positive real component.
IsValid
 Gets the validity of this number.
IsZero
 Gets whether or not this complex number equals {0.0; 0.0}
NaN
NegativeInfinity
Real
 Gets or sets the real component of the Complex number.
Zero
Top
Methods
Name | Description
ACos
ASin
ATan
Cos
Cosecant
CoTan
Exponential
GetHashCode |  (Overrides ValueType.GetHashCode().)
Log
Log10
Modulus
ModulusSquared
Power
Root
Secant
Sin
Square
SquareRoot
Tan
Top
Operators
Name | Description
Addition(Double, Complex)
Addition(Complex, Complex)
Addition(Complex, Double)
Division(Double, Complex)
Division(Complex, Complex)
Division(Complex, Double)
Multiply(Double, Complex)
Multiply(Complex, Complex)
Multiply(Complex, Double)
Subtraction(Double, Complex)
Subtraction(Complex, Complex)
Subtraction(Complex, Double)
UnaryNegation
UnaryPlus
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace