Grasshopper SDK
CentralSettings.UiScaleChanged Event
 Raised whenever the UiScale setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.UiScaleChangedEventHandler UiScaleChanged
Public Shared Event UiScaleChanged As CentralSettings.UiScaleChangedEventHandler
Value
Type: Grasshopper.CentralSettings.UiScaleChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace