Grasshopper SDK
GH_PaletteStyle.m_text Field
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color m_text
Public m_text As Color
Field Value
Type: Color
See Also
Reference
GH_PaletteStyle Class
Grasshopper.GUI.Canvas Namespace