Grasshopper SDK
IGH_Structure.PathCount Property
 Gets the number of paths defined in this structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int PathCount { get; }
ReadOnly Property PathCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.IGH_Structure.PathCount"]
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace