Grasshopper SDK
IGH_Param.Kind Property
 Gets the parameter kind. The kind is evaluated lazily and cached.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_ParamKind Kind { get; }
ReadOnly Property Kind As GH_ParamKind
	Get
Property Value
Type: GH_ParamKind
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.Kind"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace