Grasshopper SDK
GH_Viewport.UnprojectX Method
 Project a value along constant X from control coordinates into canvas coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float UnprojectX(
	float x
)
Public Function UnprojectX (
	x As Single
) As Single
Parameters
x
Type: System.Single
The constant X value in control coordinates.
Return Value
Type: Single
The associated X value in canvas coordinates.
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace