Grasshopper SDK
GH_State Constructor (GH_State)
Initializes a new instance of the GH_State class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_State(
	GH_State other
)
Public Sub New (
	other As GH_State
)
Parameters
other
Type: Grasshopper.Kernel.GH_State
See Also
Reference
GH_State Class
GH_State Overload
Grasshopper.Kernel Namespace