Grasshopper SDK
GH_SliderBase.FixDomain Method
 Fix the limits of the slider. Limits will be rounded according to slider type and accuracy. Also, a minimum range for all types is ensured.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void FixDomain()
Public Sub FixDomain
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace