Grasshopper SDK
GH_ColourPicker.DesiredHeight Property
 Gets the ideal height for this control given the current width and UI settings.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int DesiredHeight { get; }
Public ReadOnly Property DesiredHeight As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_ColourPicker.DesiredHeight"]
See Also
Reference
GH_ColourPicker Class
Grasshopper.GUI Namespace