Grasshopper SDK
GH_ObjectWrapper Constructor (Object)
Initializes a new instance of the GH_ObjectWrapper class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ObjectWrapper(
	Object obj
)
Public Sub New (
	obj As Object
)
Parameters
obj
Type: System.Object
See Also
Reference
GH_ObjectWrapper Class
GH_ObjectWrapper Overload
Grasshopper.Kernel.Types Namespace