Grasshopper SDK
GH_Capsule.TextOrientation Property
 Gets or sets the orientation of the text within the content box.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Orientation TextOrientation { get; set; }
Public Property TextOrientation As GH_Orientation
	Get
	Set
Property Value
Type: GH_Orientation
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.TextOrientation"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace