Grasshopper SDK
Param_MeshParameters.Icon Property
Namespace: Grasshopper.Kernel.Parameters
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override Bitmap Icon { get; }
Protected Overrides ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_MeshParameters.Icon"]
See Also
Reference
Param_MeshParameters Class
Grasshopper.Kernel.Parameters Namespace