Grasshopper SDK
TreeDelegates.Node2Coordinates Method
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void Node2Coordinates(
	Node2 pt,
	ref double x,
	ref double y,
	ref double z
)
Public Shared Sub Node2Coordinates (
	pt As Node2,
	ByRef x As Double,
	ByRef y As Double,
	ByRef z As Double
)
Parameters
pt
Type: Node2
x
Type: System.Double
y
Type: System.Double
z
Type: System.Double
See Also
Reference
TreeDelegates Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace