Grasshopper SDK
GH_DigitScroller.ValueChangedEventHandler Delegate
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ValueChangedEventHandler(
	Object sender,
	GH_DigitScrollerEventArgs e
)
Public Delegate Sub ValueChangedEventHandler (
	sender As Object,
	e As GH_DigitScrollerEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.GUI.Base.GH_DigitScrollerEventArgs
See Also
Reference
Grasshopper.GUI Namespace