Grasshopper SDK
GH_ComponentServer.DiscardedProxies Property
 Returns the total number of IGH_DocumentObjects that were discarded during assembly parsing. This includes both skipped and replaced proxies.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int DiscardedProxies { get; }
Public ReadOnly Property DiscardedProxies As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.DiscardedProxies"]
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace