Grasshopper SDK
GH_DigitScroller.Presets Property
 Gets the internal object that maintains numeric presets.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_NumberPresets Presets { get; }
Public ReadOnly Property Presets As GH_NumberPresets
	Get
Property Value
Type: GH_NumberPresets
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DigitScroller.Presets"]
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace