Grasshopper SDK
GH_CapsuleRenderEngine.CreateRoundedRectangle Method (Rectangle, Int32, Int32, Int32, Int32)
 Static (Shared in VB) method for creating rectangles with rounded corners.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath CreateRoundedRectangle(
	Rectangle rec,
	int R0,
	int R1,
	int R2,
	int R3
)
Public Shared Function CreateRoundedRectangle (
	rec As Rectangle,
	R0 As Integer,
	R1 As Integer,
	R2 As Integer,
	R3 As Integer
) As GraphicsPath
Parameters
rec
Type: System.Drawing.Rectangle
Rectangle to fillet. Rectangles smaller than 3 pixels wide/high will be grown.
R0
Type: System.Int32
Radius of upper left corner. Zero or negative values omit fillets.
R1
Type: System.Int32
Radius of upper right corner. Zero or negative values omit fillets.
R2
Type: System.Int32
Radius of lower right corner. Zero or negative values omit fillets.
R3
Type: System.Int32
Radius of lower left corner. Zero or negative values omit fillets.
Return Value
Type: GraphicsPath
Graphics path that describes the rounded rectangle.
See Also
Reference
GH_CapsuleRenderEngine Class
CreateRoundedRectangle Overload
Grasshopper.GUI.Canvas Namespace