Grasshopper SDK
GH_Box.Brep Method
 Differs from Rhino.Geometry.Brep.FromBox() because it Handles degenerate cases.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Brep Brep()
Public Function Brep As Brep
Return Value
Type: Brep
See Also
Reference
GH_Box Class
Grasshopper.Kernel.Types Namespace