Grasshopper SDK
GH_Canvas.AddTagArtist Method
 Add a Tag Artist instance to this canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddTagArtist(
	IGH_TagArtist artist
)
Public Sub AddTagArtist (
	artist As IGH_TagArtist
)
Parameters
artist
Type: Grasshopper.GUI.Canvas.TagArtists.IGH_TagArtist
Tag artist to add
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace