Grasshopper SDK
GH_Slider_Obsolete.GripForeColor Property
 Foreground colour of slider grip.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color GripForeColor { get; set; }
Public Property GripForeColor As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider_Obsolete.GripForeColor"]
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace