Grasshopper SDK
GH_Convert.ToVariant Method
 Convert an object to a Grasshopper Expression Variant if possible.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Variant ToVariant(
	Object value
)
Public Shared Function ToVariant (
	value As Object
) As GH_Variant
Parameters
value
Type: System.Object
Data to convert.
Return Value
Type: GH_Variant
An expression variant that matches the input best or a VAR_Null instance.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace