Grasshopper SDK
GH_Rectangle.DuplicateRectangle Method
 Create a duplicate of this rectangle.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Rectangle DuplicateRectangle()
Public Function DuplicateRectangle As GH_Rectangle
Return Value
Type: GH_Rectangle
See Also
Reference
GH_Rectangle Class
Grasshopper.Kernel.Types Namespace