Grasshopper SDK
IGH_PreviewObject.DrawViewportMeshes Method
 Implement this function to draw all shaded meshes. If the viewport does not support shading, this function will not be called.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void DrawViewportMeshes(
	IGH_PreviewArgs args
)
Sub DrawViewportMeshes (
	args As IGH_PreviewArgs
)
Parameters
args
Type: Grasshopper.Kernel.IGH_PreviewArgs
Draw operation arguments.
See Also
Reference
IGH_PreviewObject Interface
Grasshopper.Kernel Namespace