Grasshopper SDK
GH_DocumentObject.GetValue Method (String, Double)
 Get a double value from the component value table.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected double GetValue(
	string name,
	double default
)
Protected Function GetValue (
	name As String,
	default As Double
) As Double
Parameters
name
Type: System.String
Name of double to retrieve.
default
Type: System.Double
Default value to return in case of missing named value.
Return Value
Type: Double
The double value with the given name of the default value.
See Also
Reference
GH_DocumentObject Class
GetValue Overload
Grasshopper.Kernel Namespace