Grasshopper SDK
GH_FloatingParamAttributes.IconHeight Field
 Defines the default height of a floating parameter in Icon display mode.
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int IconHeight = 24
Public Const IconHeight As Integer = 24
Field Value
Type: Int32
See Also
Reference
GH_FloatingParamAttributes Class
Grasshopper.Kernel.Attributes Namespace