Grasshopper SDK
GH_Point.ReferenceType Method
 Retrieve the reference type of this point object.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PointRefType ReferenceType()
Public Function ReferenceType As GH_PointRefType
Return Value
Type: GH_PointRefType
The reference type as specified by the Reference Data. If there is no reference data, either Unset or Coordinate is returned depending on whether m_Point is a null reference.
See Also
Reference
GH_Point Class
ReferenceType Overload
Grasshopper.Kernel.Types Namespace