Grasshopper SDK
GH_Variant Constructor (Int32)
 Create a new Integer variant.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant(
	int value
)
Public Sub New (
	value As Integer
)
Parameters
value
Type: System.Int32
Value of Variant.
See Also
Reference
GH_Variant Class
GH_Variant Overload
Grasshopper.Kernel.Expressions Namespace