Grasshopper SDK
GH_Slider.DrawControlBorder Property
 Gets or sets whether the border of the slider should be drawn.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DrawControlBorder { get; set; }
Public Property DrawControlBorder As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.DrawControlBorder"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace