Grasshopper SDK
GH_ActiveObject.RuntimeMessageLevel Property
 Returns the worst case flag for the current object
If the object contains at least 1 error, the result is Error.
If the object contains at least 1 warning, the result is Warning.
If the object contains at least 1 message, the result is Remark.
If the object contains no errors, no warnings and no messages, the result is Blank.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual GH_RuntimeMessageLevel RuntimeMessageLevel { get; }
Public Overridable ReadOnly Property RuntimeMessageLevel As GH_RuntimeMessageLevel
	Get
Property Value
Type: GH_RuntimeMessageLevel
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ActiveObject.RuntimeMessageLevel"]
Implements
IGH_ActiveObject.RuntimeMessageLevel
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace