Grasshopper SDK
CentralSettings.TooltipWiggleRadius Property
 Gets or sets the wiggle radius (in pixels) which the mouse is allowed to move before the tooltip is nuked.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int TooltipWiggleRadius { get; set; }
Public Shared Property TooltipWiggleRadius As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.CentralSettings.TooltipWiggleRadius"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace