Grasshopper SDK
GH_Document.GetAllInstanceIDs Method
 Get a sorted list of all the IGH_DocumentObject instance IDs in this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public SortedList<Guid, int> GetAllInstanceIDs(
	bool topLevelOnly
)
Public Function GetAllInstanceIDs (
	topLevelOnly As Boolean
) As SortedList(Of Guid, Integer)
Parameters
topLevelOnly
Type: System.Boolean
If true, only top level objects are considered.
Return Value
Type: SortedList<Guid, Int32>
A sorted fictionary of IDs and Integers. The integers represent the indices of the top-level objects that contained the ids. Since the object list inside a GH_Document is not static, these indices will not remain valid.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace