Grasshopper SDK
GH_NamedView.Point Property
 Gets or sets the anchor point of the named view.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF Point { get; set; }
Public Property Point As PointF
	Get
	Set
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_NamedView.Point"]
See Also
Reference
GH_NamedView Class
Grasshopper.GUI.Canvas Namespace