Grasshopper SDK
GH_Canvas.RemoveValidator Method
 Remove a drop validator from the canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RemoveValidator(
	IGH_CanvasValidator validator
)
Public Sub RemoveValidator (
	validator As IGH_CanvasValidator
)
Parameters
validator
Type: Grasshopper.GUI.Canvas.IGH_CanvasValidator
Validator to remove.
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace