Grasshopper SDK
GH_Culture Constructor (CultureInfo)
Initializes a new instance of the GH_Culture class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Culture(
	CultureInfo culture
)
Public Sub New (
	culture As CultureInfo
)
Parameters
culture
Type: System.Globalization.CultureInfo
See Also
Reference
GH_Culture Class
GH_Culture Overload
Grasshopper.Kernel.Types Namespace