Grasshopper SDK
GH_ComponentAttributes.AppendToAttributeTree Method
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void AppendToAttributeTree(
	List<IGH_Attributes> attributes
)
Public Overrides Sub AppendToAttributeTree (
	attributes As List(Of IGH_Attributes)
)
Parameters
attributes
Type: System.Collections.Generic.List<IGH_Attributes>
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace