Grasshopper SDK
GH_TagArtist.Paint Method
 This method is called whenever a Canvas channel is painted
Namespace: Grasshopper.GUI.Canvas.TagArtists
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract void Paint(
	GH_Canvas canvas,
	GH_CanvasChannel channel
)
Public MustOverride Sub Paint (
	canvas As GH_Canvas,
	channel As GH_CanvasChannel
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas that is currently painting.
channel
Type: Grasshopper.GUI.Canvas.GH_CanvasChannel
Channel that is currently being painted.
Implements
IGH_TagArtist.Paint(GH_Canvas, GH_CanvasChannel)
See Also
Reference
GH_TagArtist Class
Grasshopper.GUI.Canvas.TagArtists Namespace