Grasshopper SDK
GH_CanvasMouseEvent Constructor (Point, PointF, MouseButtons, Int32, Int32)
 Constructor.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CanvasMouseEvent(
	Point pt_control,
	PointF pt_canvas,
	MouseButtons mButton,
	int iClicks = 0,
	int iDelta = 0
)
Public Sub New (
	pt_control As Point,
	pt_canvas As PointF,
	mButton As MouseButtons,
	Optional iClicks As Integer = 0,
	Optional iDelta As Integer = 0
)
Parameters
pt_control
Type: System.Drawing.Point
Cursor location in control pixel coordinates.
pt_canvas
Type: System.Drawing.PointF
Cursor location in canvas unit coordinates.
mButton
Type: System.Windows.Forms.MouseButtons
Currently pressed mouse buttons.
iClicks (Optional)
Type: System.Int32
Number of times the buttons were pressed and released.
iDelta (Optional)
Type: System.Int32
A signed count of the number of detents the mouse wheel has rotated.
See Also
Reference
GH_CanvasMouseEvent Class
GH_CanvasMouseEvent Overload
Grasshopper.GUI Namespace