Grasshopper SDK
GH_StandardIcons.FileIconExe_32x32 Property
 Gets the file icon used for Exe files.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Bitmap FileIconExe_32x32 { get; }
Public Shared ReadOnly Property FileIconExe_32x32 As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.GH_StandardIcons.FileIconExe_32x32"]
See Also
Reference
GH_StandardIcons Class
Grasshopper.GUI Namespace