Grasshopper SDK
GH_Slider.Minimum Property
 Gets or sets the lower numeric limit for the slider range.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Minimum { get; set; }
Public Property Minimum As Decimal
	Get
	Set
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.Minimum"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace