Grasshopper SDK
GH_ComponentParamServer.ParameterNickNameChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ParameterNickNameChangedEventHandler(
	Object sender,
	GH_ParamServerEventArgs e
)
Public Delegate Sub ParameterNickNameChangedEventHandler (
	sender As Object,
	e As GH_ParamServerEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_ParamServerEventArgs
See Also
Reference
Grasshopper.Kernel Namespace