Grasshopper SDK
GH_Skin.SaveSkin Method
 Store all palette and gui defaults. This function writes the colour values out to grasshopper_gui.xml settings database.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void SaveSkin()
Public Shared Sub SaveSkin
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace