Grasshopper SDK
GH_RotationalTuningData<T> Class
 Utility class for keeping track of rotational mouse events.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_RotationalTuningData<T>
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_RotationalTuningData<T>
Public Class GH_RotationalTuningData(Of T)
Type Parameters
T
Basic type for initial conditions.
The GH_RotationalTuningData<T> type exposes the following members.
Constructors
Name | Description
GH_RotationalTuningData<T>(T, PointF)
 Create a new instance of the rotational tuning data.
GH_RotationalTuningData<T>(T, PointF, PointF)
 Create a new instance of the rotational tuning data.
Top
Properties
Name | Description
Frame
 Gets the frame at the given index.
FrameCount
 Gets the total number of recorded frames.
InitialValue
 Gets the initial value.
Pivot
 Gets or sets the rotational pivot. You only need to set this if the pivot changes.
Top
Methods
Name | Description
AddFrame
 Grow the tuning track by one point and compute the angle.
TotalAngle
 Compute the total angle from the first to the last frame.
TotalTurns
 Compute the total number of full turns from the first to the last frame.
Top
See Also
Reference
Grasshopper.GUI Namespace