Grasshopper SDK
GH_VerticalScrollBar.ScreenHeight Property
 Gets or sets the height of the screen area (the visible area)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ScreenHeight { get; set; }
Public Property ScreenHeight As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_VerticalScrollBar.ScreenHeight"]
See Also
Reference
GH_VerticalScrollBar Class
Grasshopper.GUI Namespace