Grasshopper SDK
GH_UndoRecord.Time Property
 Gets the time at which this record was created.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime Time { get; }
Public ReadOnly Property Time As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoRecord.Time"]
See Also
Reference
GH_UndoRecord Class
Grasshopper.Kernel.Undo Namespace