Grasshopper SDK
GH_TimeKind Enumeration
 Enumerates the possible kinds that a System.DateTime value can imply.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_TimeKind
Public Enumeration GH_TimeKind
Members
Member name | Value | Description
Unset | 0 |  Unset kind.
Mixed | 1 |  Mixed indicates there isn't a single clear answer.
PureTime | 2 |  DateTime value implies a pure time (no date part).
PureDate | 3 |  DateTime value implies a pute date (no time part).
DateAndTime | 4 |  DateTime value implies both a date and a time component.
See Also
Reference
Grasshopper.Kernel Namespace