Grasshopper SDK
GH_ComponentServer.Aliases Property
 Gets a list of all the defined aliases.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string> Aliases { get; }
Public ReadOnly Property Aliases As List(Of String)
	Get
Property Value
Type: List<String>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.Aliases"]
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace