Grasshopper SDK
GH_Parser.IsLinkLine Method (String, String, String, String)
 Test whether a line represents a referenced link target.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsLinkLine(
	string line,
	out string linkId,
	out string linkTarget,
	out string linkTooltip
)
Public Shared Function IsLinkLine (
	line As String,
	<OutAttribute> ByRef linkId As String,
	<OutAttribute> ByRef linkTarget As String,
	<OutAttribute> ByRef linkTooltip As String
) As Boolean
Parameters
line
Type: System.String
Line to test.
linkId
Type: System.String
linkTarget
Type: System.String
linkTooltip
Type: System.String
Return Value
Type: Boolean
True if the line is a referenced link.
See Also
Reference
GH_Parser Class
IsLinkLine Overload
Grasshopper.Documentation Namespace