Grasshopper SDK
GH_DocumentEditor.CloseForReal Method
 Really, really close the window.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CloseForReal()
Public Sub CloseForReal
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace