Grasshopper SDK
GH_CanvasObjectMouseDownEventArgs.Object Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RelevantObjectData Object { get; }
Public ReadOnly Property Object As GH_RelevantObjectData
	Get
Property Value
Type: GH_RelevantObjectData
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasObjectMouseDownEventArgs.Object"]
See Also
Reference
GH_CanvasObjectMouseDownEventArgs Class
Grasshopper.GUI Namespace