Grasshopper SDK
GH_Convert.ToCurve_Primary Method
 Performs a direct cast from OnCurve or GH_Curve. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToCurve_Primary(
	Object data,
	ref Curve rc
)
Public Shared Function ToCurve_Primary (
	data As Object,
	ByRef rc As Curve
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Curve
Return Value
Type: Boolean
An OnCurve instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace