Grasshopper SDK
GH_Structure<T>.Graft Method (Boolean)
Note: This API is now obsolete.
 Grafts all paths by reallocating all data into child paths.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("this method has been replaced by Graft(GH_GraftMode)")]
public void Graft(
	bool clearSingleNulls
)
<ObsoleteAttribute("this method has been replaced by Graft(GH_GraftMode)")>
Public Sub Graft (
	clearSingleNulls As Boolean
)
Parameters
clearSingleNulls
Type: System.Boolean
If True, nulls will not be grafted.
Implements
IGH_Structure.Graft(Boolean)
See Also
Reference
GH_Structure<T> Class
Graft Overload
Grasshopper.Kernel.Data Namespace