Grasshopper SDK
GH_ComponentAttributes.PathName Property
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string PathName { get; }
Public Overrides ReadOnly Property PathName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Attributes.GH_ComponentAttributes.PathName"]
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace