Grasshopper SDK
IGH_InstanceDescription.Keywords Property
 Gets a list of additional keywords that describe the object. Typically this list is empty but you can override this property to aid in object searches.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IEnumerable<string> Keywords { get; }
ReadOnly Property Keywords As IEnumerable(Of String)
	Get
Property Value
Type: IEnumerable<String>
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_InstanceDescription.Keywords"]
See Also
Reference
IGH_InstanceDescription Interface
Grasshopper.Kernel Namespace