Grasshopper SDK
GH_ParamServerEventArgs.OriginalArguments Property
 Gets access to the original parameter event arguments.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ObjectChangedEventArgs OriginalArguments { get; }
Public ReadOnly Property OriginalArguments As GH_ObjectChangedEventArgs
	Get
Property Value
Type: GH_ObjectChangedEventArgs
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ParamServerEventArgs.OriginalArguments"]
See Also
Reference
GH_ParamServerEventArgs Class
Grasshopper.Kernel Namespace