Grasshopper SDK
GH_FadePhase Enumeration
 Enumerates the possible states of a ZUI fade animation.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_FadePhase
Public Enumeration GH_FadePhase
Members
Member name | Value | Description
Hidden | 0 |  Indicates the UI elements ought to be hidden.
Hiding | 1 |  Indicates the UI elements are in the process of being hidden.
Shown | 2 |  Indicates the UI elements ought to be shown.
Showing | 3 |  Indicates the UI elements are in the process of being shown.
See Also
Reference
Grasshopper.GUI Namespace