Grasshopper SDK
GH_Document.Context Property
 Gets or sets the context for this document. Note that the context is not a state so much as an action. Therefore it is not particularly useful to read the context after the fact, rather, context is mostly intended to be a setter, not a getter. When you set the context, all top-level document objects will be informed and the ContextChanged event will be raised.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentContext Context { get; set; }
Public Property Context As GH_DocumentContext
	Get
	Set
Property Value
Type: GH_DocumentContext
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.Context"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace