Grasshopper SDK
GH_ScriptVariant.Vector Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Vector3d Vector { get; }
Public ReadOnly Property Vector As Vector3d
	Get
Property Value
Type: Vector3d
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ScriptVariant.Vector"]
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace