Grasshopper SDK
IGH_CanvasValidator.CanShowComponentSearchBox Method
 Validates whether the double-click-component-search-window is allowed to pop up at a specific point.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool CanShowComponentSearchBox(
	PointF pt
)
Function CanShowComponentSearchBox (
	pt As PointF
) As Boolean
Parameters
pt
Type: System.Drawing.PointF
Return Value
Type: Boolean
See Also
Reference
IGH_CanvasValidator Interface
Grasshopper.GUI.Canvas Namespace