Grasshopper SDK
GH_Grip.CompareTo Method
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int CompareTo(
	GH_Grip other
)
Public Function CompareTo (
	other As GH_Grip
) As Integer
Parameters
other
Type: Grasshopper.GUI.Gradient.GH_Grip
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace