Grasshopper SDK
GH_Painter.DrawRecipientLinks Method (GH_Document)
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DrawRecipientLinks(
	GH_Document doc
)
Public Sub DrawRecipientLinks (
	doc As GH_Document
)
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
See Also
Reference
GH_Painter Class
DrawRecipientLinks Overload
Grasshopper.GUI.Canvas Namespace