Grasshopper SDK
IGH_Author.Address Property
 Gets the address of the author.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Address { get; }
ReadOnly Property Address As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Author.Address"]
See Also
Reference
IGH_Author Interface
Grasshopper.Kernel Namespace