Grasshopper SDK
GH_SettingsServer.GetValue Method (String, Boolean)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool GetValue(
	string key,
	bool default
)
Public Function GetValue (
	key As String,
	default As Boolean
) As Boolean
Parameters
key
Type: System.String
default
Type: System.Boolean
Return Value
Type: Boolean
See Also
Reference
GH_SettingsServer Class
GetValue Overload
Grasshopper.Kernel Namespace