Grasshopper SDK
GH_MaterialPreviewControl.MaterialImagePostPaintEventHandler Delegate
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void MaterialImagePostPaintEventHandler(
	Bitmap image
)
Public Delegate Sub MaterialImagePostPaintEventHandler (
	image As Bitmap
)
Parameters
image
Type: System.Drawing.Bitmap
See Also
Reference
Grasshopper.GUI Namespace