Grasshopper SDK
GH_Gradient.NearestGrip Method (RectangleF, PointF, Double)
 Find the nearest grip in screen coordinates.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int NearestGrip(
	RectangleF dest,
	PointF pt,
	double maxRadius
)
Public Function NearestGrip (
	dest As RectangleF,
	pt As PointF,
	maxRadius As Double
) As Integer
Parameters
dest
Type: System.Drawing.RectangleF
Retangle that contains the entire gradient.
pt
Type: System.Drawing.PointF
Point to search from.
maxRadius
Type: System.Double
Maximum distance between point and grip.
Return Value
Type: Int32
The grip closest to the point.
See Also
Reference
GH_Gradient Class
NearestGrip Overload
Grasshopper.GUI.Gradient Namespace