Grasshopper SDK
Versioning.Version Property
 Gets the version of the current build of Grasshopper.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Version Version { get; }
Public Shared ReadOnly Property Version As GH_Version
	Get
Property Value
Type: GH_Version
[Missing <value> documentation for "P:Grasshopper.Versioning.Version"]
See Also
Reference
Versioning Class
Grasshopper Namespace