Grasshopper SDK
GH_ComponentServer.NewUserObject Method
 Create a new UserObject and write it to the Grasshopper User Object folder.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool NewUserObject(
	IGH_DocumentObject obj
)
Public Shared Function NewUserObject (
	obj As IGH_DocumentObject
) As Boolean
Parameters
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
Object to write.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace