Grasshopper SDK
GH_ParamServerEventArgs.Parameter Property
 Gets the parameter that caused the original event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Param Parameter { get; }
Public ReadOnly Property Parameter As IGH_Param
	Get
Property Value
Type: IGH_Param
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ParamServerEventArgs.Parameter"]
See Also
Reference
GH_ParamServerEventArgs Class
Grasshopper.Kernel Namespace