Grasshopper SDK
GH_ComponentServer.FindAssemblyByObject Method (Guid)
 Gets the assembly that corresponds to the given library ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_AssemblyInfo FindAssemblyByObject(
	Guid objectId
)
Public Function FindAssemblyByObject (
	objectId As Guid
) As GH_AssemblyInfo
Parameters
objectId
Type: System.Guid
The object ComponentGuid.
Return Value
Type: GH_AssemblyInfo
The library info, or null if the ID is not registered.
See Also
Reference
GH_ComponentServer Class
FindAssemblyByObject Overload
Grasshopper.Kernel Namespace