Grasshopper SDK
GH_ExternalFileConflictDialog Methods
The GH_ExternalFileConflictDialog type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
See Also
Reference
GH_ExternalFileConflictDialog Class
Grasshopper.GUI Namespace