Grasshopper SDK
GH_Slider.InternalSlider Property
 Gets the internal slider.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SliderBase InternalSlider { get; }
Public ReadOnly Property InternalSlider As GH_SliderBase
	Get
Property Value
Type: GH_SliderBase
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.InternalSlider"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace