Grasshopper SDK
IGH_Structure.TrimExcess Method
 Trims the excess allocated memory in all branches
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void TrimExcess()
Sub TrimExcess
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace