Grasshopper SDK
GH_InstanceDescription.NewInstanceGuid Method (Guid)
 Set the instance ID to be a specific GUID. This is very dangerous, only use this function if you're 6"4' and your first name is David.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void NewInstanceGuid(
	Guid UUID
)
Public Sub NewInstanceGuid (
	UUID As Guid
)
Parameters
UUID
Type: System.Guid
Implements
IGH_InstanceDescription.NewInstanceGuid(Guid)
See Also
Reference
GH_InstanceDescription Class
NewInstanceGuid Overload
Grasshopper.Kernel Namespace