Grasshopper SDK
IGH_BakeAwareObject.BakeGeometry Method (RhinoDoc, ObjectAttributes, List<Guid>)
 Bake all the goemetry in this object in the given Rhino document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void BakeGeometry(
	RhinoDoc doc,
	ObjectAttributes att,
	List<Guid> obj_ids
)
Sub BakeGeometry (
	doc As RhinoDoc,
	att As ObjectAttributes,
	obj_ids As List(Of Guid)
)
Parameters
doc
Type: RhinoDoc
Document to bake into.
att
Type: ObjectAttributes
Attributes to use for baked geometry.
obj_ids
Type: System.Collections.Generic.List<Guid>
All bake objects IDs will be appended to this list.
See Also
Reference
IGH_BakeAwareObject Interface
BakeGeometry Overload
Grasshopper.Kernel Namespace