Grasshopper SDK
GH_DigitNumber.Maximum Property
 Gets the maximum value allowed in this number.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Maximum { get; set; }
Public Property Maximum As Decimal
	Get
	Set
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitNumber.Maximum"]
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace