Grasshopper SDK
GH_SolutionEventArgs.StartTime Property
 Gets the time when the current solution began.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime StartTime { get; }
Public ReadOnly Property StartTime As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_SolutionEventArgs.StartTime"]
See Also
Reference
GH_SolutionEventArgs Class
Grasshopper.Kernel Namespace