Grasshopper SDK
GH_Material Properties
The GH_Material type exposes the following members.
Properties
Name | Description
IsReferencedShader
IsValid |  (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
RdkMaterialId
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace