Grasshopper SDK
GH_PreviewMeshArgs.Material Property
 Gets the material in which meshes ought to be drawn.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DisplayMaterial Material { get; }
Public ReadOnly Property Material As DisplayMaterial
	Get
Property Value
Type: DisplayMaterial
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewMeshArgs.Material"]
See Also
Reference
GH_PreviewMeshArgs Class
Grasshopper.Kernel Namespace