Grasshopper SDK
GH_Param<T>.Recipients Property
 Gets a list of all the recipients of this parameter. I.e. a recipient has this parameter as one of the sources. The Recipient list is maintained by the parameter, do not modify it yourself.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual IList<IGH_Param> Recipients { get; }
Public Overridable ReadOnly Property Recipients As IList(Of IGH_Param)
	Get
Property Value
Type: IList<IGH_Param>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.Recipients"]
Implements
IGH_Param.Recipients
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace