Grasshopper SDK
GH_HiddenAction.ExpiresDisplay Property
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool ExpiresDisplay { get; }
Public Overrides ReadOnly Property ExpiresDisplay As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.Actions.GH_HiddenAction.ExpiresDisplay"]
See Also
Reference
GH_HiddenAction Class
Grasshopper.Kernel.Undo.Actions Namespace