Grasshopper SDK
GH_Theme.LoadTheme Method
 Instantiate all palette and gui defaults. This function reads the colour values out of grasshopper_gui.xml settings database if it exists.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void LoadTheme()
Public Sub LoadTheme
See Also
Reference
GH_Theme Class
Grasshopper.GUI.Theme Namespace