Grasshopper SDK
GH_StateServer Constructor
Initializes a new instance of the GH_StateServer class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_StateServer(
	GH_Document owner
)
Public Sub New (
	owner As GH_Document
)
Parameters
owner
Type: Grasshopper.Kernel.GH_Document
See Also
Reference
GH_StateServer Class
Grasshopper.Kernel Namespace