Grasshopper SDK
IGH_UpgradeObject Interface
 Create a class with an empty constructor that implements this interface if you want to provide an upgrade mechanism.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_UpgradeObject
Public Interface IGH_UpgradeObject
The IGH_UpgradeObject type exposes the following members.
Properties
Name | Description
UpgradeFrom
 Gets the ComponentGuid of the old object (the object to be updated).
UpgradeTo
 Gets the ComponentGuid of the new object (the object that will be inserted).
Version
 Return a DateTime object that indicates when this upgrade mechanism was written, so that it becomes possible to distinguish competing upgrade mechanisms.
Top
Methods
Name | Description
Upgrade
 Upgrade an existing object.
Top
See Also
Reference
Grasshopper.Kernel Namespace