Grasshopper SDK
IGH_InstanceDescription.NickName Property
 Gets or sets the nickname of the object. This field can be changed by the user.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string NickName { get; set; }
Property NickName As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_InstanceDescription.NickName"]
See Also
Reference
IGH_InstanceDescription Interface
Grasshopper.Kernel Namespace