Grasshopper SDK
GH_Circle Class
 Represents a 3D circle. GH_Circle re-implements the OpenNURBS OnCircle class.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Circle>
 Grasshopper.Kernel.Types.GH_GeometricGoo<Circle>
 Grasshopper.Kernel.Types.GH_Circle
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Circle : GH_GeometricGoo<Circle>,
	IGH_BakeAwareData, IGH_PreviewData
Public Class GH_Circle
	Inherits GH_GeometricGoo(Of Circle)
	Implements IGH_BakeAwareData, IGH_PreviewData
The GH_Circle type exposes the following members.
Constructors
Name | Description
GH_Circle()
 Default constructor
GH_Circle(Circle)
 Create a duplicate of another circle
GH_Circle(GH_Circle)
 Create a duplicate of another circle.
Top
Properties
Name | Description
Boundingbox
 Gets the boundingbox for this geometry.
 (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsValid
 Gets the validity of this instance. Circles are valid when their base planes are valid and when the radius is larger than zero.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateCircle
 Create a duplicate of this circle.
DuplicateGeometry
 Create a duplicate of this circle.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
EmitProxy
 Returns a proxy that represents this circle. Do not call this function unless you're
 (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString
 Format the circle using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace