Grasshopper SDK
GH_Component.RegisterOutputParams Method
 Declare all your output parameters here.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected abstract void RegisterOutputParams(
	GH_Component.GH_OutputParamManager pManager
)
Protected MustOverride Sub RegisterOutputParams (
	pManager As GH_Component.GH_OutputParamManager
)
Parameters
pManager
Type: Grasshopper.Kernel.GH_Component.GH_OutputParamManager
Use the pManager to register new parameters. pManager is never null.
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace