Grasshopper SDK
GH_Attributes<T>.NewInstanceGuid Method (Guid)
 Generate a new instance GUID for the owner object. Do not use this overload unless you're > 1.95m and called David.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void NewInstanceGuid(
	Guid newId
)
Public Sub NewInstanceGuid (
	newId As Guid
)
Parameters
newId
Type: System.Guid
Implements
IGH_Attributes.NewInstanceGuid(Guid)
See Also
Reference
GH_Attributes<T> Class
NewInstanceGuid Overload
Grasshopper.Kernel Namespace