Grasshopper SDK
Translation Constructor
Initializes a new instance of the Translation class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Translation()
Public Sub New
See Also
Reference
Translation Class
Translation Overload
Grasshopper.Kernel.Types.Transforms Namespace