Grasshopper SDK
Node3d<T>.SubTree Method
 Gets an iterator for all nodes in this (sub)tree.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IEnumerator<Node3d<T>> SubTree(
	bool omitStructuralNodes
)
Public Function SubTree (
	omitStructuralNodes As Boolean
) As IEnumerator(Of Node3d(Of T))
Parameters
omitStructuralNodes
Type: System.Boolean
If true, nodes that contain other nodes will be skipped. Only nodes containing items will be included.
Return Value
Type: IEnumerator<Node3d<T>>
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace