Grasshopper SDK
GH_Skin.panel_back Field
 Specifies the default fill colour for Panel objects.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color panel_back
Public Shared panel_back As Color
Field Value
Type: Color
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace