Grasshopper SDK
GH_BracketMismatchException Class
 Exception used during Rule Set parsing.
Inheritance Hierarchy
System.Object
 System.Exception
 Grasshopper.Kernel.Data.GH_BracketMismatchException
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_BracketMismatchException : Exception
Public Class GH_BracketMismatchException
	Inherits Exception
The GH_BracketMismatchException type exposes the following members.
Constructors
Name | Description
GH_BracketMismatchException()
Initializes a new instance of the GH_BracketMismatchException class
GH_BracketMismatchException(String)
Initializes a new instance of the GH_BracketMismatchException class
GH_BracketMismatchException(String, Int32)
Initializes a new instance of the GH_BracketMismatchException class
Top
Properties
Name | Description
Index
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace