Grasshopper SDK
GH_Variant._Point Property
 Gets the contents of this Variant as a Point.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point3d _Point { get; }
Public ReadOnly Property _Point As Point3d
	Get
Property Value
Type: Point3d
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_Variant._Point"]
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace