Grasshopper SDK
GH_Component.HelpDescription Property
 Override this method if you want the help topic content to be more than the Component description.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual string HelpDescription { get; }
Protected Overridable ReadOnly Property HelpDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.HelpDescription"]
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace