Grasshopper SDK
GH_Goo<T>.m_value Field
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected T m_value
Protected m_value As T
Field Value
Type: T
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace