Grasshopper SDK
GH_Structure<T>.DataList Property (Int32)
 Gets a direct pointer to the list of data under the specified index.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<T> this[
	int index
] { get; }
Public ReadOnly Default Property DataList (
	index As Integer
) As List(Of T)
	Get
Parameters
index
Type: System.Int32
Index of the data branch to retrieve.
Property Value
Type: List<T>
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.DataList(System.Int32)"]
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown if the index does not represent a valid branch.
See Also
Reference
GH_Structure<T> Class
DataList Overload
Grasshopper.Kernel.Data Namespace