Grasshopper SDK
GH_WireDirection Enumeration
 Identifies a wire direction.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_WireDirection
Public Enumeration GH_WireDirection
Members
Member name | Value | Description
left | 0
right | 1
See Also
Reference
Grasshopper.GUI.Canvas Namespace