Grasshopper SDK
GH_StateTag Class
 Abstract implementation of the IGH_StateTag interface. Derive from this class rather than implementing IGH_StateTag.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_StateTag
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_StateTag : IGH_StateTag
Public MustInherit Class GH_StateTag
	Implements IGH_StateTag
The GH_StateTag type exposes the following members.
Constructors
Name | Description
GH_StateTag
Initializes a new instance of the GH_StateTag class
Top
Properties
Name | Description
Description
Icon
Name
Stage
 Gets or sets the stage rectangle for this tag.
StateDescription
 Gets or sets the state description for this tag.
Top
Methods
Name | Description
Render
RenderFreeformIcon
 Render a filled path with default shading.
RenderTagBlankIcon(Graphics)
 Render a blank rectangle icon.
RenderTagBlankIcon(Graphics, GH_StateTag.DrawCallback)
 Render a blank rectangle icon.
RenderTagPolygonIcon
 Render a filled polygon with default shading.
Top
See Also
Reference
Grasshopper.Kernel Namespace