Grasshopper SDK
GH_PersistentParam<T>.PrepareForPrompt Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void PrepareForPrompt()
Protected Overridable Sub PrepareForPrompt
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace