Grasshopper SDK
GH_MenuTextBox Class
 Utility control for putting textboxes into menus.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_MenuTextBox
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_MenuTextBox
Public Class GH_MenuTextBox
The GH_MenuTextBox type exposes the following members.
Constructors
Name | Description
GH_MenuTextBox
 Constructor for TextBox collection.
Top
Properties
Name | Description
OriginalText
 Gets or sets the original text that was visible when the control was first displayed.
Text
 Gets or sets the current text.
TextBoxItem
 Gets the text box control embedded in the menu.
Width
 Gets or sets the width of the control.
Top
Methods
Name | Description
CloseEntireMenuStructure
 Call this function to close the ENTIRE menu structure.
Top
Events
Name | Description
KeyDown
 Raised whenever a key is pressed.
TextChanged
 Raised whenever the text in the textbox changes.
Top
See Also
Reference
Grasshopper.GUI Namespace