Grasshopper SDK
GH_PaletteStyle.m_edge Field
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color m_edge
Public m_edge As Color
Field Value
Type: Color
See Also
Reference
GH_PaletteStyle Class
Grasshopper.GUI.Canvas Namespace