Grasshopper SDK
GH_Document.OnFilePathChanged Method
 Raise the FilePathChanged event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnFilePathChanged(
	string old,
	string new
)
Public Sub OnFilePathChanged (
	old As String,
	new As String
)
Parameters
old
Type: System.String
Old filepath.
new
Type: System.String
New filepath.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace