Grasshopper SDK
GH_Component.GH_OutputParamManager.Register_CircleParam Method (String, String, String)
 Register a new 3D circle parameter
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Register_CircleParam(
	string name,
	string nickname,
	string description
)
Public Sub Register_CircleParam (
	name As String,
	nickname As String,
	description As String
)
Parameters
name
Type: System.String
The name of the parameter. Keep it short, single words are best.
nickname
Type: System.String
The nickname of the parameter. Keep it short, single characters are best.
description
Type: System.String
The description of the parameter. Be succinct but clear.
Remarks
See Also
Reference
GH_Component.GH_OutputParamManager Class
Register_CircleParam Overload
Grasshopper.Kernel Namespace