Grasshopper SDK
GH_DigitNumber.Epsilon Property
 Gets the smallest possible change.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Epsilon { get; }
Public ReadOnly Property Epsilon As Decimal
	Get
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitNumber.Epsilon"]
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace