Grasshopper SDK
GH_Point.CreateFromEdgeDistance Method
 Create new point geometry instance based on a curve distance parameter
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateFromEdgeDistance(
	Guid brp_id,
	Curve edge,
	int e_index,
	double t,
	bool bFromStart
)
Public Sub CreateFromEdgeDistance (
	brp_id As Guid,
	edge As Curve,
	e_index As Integer,
	t As Double,
	bFromStart As Boolean
)
Parameters
brp_id
Type: System.Guid
ID of the curve this object references
edge
Type: Curve
The edge curve
e_index
Type: System.Int32
Index of edge to reference
t
Type: System.Double
Parameter along the curve in curve domain space
bFromStart
Type: System.Boolean
True if the distance is to be measured from the start of the curve
Remarks
This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace