Grasshopper SDK
GH_ScriptVariant.Type Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ScriptVariantType Type { get; }
Public ReadOnly Property Type As GH_ScriptVariantType
	Get
Property Value
Type: GH_ScriptVariantType
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ScriptVariant.Type"]
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace