Grasshopper SDK
GH_Param<T>.RemoveSource Method (IGH_Param)
 Remove the specified source from this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void RemoveSource(
	IGH_Param source
)
Public Overridable Sub RemoveSource (
	source As IGH_Param
)
Parameters
source
Type: Grasshopper.Kernel.IGH_Param
Source to remove.
Implements
IGH_Param.RemoveSource(IGH_Param)
See Also
Reference
GH_Param<T> Class
RemoveSource Overload
Grasshopper.Kernel Namespace