Grasshopper SDK
GH_PreviewArgs.WireColour_Selected Property
 Gets the document default colour for selected Wires.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color WireColour_Selected { get; }
Public ReadOnly Property WireColour_Selected As Color
	Get
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewArgs.WireColour_Selected"]
Implements
IGH_PreviewArgs.WireColour_Selected
See Also
Reference
GH_PreviewArgs Class
Grasshopper.Kernel Namespace