Grasshopper SDK
GH_Skin.canvas_grid_row Field
 Specifies the interval of the canvas grid rows.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int canvas_grid_row
Public Shared canvas_grid_row As Integer
Field Value
Type: Int32
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace