Grasshopper SDK
GH_Attributes<T>.NewInstanceGuid Method
 Generate a new instance GUID for the owner object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void NewInstanceGuid()
Public Sub NewInstanceGuid
Implements
IGH_Attributes.NewInstanceGuid()
See Also
Reference
GH_Attributes<T> Class
NewInstanceGuid Overload
Grasshopper.Kernel Namespace