Grasshopper SDK
GH_GlossaryItem.Author Property
 Gets the author of this glossary entry. This field is optional and may not be defined.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Content Author { get; }
Public ReadOnly Property Author As IGH_Content
	Get
Property Value
Type: IGH_Content
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_GlossaryItem.Author"]
See Also
Reference
GH_GlossaryItem Class
Grasshopper.Documentation Namespace