Grasshopper SDK
GH_VarParamEventArgs.Index Property
 Gets the index of the parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_VarParamEventArgs.Index"]
See Also
Reference
GH_VarParamEventArgs Class
Grasshopper.Kernel Namespace