Grasshopper SDK
GH_Animator.DecimalAnimator Method (Decimal, Decimal, Int32)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<decimal> DecimalAnimator(
	decimal A,
	decimal B,
	int duration
)
Public Shared Function DecimalAnimator (
	A As Decimal,
	B As Decimal,
	duration As Integer
) As GH_Animator(Of Decimal)
Parameters
A
Type: System.Decimal
B
Type: System.Decimal
duration
Type: System.Int32
Return Value
Type: GH_Animator<Decimal>
See Also
Reference
GH_Animator Class
DecimalAnimator Overload
Grasshopper.GUI Namespace