Grasshopper SDK
GH_Convert.ToString_Secondary Method
 Creates a String representation of an object by calling the ToString() function.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToString_Secondary(
	Object data,
	ref string destination
)
Public Shared Function ToString_Secondary (
	data As Object,
	ByRef destination As String
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.String
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace