Grasshopper SDK
GH_GlossaryItem.Path Property
 Gets the source file for this glossary entry.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_GlossaryItem.Path"]
See Also
Reference
GH_GlossaryItem Class
Grasshopper.Documentation Namespace