Grasshopper SDK
GH_FontServer.ScriptFamilyChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ScriptFamilyChangedEventHandler()
Public Delegate Sub ScriptFamilyChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace