Grasshopper SDK
GH_PluginFolderType Enumeration
 Enumerates the possible folder types for GH_AssemblyFolderInfo
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_PluginFolderType
Public Enumeration GH_PluginFolderType
Members
Member name | Value | Description
Core | 0 |  The Core folder is the one where native Grasshopper GHA files are installed.
Default | 1 |  The Default folder is where Grasshopper puts 3rd party GHA files.
RhiFolder | 2 |  A RhiFolder folder is created by an RHI installer package.
UserFolder | 3 |  A UserFolder is created by the user via the _GrasshopperDeveloperSettings command.
See Also
Reference
Grasshopper.Kernel Namespace