Grasshopper SDK
GH_AutoSaveSettings.SaveOnWireEventChanged Event
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_AutoSaveSettings.SaveOnWireEventChangedEventHandler SaveOnWireEventChanged
Public Shared Event SaveOnWireEventChanged As GH_AutoSaveSettings.SaveOnWireEventChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_AutoSaveSettings.SaveOnWireEventChangedEventHandler
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace