Grasshopper SDK
IGH_DocumentObject.RemovedFromDocument Method
 This method will be called when an object is removed from a document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void RemovedFromDocument(
	GH_Document document
)
Sub RemovedFromDocument (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document that now no longer owns this object.
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace