Grasshopper SDK
GH_DocumentObject.Exposure Property
 Gets the exposure of this object in the Graphical User Interface. The default is to expose everywhere.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual GH_Exposure Exposure { get; }
Public Overridable ReadOnly Property Exposure As GH_Exposure
	Get
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentObject.Exposure"]
Implements
IGH_DocumentObject.Exposure
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace