Grasshopper SDK
GH_AsynchFileData.IsFileData Property
 Gets whether the data has been retrieved at least once.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsFileData { get; }
Public ReadOnly Property IsFileData As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_AsynchFileData.IsFileData"]
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace