Grasshopper SDK
GH_FileWatcher.Dispose Method
Releases all resources used by the GH_FileWatcher
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
GH_FileWatcher Class
Dispose Overload
Grasshopper.Kernel Namespace