Grasshopper SDK
GH_AsynchFileData Fields
The GH_AsynchFileData type exposes the following members.
Fields
Name | Description
LocalUpdatePeriod
 Specifies the recommended number of milliseconds in between periodic checks for files on the local system.
Location
 Gets the location this class is watching.
RemoteUpdatePeriod
 Specifies the recommended number of milliseconds in between periodic checks for files on network drives.
Top
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace