Grasshopper SDK
GH_ObjectChangedEventArgs Constructor (IGH_DocumentObject, GH_ObjectEventType)
Initializes a new instance of the GH_ObjectChangedEventArgs class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ObjectChangedEventArgs(
	IGH_DocumentObject eSender,
	GH_ObjectEventType eType
)
Public Sub New (
	eSender As IGH_DocumentObject,
	eType As GH_ObjectEventType
)
Parameters
eSender
Type: Grasshopper.Kernel.IGH_DocumentObject
eType
Type: Grasshopper.Kernel.GH_ObjectEventType
See Also
Reference
GH_ObjectChangedEventArgs Class
GH_ObjectChangedEventArgs Overload
Grasshopper.Kernel Namespace