Grasshopper SDK
IGH_ActiveObject.RuntimeMessageLevel Property
 Gets the worst-case level of all messages. I.e. if only warnings have been recorded, the level will be ::warning. If even a single error exists, the level will be ::error.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_RuntimeMessageLevel RuntimeMessageLevel { get; }
ReadOnly Property RuntimeMessageLevel As GH_RuntimeMessageLevel
	Get
Property Value
Type: GH_RuntimeMessageLevel
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ActiveObject.RuntimeMessageLevel"]
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace