Grasshopper SDK
GH_FontServer.StringWidth Method (String, Font)
 Measure the width of a string in pixels
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int StringWidth(
	string text,
	Font font
)
Public Shared Function StringWidth (
	text As String,
	font As Font
) As Integer
Parameters
text
Type: System.String
The string to measure
font
Type: System.Drawing.Font
The font to measure with
Return Value
Type: Int32
See Also
Reference
GH_FontServer Class
StringWidth Overload
Grasshopper.Kernel Namespace