Grasshopper SDK
GH_UndoServer.ClearUndo Method
 Clear the redo list.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearUndo()
Public Sub ClearUndo
Remarks
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace