Grasshopper SDK
GH_PointRefData Constructor (GH_PointRefData)
Initializes a new instance of the GH_PointRefData class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PointRefData(
	GH_PointRefData iOther
)
Public Sub New (
	iOther As GH_PointRefData
)
Parameters
iOther
Type: Grasshopper.Kernel.Types.GH_PointRefData
See Also
Reference
GH_PointRefData Class
GH_PointRefData Overload
Grasshopper.Kernel.Types Namespace