Grasshopper SDK
GH_Number Constructor (GH_Number)
Initializes a new instance of the GH_Number class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Number(
	GH_Number other
)
Public Sub New (
	other As GH_Number
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Number
See Also
Reference
GH_Number Class
GH_Number Overload
Grasshopper.Kernel.Types Namespace