Grasshopper SDK
GH_MemoryBitmap.Sample Method (Int32, Int32, Color)
 Top level sampling function.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Sample(
	int x,
	int y,
	ref Color col
)
Public Function Sample (
	x As Integer,
	y As Integer,
	ByRef col As Color
) As Boolean
Parameters
x
Type: System.Int32
Unmapped x pixel coordinate.
y
Type: System.Int32
Unmapped y pixel coordinate.
col
Type: System.Drawing.Color
Colour output.
Return Value
Type: Boolean
True on success, false if pixels could not be sampled.
See Also
Reference
GH_MemoryBitmap Class
Sample Overload
Grasshopper.Kernel Namespace