Grasshopper SDK
DataTree<T>.AddRange Method (IEnumerable<T>)
 Add (append) a list of data items to the last branch in the tree. If no branch exists yet, a new one will be created.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddRange(
	IEnumerable<T> data
)
Public Sub AddRange (
	data As IEnumerable(Of T)
)
Parameters
data
Type: System.Collections.Generic.IEnumerable<T>
Data to append
See Also
Reference
DataTree<T> Class
AddRange Overload
Grasshopper Namespace