Grasshopper SDK
GH_ExternalFile Class
 Represents information about external files to be loaded.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_ExternalFile
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ExternalFile
Public Class GH_ExternalFile
The GH_ExternalFile type exposes the following members.
Constructors
Name | Description
GH_ExternalFile
 Create a new instance of the file info class
Top
Properties
Name | Description
FileHash
 Gets the file hash.
FileName
 Gets the file name (without the extension).
FilePath
 Gets the file path.
FileSize
 Gets the file size (in bytes).
FileType
 Gets the file type as indicated by the extension.
Top
Methods
Name | Description
IsIdenticalTo
 Compares two files for content. If the size and the hash or the other file are equal to this one, the files are considered identical.
Top
See Also
Reference
Grasshopper.Kernel Namespace