Grasshopper SDK
GH_DocumentObject Fields
The GH_DocumentObject type exposes the following members.
Fields
Name | Description
m_attributes
Top
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace