Grasshopper SDK
GH_ConnectivityDiagram.NodeCount Property
 Gets the number of connectivity nodes in this diagram.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int NodeCount { get; }
Public ReadOnly Property NodeCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ConnectivityDiagram.NodeCount"]
See Also
Reference
GH_ConnectivityDiagram Class
Grasshopper.Kernel Namespace