Grasshopper SDK
GH_GraphicsUtil.DentVertical Method (Graphics, Rectangle)
 Draws a vertical dent. A vertical dent had dark lines along the left and right edges.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void DentVertical(
	Graphics g,
	Rectangle box
)
Public Shared Sub DentVertical (
	g As Graphics,
	box As Rectangle
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
box
Type: System.Drawing.Rectangle
Dimensions of the dent.
See Also
Reference
GH_GraphicsUtil Class
DentVertical Overload
Grasshopper.GUI Namespace