Grasshopper SDK
GH_LayoutAction Constructor
Initializes a new instance of the GH_LayoutAction class
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LayoutAction(
	IGH_DocumentObject obj
)
Public Sub New (
	obj As IGH_DocumentObject
)
Parameters
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
See Also
Reference
GH_LayoutAction Class
Grasshopper.Kernel.Undo.Actions Namespace