Grasshopper SDK
IRcpAwareObject Interface
 Implement this interface in a parameter or component if you want to be publishable on the remote control panel.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IRcpAwareObject
Public Interface IRcpAwareObject
The IRcpAwareObject type exposes the following members.
Methods
Name | Description
PublishRcpItem
 Emit a new object to be inserted on a Remote Control Panel.
Top
See Also
Reference
Grasshopper.Kernel Namespace