Grasshopper SDK
GH_Variant._String Property
 Gets the contents of this Variant as a String. This function will work for all Variant types.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string _String { get; }
Public ReadOnly Property _String As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_Variant._String"]
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace