Grasshopper SDK
GH_SettingsServer.GetValue Method (String, String)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string GetValue(
	string key,
	string default
)
Public Function GetValue (
	key As String,
	default As String
) As String
Parameters
key
Type: System.String
default
Type: System.String
Return Value
Type: String
See Also
Reference
GH_SettingsServer Class
GetValue Overload
Grasshopper.Kernel Namespace