Grasshopper SDK
Scale.ScaleXFactor Property
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double ScaleXFactor { get; set; }
Public Property ScaleXFactor As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Transforms.Scale.ScaleXFactor"]
See Also
Reference
Scale Class
Grasshopper.Kernel.Types.Transforms Namespace