Grasshopper SDK
GH_Component.IsDataProvider Property
 Components are never Data providers. Only the output parameters can be considered to be providers.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override sealed bool IsDataProvider { get; }
Public Overrides NotOverridable ReadOnly Property IsDataProvider As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.IsDataProvider"]
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace