Grasshopper SDK
GH_Document.SelectAll Method
 Select all top-level attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SelectAll()
Public Sub SelectAll
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace