Grasshopper SDK
GH_Plane Constructor (Plane)
 Create a duplicate of another plane.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Plane(
	Plane plane
)
Public Sub New (
	plane As Plane
)
Parameters
plane
Type: Plane
Plane to set.
See Also
Reference
GH_Plane Class
GH_Plane Overload
Grasshopper.Kernel.Types Namespace