Grasshopper SDK
CentralSettings.AuthorEMail Property
 Gets or sets the default author e-mail to be used for all data generated by this Grasshopper installation.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string AuthorEMail { get; set; }
Public Shared Property AuthorEMail As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.CentralSettings.AuthorEMail"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace