Grasshopper SDK
GH_ColourCube.Slice Property
 Gets the rectangle that describes the cutting slide through the current colour space.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle Slice { get; }
Public ReadOnly Property Slice As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourCube.Slice"]
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace