Grasshopper SDK
Instances.ComponentServer Property
 Gets the ComponentServer instance cached by the Instance Server. The ComponentServer will be instantiated the first time this property accessed. This is a rather involved process during which the Grasshopper Banner will be displayed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_ComponentServer ComponentServer { get; }
Public Shared ReadOnly Property ComponentServer As GH_ComponentServer
	Get
Property Value
Type: GH_ComponentServer
[Missing <value> documentation for "P:Grasshopper.Instances.ComponentServer"]
See Also
Reference
Instances Class
Grasshopper Namespace