Grasshopper SDK
GH_ValueProxy<T>.m_IsStringProxy Field
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected bool m_IsStringProxy
Protected m_IsStringProxy As Boolean
Field Value
Type: Boolean
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace