Grasshopper SDK
GH_VerticalScrollBar.Grip Property
 Gets the actual dimensions of the scroll bar grip.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle Grip { get; }
Public ReadOnly Property Grip As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.GH_VerticalScrollBar.Grip"]
See Also
Reference
GH_VerticalScrollBar Class
Grasshopper.GUI Namespace