Grasshopper SDK
GH_Document.RequestAbortSolution Method
 Set the requestabort flag. The solution will be aborted whenever the current active object is completed. It is also possible that active objects themselves implement an abortion mechanism, in which case abortion might occur even sooner.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RequestAbortSolution()
Public Sub RequestAbortSolution
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace