Grasshopper SDK
GH_GHALoadingEventArgs Class
 Event arguments used in the GH_GHALoaded event on GH_ComponentServer.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_GHALoadingEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_GHALoadingEventArgs : EventArgs
Public Class GH_GHALoadingEventArgs
	Inherits EventArgs
The GH_GHALoadingEventArgs type exposes the following members.
Properties
Name | Description
Assembly
 Gets the assembly that was loaded from the GHA file.
FileName
 Gets the location of the gha file.
Icon
 Gets the official icon of the GHA file.
Id
 Gets the Id of the GHA file.
LoadingMechanism
 Gets the mechanism that was used to load the file.
Name
 Gets the official name of the GHA file.
Top
See Also
Reference
Grasshopper.Kernel Namespace