Grasshopper SDK
GH_LineParser Class
 Provides basic functionality for the custom ReadFile component script parsing.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_LineParser
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_LineParser
Public MustInherit Class GH_LineParser
The GH_LineParser type exposes the following members.
Constructors
Name | Description
GH_LineParser
Initializes a new instance of the GH_LineParser class
Top
Methods
Name | Description
ParseLine
 Parse a line of text and convert it to custom data.
Top
See Also
Reference
Grasshopper.Kernel Namespace