Grasshopper SDK
GH_IndexRanges Class
 Represents a sorted, non-colliding collection of index ranges.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_IndexRanges
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_IndexRanges : GH_ISerializable
Public Class GH_IndexRanges
	Implements GH_ISerializable
The GH_IndexRanges type exposes the following members.
Constructors
Name | Description
GH_IndexRanges
Initializes a new instance of the GH_IndexRanges class
Top
Properties
Name | Description
Count
 Gets the number of ranges stored in this collection.
Range
 Gets the range at the given index.
Top
Methods
Name | Description
InsertRange
 Insert an index range into the collection.
Read
RemoveRange
 Remove an index range from the collection.
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace