Grasshopper SDK
GH_Structure<T>.DuplicateCast<Q> Method
 Create a duplicate of this structure in a different type.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Structure<Q> DuplicateCast<Q>(
	GH_Structure<T>.ConversionDelegate<T, Q> conversion
)
where Q : IGH_Goo
Public Function DuplicateCast(Of Q As IGH_Goo) (
	conversion As GH_Structure<T>.ConversionDelegate(Of T, Q)
) As GH_Structure(Of Q)
Parameters
conversion
Type: Grasshopper.Kernel.Data.GH_Structure<T>.ConversionDelegate<T, Q>
Conversion delegate.
Type Parameters
Q
Type of conversion.
Return Value
Type: GH_Structure<Q>
A duplicate of this structure with all valid casts.
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace