Grasshopper SDK
IGH_VariableParameterComponent.VariableParameterMaintenance Method
 This method will be called when a closely related set of variable parameter operations completes. This would be a good time to ensure all Nicknames and parameter properties are correct. This method will also be called upon IO operations such as Open, Paste, Undo and Redo.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void VariableParameterMaintenance()
Sub VariableParameterMaintenance
See Also
Reference
IGH_VariableParameterComponent Interface
Grasshopper.Kernel Namespace