Grasshopper SDK
GH_CodeStringSegment Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Expressions.GH_CodeStringSegment
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_CodeStringSegment
Public Class GH_CodeStringSegment
The GH_CodeStringSegment type exposes the following members.
Constructors
Name | Description
GH_CodeStringSegment
Initializes a new instance of the GH_CodeStringSegment class
Top
Properties
Name | Description
IsCode
String
StringValue
Top
Methods
Name | Description
IsAlpha
Replace
ReplaceToken
ToString |  (Overrides Object.ToString().)
Top
Fields
Name | Description
m_IsCode
m_String
Top
See Also
Reference
Grasshopper.Kernel.Expressions Namespace