Grasshopper SDK
Index3d<T> Class
 Represents an element index within a Tree3d instance.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Geometry.SpatialTrees.Index3d<T>
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class Index3d<T> : IComparable<Index3d<T>>
Public Class Index3d(Of T)
	Implements IComparable(Of Index3d(Of T))
Type Parameters
T
The Index3d<T> type exposes the following members.
Constructors
Name | Description
Index3d<T>
Initializes a new instance of the Index3d<T> class
Top
Properties
Name | Description
GlobalIndex
 Gets the item index within the tree global list.
Item
 Gets the actual item.
LocalIndex
 Gets the index within the node index list.
Node
 Gets the node of the tree in which this element is stored.
Top
Methods
Name | Description
CompareTo
Top
See Also
Reference
Grasshopper.Kernel.Geometry.SpatialTrees Namespace