Grasshopper SDK
GH_Convert.CombineDateAndTime Method
 Combine a pure date and a pure time.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static DateTime CombineDateAndTime(
	DateTime date,
	DateTime time
)
Public Shared Function CombineDateAndTime (
	date As DateTime,
	time As DateTime
) As DateTime
Parameters
date
Type: System.DateTime
Must be a pure date instance.
time
Type: System.DateTime
Must be a pute time instance.
Return Value
Type: DateTime
A combined date and time.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace