Grasshopper SDK
GH_Interval Constructor (Interval)
 Create a duplicate of another interval
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Interval(
	Interval interval
)
Public Sub New (
	interval As Interval
)
Parameters
interval
Type: Interval
Interval to copy. If null, a default interval will be created.
See Also
Reference
GH_Interval Class
GH_Interval Overload
Grasshopper.Kernel.Types Namespace