Grasshopper SDK
GH_Point Constructor
Initializes a new instance of the GH_Point class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Point()
Public Sub New
See Also
Reference
GH_Point Class
GH_Point Overload
Grasshopper.Kernel.Types Namespace