Grasshopper SDK
GH_RuntimeFile.Keys Property
 Gets a list of all the keys present in the File.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string> Keys { get; }
Public ReadOnly Property Keys As List(Of String)
	Get
Property Value
Type: List<String>
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_RuntimeFile.Keys"]
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace