Grasshopper SDK
GH_Colour Constructor (Color)
Initializes a new instance of the GH_Colour class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Colour(
	Color colour
)
Public Sub New (
	colour As Color
)
Parameters
colour
Type: System.Drawing.Color
See Also
Reference
GH_Colour Class
GH_Colour Overload
Grasshopper.Kernel.Types Namespace