Grasshopper SDK
IGH_RenderAwareData.AppendRenderGeometry Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void AppendRenderGeometry(
	GH_RenderArgs args,
	RenderMaterial materialHint
)
Sub AppendRenderGeometry (
	args As GH_RenderArgs,
	materialHint As RenderMaterial
)
Parameters
args
Type: Grasshopper.Kernel.GH_RenderArgs
materialHint
Type: RenderMaterial
See Also
Reference
IGH_RenderAwareData Interface
Grasshopper.Kernel Namespace