Grasshopper SDK
GH_DocumentAssociations.Associate Method
 Add an association between a Rhino and a Grasshopper file. If a similar association already exists, it will be overwritten. This function reads and writes to the disk, it is SLOW. Only call it when you KNOW something changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Associate(
	string rhinoFile,
	string grasshopperFile
)
Public Sub Associate (
	rhinoFile As String,
	grasshopperFile As String
)
Parameters
rhinoFile
Type: System.String
Path to Rhino 3dm file.
grasshopperFile
Type: System.String
Path to Grasshopper ghx or gh file.
See Also
Reference
GH_DocumentAssociations Class
Grasshopper.Kernel Namespace