Grasshopper SDK
GH_Viewport.Height Property
 Gets or sets the height of the viewport. Typically this is tied to the dimensions of the canvas. Height is not allowed to go below 5 pixels.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Height { get; set; }
Public Property Height As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.Height"]
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace