Grasshopper SDK
CentralSettings.CanvasZuiZoomLevel Property
 Gets or sets the global Zui zoom threshold.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static float CanvasZuiZoomLevel { get; set; }
Public Shared Property CanvasZuiZoomLevel As Single
	Get
	Set
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CanvasZuiZoomLevel"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace