Grasshopper SDK
GH_Canvas.Painter Property
 Gets the painter object that handles most of the drawing logic for this canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Painter Painter { get; }
Public ReadOnly Property Painter As GH_Painter
	Get
Property Value
Type: GH_Painter
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.Painter"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace