Grasshopper SDK
GH_TrackerFrame.PositionScreen Field
 The position (in screen coordinates) of the frame.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point PositionScreen
Public PositionScreen As Point
Field Value
Type: Point
See Also
Reference
GH_TrackerFrame Structure
Grasshopper.GUI Namespace