Grasshopper SDK
Validation3d<T> Delegate
 Delegate to be used during advanced customized searches.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate bool Validation3d<T>(
	T element,
	int globalIndex,
	Node3d<T> node
)
Public Delegate Function Validation3d(Of T) (
	element As T,
	globalIndex As Integer,
	node As Node3d(Of T)
) As Boolean
Parameters
element
Type: T
Potential hit.
globalIndex
Type: System.Int32
Index of item in global list.
node
Type: Grasshopper.Kernel.Geometry.SpatialTrees.Node3d<T>
Node containing the element.
Type Parameters
T
Element type.
Return Value
Type: Boolean
True if item can be included in the search, false if not.
See Also
Reference
Grasshopper.Kernel.Geometry.SpatialTrees Namespace