Grasshopper SDK
GH_RelevantObjectData.CreateGripData Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateGripData(
	IGH_DocumentObject obj,
	bool is_input
)
Public Sub CreateGripData (
	obj As IGH_DocumentObject,
	is_input As Boolean
)
Parameters
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
is_input
Type: System.Boolean
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace