Grasshopper SDK
GH_PreviewUtil.Redraw Method
 Forces a redraw the the viewports.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Redraw()
Public Sub Redraw
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace