Grasshopper SDK
GH_Boolean Constructor (GH_Boolean)
Initializes a new instance of the GH_Boolean class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Boolean(
	GH_Boolean other
)
Public Sub New (
	other As GH_Boolean
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Boolean
See Also
Reference
GH_Boolean Class
GH_Boolean Overload
Grasshopper.Kernel.Types Namespace