Grasshopper SDK
IGH_StructureEnumerator Interface
 Defines a minimum interface for iterating over all data in an IGH_Structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_StructureEnumerator : IEnumerable<IGH_Goo>
Public Interface IGH_StructureEnumerator
	Inherits IEnumerable(Of IGH_Goo)
See Also
Reference
Grasshopper.Kernel.Data Namespace