Grasshopper SDK
GH_Surface.IsPointOnFace Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsPointOnFace(
	double u,
	double v
)
Public Function IsPointOnFace (
	u As Double,
	v As Double
) As Boolean
Parameters
u
Type: System.Double
v
Type: System.Double
Return Value
Type: Boolean
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace