Grasshopper SDK
GH_Viewport.Size Property
 Gets or sets the size of the viewport. The size is typically tied to the dimensions of the Canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Size Size { get; set; }
Public Property Size As Size
	Get
	Set
Property Value
Type: Size
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.Size"]
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace