Grasshopper SDK
GH_GeometricGooWrapper.IsGeometryLoaded Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsGeometryLoaded { get; }
Public ReadOnly Property IsGeometryLoaded As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometricGooWrapper.IsGeometryLoaded"]
Implements
IGH_GeometricGoo.IsGeometryLoaded
See Also
Reference
GH_GeometricGooWrapper Class
Grasshopper.Kernel.Types Namespace