Grasshopper SDK
GH_RhinoScriptInterface.DisableSolver Method
 Disables the Grasshopper Solver. If the Solver is disabled, expired components and parameter will not be recomputed, though any existing solution will remain intact.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DisableSolver()
Public Sub DisableSolver
Examples
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
  Dim GH
  Set GH = Rhino.GetPlugInObject("Grasshopper")
  Call GH.DisableSolver()
  Set GH = Nothing
End Sub
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace