Grasshopper SDK
IGH_UpgradeObject.UpgradeTo Property
 Gets the ComponentGuid of the new object (the object that will be inserted).
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid UpgradeTo { get; }
ReadOnly Property UpgradeTo As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_UpgradeObject.UpgradeTo"]
See Also
Reference
IGH_UpgradeObject Interface
Grasshopper.Kernel Namespace