Grasshopper SDK
Param_MeshParameters.Exposure Property
Namespace: Grasshopper.Kernel.Parameters
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override GH_Exposure Exposure { get; }
Public Overrides ReadOnly Property Exposure As GH_Exposure
	Get
Property Value
Type: GH_Exposure
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_MeshParameters.Exposure"]
See Also
Reference
Param_MeshParameters Class
Grasshopper.Kernel.Parameters Namespace