Grasshopper SDK
GH_Author.Clear Method
 Erase all fields.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace