Grasshopper SDK
GH_Animator.InterpolatePointF Method
 Utility interpolation delegate for System.Drawing.PointF values.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static PointF InterpolatePointF(
	PointF A,
	PointF B,
	double factor
)
Public Shared Function InterpolatePointF (
	A As PointF,
	B As PointF,
	factor As Double
) As PointF
Parameters
A
Type: System.Drawing.PointF
B
Type: System.Drawing.PointF
factor
Type: System.Double
Return Value
Type: PointF
See Also
Reference
GH_Animator Class
Grasshopper.GUI Namespace