Grasshopper SDK
GH_CodeStringSegment.m_IsCode Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected bool m_IsCode
Protected m_IsCode As Boolean
Field Value
Type: Boolean
See Also
Reference
GH_CodeStringSegment Class
Grasshopper.Kernel.Expressions Namespace