Grasshopper SDK
GH_ProcessStep Enumeration
 Enumerates all possible solution states in which the document can be.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ProcessStep
Public Enumeration GH_ProcessStep
Members
Member name | Value | Description
PreProcess | 0 |  The document is ready for a new solution
Process | 1 |  The document is currently calculating a new solution, no changes are allowed during this phase
PostProcess | 2 |  The document has completed a solution, and nothing has changed since.
Aborted | 3 |  The last solution has been aborted before it reached completion.
See Also
Reference
Grasshopper.Kernel Namespace