Grasshopper SDK
GH_ExpressionParser.AddVariable Method (String, Plane)
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddVariable(
	string name,
	Plane val
)
Public Sub AddVariable (
	name As String,
	val As Plane
)
Parameters
name
Type: System.String
val
Type: Plane
See Also
Reference
GH_ExpressionParser Class
AddVariable Overload
Grasshopper.Kernel.Expressions Namespace