Grasshopper SDK
GH_StateTag.RenderFreeformIcon Method
 Render a filled path with default shading.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void RenderFreeformIcon(
	Graphics graphics,
	GraphicsPath path
)
Protected Sub RenderFreeformIcon (
	graphics As Graphics,
	path As GraphicsPath
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
path
Type: System.Drawing.Drawing2D.GraphicsPath
Path to draw.
See Also
Reference
GH_StateTag Class
Grasshopper.Kernel Namespace