Grasshopper SDK
SliderSnapRange.Min Property
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Min { get; }
Public ReadOnly Property Min As Decimal
	Get
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.SliderSnapRange.Min"]
See Also
Reference
SliderSnapRange Structure
Grasshopper.GUI.Base Namespace