Grasshopper SDK
GH_AssemblyFolderInfo.SearchOption Property
 Gets the search option to use when looking for GHA files in this folder.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public SearchOption SearchOption { get; }
Public ReadOnly Property SearchOption As SearchOption
	Get
Property Value
Type: SearchOption
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyFolderInfo.SearchOption"]
See Also
Reference
GH_AssemblyFolderInfo Structure
Grasshopper.Kernel Namespace