Grasshopper SDK
CentralSettings.RibbonSeparatorsChanged Event
 Raised whenever the RibbonSeparators setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.RibbonSeparatorsChangedEventHandler RibbonSeparatorsChanged
Public Shared Event RibbonSeparatorsChanged As CentralSettings.RibbonSeparatorsChangedEventHandler
Value
Type: Grasshopper.CentralSettings.RibbonSeparatorsChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace