Grasshopper SDK
GH_Structure<T>.Append Method (T)
 Append a data item to the last branch in the structure. If no branch exist yet, a new one will be created with [path = {0}]
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Append(
	T data
)
Public Sub Append (
	data As T
)
Parameters
data
Type: T
Data to append.
See Also
Reference
GH_Structure<T> Class
Append Overload
Grasshopper.Kernel.Data Namespace