Grasshopper SDK
GH_Format.FormatPointValidity Method
 If the point is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatPointValidity(
	Point3d val,
	string identifier = "Point"
)
Public Shared Function FormatPointValidity (
	val As Point3d,
	Optional identifier As String = "Point"
) As String
Parameters
val
Type: Point3d
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the point is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace