Grasshopper SDK
GH_FieldElement.Duplicate Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract IGH_FieldElement Duplicate()
Public MustOverride Function Duplicate As IGH_FieldElement
Return Value
Type: IGH_FieldElement
Implements
IGH_FieldElement.Duplicate()
See Also
Reference
GH_FieldElement Class
Grasshopper.Kernel.Types Namespace