Grasshopper SDK
UVInterval.U1 Property
 Gets or sets the T1 value of the U domain.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double U1 { get; set; }
Public Property U1 As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.UVInterval.U1"]
See Also
Reference
UVInterval Structure
Grasshopper.Kernel.Types Namespace