Grasshopper SDK
GH_VarParamEventArgs Constructor (IGH_Param, GH_VarParamSide, Int32)
Initializes a new instance of the GH_VarParamEventArgs class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_VarParamEventArgs(
	IGH_Param n_param,
	GH_VarParamSide n_side,
	int n_index
)
Public Sub New (
	n_param As IGH_Param,
	n_side As GH_VarParamSide,
	n_index As Integer
)
Parameters
n_param
Type: Grasshopper.Kernel.IGH_Param
n_side
Type: Grasshopper.Kernel.GH_VarParamSide
n_index
Type: System.Int32
See Also
Reference
GH_VarParamEventArgs Class
GH_VarParamEventArgs Overload
Grasshopper.Kernel Namespace