Grasshopper SDK
GH_ScrollBarVerticalBase.Display Property
 Gets or sets the height of the display area.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Display { get; set; }
Public Property Display As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.Display"]
See Also
Reference
GH_ScrollBarVerticalBase Class
Grasshopper.GUI.Base Namespace