Grasshopper SDK
GH_DigitScrollerBase.AmplifyMotion Property
 Gets or sets a value indicating whether vertical mouse drags should be amplified as the mouse moves further and further.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AmplifyMotion { get; set; }
Public Property AmplifyMotion As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.AmplifyMotion"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace