Grasshopper SDK
GH_ColourSwatchEventArgs Class
 Event arguments used in the GH_ColourSwatchControl.ColourChanged event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.GUI.GH_ColourSwatchEventArgs
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ColourSwatchEventArgs : EventArgs
Public Class GH_ColourSwatchEventArgs
	Inherits EventArgs
The GH_ColourSwatchEventArgs type exposes the following members.
Constructors
Name | Description
GH_ColourSwatchEventArgs
Initializes a new instance of the GH_ColourSwatchEventArgs class
Top
Properties
Name | Description
Colour
Top
See Also
Reference
Grasshopper.GUI Namespace