Grasshopper SDK
GH_RuntimeFile.TagKeywords Field
 String tag used to identify Keyword collections in documentation source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagKeywords = "KEYWORDS"
Public Const TagKeywords As String = "KEYWORDS"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace