Grasshopper SDK
GH_Variant._Double Property
 Gets the contents of this Variant as a double. If the Variant is of type Integer this cast will also work.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double _Double { get; }
Public ReadOnly Property _Double As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_Variant._Double"]
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace