Grasshopper SDK
IGH_PreviewObject.Hidden Property
 Gets or sets a value indicating whether or not this object is currently drawing preview flags.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool Hidden { get; set; }
Property Hidden As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_PreviewObject.Hidden"]
See Also
Reference
IGH_PreviewObject Interface
Grasshopper.Kernel Namespace