Grasshopper SDK
GH_Canvas.IsActiveInteraction Property
 Gets a value indicating whether or not there is an interaction object loaded in this canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsActiveInteraction { get; }
Public ReadOnly Property IsActiveInteraction As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.IsActiveInteraction"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace