Grasshopper SDK
GH_Canvas.DrawingMode Property
 Gets the current drawing mode for this canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CanvasMode DrawingMode { get; }
Public ReadOnly Property DrawingMode As GH_CanvasMode
	Get
Property Value
Type: GH_CanvasMode
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.DrawingMode"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace