Grasshopper SDK
GH_Theme.DefaultTheme Property
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Theme DefaultTheme { get; }
Public Shared ReadOnly Property DefaultTheme As GH_Theme
	Get
Property Value
Type: GH_Theme
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_Theme.DefaultTheme"]
See Also
Reference
GH_Theme Class
Grasshopper.GUI.Theme Namespace