Grasshopper SDK
GH_UpgradeUtil Class
 Exposes several utility functions for migrating parameters and wires between components useful while upgrading components.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_UpgradeUtil
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_UpgradeUtil
Public Class GH_UpgradeUtil
The GH_UpgradeUtil type exposes the following members.
Constructors
Name | Description
GH_UpgradeUtil
Initializes a new instance of the GH_UpgradeUtil class
Top
Methods
Name | Description
MigrateInputParameters(IGH_Component, IGH_Component)
 Migrate all input parameters.
MigrateInputParameters(IGH_Component, IGH_Component, Int32[], Int32[])
 Migrate a bunch of input parameters.
MigrateOutputParameters(IGH_Component, IGH_Component)
 Migrate all output parameters.
MigrateOutputParameters(IGH_Component, IGH_Component, Int32[], Int32[])
 Migrate a bunch of output parameters.
MigrateRecipients
 Migrate all recipients from A to B, while maintaining order.
MigrateSources
 Migrate all sources from A to B, while maintaining order.
ReplaceInputParameters
 Move all input parameters from one component to another. Only use this function if the target component can handle the input layout of the source component.
ReplaceOutputParameters
 Move all output parameters from one component to another. Only use this function if the target component can handle the output layout of the source component.
SwapComponents(IGH_Component, IGH_Component)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
SwapComponents(IGH_Component, Guid)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
SwapComponents(IGH_Component, IGH_Component, Boolean)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
SwapComponents(IGH_Component, Guid, Boolean)
 Replace an existing component with a different one. All parameters (input and output) will be migrated.
Top
See Also
Reference
Grasshopper.Kernel Namespace