Grasshopper SDK
GH_Document.CloseAllSubsidiaries Method
 Iterate over all subsidiary documents and close them all without saving.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int CloseAllSubsidiaries()
Public Function CloseAllSubsidiaries As Integer
Return Value
Type: Int32
The number of subsidiary documents that was closed.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace