Grasshopper SDK
GH_ColourCube.C4 Property
 Gets the fifth point in the corner point list.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point C4 { get; }
Public ReadOnly Property C4 As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourCube.C4"]
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace