Grasshopper SDK
GH_ActiveObject.Locked Property
 Gets or sets the enabled flag of this object. Disabled objects are ignored during solutions.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool Locked { get; set; }
Public Overridable Property Locked As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ActiveObject.Locked"]
Implements
IGH_ActiveObject.Locked
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace