Grasshopper SDK
GH_Param<T>.HasProxySources Property
 Gets a value indicating whether or not this parameter maintains proxy sources. Proxy sources are used during file IO, when actual sources might not be available yet. Once an IO operation has been completed there should be no more proxy sources.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool HasProxySources { get; }
Public Overridable ReadOnly Property HasProxySources As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.HasProxySources"]
Return Value
Type: Boolean
True if the parameter has at least one proxy source, false if not.
Implements
IGH_Param.HasProxySources
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace