Grasshopper SDK
GH_Time.IsValid Property
 Gets the validity of this instance. Datetime is valid if it's not equal to DateTime.MaxValue
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Time.IsValid"]
See Also
Reference
GH_Time Class
Grasshopper.Kernel.Types Namespace