Grasshopper SDK
GH_GeometricGooWrapper.ScriptVariable Method
 This function will be called when the local IGH_Goo instance disapears into a user Script. This would be an excellent place to cast your IGH_Goo type to a simple data type.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Object ScriptVariable()
Public Function ScriptVariable As Object
Return Value
Type: Object
The object that represents this IGH_Goo instance in a script.
Implements
IGH_Goo.ScriptVariable()
See Also
Reference
GH_GeometricGooWrapper Class
Grasshopper.Kernel.Types Namespace