Grasshopper SDK
GH_Material.CreateRhinoMaterial Method
 Creates a standard Rhino material from a colour.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Material CreateRhinoMaterial(
	Color colour
)
Public Shared Function CreateRhinoMaterial (
	colour As Color
) As Material
Parameters
colour
Type: System.Drawing.Color
Base colour for material.
Return Value
Type: Material
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace