Grasshopper SDK
GH_Param<T>.IsolateObject Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void IsolateObject()
Public Overrides Sub IsolateObject
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace