Grasshopper SDK
GH_ListUtil Class
 Provides utilities for dealing with list of Data from input parameters.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_ListUtil
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_ListUtil
Public NotInheritable Class GH_ListUtil
The GH_ListUtil type exposes the following members.
Methods
Name | Description
CountNonNullRefs<T>
 Count all object references in L
CountNullRefs<T>
 Count all null references in L
EnsureNonNullCount<T>
 Tests a list to see if it contains sufficient non-null references.
FirstNonNullItem<T>
 Returns the index of the first non-null item in a list.
RemoveNullRefs<T>
 Remove all null references from a list of items.
Top
See Also
Reference
Grasshopper.Kernel Namespace