Grasshopper SDK
IGH_TooltipAwareObject.SetupTooltip Method
 This function is called when a tooltip it about to be displayed.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void SetupTooltip(
	PointF canvasPoint,
	GH_TooltipDisplayEventArgs e
)
Sub SetupTooltip (
	canvasPoint As PointF,
	e As GH_TooltipDisplayEventArgs
)
Parameters
canvasPoint
Type: System.Drawing.PointF
The pixel coordinate on the canvas of the cursor.
e
Type: Grasshopper.GUI.GH_TooltipDisplayEventArgs
Tooltip display arguments.
See Also
Reference
IGH_TooltipAwareObject Interface
Grasshopper.GUI.Canvas Namespace