Grasshopper SDK
GH_Skin.group_back Field
 Specifies the default fill colour for Group objects.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color group_back
Public Shared group_back As Color
Field Value
Type: Color
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace