Grasshopper SDK
Rotation.RotationAxis Property
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Vector3d RotationAxis { get; set; }
Public Property RotationAxis As Vector3d
	Get
	Set
Property Value
Type: Vector3d
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Transforms.Rotation.RotationAxis"]
See Also
Reference
Rotation Class
Grasshopper.Kernel.Types.Transforms Namespace