Grasshopper SDK
GH_ExpressionString.BuildLUT Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void BuildLUT()
Public Sub BuildLUT
See Also
Reference
GH_ExpressionString Class
Grasshopper.Kernel.Expressions Namespace