Grasshopper SDK
GH_DocumentServer.IndexOf Method (String)
 Gets the index of the document that matches the filepath.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int IndexOf(
	string filepath
)
Public Function IndexOf (
	filepath As String
) As Integer
Parameters
filepath
Type: System.String
File path URI to match.
Return Value
Type: Int32
The index of the document that matches the given path or -1 if no document match is found.
See Also
Reference
GH_DocumentServer Class
IndexOf Overload
Grasshopper.Kernel Namespace