Grasshopper SDK
GH_DocumentServer.RemoveAllDocuments Method
 Remove all documents in the global list.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RemoveAllDocuments()
Public Sub RemoveAllDocuments
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace