Grasshopper SDK
GH_Component.AppendAdditionalComponentMenuItems Method
 Override this function if you want to insert some custom menu items in your derived Component class. Items will be added between List Matching items and parameter menus.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void AppendAdditionalComponentMenuItems(
	ToolStripDropDown menu
)
Protected Overridable Sub AppendAdditionalComponentMenuItems (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace