Grasshopper SDK
GH_Gradient Constructor (IEnumerable<Double>, IEnumerable<Color>)
 Create a new gradient from grips and colours.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Gradient(
	IEnumerable<double> parameters,
	IEnumerable<Color> colours
)
Public Sub New (
	parameters As IEnumerable(Of Double),
	colours As IEnumerable(Of Color)
)
Parameters
parameters
Type: System.Collections.Generic.IEnumerable<Double>
Grip locations.
colours
Type: System.Collections.Generic.IEnumerable<Color>
Colours for each grip.
See Also
Reference
GH_Gradient Class
GH_Gradient Overload
Grasshopper.GUI.Gradient Namespace