Grasshopper SDK
GH_Component.IsValidPrincipalParameterIndex Property
 Gets whether the MasterParameterIndex property identifies a valid parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsValidPrincipalParameterIndex { get; }
Public ReadOnly Property IsValidPrincipalParameterIndex As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.IsValidPrincipalParameterIndex"]
Implements
IGH_Component.IsValidMasterParameterIndex
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace