Grasshopper SDK
GH_DocumentObject.OnObjectChanged Method (String, Object)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnObjectChanged(
	string customEvent,
	Object tag
)
Public Sub OnObjectChanged (
	customEvent As String,
	tag As Object
)
Parameters
customEvent
Type: System.String
tag
Type: System.Object
Implements
IGH_DocumentObject.OnObjectChanged(String, Object)
See Also
Reference
GH_DocumentObject Class
OnObjectChanged Overload
Grasshopper.Kernel Namespace