Grasshopper SDK
GH_Attributes<T>.Render Method
 Override this function to supply custom Render logic.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void Render(
	GH_Canvas canvas,
	Graphics graphics,
	GH_CanvasChannel channel
)
Protected Overridable Sub Render (
	canvas As GH_Canvas,
	graphics As Graphics,
	channel As GH_CanvasChannel
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas in which these attributes are to be drawn.
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
channel
Type: Grasshopper.GUI.Canvas.GH_CanvasChannel
Current drawing channel.
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace