Grasshopper SDK
GH_Format.FormatColour Method (GH_Colour)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatColour(
	GH_Colour data
)
Public Shared Function FormatColour (
	data As GH_Colour
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Colour
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatColour Overload
Grasshopper.Kernel Namespace