Grasshopper SDK
GH_Lexer Class
 Represents a lexical mask for path operations.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_Lexer
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Lexer
Public Class GH_Lexer
The GH_Lexer type exposes the following members.
Constructors
Name | Description
GH_Lexer()
 Blank constructor.
GH_Lexer(String)
 Create a new mask from a textual string.
Top
Properties
Name | Description
IsItem
 Gets a value indicating whether or not the item portion of the lexer has been set.
IsPath
 Gets a value indicating whether or not the path portion of the lexer has been set.
Item
 Gets the item string that was extracted from the mask. The default is "append"
Mask
 Gets the original string that represents the user input for this lexer.
Path
 Gets the list of path strings that was extracted from the mask. If the mask hasn't been parsed yet, it will be parsed now. If the returned list is still nothing, parsing failed.
Top
Methods
Name | Description
EvaluatePath
 Evaluate the variables in this mask with the provided expression solver.
PerformLexicalReplace<T>(GH_Lexer, GH_Lexer, DataTree<T>, DataTree<T>)
 Lexical Find..Replace operations.
PerformLexicalReplace<T>(GH_Lexer, GH_Lexer, IGH_Structure, GH_Structure<T>)
 Lexical Find..Replace operations.
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace