Grasshopper SDK
GH_Format.FormatCircle Method (GH_Circle)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatCircle(
	GH_Circle data
)
Public Shared Function FormatCircle (
	data As GH_Circle
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Circle
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatCircle Overload
Grasshopper.Kernel Namespace