Grasshopper SDK
GH_Document.ContextChanged Event
 The context for this document was changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Document.ContextChangedEventHandler ContextChanged
Public Event ContextChanged As GH_Document.ContextChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.ContextChangedEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace