Grasshopper SDK
GH_Viewport.Focus Method (List<IGH_Attributes>)
 Look at a set of specific objects.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Focus(
	List<IGH_Attributes> attributes
)
Public Sub Focus (
	attributes As List(Of IGH_Attributes)
)
Parameters
attributes
Type: System.Collections.Generic.List<IGH_Attributes>
Object attributes to focus on.
See Also
Reference
GH_Viewport Class
Focus Overload
Grasshopper.GUI.Canvas Namespace