Grasshopper SDK
GH_PreviewUtil.AddBrep Method
 Add a brep to the temporary Preview lists.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddBrep(
	Brep brep
)
Public Sub AddBrep (
	brep As Brep
)
Parameters
brep
Type: Brep
Brep to add. Invalid breps will be ignored.
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace