Grasshopper SDK
GH_ArchivedUndoAction.m_data Field
 Internal data storage for serialized archives.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected byte[] m_data
Protected m_data As Byte()
Field Value
Type: Byte[]
See Also
Reference
GH_ArchivedUndoAction Class
Grasshopper.Kernel.Undo Namespace