Grasshopper SDK
GH_CursorServer.Cursor Method
 Gets a cursor from the cache.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Cursor Cursor(
	string name
)
Public Function Cursor (
	name As String
) As Cursor
Parameters
name
Type: System.String
Name of cursor to retrieve.
Return Value
Type: Cursor
The cursor that is associated with the given name or null if not cursor could be matched.
See Also
Reference
GH_CursorServer Class
Grasshopper.GUI Namespace