Grasshopper SDK
IGH_Structure.Paths Property
 Gets a list of all the paths in this structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IList<GH_Path> Paths { get; }
ReadOnly Property Paths As IList(Of GH_Path)
	Get
Property Value
Type: IList<GH_Path>
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.IGH_Structure.Paths"]
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace