Grasshopper SDK
GH_ParameterSide Enumeration
 Enumerates possible sides for variable parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ParameterSide
Public Enumeration GH_ParameterSide
Members
Member name | Value | Description
Input | 0 |  Indicates parameters along the left edge of the component.
Output | 1 |  Indicates parameters along the right edge of the component.
See Also
Reference
Grasshopper.Kernel Namespace