Grasshopper SDK
GH_PaletteStyle.Fill Property
 Gets or sets the fill of this style.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Fill { get; set; }
Public Property Fill As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_PaletteStyle.Fill"]
See Also
Reference
GH_PaletteStyle Class
Grasshopper.GUI.Canvas Namespace