Grasshopper SDK
GH_MouseTracker.NewestFrame Property
 Gets the most recent frame in recorded history.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_TrackerFrame NewestFrame { get; }
Public ReadOnly Property NewestFrame As GH_TrackerFrame
	Get
Property Value
Type: GH_TrackerFrame
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MouseTracker.NewestFrame"]
See Also
Reference
GH_MouseTracker Class
Grasshopper.GUI Namespace