Grasshopper SDK
GH_Format.FormatBrep Method (GH_Brep)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatBrep(
	GH_Brep data
)
Public Shared Function FormatBrep (
	data As GH_Brep
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Brep
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatBrep Overload
Grasshopper.Kernel Namespace