Grasshopper SDK
GH_Animator.RectangleAnimator Method (Rectangle, Rectangle)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<Rectangle> RectangleAnimator(
	Rectangle A,
	Rectangle B
)
Public Shared Function RectangleAnimator (
	A As Rectangle,
	B As Rectangle
) As GH_Animator(Of Rectangle)
Parameters
A
Type: System.Drawing.Rectangle
B
Type: System.Drawing.Rectangle
Return Value
Type: GH_Animator<Rectangle>
See Also
Reference
GH_Animator Class
RectangleAnimator Overload
Grasshopper.GUI Namespace