Grasshopper SDK
GH_SliderEventArgs Class
 Arguments passed via GH_SliderBase.ValueChanged events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.GUI.Base.GH_SliderEventArgs
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_SliderEventArgs : EventArgs
Public Class GH_SliderEventArgs
	Inherits EventArgs
The GH_SliderEventArgs type exposes the following members.
Properties
Name | Description
Intermediate
 Gets a value indicating whether the change was an intermediate one.
Slider
 Gets the instance of the slider that raised the event.
Value
 Gets the new value of the slider. This value is cached, so even if the slider subsequently updates, this property remains constant.
Top
See Also
Reference
Grasshopper.GUI.Base Namespace