Grasshopper SDK
GH_GraphicsUtil.LimitInteger Method
 Limits the given integer to the 0~255 range.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void LimitInteger(
	ref int channel
)
Public Shared Sub LimitInteger (
	ByRef channel As Integer
)
Parameters
channel
Type: System.Int32
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace