Grasshopper SDK
GH_Convert.GetMeshFromDocument Method
 Harvest a mesh object from a Rhino document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool GetMeshFromDocument(
	RhinoDoc doc,
	Guid id,
	out Mesh msh
)
Public Shared Function GetMeshFromDocument (
	doc As RhinoDoc,
	id As Guid,
	<OutAttribute> ByRef msh As Mesh
) As Boolean
Parameters
doc
Type: RhinoDoc
Document to search.
id
Type: System.Guid
ID of mesh object.
msh
Type: Mesh
Mesh result.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace