Grasshopper SDK
GH_Document.SettingsChanged Event
 Some settings of the document were changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Document.SettingsChangedEventHandler SettingsChanged
Public Event SettingsChanged As GH_Document.SettingsChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.SettingsChangedEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace