Grasshopper SDK
GH_ParserTokenClass Enumeration
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ParserTokenClass
Public Enumeration GH_ParserTokenClass
Members
Member name | Value | Description
Keyword | 1
Identifier | 2
Numeric | 3
Literal | 4
Operator | 5
Punctuation | 6
See Also
Reference
Grasshopper.Kernel.Expressions Namespace