Grasshopper SDK
GH_Component.DataComparison Property
 Gets or sets the data matching algorithm for this component
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DataComparison DataComparison { get; set; }
Public Property DataComparison As GH_DataComparison
	Get
	Set
Property Value
Type: GH_DataComparison
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.DataComparison"]
Implements
IGH_Component.DataComparison
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace