Grasshopper SDK
GH_Canvas.HasControlWithFocus Property
 Gets whether or not this canvas has a child control on it with focus.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool HasControlWithFocus { get; }
Public ReadOnly Property HasControlWithFocus As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.HasControlWithFocus"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace