Grasshopper SDK
GH_MeshingParameters.RhMesherSettings_Proxy.MaxEdgeLength Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double MaxEdgeLength { get; set; }
Public Property MaxEdgeLength As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_MeshingParameters.RhMesherSettings_Proxy.MaxEdgeLength"]
See Also
Reference
GH_MeshingParameters.RhMesherSettings_Proxy Class
Grasshopper.Kernel.Types Namespace