Grasshopper SDK
GH_DocumentEditor.CollapseForm Method
 Collapses the form into the title bar area.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CollapseForm()
Public Sub CollapseForm
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace