Grasshopper SDK
GH_ProfilerMode Enumeration
 Lists all profiler modes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ProfilerMode
Public Enumeration GH_ProfilerMode
Members
Member name | Value | Description
None | 0 |  Indicates no profiling is required.
Processor | 1 |  Indicates processor time is being measured.
Memory | 2 |  Indicates memory footprint is being measured.
See Also
Reference
Grasshopper.Kernel Namespace