Grasshopper SDK
GH_Material Class
 Represents a implementation of the Rhino material
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<DisplayMaterial>
 Grasshopper.Kernel.Types.GH_Material
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Material : GH_Goo<DisplayMaterial>
Public Class GH_Material
	Inherits GH_Goo(Of DisplayMaterial)
The GH_Material type exposes the following members.
Constructors
Name | Description
GH_Material()
Initializes a new instance of the GH_Material class
GH_Material(DisplayMaterial)
 Create a new Material.
GH_Material(Color)
 Create a new material based on a colour. The colour is used to control Diffuse, Emission and Transparency. Ambient, Specular and Shine are always default.
GH_Material(Guid)
 Create a new Material from an RDK shader ID.
GH_Material(GH_Material)
 Copy another GH_Material instance.
Top
Properties
Name | Description
IsReferencedShader
IsValid |  (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
RdkMaterialId
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
CreateRhinoMaterial
 Creates a standard Rhino material from a colour.
CreateStandardMaterial
 Creates a standard Grasshopper material from a colour.
Duplicate
 Duplicate this material.
 (Overrides GH_Goo<T>.Duplicate().)
DuplicateMaterial
 Duplicate this material.
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
RefreshReferenceData
 If the material is a referenced material, this function will update the local values to match the reference.
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
_rdkMaterialId
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace