Grasshopper SDK
GH_PaletteStyle Constructor (Color, Color)
 Construct a new GH_Box_Palette_Colours instance.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PaletteStyle(
	Color fill,
	Color edge
)
Public Sub New (
	fill As Color,
	edge As Color
)
Parameters
fill
Type: System.Drawing.Color
Colour to use for background fills.
edge
Type: System.Drawing.Color
Colour to use for edges.
See Also
Reference
GH_PaletteStyle Class
GH_PaletteStyle Overload
Grasshopper.GUI.Canvas Namespace