Grasshopper SDK
IGH_Structure.Branch Property (Int32)
 Gets a limited access pointer to the data list at the specified index.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IList this[
	int index
] { get; }
ReadOnly Property Branch (
	index As Integer
) As IList
	Get
Parameters
index
Type: System.Int32
Index of data to retrieve.
Property Value
Type: IList
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.IGH_Structure.Branch(System.Int32)"]
See Also
Reference
IGH_Structure Interface
Branch Overload
Grasshopper.Kernel.Data Namespace