Grasshopper SDK
GH_DocumentObject.MovedBetweenDocuments Method
 This method will be called when an object is moved from one document to another. Override this method if you want to handle such events.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void MovedBetweenDocuments(
	GH_Document oldDocument,
	GH_Document newDocument
)
Public Overridable Sub MovedBetweenDocuments (
	oldDocument As GH_Document,
	newDocument As GH_Document
)
Parameters
oldDocument
Type: Grasshopper.Kernel.GH_Document
Document that used to own this object.
newDocument
Type: Grasshopper.Kernel.GH_Document
Document that now owns ths object.
Implements
IGH_DocumentObject.MovedBetweenDocuments(GH_Document, GH_Document)
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace