Grasshopper SDK
Projection Constructor
Initializes a new instance of the Projection class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Projection()
Public Sub New
See Also
Reference
Projection Class
Projection Overload
Grasshopper.Kernel.Types.Transforms Namespace