Grasshopper SDK
GH_Canvas.Navigate Method
 Perform a single navigation step.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Navigate(
	GH_CanvasNavigation navigation
)
Public Sub Navigate (
	navigation As GH_CanvasNavigation
)
Parameters
navigation
Type: Grasshopper.GUI.Canvas.GH_CanvasNavigation
Type of navigation step.
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace