Grasshopper SDK
GH_ColourCube.LeftFace Property
 Gets a graphics path describing the left face of the cube. Caller is responsible for disposing of this path instance.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GraphicsPath LeftFace { get; }
Public ReadOnly Property LeftFace As GraphicsPath
	Get
Property Value
Type: GraphicsPath
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourCube.LeftFace"]
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace