Grasshopper SDK
GH_Point.GH_PointProxy.SrfRefChanged Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void SrfRefChanged(
	GH_PointRefUV_Wrapper sender,
	GH_PointRefData ref
)
Protected Sub SrfRefChanged (
	sender As GH_PointRefUV_Wrapper,
	ref As GH_PointRefData
)
Parameters
sender
Type: GH_PointRefUV_Wrapper
ref
Type: Grasshopper.Kernel.Types.GH_PointRefData
See Also
Reference
GH_Point.GH_PointProxy Class
Grasshopper.Kernel.Types Namespace