Grasshopper SDK
GH_Convert.ByteArrayToCommonObject<T> Method
 Convert an OpenNurbs compliant compressed byte array into a RhinoCommon object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static T ByteArrayToCommonObject<T>(
	byte[] data
)
where T : CommonObject
Public Shared Function ByteArrayToCommonObject(Of T As CommonObject) (
	data As Byte()
) As T
Parameters
data
Type: System.Byte[]
Byte array to de-serialize.
Type Parameters
T
Return Value
Type: T
A RhinoCommon object instance or null on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace