Grasshopper SDK
Orientation Constructor (Plane, Plane)
Initializes a new instance of the Orientation class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Orientation(
	Plane source,
	Plane target
)
Public Sub New (
	source As Plane,
	target As Plane
)
Parameters
source
Type: Plane
target
Type: Plane
See Also
Reference
Orientation Class
Orientation Overload
Grasshopper.Kernel.Types.Transforms Namespace