Grasshopper SDK
GH_Guid.DuplicateGuid Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Guid DuplicateGuid()
Public Function DuplicateGuid As GH_Guid
Return Value
Type: GH_Guid
See Also
Reference
GH_Guid Class
Grasshopper.Kernel.Types Namespace