Grasshopper SDK
GH_Document.CreateExpressionParser Method
 Create a new Expression Solver preloaded with the constants defined in this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ExpressionParser CreateExpressionParser()
Public Function CreateExpressionParser As GH_ExpressionParser
Return Value
Type: GH_ExpressionParser
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace