Grasshopper SDK
GH_Box.GH_BoxProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Box>
 Grasshopper.Kernel.Types.GH_Box.GH_BoxProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_BoxProxy : GH_GooProxy<GH_Box>
Public Class GH_BoxProxy
	Inherits GH_GooProxy(Of GH_Box)
The GH_Box.GH_BoxProxy type exposes the following members.
Constructors
Name | Description
GH_Box.GH_BoxProxy
Initializes a new instance of the GH_Box.GH_BoxProxy class
Top
Properties
Name | Description
Area
ObjectID
Origin
Volume
XAxis
XSize
YAxis
YSize
ZAxis
ZSize
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace