Grasshopper SDK
GH_RhinoScriptInterface.IsEditorVisible Method
 Returns the visible state of the Grasshopper Main window.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsEditorVisible()
Public Function IsEditorVisible As Boolean
Return Value
Type: Boolean
True if the Main Grasshopper Window has been loaded and is visible.
Examples
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
  Dim GH
  Set GH = Rhino.GetPlugInObject("Grasshopper")
  Call Rhino.Print("Grasshopper Editor Visible: " & GH.IsEditorVisible())
  Set GH = Nothing
End Sub
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace