Grasshopper SDK
GH_Document.ConstructDocumentTree Method
 Create a hierarchical document tree of ownership with this document as the root.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentTree ConstructDocumentTree()
Public Function ConstructDocumentTree As GH_DocumentTree
Return Value
Type: GH_DocumentTree
A tree of all documents owned directly or indirectly by this document.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace