Grasshopper SDK
GH_ColourCube.RenderBackFaces Method
 Render the fills of the backfaces.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderBackFaces(
	Graphics G
)
Public Sub RenderBackFaces (
	G As Graphics
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace