Grasshopper SDK
GH_Box Constructor (GH_Box)
Initializes a new instance of the GH_Box class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Box(
	GH_Box other
)
Public Sub New (
	other As GH_Box
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Box
See Also
Reference
GH_Box Class
GH_Box Overload
Grasshopper.Kernel.Types Namespace