Grasshopper SDK
GH_Convert.ToLine_Primary Method
 Performs a direct cast from OnLine or GH_Line. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToLine_Primary(
	Object data,
	ref Line rc
)
Public Shared Function ToLine_Primary (
	data As Object,
	ByRef rc As Line
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Line
Return Value
Type: Boolean
An OnLine instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace