Grasshopper SDK
GH_RuntimeFile.TagRhinoCommand Field
 String tag used to identify Similar Rhino Commands in documentation source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagRhinoCommand = "RHINOCOMMAND"
Public Const TagRhinoCommand As String = "RHINOCOMMAND"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace