Grasshopper SDK
GH_Canvas.StartAutoPan Method
 Start the auto-panning timer.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void StartAutoPan()
Public Sub StartAutoPan
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace