Grasshopper SDK
GH_Gradient.Linear Property
 Gets or sets whether the colours are interpolated linearly between grips.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Linear { get; set; }
Public Property Linear As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_Gradient.Linear"]
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace