Grasshopper SDK
GH_GHXHarvester.HarvestPivots Method (String)
 Harvest all attribute pivots from a GHX/GH archive.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<PointF> HarvestPivots(
	string file
)
Public Shared Function HarvestPivots (
	file As String
) As List(Of PointF)
Parameters
file
Type: System.String
File to parse.
Return Value
Type: List<PointF>
A list of all attribute pivots or null on failure.
See Also
Reference
GH_GHXHarvester Class
HarvestPivots Overload
Grasshopper.Kernel Namespace