Grasshopper SDK
GH_FileWatcher.CreateDirectoryWatcher Method (String, String, GH_FileWatcherEvents, GH_FileWatcher.FileChangedSimple)
 Create a new FileSystem Watcher object aimed at a specific file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_FileWatcher CreateDirectoryWatcher(
	string folderPath,
	string filter,
	GH_FileWatcherEvents events,
	GH_FileWatcher.FileChangedSimple delegate
)
Public Shared Function CreateDirectoryWatcher (
	folderPath As String,
	filter As String,
	events As GH_FileWatcherEvents,
	delegate As GH_FileWatcher.FileChangedSimple
) As GH_FileWatcher
Parameters
folderPath
Type: System.String
Folder to watch.
filter
Type: System.String
Filter string for filenames.
events
Type: Grasshopper.Kernel.GH_FileWatcherEvents
Events to watch for.
delegate
Type: Grasshopper.Kernel.GH_FileWatcher.FileChangedSimple
Callback delegate.
Return Value
Type: GH_FileWatcher
A new filewatcher aimed at the specified folder.
See Also
Reference
GH_FileWatcher Class
CreateDirectoryWatcher Overload
Grasshopper.Kernel Namespace