Grasshopper SDK
GH_ConnectivityDiagram Class
 Represents a complete connectivity diagram (topology) of a GH_Document. A connectivity diagram is basically an undirected network of all the wires in a document.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_ConnectivityDiagram
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ConnectivityDiagram
Public Class GH_ConnectivityDiagram
The GH_ConnectivityDiagram type exposes the following members.
Constructors
Name | Description
GH_ConnectivityDiagram(GH_ConnectivityDiagram)
 Create a duplicate of another Connectivity Diagram.
GH_ConnectivityDiagram(GH_Document)
 Create a new Connectivity Diagram from a GH_Document.
Top
Properties
Name | Description
Node
 Get the connectivity node with the specified ID.
NodeCount
 Gets the number of connectivity nodes in this diagram.
Nodes
 Gets a proxy for all the Nodes in this diagram.
Top
Methods
Name | Description
ContainsID
 Test the diagram for a given Node ID.
GetAllInputs
 Get all the Nodes that are part of the specified node input.
GetAllOutputs
 Get all the Nodes that are part of the specified node output.
Top
See Also
Reference
Grasshopper.Kernel Namespace