Grasshopper SDK
GH_PersistentGeometryParam<T> Class
 Derives from GH_PersistentParam(Of T), but adds some useful functions for dealing with geometric data types.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<T>
 Grasshopper.Kernel.GH_PersistentParam<T>
 Grasshopper.Kernel.GH_PersistentGeometryParam<T>
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_PersistentGeometryParam<T> : GH_PersistentParam<T>
where T : class, IGH_GeometricGoo
Public MustInherit Class GH_PersistentGeometryParam(Of T As {Class, IGH_GeometricGoo})
	Inherits GH_PersistentParam(Of T)
Type Parameters
T
Data type of this parameter.
The GH_PersistentGeometryParam<T> type exposes the following members.
Constructors
Name | Description
GH_PersistentGeometryParam<T>(GH_InstanceDescription)
Initializes a new instance of the GH_PersistentGeometryParam<T> class
GH_PersistentGeometryParam<T>(GH_InstanceDescription, Boolean) |  Obsolete.
Initializes a new instance of the GH_PersistentGeometryParam<T> class
Top
Properties
Name | Description
Top
Methods
Name | Description
ClearData |  (Overrides GH_Param<T>.ClearData().)
ConversionCallback |  (Overrides GH_Param<T>.ConversionCallback(Object, T).)
EraseGeometryCaches
ExpireSolution |  (Overrides GH_ActiveObject.ExpireSolution(Boolean).)
OnVolatileDataCollected
 This override removes all instances that fail to load their geometry.
 (Overrides GH_Param<T>.OnVolatileDataCollected().)
RegisterRemoteIDs |  (Overrides GH_ActiveObject.RegisterRemoteIDs(GH_GuidTable).)
RegisterRemoteIdsDespiteSources
 Call this method if you wish to register remote ids in the volatile data despite having one or more sources. You should only need to do this if you converted non-referenced data into volatile referenced data.
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel Namespace