Grasshopper SDK
GH_ScriptVariant.Double Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Double { get; }
Public ReadOnly Property Double As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ScriptVariant.Double"]
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace