Grasshopper SDK
GH_PersistentParam<T>.PersistentDataCount Property
 Gets the number of persistent data items stored in this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int PersistentDataCount { get; }
Public ReadOnly Property PersistentDataCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PersistentParam`1.PersistentDataCount"]
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace