Grasshopper SDK
GH_Attributes<T>.SetupTooltip Method
 Populates the Grasshopper tooltip with all relevant data. If this function returns True, it is assumed that all possible fields have been filled out and the tooltip is ready for display.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void SetupTooltip(
	PointF point,
	GH_TooltipDisplayEventArgs e
)
Public Overridable Sub SetupTooltip (
	point As PointF,
	e As GH_TooltipDisplayEventArgs
)
Parameters
point
Type: System.Drawing.PointF
The pixel coordinate on the canvas of the cursor.
e
Type: Grasshopper.GUI.GH_TooltipDisplayEventArgs
Tooltip event arguments.
Implements
IGH_TooltipAwareObject.SetupTooltip(PointF, GH_TooltipDisplayEventArgs)
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace