Grasshopper SDK
GH_Canvas.GH_ImageSettings Constructor
 Create a new instance of the GH_ImageSettings class with default values.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ImageSettings()
Public Sub New
See Also
Reference
GH_Canvas.GH_ImageSettings Class
GH_Canvas.GH_ImageSettings Overload
Grasshopper.GUI.Canvas Namespace