Grasshopper SDK
GH_Convert.ToGHTime_Secondary Method
 Converts similar data into a GH_Time instance. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToGHTime_Secondary(
	Object data,
	ref GH_Time target
)
Public Shared Function ToGHTime_Secondary (
	data As Object,
	ByRef target As GH_Time
) As Boolean
Parameters
data
Type: System.Object
Data to convert
target
Type: Grasshopper.Kernel.Types.GH_Time
Target instance. If null, a new GH_Time will be constructed. If not null, the instance values will be set.
Return Value
Type: Boolean
True on success, False on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace