Grasshopper SDK
GH_Canvas.TagArtistIDs Property
 Gets all the TagArtist IDs in this Canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Guid> TagArtistIDs { get; }
Public ReadOnly Property TagArtistIDs As List(Of Guid)
	Get
Property Value
Type: List<Guid>
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.TagArtistIDs"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace