Grasshopper SDK
GH_DocumentServer.DocumentAdded Event
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_DocumentServer.DocumentAddedEventHandler DocumentAdded
Public Event DocumentAdded As GH_DocumentServer.DocumentAddedEventHandler
Value
Type: Grasshopper.Kernel.GH_DocumentServer.DocumentAddedEventHandler
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace