Grasshopper SDK
GH_Canvas.CanvasPaintBackground Event
 Raised after the background has been drawn.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPaintBackgroundEventHandler CanvasPaintBackground
Public Event CanvasPaintBackground As GH_Canvas.CanvasPaintBackgroundEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPaintBackgroundEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace