Grasshopper SDK
GH_RotationalFrame.Pivot Property
 Gets or sets the pivot of the event.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF Pivot { get; set; }
Public Property Pivot As PointF
	Get
	Set
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.GUI.GH_RotationalFrame.Pivot"]
See Also
Reference
GH_RotationalFrame Structure
Grasshopper.GUI Namespace