Grasshopper SDK
GH_DebugLogForm Constructor
Initializes a new instance of the GH_DebugLogForm class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DebugLogForm()
Public Sub New
See Also
Reference
GH_DebugLogForm Class
Grasshopper.GUI Namespace