Grasshopper SDK
GH_Goo<T>.Value Property
 Gets or sets the internal data.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual T Value { get; set; }
Public Overridable Property Value As T
	Get
	Set
Property Value
Type: T
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Goo`1.Value"]
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace