Grasshopper SDK
GH_Attributes<T>.IsPickRegion Method (PointF)
 Determines whether a point is within the pickable region for this object. By default, any point inside the Bounds is treated as pickable.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool IsPickRegion(
	PointF point
)
Public Overridable Function IsPickRegion (
	point As PointF
) As Boolean
Parameters
point
Type: System.Drawing.PointF
Point location to test.
Return Value
Type: Boolean
Implements
IGH_Attributes.IsPickRegion(PointF)
See Also
Reference
GH_Attributes<T> Class
IsPickRegion Overload
Grasshopper.Kernel Namespace