Grasshopper SDK
Instances.DocumentEditorFadeOut Method
 Calls the FadeOut() method on the DocumentEditor if it exists.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void DocumentEditorFadeOut()
Public Shared Sub DocumentEditorFadeOut
See Also
Reference
Instances Class
Grasshopper Namespace