Grasshopper SDK
GH_Viewport.Set Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Set(
	GH_Viewport other
)
Public Sub Set (
	other As GH_Viewport
)
Parameters
other
Type: Grasshopper.GUI.Canvas.GH_Viewport
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace