Grasshopper SDK
GH_DocObjectEventArgs.Attributes Property
 Gets all the attributes that are associated with all objects in the event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_Attributes> Attributes { get; }
Public ReadOnly Property Attributes As List(Of IGH_Attributes)
	Get
Property Value
Type: List<IGH_Attributes>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocObjectEventArgs.Attributes"]
See Also
Reference
GH_DocObjectEventArgs Class
Grasshopper.Kernel Namespace