Grasshopper SDK
GH_Document.DefaultPreviewColourChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void DefaultPreviewColourChangedEventHandler(
	Color colour
)
Public Delegate Sub DefaultPreviewColourChangedEventHandler (
	colour As Color
)
Parameters
colour
Type: System.Drawing.Color
See Also
Reference
Grasshopper.Kernel Namespace