Grasshopper SDK
GH_ValueProxy<T>.UserString Property
 Wraps the protected m_UserString field
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string UserString { get; set; }
Public Property UserString As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ValueProxy`1.UserString"]
Implements
IGH_ValueProxy.UserString
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace