Grasshopper SDK
GH_IconDisplayMode Enumeration
 Lists all display modes that individual objects can have.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_IconDisplayMode
Public Enumeration GH_IconDisplayMode
Members
Member name | Value | Description
application | 0 |  Inherit the mode from the application setting. This is the default setting.
icon | 1 |  Always display the icon.
name | 2 |  Always display the nickname.
See Also
Reference
Grasshopper.Kernel Namespace