Grasshopper SDK
GH_Curve.GH_CurveProxy Class
 Proxy description of GH_Curve class. This class is used by the Generic Multivalue interfaces.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Curve>
 Grasshopper.Kernel.Types.GH_Curve.GH_CurveProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_CurveProxy : GH_GooProxy<GH_Curve>
Public Class GH_CurveProxy
	Inherits GH_GooProxy(Of GH_Curve)
The GH_Curve.GH_CurveProxy type exposes the following members.
Constructors
Name | Description
GH_Curve.GH_CurveProxy
Initializes a new instance of the GH_Curve.GH_CurveProxy class
Top
Properties
Name | Description
Closed
Deformable
Domain
Length
Linear
ObjectID
Periodic
Planar
Type
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
FromString |  (Overrides GH_GooProxy<T>.FromString(String).)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace