Grasshopper SDK
GH_Border Class
 Represents a resizing border of a Grasshopper canvas object.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Canvas.GH_Border
 Grasshopper.GUI.Canvas.GH_ResizeBorder
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Border
Public Class GH_Border
The GH_Border type exposes the following members.
Constructors
Name | Description
GH_Border
 Create a new border.
Top
Properties
Name | Description
Region
 Gets the shape of the border.
Size_Cursor
 Gets the cursor associated with this border.
Topology
 Gets the type of border.
Top
Methods
Name | Description
Contains
 Test a point for border inclusion.
CreateBorders(RectangleF, Int32)
 Static (Shared) method for creating a set of borders.
CreateBorders(RectangleF, Padding)
 Static (Shared) method for creating a set of borders.
CreateBorders(RectangleF, Int32, Int32)
 Static (Shared) method for creating a set of borders.
CreateBorders(RectangleF, Int32, Int32, Int32, Int32)
 Static (Shared) method for creating a set of borders.
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace