Grasshopper SDK
GH_CanvasMouseEvent.ControlY Property
 Gets the y-coordinate of the cursor location in control pixel coordinates.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ControlY { get; }
Public ReadOnly Property ControlY As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasMouseEvent.ControlY"]
See Also
Reference
GH_CanvasMouseEvent Class
Grasshopper.GUI Namespace