Grasshopper SDK
GH_SettingsServer.Clear Method
 Destroy all settings.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace