Grasshopper SDK
GH_PivotAction Class
 Records a single object pivot event. Useful for tracking object movement.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ObjectUndoAction
 Grasshopper.Kernel.Undo.Actions.GH_PivotAction
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PivotAction : GH_ObjectUndoAction
Public Class GH_PivotAction
	Inherits GH_ObjectUndoAction
The GH_PivotAction type exposes the following members.
Constructors
Name | Description
GH_PivotAction
Initializes a new instance of the GH_PivotAction class
Top
Properties
Name | Description
Top
Methods
Name | Description
Object_Redo |  (Overrides GH_ObjectUndoAction.Object_Redo(GH_Document, IGH_DocumentObject).)
Object_Undo |  (Overrides GH_ObjectUndoAction.Object_Undo(GH_Document, IGH_DocumentObject).)
Top
See Also
Reference
Grasshopper.Kernel.Undo.Actions Namespace