Grasshopper SDK
GH_Slider.TickDisplay Property
 Gets or sets how the slider ticks are drawn.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SliderTickDisplay TickDisplay { get; set; }
Public Property TickDisplay As GH_SliderTickDisplay
	Get
	Set
Property Value
Type: GH_SliderTickDisplay
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.TickDisplay"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace