Grasshopper SDK
DataTree<T>.DuplicateT Delegate
 Duplication delegate used in the copy constructor. Implementation should never throw exceptions.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate T DuplicateT(
	T original
)
Public Delegate Function DuplicateT (
	original As T
) As T
Parameters
original
Type: T
Data to copy (might be null)
Return Value
Type: T
A duplicate of the original or null.
See Also
Reference
Grasshopper Namespace