Grasshopper SDK
GH_ColourPickerBase.Invalidate Method
 Raise the Invalidated event.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Invalidate()
Public Sub Invalidate
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace