Grasshopper SDK
Folders.TutorialFolder Property
 Gets the directory that contains the tutorial files that ship with Grasshopper.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string TutorialFolder { get; }
Public Shared ReadOnly Property TutorialFolder As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.TutorialFolder"]
See Also
Reference
Folders Class
Grasshopper Namespace