Grasshopper SDK
GH_Document.ArrangeObject Method
 Rearrange the stack order of the object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ArrangeObject(
	IGH_DocumentObject obj,
	GH_Arrange motion
)
Public Function ArrangeObject (
	obj As IGH_DocumentObject,
	motion As GH_Arrange
) As Boolean
Parameters
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
Object to move.
motion
Type: Grasshopper.Kernel.GH_Arrange
Direction to move in.
Return Value
Type: Boolean
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace