Grasshopper SDK
GH_ParamWireDisplay Enumeration
 Enumerates the possible wire display types for parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ParamWireDisplay
Public Enumeration GH_ParamWireDisplay
Members
Member name | Value | Description
default | 0 |  Wire display is controlled by the application settings.
faint | 1 |  Wires are displayed faintly (thin and transparent) while the parameter is not selected.
hidden | 2 |  Wires are not displayed at all while the parameter is not selected.
See Also
Reference
Grasshopper.Kernel Namespace