Grasshopper SDK
GH_PointRefData Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_PointRefData
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PointRefData
Public Class GH_PointRefData
The GH_PointRefData type exposes the following members.
Constructors
Name | Description
GH_PointRefData()
Initializes a new instance of the GH_PointRefData class
GH_PointRefData(GH_PointRefData)
Initializes a new instance of the GH_PointRefData class
Top
Methods
Name | Description
EvCurve
 Evaluate this reference structure when applied to a curve
EvCurveParam
 Evaluate this reference structure when applied to a curve
EvSurface
 Evaluate this reference structure when applied to the surface
SetCurveDistFromEndParam
SetCurveDistFromStartParam
SetCurveParam
 Set the curve reference parameter based on the value of m_RefType and the curve parameter
SetCurveRatioParam
SetSurfaceParam
 Set the surface reference parameters
Top
Fields
Name | Description
m_RefID
m_RefIndex
m_RefParam
m_RefType
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace