Grasshopper SDK
GH_Document.ExpirePreview Method
 Expires the preview caches of the conduit.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ExpirePreview(
	bool redraw
)
Public Sub ExpirePreview (
	redraw As Boolean
)
Parameters
redraw
Type: System.Boolean
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace