Grasshopper SDK
GH_CodeStringSegment.IsCode Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsCode { get; set; }
Public Property IsCode As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_CodeStringSegment.IsCode"]
See Also
Reference
GH_CodeStringSegment Class
Grasshopper.Kernel.Expressions Namespace