Grasshopper SDK
GH_ComponentAttributes.InvalidateCanvas Method
 The canvas must be invalidated when the mouse is near enough and this component has variable parameters.
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool InvalidateCanvas(
	GH_Canvas canvas,
	GH_CanvasMouseEvent e
)
Public Overrides Function InvalidateCanvas (
	canvas As GH_Canvas,
	e As GH_CanvasMouseEvent
) As Boolean
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
e
Type: Grasshopper.GUI.GH_CanvasMouseEvent
Return Value
Type: Boolean
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace