Grasshopper SDK
GH_UserObject.SaveToFile Method
 Save the current User Object state to a file. Any existing file will be overwritten.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool SaveToFile()
Public Function SaveToFile As Boolean
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace