Grasshopper SDK
GH_Skin.DefaultPalette Method
Note: This API is now obsolete.
 Get the default palette as implied by the object state. Locked and Hidden flags are ignored.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("This method is now available on GH_CapsuleRenderEngine")]
public static GH_Palette DefaultPalette(
	IGH_ActiveObject obj
)
<ObsoleteAttribute("This method is now available on GH_CapsuleRenderEngine")>
Public Shared Function DefaultPalette (
	obj As IGH_ActiveObject
) As GH_Palette
Parameters
obj
Type: Grasshopper.Kernel.IGH_ActiveObject
Return Value
Type: GH_Palette
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace