Grasshopper SDK
GH_NamedView.LoadFromViewport Method
 Create a named view from a viewport.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void LoadFromViewport(
	GH_Viewport vp,
	GH_NamedViewType view_type
)
Public Sub LoadFromViewport (
	vp As GH_Viewport,
	view_type As GH_NamedViewType
)
Parameters
vp
Type: Grasshopper.GUI.Canvas.GH_Viewport
Viewport to mimic.
view_type
Type: Grasshopper.GUI.Canvas.GH_NamedViewType
Type of named view to create.
See Also
Reference
GH_NamedView Class
Grasshopper.GUI.Canvas Namespace