Grasshopper SDK
GH_RhinoScriptInterface.IsSolverEnabled Method
 Returns the state of the Grasshopper Solver.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsSolverEnabled()
Public Function IsSolverEnabled As Boolean
Return Value
Type: Boolean
True if the Grasshopper Solver is enabled.
Examples
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
  Dim GH
  Set GH = Rhino.GetPlugInObject("Grasshopper")
  Call Rhino.Print("Grasshopper Solver Enabled: " & GH.IsSolverEnabled())
  Set GH = Nothing
End Sub
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace