Grasshopper SDK
GH_LexerCombo Constructor (String, String)
Initializes a new instance of the GH_LexerCombo class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LexerCombo(
	string n_source,
	string n_target
)
Public Sub New (
	n_source As String,
	n_target As String
)
Parameters
n_source
Type: System.String
n_target
Type: System.String
See Also
Reference
GH_LexerCombo Class
GH_LexerCombo Overload
Grasshopper.Kernel.Data Namespace