Grasshopper SDK
GH_Component.HtmlHelp_Source Method
 Return a String which contains HTML formatted source for the help topic. If you want to pass a URL that points to a remote page, then prefix the URL with a GOTO: tag, like so: GOTO:http://www.YourWebAddressHere.com
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected internal override string HtmlHelp_Source()
Protected Friend Overrides Function HtmlHelp_Source As String
Return Value
Type: String
The HTML default help topic for this component including all parameters
Remarks
You can use the GUI.GH_HtmlFormatter class to generate an HTML page which conforms to Grasshopper Help standards
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace