Grasshopper SDK
GH_Canvas.DocumentObjectsDeleted Event
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.DocumentObjectsDeletedEventHandler DocumentObjectsDeleted
Public Event DocumentObjectsDeleted As GH_Canvas.DocumentObjectsDeletedEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.DocumentObjectsDeletedEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace