Grasshopper SDK
GH_Material.GH_Material_Proxy.Specular Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Specular { get; set; }
Public Property Specular As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Material.GH_Material_Proxy.Specular"]
See Also
Reference
GH_Material.GH_Material_Proxy Class
Grasshopper.Kernel.Types Namespace