Grasshopper SDK
GH_Param<T>.ExpireDownStreamObjects Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override void ExpireDownStreamObjects()
Protected Overrides Sub ExpireDownStreamObjects
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace