Grasshopper SDK
GH_Document.PreviewFilter Property
 Gets or set the preview filter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PreviewFilter PreviewFilter { get; set; }
Public Property PreviewFilter As GH_PreviewFilter
	Get
	Set
Property Value
Type: GH_PreviewFilter
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.PreviewFilter"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace