Grasshopper SDK
GH_ExpressionParser.DisplayFunctionList Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DisplayFunctionList(
	IWin32Window wnd = null
)
Public Sub DisplayFunctionList (
	Optional wnd As IWin32Window = Nothing
)
Parameters
wnd (Optional)
Type: System.Windows.Forms.IWin32Window
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace