Grasshopper SDK
CentralSettings.CanvasRadialMenu Property
 Gets or sets the global default for whether the canvas should use Radial or olds-kool menus.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool CanvasRadialMenu { get; set; }
Public Shared Property CanvasRadialMenu As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CanvasRadialMenu"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace