Grasshopper SDK
IGH_DocumentObject.OnObjectChanged Method (GH_ObjectChangedEventArgs)
 Raises the ObjectChanged event on the current (!not the top level!) object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void OnObjectChanged(
	GH_ObjectChangedEventArgs e
)
Sub OnObjectChanged (
	e As GH_ObjectChangedEventArgs
)
Parameters
e
Type: Grasshopper.Kernel.GH_ObjectChangedEventArgs
Fully constructed event arguments.
See Also
Reference
IGH_DocumentObject Interface
OnObjectChanged Overload
Grasshopper.Kernel Namespace