Grasshopper SDK
GH_FontServer.Large Property
 SystemFonts.CaptionFont, 10pt, bold
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font Large { get; }
Public Shared ReadOnly Property Large As Font
	Get
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FontServer.Large"]
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace