Grasshopper SDK
GH_DocDiagramPainter.MapY Method (Int32)
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int MapY(
	int y
)
Public Function MapY (
	y As Integer
) As Integer
Parameters
y
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
GH_DocDiagramPainter Class
MapY Overload
Grasshopper.GUI.Canvas Namespace