Grasshopper SDK
IGH_DocumentOwner.DocumentModified Method
 This method will be called whenever the owned document is modified.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void DocumentModified(
	GH_Document document
)
Sub DocumentModified (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
The modified document.
See Also
Reference
IGH_DocumentOwner Interface
Grasshopper.Kernel Namespace