Grasshopper SDK
IGH_Component.InConstructor Property
 Gets the constructor flag for this instance. If InConstructor = True, it means the component is still registering parameters and the layout is not yet complete.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool InConstructor { get; }
ReadOnly Property InConstructor As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Component.InConstructor"]
See Also
Reference
IGH_Component Interface
Grasshopper.Kernel Namespace