Grasshopper SDK
GH_VectorForce Constructor
Initializes a new instance of the GH_VectorForce class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_VectorForce()
Public Sub New
See Also
Reference
GH_VectorForce Class
Grasshopper.Kernel.Types Namespace