Grasshopper SDK
GH_MouseTracker.Record Method (Point, Object)
 Record a new mouse event frame. If this frame is closer than [Accuracy]ms to the previously recorded frame, it is not included.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Record(
	Point position,
	Object tag
)
Public Sub Record (
	position As Point,
	tag As Object
)
Parameters
position
Type: System.Drawing.Point
Location of new frame.
tag
Type: System.Object
See Also
Reference
GH_MouseTracker Class
Record Overload
Grasshopper.GUI Namespace