Grasshopper SDK
GH_CanvasDropTargetValidator Class
 Utility validator for restricting component creation.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Canvas.GH_CanvasValidator
 Grasshopper.GUI.Canvas.GH_CanvasDropTargetValidator
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_CanvasDropTargetValidator : GH_CanvasValidator
Public Class GH_CanvasDropTargetValidator
	Inherits GH_CanvasValidator
The GH_CanvasDropTargetValidator type exposes the following members.
Constructors
Name | Description
GH_CanvasDropTargetValidator
Initializes a new instance of the GH_CanvasDropTargetValidator class
Top
Properties
Name | Description
DropDelegate
 Gets or sets the delegate to be invoked when a component is dropped inside the dropregion.
DropID
 Gets or sets the ID for the allowed component.
DropRegion
 Gets or sets the dropregion for this validator. Regions are cloned so you can dispose of the original immedately after assignment.
DropText
 Gets or sets the text to display.
Top
Methods
Name | Description
AddedToCanvas |  (Overrides GH_CanvasValidator.AddedToCanvas(GH_Canvas).)
AppliesToDocument |  (Overrides GH_CanvasValidator.AppliesToDocument(Guid).)
CanAcceptObject |  (Overrides GH_CanvasValidator.CanAcceptObject(Guid).)
CanCreateObject |  (Overrides GH_CanvasValidator.CanCreateObject(Guid, PointF).)
CanDeleteObject |  (Overrides GH_CanvasValidator.CanDeleteObject(IGH_DocumentObject).)
CanDragObject |  (Overrides GH_CanvasValidator.CanDragObject(IGH_DocumentObject, PointF).)
CanShowCanvasMenu |  (Overrides GH_CanvasValidator.CanShowCanvasMenu(PointF).)
CanShowComponentSearchBox |  (Overrides GH_CanvasValidator.CanShowComponentSearchBox(PointF).)
RemovedFromCanvas |  (Overrides GH_CanvasValidator.RemovedFromCanvas(GH_Canvas).)
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace