Grasshopper SDK
GH_Document.SolutionState Property
 Gets the state of this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ProcessStep SolutionState { get; }
Public ReadOnly Property SolutionState As GH_ProcessStep
	Get
Property Value
Type: GH_ProcessStep
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.SolutionState"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace