Grasshopper SDK
GH_Matrix Class
 Represents a 32-bit signed integer. GH_Integer re-implements the framework System.Int32 type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Matrix>
 Grasshopper.Kernel.Types.GH_Matrix
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Matrix : GH_Goo<Matrix>
Public Class GH_Matrix
	Inherits GH_Goo(Of Matrix)
The GH_Matrix type exposes the following members.
Constructors
Name | Description
GH_Matrix()
 Blank constructor
GH_Matrix(Matrix)
Initializes a new instance of the GH_Matrix class
GH_Matrix(GH_Matrix)
Initializes a new instance of the GH_Matrix class
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance. Integers are always valid.
 (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
CloneMatrix
 Duplicates a Matrix.
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateMatrix
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace