Grasshopper SDK
GH_ConnectivityDiagram.Node Property
 Get the connectivity node with the specified ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ConnectivityNode this[
	Guid id
] { get; }
Public ReadOnly Default Property Node (
	id As Guid
) As GH_ConnectivityNode
	Get
Parameters
id
Type: System.Guid
ID of node to search for.
Property Value
Type: GH_ConnectivityNode
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ConnectivityDiagram.Node(System.Guid)"]
Return Value
Type: GH_ConnectivityNode
The node on success or null on failure.
See Also
Reference
GH_ConnectivityDiagram Class
Grasshopper.Kernel Namespace