Grasshopper SDK
GH_InstanceDescription.Category Property
 Gets or sets the Category in which this object belongs. If HasCategory() returns false, this field has no meaning.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string Category { get; set; }
Public Overridable Property Category As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_InstanceDescription.Category"]
Implements
IGH_InstanceDescription.Category
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace