Grasshopper SDK
GH_ComponentParamServer.Clear Method
 Removes all input and output parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
GH_ComponentParamServer Class
Clear Overload
Grasshopper.Kernel Namespace