Grasshopper SDK
GH_FileWatcher.CreateFileWatcher Method (String, GH_FileWatcherEvents, GH_FileWatcher.FileChanged)
 Create a new FileSystem Watcher object aimed at a specific file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_FileWatcher CreateFileWatcher(
	string filePath,
	GH_FileWatcherEvents events,
	GH_FileWatcher.FileChanged delegate
)
Public Shared Function CreateFileWatcher (
	filePath As String,
	events As GH_FileWatcherEvents,
	delegate As GH_FileWatcher.FileChanged
) As GH_FileWatcher
Parameters
filePath
Type: System.String
File to watch.
events
Type: Grasshopper.Kernel.GH_FileWatcherEvents
Events to watch for.
delegate
Type: Grasshopper.Kernel.GH_FileWatcher.FileChanged
Callback delegate.
Return Value
Type: GH_FileWatcher
A new filewatcher aimed at the specified file.
See Also
Reference
GH_FileWatcher Class
CreateFileWatcher Overload
Grasshopper.Kernel Namespace