Grasshopper SDK
IGH_Attributes.NewInstanceGuid Method (Guid)
 Generate a new instance GUID for the owner object. Do not use this overload unless you're > 1.95m and called David.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void NewInstanceGuid(
	Guid newID
)
Sub NewInstanceGuid (
	newID As Guid
)
Parameters
newID
Type: System.Guid
New ID to assign.
See Also
Reference
IGH_Attributes Interface
NewInstanceGuid Overload
Grasshopper.Kernel Namespace