Grasshopper SDK
GH_Document.AddObject Method
 Add a new object to the document. If the object is already contained, nothing will happen
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AddObject(
	IGH_DocumentObject docObject,
	bool update,
	int index = 2147483647
)
Public Function AddObject (
	docObject As IGH_DocumentObject,
	update As Boolean,
	Optional index As Integer = 2147483647
) As Boolean
Parameters
docObject
Type: Grasshopper.Kernel.IGH_DocumentObject
The object to add.
update
Type: System.Boolean
If True, a new solution will be triggered afterwards, regardless of event response settings.
index (Optional)
Type: System.Int32
Index at which object will be inserted.
Return Value
Type: Boolean
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace