Grasshopper SDK
GH_GraphicsUtil.Grid Method (Graphics, RectangleF, Int32, Int32, Color, Color)
 Draw a grid.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void Grid(
	Graphics g,
	RectangleF rec,
	int densityX,
	int densityY,
	Color colorBg,
	Color colorWire
)
Public Shared Sub Grid (
	g As Graphics,
	rec As RectangleF,
	densityX As Integer,
	densityY As Integer,
	colorBg As Color,
	colorWire As Color
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
rec
Type: System.Drawing.RectangleF
Grid rectangle.
densityX
Type: System.Int32
Density in x direction.
densityY
Type: System.Int32
Density in y direction.
colorBg
Type: System.Drawing.Color
Background colour override, the default is 30/255 white.
colorWire
Type: System.Drawing.Color
Grid line colour override, the default is 40/255 black.
See Also
Reference
GH_GraphicsUtil Class
Grid Overload
Grasshopper.GUI Namespace