Grasshopper SDK
GH_Document.ModifiedChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ModifiedChangedEventHandler(
	Object sender,
	GH_DocModifiedEventArgs e
)
Public Delegate Sub ModifiedChangedEventHandler (
	sender As Object,
	e As GH_DocModifiedEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_DocModifiedEventArgs
See Also
Reference
Grasshopper.Kernel Namespace