Grasshopper SDK
GH_Field.TypeDescription Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string TypeDescription { get; }
Public ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Field.TypeDescription"]
Implements
IGH_Goo.TypeDescription
See Also
Reference
GH_Field Class
Grasshopper.Kernel.Types Namespace