Grasshopper SDK
GH_TrackerFrame.Tag Field
 Optional Tag object (to be supplied by user).
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Object Tag
Public Tag As Object
Field Value
Type: Object
See Also
Reference
GH_TrackerFrame Structure
Grasshopper.GUI Namespace