Grasshopper SDK
GH_Param<T>.VolatileData Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Structure VolatileData { get; }
Public ReadOnly Property VolatileData As IGH_Structure
	Get
Property Value
Type: IGH_Structure
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.VolatileData"]
Implements
IGH_Param.VolatileData
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace