Grasshopper SDK
GH_Plane.DrawPlaneIcon Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void DrawPlaneIcon(
	DisplayPipeline display,
	Plane plane,
	double size,
	Color edgeColour,
	Color fillColour
)
Public Shared Sub DrawPlaneIcon (
	display As DisplayPipeline,
	plane As Plane,
	size As Double,
	edgeColour As Color,
	fillColour As Color
)
Parameters
display
Type: DisplayPipeline
plane
Type: Plane
size
Type: System.Double
edgeColour
Type: System.Drawing.Color
fillColour
Type: System.Drawing.Color
See Also
Reference
GH_Plane Class
Grasshopper.Kernel.Types Namespace