Grasshopper SDK
GH_MemoryBitmap.Filter_LumScale Method
 Convert the image to a greyscale representation of the luminance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_LumScale()
Public Sub Filter_LumScale
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace