Grasshopper SDK
GH_MenuTextBox Constructor
 Constructor for TextBox collection.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MenuTextBox(
	ToolStripDropDown nDropDown,
	string nText,
	bool bLockFocus
)
Public Sub New (
	nDropDown As ToolStripDropDown,
	nText As String,
	bLockFocus As Boolean
)
Parameters
nDropDown
Type: System.Windows.Forms.ToolStripDropDown
The menu dropdown into which to embed this textbox control.
nText
Type: System.String
The original text to be displayed in the textbox.
bLockFocus
Type: System.Boolean
If True, the control will disable the other menu items when it gets focus.
See Also
Reference
GH_MenuTextBox Class
Grasshopper.GUI Namespace