Grasshopper SDK
GH_RuntimeFile.TagContact Field
 String tag used to identify Author contact details in documentation source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagContact = "CONTACT"
Public Const TagContact As String = "CONTACT"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace