Grasshopper SDK
GH_RuntimeFile.TagAutoLink Field
 String tag used to signal whether automatic linking to a topic is allowed.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagAutoLink = "AUTOLINK"
Public Const TagAutoLink As String = "AUTOLINK"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace