Grasshopper SDK
GH_Interval2D Constructor (GH_Interval2D)
 Create a duplicate of another two-dimensional interval
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Interval2D(
	GH_Interval2D other
)
Public Sub New (
	other As GH_Interval2D
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Interval2D
Interval to copy. If null, a default interval will be created.
See Also
Reference
GH_Interval2D Class
GH_Interval2D Overload
Grasshopper.Kernel.Types Namespace