Grasshopper SDK
GH_DataMatchingAction.ExpiresSolution Property
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool ExpiresSolution { get; }
Public Overrides ReadOnly Property ExpiresSolution As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.Actions.GH_DataMatchingAction.ExpiresSolution"]
See Also
Reference
GH_DataMatchingAction Class
Grasshopper.Kernel.Undo.Actions Namespace