Grasshopper SDK
GH_LineCharge.Charge Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Charge { get; set; }
Public Property Charge As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_LineCharge.Charge"]
See Also
Reference
GH_LineCharge Class
Grasshopper.Kernel.Types Namespace