Grasshopper SDK
GH_ComponentServer.RemoveCachedObject Method (String)
 Remove the user object (if any) that loads itself from a specified *.ghuser file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RemoveCachedObject(
	string userObjectFilePath
)
Public Function RemoveCachedObject (
	userObjectFilePath As String
) As Boolean
Parameters
userObjectFilePath
Type: System.String
File name path of user object proxy.
Return Value
Type: Boolean
True if an object proxy was removed, false if not.
See Also
Reference
GH_ComponentServer Class
RemoveCachedObject Overload
Grasshopper.Kernel Namespace