Grasshopper SDK
GH_PluginUtil.SendKeyCodeToRhino Method (String)
 Send a string of characters to the Rhino command line.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void SendKeyCodeToRhino(
	string key
)
Public Shared Sub SendKeyCodeToRhino (
	key As String
)
Parameters
key
Type: System.String
String
See Also
Reference
GH_PluginUtil Class
SendKeyCodeToRhino Overload
Grasshopper.Plugin Namespace