Grasshopper SDK
GH_Component.RuntimeMessageLevel Property
 Returns the worst case runtime warning level of me and all my parameters
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override sealed GH_RuntimeMessageLevel RuntimeMessageLevel { get; }
Public Overrides NotOverridable ReadOnly Property RuntimeMessageLevel As GH_RuntimeMessageLevel
	Get
Property Value
Type: GH_RuntimeMessageLevel
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.RuntimeMessageLevel"]
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace