Grasshopper SDK
GH_ScriptVariant Explicit Conversion (GH_ScriptVariant to Vector3d)
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static explicit operator Vector3d (
	GH_ScriptVariant in
)
Public Shared Narrowing Operator CType (
	in As GH_ScriptVariant
) As Vector3d
Parameters
in
Type: Grasshopper.Kernel.Expressions.GH_ScriptVariant
Return Value
Type: Vector3d
See Also
Reference
GH_ScriptVariant Class
Explicit Overload
Grasshopper.Kernel.Expressions Namespace