Grasshopper SDK
GH_GeometricGoo<T>.CastFrom Method
 Attempt a cast from generic object.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CastFrom(
	Object source
)
Public Overrides Function CastFrom (
	source As Object
) As Boolean
Parameters
source
Type: System.Object
Reference to source of cast.
Return Value
Type: Boolean
True on success, false on failure.
Remarks
If False, the contents of this instance are not to be trusted.
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace