Grasshopper SDK
Param_MeshParameters.Prompt_Plural Method
Namespace: Grasshopper.Kernel.Parameters
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override GH_GetterResult Prompt_Plural(
	ref List<GH_MeshingParameters> values
)
Protected Overrides Function Prompt_Plural (
	ByRef values As List(Of GH_MeshingParameters)
) As GH_GetterResult
Parameters
values
Type: System.Collections.Generic.List<GH_MeshingParameters>
Return Value
Type: GH_GetterResult
See Also
Reference
Param_MeshParameters Class
Grasshopper.Kernel.Parameters Namespace