Grasshopper SDK
IGH_Param.AddSource Method (IGH_Param)
 Append a new Source parameter to the end of the Sources list. Sources provide this parameter with data at runtime.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void AddSource(
	IGH_Param source
)
Sub AddSource (
	source As IGH_Param
)
Parameters
source
Type: Grasshopper.Kernel.IGH_Param
Source to append.
See Also
Reference
IGH_Param Interface
AddSource Overload
Grasshopper.Kernel Namespace