Grasshopper SDK
GH_AutoSaveSettings.SaveOnObjectAddedChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void SaveOnObjectAddedChangedEventHandler()
Public Delegate Sub SaveOnObjectAddedChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace