Grasshopper SDK
GH_ScrollBarVerticalBase.OffsetNormalised Property
 Gets or sets the normalised offset of the scroller.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double OffsetNormalised { get; set; }
Public Property OffsetNormalised As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.OffsetNormalised"]
See Also
Reference
GH_ScrollBarVerticalBase Class
Grasshopper.GUI.Base Namespace