Grasshopper SDK
IGH_FieldElement.ElementGuid Property
 Gets the element Guid for this element.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid ElementGuid { get; }
ReadOnly Property ElementGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_FieldElement.ElementGuid"]
See Also
Reference
IGH_FieldElement Interface
Grasshopper.Kernel.Types Namespace