Grasshopper SDK
GH_Time Constructor (DateTime)
Initializes a new instance of the GH_Time class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Time(
	DateTime time
)
Public Sub New (
	time As DateTime
)
Parameters
time
Type: System.DateTime
See Also
Reference
GH_Time Class
GH_Time Overload
Grasshopper.Kernel.Types Namespace