Grasshopper SDK
GH_VarParamSide Enumeration
 Enumerates possible sides for variable parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_VarParamSide
Public Enumeration GH_VarParamSide
Members
Member name | Value | Description
Input | 0
Output | 1
See Also
Reference
Grasshopper.Kernel Namespace