Grasshopper SDK
GH_FontControl Class
 Represents a control that offers both Font preview and Picking methods.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Grasshopper.GUI.GH_FontControl
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_FontControl : UserControl
Public Class GH_FontControl
	Inherits UserControl
The GH_FontControl type exposes the following members.
Constructors
Name | Description
GH_FontControl
Initializes a new instance of the GH_FontControl class
Top
Properties
Name | Description
AllowFamilyOverride
AllowSizeOverride
AllowStyleOverride
Top
Methods
Name | Description
Dispose
Releases the unmanaged resources used by the GH_FontControl and optionally releases the managed resources
 (Overrides ContainerControl.Dispose(Boolean).)
OnLayout
Raises the Layout event.
 (Overrides ContainerControl.OnLayout(LayoutEventArgs).)
Top
See Also
Reference
Grasshopper.GUI Namespace