Grasshopper SDK
GH_PointRefData.EvCurveParam Method
 Evaluate this reference structure when applied to a curve
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double EvCurveParam(
	Curve c
)
Public Function EvCurveParam (
	c As Curve
) As Double
Parameters
c
Type: Curve
The curve to act on
Return Value
Type: Double
The parameter on the curve that corresponds to this reference, or NaN
Remarks
Evaluation depends on the value of m_RefType
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace