Grasshopper SDK
GH_CustomEventServer Constructor
 Create and register a new event server.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CustomEventServer(
	IGH_EventConsumer consumer
)
Public Sub New (
	consumer As IGH_EventConsumer
)
Parameters
consumer
Type: Grasshopper.Kernel.IGH_EventConsumer
Consumer object that owns this event server.
See Also
Reference
GH_CustomEventServer Class
Grasshopper.Kernel Namespace