Grasshopper SDK
GH_AutoSaveSettings.EnableAutoSaveChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void EnableAutoSaveChangedEventHandler()
Public Delegate Sub EnableAutoSaveChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace