Grasshopper SDK
GH_Vector.DuplicateVector Method
 Create a duplicate of this vector.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Vector DuplicateVector()
Public Function DuplicateVector As GH_Vector
Return Value
Type: GH_Vector
See Also
Reference
GH_Vector Class
Grasshopper.Kernel.Types Namespace