Grasshopper SDK
GH_Canvas.GH_ImageSettings Constructor (String, String, String)
 Create a new instance of the GH_ImageSettings class.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ImageSettings(
	string folder,
	string filename,
	string extension
)
Public Sub New (
	folder As String,
	filename As String,
	extension As String
)
Parameters
folder
Type: System.String
Folder for target image.
filename
Type: System.String
File name of target image.
extension
Type: System.String
Image extension for target image.
See Also
Reference
GH_Canvas.GH_ImageSettings Class
GH_Canvas.GH_ImageSettings Overload
Grasshopper.GUI.Canvas Namespace