Grasshopper SDK
GH_ComponentServer.CopyFileToAppropriateFolder Method
 Copy a GHA or GHUSER file into the appropriate Roaming Application Data folder. Of the file is already in the top-level roaming folder it will not be copied.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string CopyFileToAppropriateFolder(
	string filepath,
	bool moveOriginalToBin
)
Public Shared Function CopyFileToAppropriateFolder (
	filepath As String,
	moveOriginalToBin As Boolean
) As String
Parameters
filepath
Type: System.String
The file to copy.
moveOriginalToBin
Type: System.Boolean
If true, the original file will be placed in the recycle bin upon a successful copy.
Return Value
Type: String
The path of the copied file.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace