Grasshopper SDK
GH_AsynchFileData.FileDataAge Property
 Gets the time from which the current file data stems.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime FileDataAge { get; }
Public ReadOnly Property FileDataAge As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.GUI.GH_AsynchFileData.FileDataAge"]
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace