Grasshopper SDK
GH_Circle.DuplicateCircle Method
 Create a duplicate of this circle.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Circle DuplicateCircle()
Public Function DuplicateCircle As GH_Circle
Return Value
Type: GH_Circle
See Also
Reference
GH_Circle Class
Grasshopper.Kernel.Types Namespace