Grasshopper SDK
GH_Canvas.NavigationZoomOut Property
 Gets or sets the special key for zooming in.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Keys NavigationZoomOut { get; set; }
Public Shared Property NavigationZoomOut As Keys
	Get
	Set
Property Value
Type: Keys
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.NavigationZoomOut"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace