Grasshopper SDK
GH_Capsule.Render Method (Graphics, Image, GH_PaletteStyle)
 Have this capsule draw itself onto a Graphics surface with a custom Style override.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Render(
	Graphics G,
	Image icon,
	GH_PaletteStyle style
)
Public Sub Render (
	G As Graphics,
	icon As Image,
	style As GH_PaletteStyle
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with. Zoom factor is implied by the G.Transform property.
icon
Type: System.Drawing.Image
Icon to render in center of content/bounding box.
style
Type: Grasshopper.GUI.Canvas.GH_PaletteStyle
Style to draw capsule with.
See Also
Reference
GH_Capsule Class
Render Overload
Grasshopper.GUI.Canvas Namespace