Grasshopper SDK
GH_DocSettingsEventArgs.Kind Property
 Gets the type of setting that was changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentSettings Kind { get; }
Public ReadOnly Property Kind As GH_DocumentSettings
	Get
Property Value
Type: GH_DocumentSettings
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocSettingsEventArgs.Kind"]
See Also
Reference
GH_DocSettingsEventArgs Class
Grasshopper.Kernel Namespace