Grasshopper SDK
GH_IndexRange.Contains Method (Int32)
 Tests whether a specified index is defined by this range.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Contains(
	int index
)
Public Function Contains (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Index to test.
Return Value
Type: Boolean
True if the index is inside this range.
See Also
Reference
GH_IndexRange Structure
Contains Overload
Grasshopper.Kernel.Data Namespace