Grasshopper SDK
GH_StateServer Class
 Maintains all the recorded states for this document.
Inheritance Hierarchy
System.Object
 System.Collections.Generic.List<GH_State>
 Grasshopper.Kernel.GH_StateServer
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_StateServer : List<GH_State>,
	GH_ISerializable
Public Class GH_StateServer
	Inherits List(Of GH_State)
	Implements GH_ISerializable
The GH_StateServer type exposes the following members.
Constructors
Name | Description
GH_StateServer
Initializes a new instance of the GH_StateServer class
Top
Properties
Name | Description
Names
 Gets a list of all the state names in this server.
Owner
 Gets the document that owns this server.
Top
Methods
Name | Description
NewStateFromDocument
 Displays UI for new state creation. If the user aborts, then null is returned. If the user successfully defines a new state, it is appended to this server.
Read
RemoveState
 Remove a certain state. This method adds an undo record to the document.
RestoreState(Int32, Int32, Int32)
 Restore a certain state.
RestoreState(String, Int32, Int32)
 Restore a certain state.
RestoreState(Int32, Boolean, Int32, Int32)
 Restore a certain state.
Write
Top
See Also
Reference
Grasshopper.Kernel Namespace