Grasshopper SDK
IGH_GooProxy.MutateString Method
 Munge a string to remove obvious errors on account of the user.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string MutateString(
	string in
)
Function MutateString (
	in As String
) As String
Parameters
in
Type: System.String
Return Value
Type: String
See Also
Reference
IGH_GooProxy Interface
Grasshopper.Kernel.Types Namespace