Grasshopper SDK
GH_Document.NullFilter Method
 This delegate can be used in the FindAllDownstreamObjects(...) methods. Includes all objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool NullFilter(
	IGH_ActiveObject iObj
)
Public Shared Function NullFilter (
	iObj As IGH_ActiveObject
) As Boolean
Parameters
iObj
Type: Grasshopper.Kernel.IGH_ActiveObject
Return Value
Type: Boolean
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace