Grasshopper SDK
GH_TreeRules.PathRuleCount Property
 Gets the number of defined path rules.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int PathRuleCount { get; }
Public ReadOnly Property PathRuleCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_TreeRules.PathRuleCount"]
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace