Grasshopper SDK
GH_UserObject.SetDataFromObject Method
 Set the Data field content of ths UserObject from a Document object instance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetDataFromObject(
	IGH_DocumentObject obj
)
Public Sub SetDataFromObject (
	obj As IGH_DocumentObject
)
Parameters
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
Object to assign
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace