Grasshopper SDK
GH_Material Constructor
Initializes a new instance of the GH_Material class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Material()
Public Sub New
See Also
Reference
GH_Material Class
GH_Material Overload
Grasshopper.Kernel.Types Namespace