Grasshopper SDK
IGH_ObjectProxy.Location Property
 Gets the location of the target object. If the proxy represents a Compiled Object, the location refers to the file path of the assembly, in the case of User Objects, the location refers to the object file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Location { get; }
ReadOnly Property Location As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ObjectProxy.Location"]
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace