Grasshopper SDK
GH_ComponentAttributes.m_innerBounds Field
 Represents the Rectangle that contains the component black box.
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected RectangleF m_innerBounds
Protected m_innerBounds As RectangleF
Field Value
Type: RectangleF
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace