Grasshopper SDK
Instances.MruServer Property
 Gets the MRU_Server instance cached by the Instance Server. The MRU_Server will be instantiated the first time this property accessed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_MRU_Server MruServer { get; }
Public Shared ReadOnly Property MruServer As GH_MRU_Server
	Get
Property Value
Type: GH_MRU_Server
[Missing <value> documentation for "P:Grasshopper.Instances.MruServer"]
See Also
Reference
Instances Class
Grasshopper Namespace