Grasshopper SDK
IGH_DataAccess.SetData Method (Int32, Object)
 Stores data in an output parameter during GH_Component.SolveInstance(). Use this function only for setting individual data items. If you want to set lists of data, you *must* call SetDataList() instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool SetData(
	int paramIndex,
	Object data
)
Function SetData (
	paramIndex As Integer,
	data As Object
) As Boolean
Parameters
paramIndex
Type: System.Int32
Index of the output parameter at which to store the data.
data
Type: System.Object
Data to store. Data will be converted if necessary, but it will not be duplicated automatically.
Return Value
Type: Boolean
See Also
Reference
IGH_DataAccess Interface
SetData Overload
Grasshopper.Kernel Namespace