Grasshopper SDK
IGH_Tooltip.Title Property
 Gets or sets the tooltip Title.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Title { get; set; }
Property Title As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_Tooltip.Title"]
See Also
Reference
IGH_Tooltip Interface
Grasshopper.GUI Namespace