Grasshopper SDK
IGH_UpgradeObject.Version Property
 Return a DateTime object that indicates when this upgrade mechanism was written, so that it becomes possible to distinguish competing upgrade mechanisms.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
DateTime Version { get; }
ReadOnly Property Version As DateTime
	Get
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_UpgradeObject.Version"]
See Also
Reference
IGH_UpgradeObject Interface
Grasshopper.Kernel Namespace