Grasshopper SDK
GH_AsynchFileData.LocalUpdatePeriod Field
 Specifies the recommended number of milliseconds in between periodic checks for files on the local system.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int LocalUpdatePeriod = 250
Public Const LocalUpdatePeriod As Integer = 250
Field Value
Type: Int32
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace