Grasshopper SDK
GH_LooseChunk Constructor
 Create a new loose chunk. A loose chunk does not have an owner archive and thus cannot store runtime messages.
Namespace: GH_IO.Serialization
Assembly: GH_IO (in GH_IO.dll) Version: Rhino 6.0
Syntax
public GH_LooseChunk(
	string chunk_name
)
Public Sub New (
	chunk_name As String
)
Parameters
chunk_name
Type: System.String
Name of this chunk.
See Also
Reference
GH_LooseChunk Class
GH_IO.Serialization Namespace