Grasshopper SDK
GH_DocContextEventArgs Class
 These arguments are passed along with SettingsChanged events on GH_Document.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_DocContextEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocContextEventArgs : EventArgs
Public Class GH_DocContextEventArgs
	Inherits EventArgs
The GH_DocContextEventArgs type exposes the following members.
Properties
Name | Description
Context
 Gets the value of the document context flag at the time the event was raised, it may have been changed in between by other event handlers.
Document
 Gets the document that raised the event.
Top
See Also
Reference
Grasshopper.Kernel Namespace