Grasshopper SDK
GH_CapsuleRenderEngine.RenderBackground_Alternative Method
 Render a custom capsule background fill. This is usually the third stage in a capsule rendering.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderBackground_Alternative(
	Graphics G,
	Color colourOverride,
	bool drawAlphaGrid
)
Public Sub RenderBackground_Alternative (
	G As Graphics,
	colourOverride As Color,
	drawAlphaGrid As Boolean
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with.
colourOverride
Type: System.Drawing.Color
Custom background colour.
drawAlphaGrid
Type: System.Boolean
If true, and the background colour is not opaque, an alpha grid will be drawn as well.
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace