Grasshopper SDK
GH_DocumentObject.AppendMenuItems Method
 This function is called when a context menu is about to be displayed. Override it to set custom items.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool AppendMenuItems(
	ToolStripDropDown menu
)
Public Overridable Function AppendMenuItems (
	menu As ToolStripDropDown
) As Boolean
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
Menu object to populate.
Return Value
Type: Boolean
If true, the menu will be displayed, if false the menu will be supressed.
Implements
IGH_DocumentObject.AppendMenuItems(ToolStripDropDown)
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace