Grasshopper SDK
GH_Variant Constructor
 Create a new Null variant.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant()
Public Sub New
See Also
Reference
GH_Variant Class
GH_Variant Overload
Grasshopper.Kernel.Expressions Namespace