Grasshopper SDK
Param_MeshParameters.Menu_AppendPromptOne Method
Namespace: Grasshopper.Kernel.Parameters
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override void Menu_AppendPromptOne(
	ToolStripDropDown menu
)
Protected Overrides Sub Menu_AppendPromptOne (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
Param_MeshParameters Class
Grasshopper.Kernel.Parameters Namespace