Grasshopper SDK
GH_BackgroundSettings.Style Property
 Canvas monochromatic flag. If True, the canvas background is a solid colour.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_BackgroundStyle Style { get; set; }
Public Property Style As GH_BackgroundStyle
	Get
	Set
Property Value
Type: GH_BackgroundStyle
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_BackgroundSettings.Style"]
See Also
Reference
GH_BackgroundSettings Class
Grasshopper.GUI.Theme Namespace