Grasshopper SDK
GH_Number Class
 Represents a double-precision floating point number. GH_Number re-implements the framework System.Double type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Double>
 Grasshopper.Kernel.Types.GH_Number
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Number : GH_Goo<double>
Public Class GH_Number
	Inherits GH_Goo(Of Double)
The GH_Number type exposes the following members.
Constructors
Name | Description
GH_Number()
 Blank constructor
GH_Number(Double)
Initializes a new instance of the GH_Number class
GH_Number(GH_Number)
Initializes a new instance of the GH_Number class
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance. If the number is NaN, then it is considered invalid
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateNumber
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace