Grasshopper SDK
IGH_Structure.PathIndex Method
 Find the indices that delineate the given path domain.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void PathIndex(
	GH_Path path,
	ref int idx0,
	ref int idx1
)
Sub PathIndex (
	path As GH_Path,
	ByRef idx0 As Integer,
	ByRef idx1 As Integer
)
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to search for (it need not exist in the structure).
idx0
Type: System.Int32
The index of the path itself or the first smaller path if the path is not defined.
idx1
Type: System.Int32
The index of the path itself of the first larger path if the path is not defined.
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace