Grasshopper SDK
GH_SliderBase.DrawControlBorder Property
 Gets or sets whether the border of the slider should be drawn.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DrawControlBorder { get; set; }
Public Property DrawControlBorder As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.DrawControlBorder"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace