Grasshopper SDK
GH_Document.GH_UndoUtil.RecordNickNameEvent Method
 Create and Record a new NickNameChanged undo record.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid RecordNickNameEvent(
	string name,
	IGH_DocumentObject obj
)
Public Function RecordNickNameEvent (
	name As String,
	obj As IGH_DocumentObject
) As Guid
Parameters
name
Type: System.String
Name of undo record.
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
Target object for undo record.
Return Value
Type: Guid
The ID of the newly added undo record or Guid.Empty on failure.
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace