Grasshopper SDK
GH_Structure<T>.Branches Property
 Gets a list of all the data-arrays in this structure
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<List<T>> Branches { get; }
Public ReadOnly Property Branches As IList(Of List(Of T))
	Get
Property Value
Type: IList<List<T>>
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.Branches"]
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace