Grasshopper SDK
Node3d<T>.FurthestItem Method (Point3d)
 Find the furtest item.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Index3d<T> FurthestItem(
	Point3d locus
)
Public Function FurthestItem (
	locus As Point3d
) As Index3d(Of T)
Parameters
locus
Type: Point3d
Location to search from.
Return Value
Type: Index3d<T>
The index of the furtest item or null if no furtest item could be found.
See Also
Reference
Node3d<T> Class
FurthestItem Overload
Grasshopper.Kernel.Geometry.SpatialTrees Namespace