Grasshopper SDK
IGH_Attributes.AllowMessageBalloon Property
 Gets a value indicating whether these attributes allow warning and error boxes to be drawn on top of them.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool AllowMessageBalloon { get; }
ReadOnly Property AllowMessageBalloon As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.AllowMessageBalloon"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace