Grasshopper SDK
GH_ColourCube.S4 Property
 Gets the fifth point in the shadow point list. This point is coincident with C4.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point S4 { get; }
Public ReadOnly Property S4 As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourCube.S4"]
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace