Grasshopper SDK
GH_Interval2D.Duplicate Method
 Create a duplicate of this interval.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IGH_Goo Duplicate()
Public Overrides Function Duplicate As IGH_Goo
Return Value
Type: IGH_Goo
See Also
Reference
GH_Interval2D Class
Grasshopper.Kernel.Types Namespace