Grasshopper SDK
GH_TypeLib.t_gh_mesh Field
Grasshopper.Kernel.Types.GH_Mesh
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Type t_gh_mesh
Public Shared t_gh_mesh As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace