Grasshopper SDK
GH_DigitScrollerBase.BottomColour Property
 Gets or sets the colour used along the bottom edge of the control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color BottomColour { get; set; }
Public Property BottomColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.BottomColour"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace