Grasshopper SDK
GH_VerticalScrollBar.GripRegion Property
 Gets the grip region for this scroll bar. The Grip Region is the area in which the grip can be found. It is essentially the Client area minus the padding.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle GripRegion { get; }
Public ReadOnly Property GripRegion As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.GH_VerticalScrollBar.GripRegion"]
See Also
Reference
GH_VerticalScrollBar Class
Grasshopper.GUI Namespace