Grasshopper SDK
GH_Painter.ConnectionVisible Method
 Test whether a wire ought to be drawn at all.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ConnectionVisible(
	PointF a,
	PointF b
)
Public Function ConnectionVisible (
	a As PointF,
	b As PointF
) As Boolean
Parameters
a
Type: System.Drawing.PointF
Start point of wire.
b
Type: System.Drawing.PointF
End point of wire.
Return Value
Type: Boolean
True if the wire is visible and ought to be drawn.
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace