Grasshopper SDK
GH_RuleNumber Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_RuleNumber
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_RuleNumber : IGH_Rule
Public Class GH_RuleNumber
	Implements IGH_Rule
The GH_RuleNumber type exposes the following members.
Constructors
Name | Description
GH_RuleNumber
Initializes a new instance of the GH_RuleNumber class
Top
Properties
Name | Description
Kind
Notation
Top
Methods
Name | Description
Apply
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace