Grasshopper SDK
GH_ColourPicker.ColourChangedEventHandler Delegate
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ColourChangedEventHandler(
	Object sender,
	GH_ColourPickerEventArgs e
)
Public Delegate Sub ColourChangedEventHandler (
	sender As Object,
	e As GH_ColourPickerEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.GUI.Base.GH_ColourPickerEventArgs
See Also
Reference
Grasshopper.GUI Namespace