Grasshopper SDK
GH_Integer Constructor (GH_Integer)
Initializes a new instance of the GH_Integer class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Integer(
	GH_Integer other
)
Public Sub New (
	other As GH_Integer
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Integer
See Also
Reference
GH_Integer Class
GH_Integer Overload
Grasshopper.Kernel.Types Namespace