Grasshopper SDK
GH_Colour.IsValid Property
 Gets the validity of this instance.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Colour.IsValid"]
See Also
Reference
GH_Colour Class
Grasshopper.Kernel.Types Namespace