Grasshopper SDK
GH_AssemblyInfo.Icon Property
 Gets a 24x24 icon that represents this assembly. Return null if you do not wish to associate an icon with this assembly.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual Bitmap Icon { get; }
Public Overridable ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.Icon"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace