Grasshopper SDK
GH_Document.SolutionEndEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void SolutionEndEventHandler(
	Object sender,
	GH_SolutionEventArgs e
)
Public Delegate Sub SolutionEndEventHandler (
	sender As Object,
	e As GH_SolutionEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_SolutionEventArgs
See Also
Reference
Grasshopper.Kernel Namespace