Grasshopper SDK
GH_FadeAnimation.Duration Property
 Gets or sets the duration (in milliseconds) for ZUI animations. Negative durations are not allowed. The default is 350 milliseconds.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Duration { get; set; }
Public Property Duration As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FadeAnimation.Duration"]
See Also
Reference
GH_FadeAnimation Class
Grasshopper.GUI Namespace