Grasshopper SDK
GH_MeshingParameters Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<MeshingParameters>
 Grasshopper.Kernel.Types.GH_MeshingParameters
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_MeshingParameters : GH_Goo<MeshingParameters>
Public Class GH_MeshingParameters
	Inherits GH_Goo(Of MeshingParameters)
The GH_MeshingParameters type exposes the following members.
Constructors
Name | Description
GH_MeshingParameters()
Initializes a new instance of the GH_MeshingParameters class
GH_MeshingParameters(MeshingParameters)
Initializes a new instance of the GH_MeshingParameters class
Top
Properties
Name | Description
IsValid |  (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateMesherSettings
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace