Grasshopper SDK
GH_DigitScrollerBase.ShowTextInputBox Method (Control)
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ShowTextInputBox(
	Control owner
)
Public Sub ShowTextInputBox (
	owner As Control
)
Parameters
owner
Type: System.Windows.Forms.Control
See Also
Reference
GH_DigitScrollerBase Class
ShowTextInputBox Overload
Grasshopper.GUI.Base Namespace