Grasshopper SDK
GH_Curve Constructor (Curve)
 Create a duplicate of an existing curve.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Curve(
	Curve curve
)
Public Sub New (
	curve As Curve
)
Parameters
curve
Type: Curve
Curve to duplicate
See Also
Reference
GH_Curve Class
GH_Curve Overload
Grasshopper.Kernel.Types Namespace