Grasshopper SDK
GH_UserObject.Data Property
 Gets or sets the serialized data. This data is used to deserialize a new instance of the base class.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public byte[] Data { get; set; }
Public Property Data As Byte()
	Get
	Set
Property Value
Type: Byte[]
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_UserObject.Data"]
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace