Grasshopper SDK
GH_ExpressionString.Char Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public char this[
	int index
] { get; }
Public ReadOnly Property Char (
	index As Integer
) As Char
	Get
Parameters
index
Type: System.Int32
Property Value
Type: Char
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ExpressionString.Char(System.Int32)"]
See Also
Reference
GH_ExpressionString Class
Grasshopper.Kernel.Expressions Namespace