Grasshopper SDK
GH_DocumentObject.AttributesChanged Event
 Raised whenever the number or kind of attributes changes. This event is handled by GH_Documents who subsequently wipe their attribute caches.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event IGH_DocumentObject.AttributesChangedEventHandler AttributesChanged
Public Event AttributesChanged As IGH_DocumentObject.AttributesChangedEventHandler
Value
Type: Grasshopper.Kernel.IGH_DocumentObject.AttributesChangedEventHandler
Implements
IGH_DocumentObject.AttributesChanged
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace