Grasshopper SDK
GH_Lexer.IsPath Property
 Gets a value indicating whether or not the path portion of the lexer has been set.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsPath { get; }
Public ReadOnly Property IsPath As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Lexer.IsPath"]
See Also
Reference
GH_Lexer Class
Grasshopper.Kernel.Data Namespace