Grasshopper SDK
GH_Canvas.Dispose Method
Releases the unmanaged resources used by the GH_Canvas and optionally releases the managed resources
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override void Dispose(
	bool disposing
)
Protected Overrides Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace