Grasshopper SDK
IGH_DocumentObject.OnObjectChanged Method (String, Object)
 Raises the ObjectChanged event on the current (!not the top level!) object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void OnObjectChanged(
	string customEvent,
	Object tag
)
Sub OnObjectChanged (
	customEvent As String,
	tag As Object
)
Parameters
customEvent
Type: System.String
Custom change type name.
tag
Type: System.Object
Tag to apply to the event arguments.
See Also
Reference
IGH_DocumentObject Interface
OnObjectChanged Overload
Grasshopper.Kernel Namespace