Grasshopper SDK
GH_GooProxy<T>.ProxyOwner Property
 Gets the piece of Grasshopper data that spawned this proxy.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Goo ProxyOwner { get; }
Public ReadOnly Property ProxyOwner As IGH_Goo
	Get
Property Value
Type: IGH_Goo
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GooProxy`1.ProxyOwner"]
Implements
IGH_GooProxy.ProxyOwner
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace