Grasshopper SDK
GH_ExpressionParser Class
 Provides a run-time evaluator for Grasshopper expressions.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Expressions.GH_ExpressionParser
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ExpressionParser
Public Class GH_ExpressionParser
The GH_ExpressionParser type exposes the following members.
Constructors
Name | Description
GH_ExpressionParser()
Initializes a new instance of the GH_ExpressionParser class
GH_ExpressionParser(Boolean)
Initializes a new instance of the GH_ExpressionParser class
Top
Properties
Name | Description
ThrowExceptions
Variables
Top
Methods
Name | Description
AddVariable(String, Complex)
AddVariable(String, Plane)
AddVariable(String, Point3d)
AddVariable(String, Vector3d)
AddVariable(String, Boolean)
AddVariable(String, Double)
AddVariable(String, Int32)
AddVariable(String, String)
AddVariableEx(String, GH_Variant)
AddVariableEx(String, IGH_Goo)
BalancedCharTest
 Test a string for balanced open and close chars. You can use this function to see if brackets or parenthesis have been properly used.
CachedSymbols
 Retrieve a copy of the Queue of cached symbols. You can use the cached symbols as an uber-optimization to speed up successive calls to Evaluate() with an identical expression string
CacheSymbols
 Create a Symbols array from the expression. Use this method if you intend to evaluate the same expression multiple times. At this point, the expression has to be in correct syntax format. Use the GH_ExpressionSyntaxWriter.RewriteAll() method to make sure.
ClearSymbols
 Destroy the Symbols cache.
ClearVariables
 Destroy the variable cache.
DisplayFunctionList
Evaluate()
 Evaluate the expression currently loaded in the Symbols cache using the currently loaded variables.
Evaluate(String)
 Store a new expression in the Symbols cache and evaluate it using the current variables
Evaluate(Queue<GH_ParserSymbol>)
 Evaluate the expression queue without overriding any local caches. You can obtain an expression queue by calling CachedSymbols()
IsValidVariableName
 Tests whether a string is a valid variable name for expressions. Valid names must contain at least one character, must start with an alphabetic character, and only contain alphanumeric chars and underscores.
Op_BinaryAddition
Op_BinaryAmpersand
Op_BinaryAND
Op_BinaryAngle
Op_BinaryCircumflex
Op_BinaryCrossProduct
Op_BinaryDistance
Op_BinaryDivision
Op_BinaryEquality
Op_BinaryIntegerDivision
Op_BinaryLargerThan
Op_BinaryLargerThanOrEqual
Op_BinaryModulus
Op_BinaryMultiplication
Op_BinaryNearEquality
Op_BinaryOR
Op_BinaryPull
Op_BinaryPush
Op_BinarySmallerThan
Op_BinarySmallerThanOrEqual
Op_BinarySubtraction
Op_BinaryXOR
Op_UnaryBang
Op_UnaryCube
Op_UnaryDeg2Rad
Op_UnaryImaginary
Op_UnaryMinus
Op_UnaryNOT
Op_UnaryOComponent
Op_UnaryPlus
Op_UnarySquare
Op_UnaryXComponent
Op_UnaryYComponent
Op_UnaryZComponent
Top
See Also
Reference
Grasshopper.Kernel.Expressions Namespace