Grasshopper SDK
GH_ExpressionParser.Variables Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public SortedDictionary<string, GH_Variant> Variables { get; }
Public ReadOnly Property Variables As SortedDictionary(Of String, GH_Variant)
	Get
Property Value
Type: SortedDictionary<String, GH_Variant>
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ExpressionParser.Variables"]
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace