Grasshopper SDK
GH_Viewport.DollyZoom Method
 Advanced interface function for mouse 'dolly' zooming.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DollyZoom(
	GH_CanvasMouseEvent e
)
Public Function DollyZoom (
	e As GH_CanvasMouseEvent
) As Boolean
Parameters
e
Type: Grasshopper.GUI.GH_CanvasMouseEvent
Event arguments.
Return Value
Type: Boolean
True if a change to the viewport was made, otherwise false.
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace