Grasshopper SDK
GH_DocumentEditor.FormShepard Property
 Gets the form shepard for this window. Register your modeless dialogs with this shepard if you want to be popular.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_FormShepard FormShepard { get; }
Public ReadOnly Property FormShepard As GH_FormShepard
	Get
Property Value
Type: GH_FormShepard
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DocumentEditor.FormShepard"]
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace