Grasshopper SDK
GH_CursorServer.IsCursor Method
 Test for the existence of a cursor.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsCursor(
	string name
)
Public Function IsCursor (
	name As String
) As Boolean
Parameters
name
Type: System.String
Cursor name to test for.
Return Value
Type: Boolean
True if the cursor is cached.
See Also
Reference
GH_CursorServer Class
Grasshopper.GUI Namespace