Grasshopper SDK
GH_Document.ArrangeObjects Method
 Rearrange the stack order of a collection of objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ArrangeObjects(
	IEnumerable<IGH_DocumentObject> objs,
	GH_Arrange motion
)
Public Function ArrangeObjects (
	objs As IEnumerable(Of IGH_DocumentObject),
	motion As GH_Arrange
) As Boolean
Parameters
objs
Type: System.Collections.Generic.IEnumerable<IGH_DocumentObject>
Objects to move.
motion
Type: Grasshopper.Kernel.GH_Arrange
Direction to move in.
Return Value
Type: Boolean
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace