Grasshopper SDK
GH_FileSystemEventServer.AddWatcher Method
 Add a new file watcher instance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void AddWatcher(
	Object owner,
	string path,
	GH_FileSystemEventServer.FileEvent callback
)
Public Shared Sub AddWatcher (
	owner As Object,
	path As String,
	callback As GH_FileSystemEventServer.FileEvent
)
Parameters
owner
Type: System.Object
The object that owns this watcher.
path
Type: System.String
The path of the file to watch.
callback
Type: Grasshopper.Kernel.GH_FileSystemEventServer.FileEvent
Callback delegate used during file changes.
See Also
Reference
GH_FileSystemEventServer Class
Grasshopper.Kernel Namespace