Grasshopper SDK
IGH_FieldElement Interface
 Represents the basic interface for field elements.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_FieldElement : GH_ISerializable,
	IGH_PreviewData
Public Interface IGH_FieldElement
	Inherits GH_ISerializable, IGH_PreviewData
The IGH_FieldElement type exposes the following members.
Properties
Name | Description
BoundingBox
 Gets the visual boundingbox of all the geometry used to represent this element in 3D.
ElementGuid
 Gets the element Guid for this element.
IsLimited
 Gets or sets whether this element affects a limited region.
Limits
 Gets or sets the limits of this region. Unless IsLimited equals true, the Limits property is ignored.
Top
Methods
Name | Description
Duplicate
 Create an exact copy of this element.
Force
 Compute the force at a given location.
IsCoincident
 Computes whether the point can be considered coincident with the element.
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace