Grasshopper SDK
GH_ExpressionSyntaxWriter.RewriteForGraphicInterface Method (GH_CodeString)
 Rewrite the expression so that tags are replaced by the complex characters that make up the esoteric operators, functions and constants. The expression should become more readable for humans.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RewriteForGraphicInterface(
	GH_CodeString code
)
Public Shared Sub RewriteForGraphicInterface (
	code As GH_CodeString
)
Parameters
code
Type: Grasshopper.Kernel.Expressions.GH_CodeString
See Also
Reference
GH_ExpressionSyntaxWriter Class
RewriteForGraphicInterface Overload
Grasshopper.Kernel.Expressions Namespace