Grasshopper SDK
GH_PingDocumentEventArgs.Document Property
 If you're a GH_Document that owns this object, you must fill out this field. This is the only way for objects to know which document they belong to.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document Document { get; set; }
Public Property Document As GH_Document
	Get
	Set
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PingDocumentEventArgs.Document"]
See Also
Reference
GH_PingDocumentEventArgs Class
Grasshopper.Kernel Namespace