Grasshopper SDK
GH_ColourPickerBase.BackColour Property
 Gets or sets the background colour of the picker.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color BackColour { get; set; }
Public Property BackColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.BackColour"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace