Grasshopper SDK
GH_Document.BoundingBox Method
 Returns the boundingbox of all the normal attributes. If the document contains no normal attributes an Empty RectangleF structure is returned.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RectangleF BoundingBox(
	bool limitToSelection = false
)
Public Function BoundingBox (
	Optional limitToSelection As Boolean = false
) As RectangleF
Parameters
limitToSelection (Optional)
Type: System.Boolean
If true, only selected attributes are included in the boundingbox computation.
Return Value
Type: RectangleF
The boundingbox of the requested objects or RectangleF.Empty if no objects could be found.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace