Grasshopper SDK
GH_UpgradeUtil.MigrateInputParameters Method (IGH_Component, IGH_Component)
 Migrate all input parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool MigrateInputParameters(
	IGH_Component source,
	IGH_Component target
)
Public Shared Function MigrateInputParameters (
	source As IGH_Component,
	target As IGH_Component
) As Boolean
Parameters
source
Type: Grasshopper.Kernel.IGH_Component
Source component.
target
Type: Grasshopper.Kernel.IGH_Component
Target component.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_UpgradeUtil Class
MigrateInputParameters Overload
Grasshopper.Kernel Namespace