Grasshopper SDK
GH_CapsuleRenderEngine.RenderGrips_Alternative Method
 Render all the grips associates with the capsule as semi-circles. This is needed if the capsule background is not fully opaque. Grips are not drawn if the zoom level is less than 50%. This is usually the first stage in a Capsule rendering.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderGrips_Alternative(
	Graphics G
)
Public Sub RenderGrips_Alternative (
	G As Graphics
)
Parameters
G
Type: System.Drawing.Graphics
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace