Grasshopper SDK
GH_SamplingSphere.SampleSphere Method (Sphere)
 Sample the UV locations of a sphere. The sphere should be centered on the world origin.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point2d[,] SampleSphere(
	Sphere sphere
)
Public Function SampleSphere (
	sphere As Sphere
) As Point2d(,)
Parameters
sphere
Type: Sphere
Sphere to sample.
Return Value
Type: Point2d[,]
A two-dimensional array of Sphere UV locations, one for each sample point.
See Also
Reference
GH_SamplingSphere Class
SampleSphere Overload
Grasshopper.GUI Namespace