Grasshopper SDK
GH_Canvas.CanvasPostPaintWires Event
 Raised after wire drawing completes.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPostPaintWiresEventHandler CanvasPostPaintWires
Public Event CanvasPostPaintWires As GH_Canvas.CanvasPostPaintWiresEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPostPaintWiresEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace