Grasshopper SDK
GH_Curve Class
 Represents a 3D spline curve.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Curve>
 Grasshopper.Kernel.Types.GH_GeometricGoo<Curve>
 Grasshopper.Kernel.Types.GH_Curve
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Curve : GH_GeometricGoo<Curve>,
	IGH_BakeAwareData, IGH_PreviewData
Public Class GH_Curve
	Inherits GH_GeometricGoo(Of Curve)
	Implements IGH_BakeAwareData, IGH_PreviewData
The GH_Curve type exposes the following members.
Constructors
Name | Description
GH_Curve()
 Default constructor, creates an invalid curve.
GH_Curve(Curve)
 Create a duplicate of an existing curve.
GH_Curve(Guid)
 Create a new referenced curve that references a Rhino curve object with the specified ID.
GH_Curve(GH_Curve)
 Create a duplicate of another GH_Curve. This constructor also copies reference data.
GH_Curve(Guid, Int32)
 Create a new references edge curve that references an edge index in a Rhino Brep object.
Top
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsGeometryLoaded
 Gets the load state of this curve object. The curve is considered to be loaded when the local OnCurve instance is not null.
 (Overrides GH_GeometricGoo<T>.IsGeometryLoaded.)
IsValid
 Gets the validity of this curve. If the curve is referenced but cannot be loaded, the curve is not valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
ReferenceEdge
 Gets or sets the edge index for a referenced curve. If the index >= 0 then an edge reference is implied.
ReferenceID |  (Overrides GH_GeometricGoo<T>.ReferenceID.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Value |  (Overrides GH_GeometricGoo<T>.Value.)
Top
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all volatile caches for this instance. The boundingbox is cleared, and if the curve is referenced, the local instance of the curve is erased.
 (Overrides GH_GeometricGoo<T>.ClearCaches().)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateCurve
 Create a duplicate of this curve.
DuplicateGeometry
 Create a duplicate of this curve.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
EmitProxy
 Returns a proxy that represents this curve. Do not call this function unless you're
 (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
LoadGeometry(RhinoDoc)
 If the curve is referenced and not yet loaded, attempts to load the curve.
 (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
MakeDeformable
 Converts the local geometry into deformable nurbs curve geometry. This method will not destroy Reference data.
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ScriptVariable |  (Overrides GH_Goo<T>.ScriptVariable().)
ToString
 Format the curve using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace