Grasshopper SDK
GH_Skin.canvas_shade_size Field
 Specifies the size of the canvas drop shadow.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int canvas_shade_size
Public Shared canvas_shade_size As Integer
Field Value
Type: Int32
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace