Grasshopper SDK
GH_Author.Name Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Author.Name"]
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace