Grasshopper SDK
GH_TooltipDisplayEventArgs.Control Property
 Gets the control for whom the tooltip is about to be displayed.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Control Control { get; }
Public ReadOnly Property Control As Control
	Get
Property Value
Type: Control
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipDisplayEventArgs.Control"]
See Also
Reference
GH_TooltipDisplayEventArgs Class
Grasshopper.GUI Namespace