Grasshopper SDK
IGH_ObjectProxy.Kind Property
 Gets the kind of the Proxy target object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_ObjectType Kind { get; }
ReadOnly Property Kind As GH_ObjectType
	Get
Property Value
Type: GH_ObjectType
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ObjectProxy.Kind"]
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace