Grasshopper SDK
GH_Conversion Enumeration
 Level flag for conversion algorithms.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_Conversion
Public Enumeration GH_Conversion
Members
Member name | Value | Description
Primary | 0 |  Primary conversions only entail direct casts from identical or similar data types.
Secondary | 1 |  Secondary conversions entail all implied conversions with the exception of direct casts.
Both | 2 |  Indicates both Primary and Secondary
See Also
Reference
Grasshopper.Kernel Namespace