Grasshopper SDK
IGH_ActiveObject Interface
 Base interface for all objects on the canvas that participate in solutions
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_ActiveObject : IGH_DocumentObject
Public Interface IGH_ActiveObject
	Inherits IGH_DocumentObject
The IGH_ActiveObject type exposes the following members.
Properties
Name | Description
IsDataProvider
 Gets whether or not this object is capable of emitting data.
Locked
 Gets or sets the locked flag of this object. Locked objects are ignored during solutions.
MutableNickName
 Gets or sets a value that enables Nick name changes through the menu. The default is TRUE.
Phase
 Gets the solution phase in which this object is currently stuck.
ProcessorTime
 Gets the most recent measured processor time.
RuntimeMessageLevel
 Gets the worst-case level of all messages. I.e. if only warnings have been recorded, the level will be ::warning. If even a single error exists, the level will be ::error.
Top
Methods
Name | Description
AddRuntimeMessage
 Add a new message to this object. Valid message type flags are Warning and Error. If the Message string is empty or zero-length no message is added.
ClearData
 This function is called whenever the object needs to clear all solution data. This usually amounts to wiping volatile caches and messages. This function will not affect any other objects, but it will set the Phase flag to Blank
ClearRuntimeMessages
 Clear all message lists.
CollectData
 This function is called whenever the object is required to collect all data. Either from Persistent records, from source params or whatever. This step is only performed if the phase flag is Blank or Failed. Upon completion, the phase flag will be set to Collected
ComputeData
 This function is called whenever the object is required to generate new data. This step is only performed by some objects and only when the Phase flag is Collected. Upon completion, the Phase will be Computed. If this object throws exceptions, it is the responsibility of the caller to set the Phase flag to Failed.
DependsOn
 Solve the inheritance relationship between this object and a potential parental object.
RegisterRemoteIDs
 If this object depends on Rhino Objects, you must register the UUIDs of those objects. Failure to do so will result in faulty event handling.
RuntimeMessages
 Gets the list of cached runtime messages that were recorded during solver-time processes.
SDKCompliancy
 Test whether this object is compliant with a given Rhino version.
Top
Events
Name | Description
Top
See Also
Reference
Grasshopper.Kernel Namespace