Grasshopper SDK
GH_Convert.ToBoundingBox_Primary Method
 Performs a direct cast from OnBoundingBox. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToBoundingBox_Primary(
	Object data,
	ref BoundingBox rc
)
Public Shared Function ToBoundingBox_Primary (
	data As Object,
	ByRef rc As BoundingBox
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: BoundingBox
Return Value
Type: Boolean
An OnBoundingBox instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace