Grasshopper SDK
IGH_InstanceGuidDependent.InstanceGuidsChanged Method
 This method will be called by the GH_Document that owns this object after it mutates some or all of it's object InstanceIds.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void InstanceGuidsChanged(
	SortedDictionary<Guid, Guid> map
)
Sub InstanceGuidsChanged (
	map As SortedDictionary(Of Guid, Guid)
)
Parameters
map
Type: System.Collections.Generic.SortedDictionary<Guid, Guid>
A translation dictionary of old InstanceID keys (no longer existent) and new InstanceID values.
See Also
Reference
IGH_InstanceGuidDependent Interface
Grasshopper.Kernel Namespace