Grasshopper SDK
GH_Format.FormatLine Method (GH_Line)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatLine(
	GH_Line data
)
Public Shared Function FormatLine (
	data As GH_Line
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Line
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatLine Overload
Grasshopper.Kernel Namespace