Grasshopper SDK
GH_CapsuleRenderEngine.RenderHighlight Method
 Render a highlight bar. This is highly zoom-dependant. Highlight rendering is usually the fourth stage in a Capsule Rendering, after the background but prior to the edges.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderHighlight(
	Graphics G
)
Public Sub RenderHighlight (
	G As Graphics
)
Parameters
G
Type: System.Drawing.Graphics
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace