Grasshopper SDK
GH_ParamHashFields Enumeration
 Enumerates all accepted fields for hashing parameter data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[FlagsAttribute]
public enum GH_ParamHashFields
<FlagsAttribute>
Public Enumeration GH_ParamHashFields
Members
Member name | Value | Description
None | 0 |  Represents a blank hash.
Input | 1 |  Input parameters are taken into account.
Output | 2 |  Output parameters are taken into account.
InputAndOutput | 3 |  Input and output parameters are taken into account.
InstanceId | 4 |  Parameter instance ID is taken into account.
NickName | 8 |  Parameter nickname is taken into account.
Access | 16 |  Parameter access (item, list, tree) is taken into account.
TypeId | 32 |  Parameter type code is taken into account.
PersistentData | 64 |  Parameter persistent data is taken into account.
Expression | 128 |  Parameter Expression is taken into account.
TypeHint | 256 |  Parameter typehint is taken into account.
Sources | 65536 |  Parameter source IDs are taken into account.
Recipients | 131072 |  Parameter recipient IDs are taken into account.
SourcesAndRecipients | 196608 |  Parameter sources and recipients are taken into account.
SerialData | 16777216 |  Parameter serialization byte array is taken into account.
All | 16974335
See Also
Reference
Grasshopper.Kernel Namespace