Grasshopper SDK
GH_Structure<T>.GetEnumerator_Generic Method
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IEnumerator<T> GetEnumerator_Generic()
Public Function GetEnumerator_Generic As IEnumerator(Of T)
Return Value
Type: IEnumerator<T>
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace