Grasshopper SDK
GH_CanvasMouseEvent.CanvasLocation Property
 Gets the location of the cursor in canvas unit coordinates.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF CanvasLocation { get; }
Public ReadOnly Property CanvasLocation As PointF
	Get
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasMouseEvent.CanvasLocation"]
See Also
Reference
GH_CanvasMouseEvent Class
Grasshopper.GUI Namespace