Grasshopper SDK
GH_Viewport.ZoomMinimum Field
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const float ZoomMinimum = 0.05f
Public Const ZoomMinimum As Single = 0.05F
Field Value
Type: Single
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace