Grasshopper SDK
GH_Document.RemotePanelLayout Property
 Gets the Remote Control Panel layout for this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RcpLayout RemotePanelLayout { get; }
Public ReadOnly Property RemotePanelLayout As RcpLayout
	Get
Property Value
Type: RcpLayout
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.RemotePanelLayout"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace