Grasshopper SDK
GH_ColourPickerBase.SetupColourPicker Method (Color, Point4d, GH_ColourSpace)
 Setup all UI elements.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetupColourPicker(
	Color col0,
	Point4d col1,
	GH_ColourSpace space
)
Public Sub SetupColourPicker (
	col0 As Color,
	col1 As Point4d,
	space As GH_ColourSpace
)
Parameters
col0
Type: System.Drawing.Color
Initial colour for this picker.
col1
Type: Point4d
Active colour for this picker.
space
Type: Grasshopper.GUI.Base.GH_ColourSpace
Colour space mode for this picker.
See Also
Reference
GH_ColourPickerBase Class
SetupColourPicker Overload
Grasshopper.GUI.Base Namespace