Grasshopper SDK
GH_PersistentParam<T>.Script_ClearPersistentData Method
 Method used primarily for COM_Access code.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Script_ClearPersistentData()
Public Sub Script_ClearPersistentData
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace