Grasshopper SDK
DataTree<T> Constructor
 Default constructor, create an empty data tree.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DataTree()
Public Sub New
See Also
Reference
DataTree<T> Class
DataTree<T> Overload
Grasshopper Namespace