Grasshopper SDK
GH_UndoRecord.Actions Property
 Gets or sets the actions inside this record.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<IGH_UndoAction> Actions { get; }
Public ReadOnly Property Actions As IList(Of IGH_UndoAction)
	Get
Property Value
Type: IList<IGH_UndoAction>
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoRecord.Actions"]
See Also
Reference
GH_UndoRecord Class
Grasshopper.Kernel.Undo Namespace