Grasshopper SDK
GH_Canvas.CanvasPrePaintWires Event
 Raised before wire drawing starts.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPrePaintWiresEventHandler CanvasPrePaintWires
Public Event CanvasPrePaintWires As GH_Canvas.CanvasPrePaintWiresEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPrePaintWiresEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace