Grasshopper SDK
GH_Vector.GH_VectorProxy Class
 Proxy description of GH_Vector class. This class is used by the Generic Multivalue interfaces.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Vector>
 Grasshopper.Kernel.Types.GH_Vector.GH_VectorProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_VectorProxy : GH_GooProxy<GH_Vector>
Public Class GH_VectorProxy
	Inherits GH_GooProxy(Of GH_Vector)
The GH_Vector.GH_VectorProxy type exposes the following members.
Constructors
Name | Description
GH_Vector.GH_VectorProxy
Initializes a new instance of the GH_Vector.GH_VectorProxy class
Top
Properties
Name | Description
IsParsable |  (Overrides GH_GooProxy<T>.IsParsable.)
Length
X
Y
Z
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
FromString |  (Overrides GH_GooProxy<T>.FromString(String).)
ToString |  (Overrides GH_GooProxy<T>.ToString().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace