Grasshopper SDK
GH_Point.ReferenceIndex Method (Int32)
 Sets the index of the point reference data.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ReferenceIndex(
	int new_index
)
Public Sub ReferenceIndex (
	new_index As Integer
)
Parameters
new_index
Type: System.Int32
The index to set. This index describes the sub-object of the reference.
Remarks
If there is no reference data, this function will create a new instance.
See Also
Reference
GH_Point Class
ReferenceIndex Overload
Grasshopper.Kernel.Types Namespace