Grasshopper SDK
IGH_PreviewObject Interface
 All IGH_DocumentObjects that wish to participate in Viewport redraws must implement this interface.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_PreviewObject
Public Interface IGH_PreviewObject
The IGH_PreviewObject type exposes the following members.
Properties
Name | Description
ClippingBox
 Gets the clipping box for this object. The clipping box is typically the union of the boundingboxes of all the geometry that is drawn by this object.
Hidden
 Gets or sets a value indicating whether or not this object is currently drawing preview flags.
IsPreviewCapable
 Gets a value indicating whether or not this object (in its current state) can draw geometric previews at all.
Top
Methods
Name | Description
DrawViewportMeshes
 Implement this function to draw all shaded meshes. If the viewport does not support shading, this function will not be called.
DrawViewportWires
 Implement this function to draw all wire and point geometry previews.
Top
See Also
Reference
Grasshopper.Kernel Namespace