Grasshopper SDK
GH_DocumentEventServer.EnsureGuidTable Method
 Create the entire ID table if it doesn't exist yet.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void EnsureGuidTable()
Public Sub EnsureGuidTable
See Also
Reference
GH_DocumentEventServer Class
Grasshopper.Kernel Namespace