Grasshopper SDK
GH_Text.Text Property
 Gets the text string.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Text { get; }
Public ReadOnly Property Text As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_Text.Text"]
See Also
Reference
GH_Text Class
Grasshopper.Documentation Namespace