Grasshopper SDK
Node3d<T>.MemoryConsumption Property
 Gets the estimated memory consumption of the (sub)tree structure. Items inside the global list are not included in this estimate.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public long MemoryConsumption { get; }
Public ReadOnly Property MemoryConsumption As Long
	Get
Property Value
Type: Int64
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.MemoryConsumption"]
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace