Grasshopper SDK
GH_SliderBase.SetSnapRanges Method
 Assign a collection of snap ranges to this slider.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetSnapRanges(
	IEnumerable<SliderSnapRange> ranges
)
Public Sub SetSnapRanges (
	ranges As IEnumerable(Of SliderSnapRange)
)
Parameters
ranges
Type: System.Collections.Generic.IEnumerable<SliderSnapRange>
Ranges to snap to. Will override whatever snap ranges were defined before.
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace