Grasshopper SDK
GH_Convert.ToArc Method
 Convert data into Rhino.Geometry.Arc.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToArc(
	Object data,
	ref Arc rc,
	GH_Conversion conversion_level
)
Public Shared Function ToArc (
	data As Object,
	ByRef rc As Arc,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Arc
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace