Grasshopper SDK
GH_Format.FormatPlane Method (Plane)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatPlane(
	Plane data
)
Public Shared Function FormatPlane (
	data As Plane
) As String
Parameters
data
Type: Plane
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatPlane Overload
Grasshopper.Kernel Namespace