Grasshopper SDK
GH_Variant Class
 Variant data used in Grasshopper Expressions.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Expressions.GH_Variant
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Variant
Public Class GH_Variant
The GH_Variant type exposes the following members.
Constructors
Name | Description
GH_Variant()
 Create a new Null variant.
GH_Variant(Plane)
 Create a new Plane variant.
GH_Variant(Point3d)
 Create a new Point variant.
GH_Variant(Vector3d)
 Create a new Point variant.
GH_Variant(Boolean)
 Create a new Bool variant.
GH_Variant(Double)
 Create a new Double variant.
GH_Variant(Int32)
 Create a new Integer variant.
GH_Variant(String)
 Create a new String variant.
GH_Variant(Complex)
 Create a new Complex variant.
GH_Variant(GH_Variant)
 Duplicate a Variant.
Top
Properties
Name | Description
_Bool
 Gets the contents of this Variant as a bool.
_Complex
 Gets the contents of this Variant as a complex number.
_Double
 Gets the contents of this Variant as a double. If the Variant is of type Integer this cast will also work.
_Int
 Gets the contents of this Variant as an integer.
_Plane
 Gets the contents of this Variant as a Plane.
_Point
 Gets the contents of this Variant as a Point.
_String
 Gets the contents of this Variant as a String. This function will work for all Variant types.
_Vector
 Gets the contents of this Variant as a Vector.
IsNumeric
 Gets a value indicating whether or not the Variant is a numeric type. Only Doubles and Integers are considered to be Numeric.
Type
 Gets the Type of this Variant.
Top
Methods
Name | Description
Data<T>
 Perform a straight cast of the data inside this Variant.
Duplicate
 Duplicate this Variant. If the type of this Variant is [unknown] the contents are not guaranteed to be duplicated.
Evaluate
 If this variant represents a string, this function will attempt to evaluate that string and replace the data inside this variant.
ToGoo
 Attempt to convert a Variant to a Grasshopper IGH_Goo type.
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
Grasshopper.Kernel.Expressions Namespace