Grasshopper SDK
GH_ActiveObject.ClearData Method
 This function is called whenever the object needs to clear all solution data. Override this function if you need to perform custom clensing.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void ClearData()
Public Overridable Sub ClearData
Implements
IGH_ActiveObject.ClearData()
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace