Grasshopper SDK
GH_MemoryBitmap.Filter_Invert Method
 Invert all values in a specific channel.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_Invert(
	GH_BitmapChannel channel
)
Public Sub Filter_Invert (
	channel As GH_BitmapChannel
)
Parameters
channel
Type: Grasshopper.Kernel.GH_BitmapChannel
Channel(s) to invert.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace