Grasshopper SDK
GH_AssemblyInfo.AssemblyLicense Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual GH_LibraryLicense AssemblyLicense { get; }
Public Overridable ReadOnly Property AssemblyLicense As GH_LibraryLicense
	Get
Property Value
Type: GH_LibraryLicense
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.AssemblyLicense"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace