Grasshopper SDK
GH_ComponentParamServer.RepairParamAssociations Method
 Makes sure all parameter attributes are a-ok. If you stick to regular functions, you shouldn't have to call this.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RepairParamAssociations()
Public Sub RepairParamAssociations
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace