Grasshopper SDK
GH_MouseTracker.DropFrames Method (DateTime)
 Drop all frames older than a given limit.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DropFrames(
	DateTime timeLimit
)
Public Sub DropFrames (
	timeLimit As DateTime
)
Parameters
timeLimit
Type: System.DateTime
All frames older than the limit will be dropped.
See Also
Reference
GH_MouseTracker Class
DropFrames Overload
Grasshopper.GUI Namespace