Grasshopper SDK
GH_ConnectivityDisparity.ExternalInputs Method
 Find all external sources for a given id in the subset.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Guid> ExternalInputs(
	Guid id
)
Public Function ExternalInputs (
	id As Guid
) As List(Of Guid)
Parameters
id
Type: System.Guid
ID of parameter.
Return Value
Type: List<Guid>
A list containing all sources that are not present in the subset topology.
See Also
Reference
GH_ConnectivityDisparity Class
Grasshopper.Kernel Namespace