Grasshopper SDK
GH_TrackerFrame.Buttons Field
 The state of the mouse buttons of the frame.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public MouseButtons Buttons
Public Buttons As MouseButtons
Field Value
Type: MouseButtons
See Also
Reference
GH_TrackerFrame Structure
Grasshopper.GUI Namespace