Grasshopper SDK
GH_Structure<T>.EnsureCapacity Method
 Ensures that all current branches have a certain capacity.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void EnsureCapacity(
	int capacity
)
Public Sub EnsureCapacity (
	capacity As Integer
)
Parameters
capacity
Type: System.Int32
Capacity per branch.
Implements
IGH_Structure.EnsureCapacity(Int32)
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace