Grasshopper SDK
GH_ExpressionParser.IsValidVariableName Method
 Tests whether a string is a valid variable name for expressions. Valid names must contain at least one character, must start with an alphabetic character, and only contain alphanumeric chars and underscores.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsValidVariableName(
	string name
)
Public Shared Function IsValidVariableName (
	name As String
) As Boolean
Parameters
name
Type: System.String
Name to test.
Return Value
Type: Boolean
True if the name is valid (might still conflict with a function name though), false if not.
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace