Grasshopper SDK
GH_GradientChangedEventArgs Constructor
Initializes a new instance of the GH_GradientChangedEventArgs class
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_GradientChangedEventArgs(
	GH_Gradient gradient,
	bool intermediate
)
Public Sub New (
	gradient As GH_Gradient,
	intermediate As Boolean
)
Parameters
gradient
Type: Grasshopper.GUI.Gradient.GH_Gradient
intermediate
Type: System.Boolean
See Also
Reference
GH_GradientChangedEventArgs Class
Grasshopper.GUI.Gradient Namespace