Grasshopper SDK
GH_Canvas.ShowNavigationPane Method
 Displays the quick-navigation popup pane at the cursor.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ShowNavigationPane()
Public Sub ShowNavigationPane
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace