Grasshopper SDK
Instances Class
 Provides access to a bunch of global instances and variables.
Inheritance Hierarchy
System.Object
 Grasshopper.Instances
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class Instances
Public NotInheritable Class Instances
The Instances type exposes the following members.
Properties
Name | Description
ActiveCanvas
 Gets the currently active Grasshopper canvas (if any)
AutoHideBanner
 Gets or sets a value indicating whether the banner ought to be hidden automatically when loading completes.
AutoShowBanner
 Gets or sets a value indicating whether or not the banner will be displayed during the ComponentServer Loading process.
ComponentServer
 Gets the ComponentServer instance cached by the Instance Server. The ComponentServer will be instantiated the first time this property accessed. This is a rather involved process during which the Grasshopper Banner will be displayed.
CursorServer
 Gets the CursorServer instance cached by the Instance Server. The CursorServer will be instantiated the first time this property is accessed.
DocumentAssociationServer
 Gets the Document Association Server instance cached by the Instance Server. The Document Association Server will be instantiated the first time this property accessed.
DocumentEditor
 Gets the DocumentEditor of Grasshopper.
DocumentServer
 Gets the DocumentServer instance cached by the Instance Server. The DocumentServer will be instantiated the first time this property accessed.
GrasshopperPluginId
 Gets the ID of the Grasshopper Plugin.
IsComponentServer
 Gets whether the Component server has been set.
IsCursorServer
 Gets whether the Cursor server has been set.
IsDocumentAssociationServer
 Gets whether the Document Association server has been set.
IsDocumentEditor
 Gets whether the Document Editor has been set.
IsDocumentEditorOnTopOfViewports
 Gets whether the Grasshopper document editor (or any of its child forms) is obscuring a significant part of the Rhino viewports.
IsDocumentServer
 Gets whether the Document server has been set.
IsMarkovChain
 Gets a value indicating whether or not the MarkovChain has already been initialized.
IsMruServer
 Gets a value indicating whether or not the MRU server has been initialized.
IsRemotePanelVisible
 Gets whether the Remote Control Panel is currently visible.
MarkovChain
 Gets the MarkovChain instance cached by the Instance Server. The Markov chain will be instantiated if it hasn't been already.
MruServer
 Gets the MRU_Server instance cached by the Instance Server. The MRU_Server will be instantiated the first time this property accessed.
RcpPanel
 Gets the app-domain wide RCP panel instance. If it doesn't exist yet it will be created.
Settings
 Represents the default settings database. Feel free to add your own settings to this database.
Top
Methods
Name | Description
DocumentEditorFadeIn
 Calls the FadeIn() method on the DocumentEditor if it exists.
DocumentEditorFadeOut
 Calls the FadeOut() method on the DocumentEditor if it exists.
EnforceInvariantCulture
 If the Setting "EnforceInvariantCulture" is set to False, this function does nothing
HideRemotePanel
 Hides the remote control panel.
InvalidateCanvas
 Invalidates the currently active Grasshopper Canvas, causing a redraw sometime in the foreseeable future.
RedrawAll
 Forces a redraw of both the active canvas and the Rhino viewports.
RedrawCanvas
 Forces a redraw of the currently active Grasshopper Canvas.
ShowRemotePanel
 Shows the remote control panel.
UnloadAllObjects
 Clears and unloads all cached objects. This function is called by the _GrasshopperUnloadPlugin command. Please don't use it.
Top
Events
Name | Description
CanvasCreated
 Raised when the main canvas is created.
CanvasDestroyed
 Raised when the main canvas is destroyed.
Top
See Also
Reference
Grasshopper Namespace