Grasshopper SDK
GH_Document.FindOutputParameter Method
 Search for output (downstream) parameters that contain the locus
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Param FindOutputParameter(
	Point pt
)
Public Function FindOutputParameter (
	pt As Point
) As IGH_Param
Parameters
pt
Type: System.Drawing.Point
Point for search start
Return Value
Type: IGH_Param
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace