Grasshopper SDK
GH_Document.GH_UndoUtil.RecordRemoveObjectEvent Method (String, IEnumerable<IGH_DocumentObject>)
 Create and Record a new ObjectRemoved undo record.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid RecordRemoveObjectEvent(
	string name,
	IEnumerable<IGH_DocumentObject> objs
)
Public Function RecordRemoveObjectEvent (
	name As String,
	objs As IEnumerable(Of IGH_DocumentObject)
) As Guid
Parameters
name
Type: System.String
Name of undo record.
objs
Type: System.Collections.Generic.IEnumerable<IGH_DocumentObject>
Target objects for undo record.
Return Value
Type: Guid
The ID of the newly added undo record or Guid.Empty on failure.
See Also
Reference
GH_Document.GH_UndoUtil Class
RecordRemoveObjectEvent Overload
Grasshopper.Kernel Namespace