Grasshopper SDK
GH_Animator.InterpolateDouble Method
 Utility interpolation delegate for System.Double values.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static double InterpolateDouble(
	double A,
	double B,
	double factor
)
Public Shared Function InterpolateDouble (
	A As Double,
	B As Double,
	factor As Double
) As Double
Parameters
A
Type: System.Double
B
Type: System.Double
factor
Type: System.Double
Return Value
Type: Double
See Also
Reference
GH_Animator Class
Grasshopper.GUI Namespace