Grasshopper SDK
GH_DocumentObject.OnSolutionExpired Method
 Raises the SolutionExpired event on the toplevel object. You probably want to call ExpireSolution() instead of this method directly.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnSolutionExpired(
	bool recompute
)
Public Sub OnSolutionExpired (
	recompute As Boolean
)
Parameters
recompute
Type: System.Boolean
If True, the solution will be immediately recalculated.
Implements
IGH_DocumentObject.OnSolutionExpired(Boolean)
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace