Grasshopper SDK
GH_SliderBase.ProcessNumber Method
 Process a number using the given slider characteristics.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static decimal ProcessNumber(
	decimal val,
	GH_SliderAccuracy accuracy,
	int digits
)
Public Shared Function ProcessNumber (
	val As Decimal,
	accuracy As GH_SliderAccuracy,
	digits As Integer
) As Decimal
Parameters
val
Type: System.Decimal
Number to process.
accuracy
Type: Grasshopper.GUI.Base.GH_SliderAccuracy
Slider rounding accuracy.
digits
Type: System.Int32
Number of digits to use for floating point rounding.
Return Value
Type: Decimal
Processed number.
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace