Grasshopper SDK
GH_StructurePath.EmitProxy Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IGH_GooProxy EmitProxy()
Public Overrides Function EmitProxy As IGH_GooProxy
Return Value
Type: IGH_GooProxy
See Also
Reference
GH_StructurePath Class
Grasshopper.Kernel.Types Namespace