Grasshopper SDK
GH_GeometricGoo<T>.IsValid Property
 Gets a value indicating whether or not the current value is valid.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometricGoo`1.IsValid"]
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace