Grasshopper SDK
GH_Slider.Input_Assign Method
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override void Input_Assign(
	string text
)
Protected Overrides Sub Input_Assign (
	text As String
)
Parameters
text
Type: System.String
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace