Grasshopper SDK
GH_Rectangle.Morph Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IGH_GeometricGoo Morph(
	SpaceMorph xmorph
)
Public Overrides Function Morph (
	xmorph As SpaceMorph
) As IGH_GeometricGoo
Parameters
xmorph
Type: SpaceMorph
Return Value
Type: IGH_GeometricGoo
See Also
Reference
GH_Rectangle Class
Grasshopper.Kernel.Types Namespace