Grasshopper SDK
GH_State.AddStateObject Method
 Append a new object to the database.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddStateObject(
	IGH_StateAwareObject obj,
	Guid obj_id
)
Public Sub AddStateObject (
	obj As IGH_StateAwareObject,
	obj_id As Guid
)
Parameters
obj
Type: Grasshopper.Kernel.IGH_StateAwareObject
Object to append.
obj_id
Type: System.Guid
Instance GUID of object in document.
See Also
Reference
GH_State Class
Grasshopper.Kernel Namespace