Grasshopper SDK
Instances.IsComponentServer Property
 Gets whether the Component server has been set.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsComponentServer { get; }
Public Shared ReadOnly Property IsComponentServer As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Instances.IsComponentServer"]
See Also
Reference
Instances Class
Grasshopper Namespace