Grasshopper SDK
CentralSettings.FormatENotationLowerThreshold Property
 Gets at what actual threshold numeric formatting switches from decimal to E-Notation.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static double FormatENotationLowerThreshold { get; }
Public Shared ReadOnly Property FormatENotationLowerThreshold As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.CentralSettings.FormatENotationLowerThreshold"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace