Grasshopper SDK
GH_GraphicsUtil.Grid Method (Graphics, RectangleF, Int32, Int32)
 Draw a default grid.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void Grid(
	Graphics g,
	RectangleF rec,
	int densityX,
	int densityY
)
Public Shared Sub Grid (
	g As Graphics,
	rec As RectangleF,
	densityX As Integer,
	densityY As Integer
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
rec
Type: System.Drawing.RectangleF
Grid rectangle.
densityX
Type: System.Int32
Density in x direction.
densityY
Type: System.Int32
Density in y direction.
See Also
Reference
GH_GraphicsUtil Class
Grid Overload
Grasshopper.GUI Namespace