Grasshopper SDK
GH_DigitScrollerEventArgs.Scroller Property
 Gets the instance of the scroller that raised the event.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DigitScrollerBase Scroller { get; }
Public ReadOnly Property Scroller As GH_DigitScrollerBase
	Get
Property Value
Type: GH_DigitScrollerBase
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerEventArgs.Scroller"]
See Also
Reference
GH_DigitScrollerEventArgs Class
Grasshopper.GUI.Base Namespace