Grasshopper SDK
GH_MemoryBitmap.Release Method
 Release the locked bits. You must call this function when you are done with this GH_MemoryBitmap instance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Release(
	bool includeChanges
)
Public Sub Release (
	includeChanges As Boolean
)
Parameters
includeChanges
Type: System.Boolean
If true, changes to the bitmap memory block will be written back into the bitmap.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace