Grasshopper SDK
GH_Document.SettingsChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void SettingsChangedEventHandler(
	Object sender,
	GH_DocSettingsEventArgs e
)
Public Delegate Sub SettingsChangedEventHandler (
	sender As Object,
	e As GH_DocSettingsEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_DocSettingsEventArgs
See Also
Reference
Grasshopper.Kernel Namespace