Grasshopper SDK
Rotation Constructor
Initializes a new instance of the Rotation class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rotation()
Public Sub New
See Also
Reference
Rotation Class
Rotation Overload
Grasshopper.Kernel.Types.Transforms Namespace