Grasshopper SDK
GH_UndoException Constructor (String, Object[])
Initializes a new instance of the GH_UndoException class
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoException(
	string message,
	params Object[] args
)
Public Sub New (
	message As String,
	ParamArray args As Object()
)
Parameters
message
Type: System.String
args
Type: System.Object[]
See Also
Reference
GH_UndoException Class
GH_UndoException Overload
Grasshopper.Kernel.Undo Namespace