Grasshopper SDK
GH_StateTag.Name Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract string Name { get; }
Public MustOverride ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_StateTag.Name"]
Implements
IGH_StateTag.Name
See Also
Reference
GH_StateTag Class
Grasshopper.Kernel Namespace