Grasshopper SDK
GH_Param<T>.Sources Property
 Gets a list of source parameters. Do not modify this list, if you wish to add or remove sources, use dedicated functions like AddSource() and RemoveSource() instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual IList<IGH_Param> Sources { get; }
Public Overridable ReadOnly Property Sources As IList(Of IGH_Param)
	Get
Property Value
Type: IList<IGH_Param>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.Sources"]
Return Value
Type: IList<IGH_Param>
The sources for this parameter.
Implements
IGH_Param.Sources
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace