Grasshopper SDK
GH_Component.DrawViewportWires Method
 Draw preview wires for this component and all associated parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void DrawViewportWires(
	IGH_PreviewArgs args
)
Public Overridable Sub DrawViewportWires (
	args As IGH_PreviewArgs
)
Parameters
args
Type: Grasshopper.Kernel.IGH_PreviewArgs
Display data used during preview drawing.
Implements
IGH_PreviewObject.DrawViewportWires(IGH_PreviewArgs)
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace