Grasshopper SDK
GH_Structure<T>.PathCount Property
 Gets the number of paths defined in this structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int PathCount { get; }
Public ReadOnly Property PathCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.PathCount"]
Implements
IGH_Structure.PathCount
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace