Grasshopper SDK
GH_AddStateAction Class
 Record the addition of a single solution state to a document.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ArchivedUndoAction
 Grasshopper.Kernel.Undo.Actions.GH_AddStateAction
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_AddStateAction : GH_ArchivedUndoAction
Public Class GH_AddStateAction
	Inherits GH_ArchivedUndoAction
The GH_AddStateAction type exposes the following members.
Constructors
Name | Description
GH_AddStateAction
Initializes a new instance of the GH_AddStateAction class
Top
Properties
Name | Description
Top
Methods
Name | Description
Internal_Redo |  (Overrides GH_UndoAction.Internal_Redo(GH_Document).)
Internal_Undo |  (Overrides GH_UndoAction.Internal_Undo(GH_Document).)
Read |  (Overrides GH_ArchivedUndoAction.Read(GH_IReader).)
Write |  (Overrides GH_ArchivedUndoAction.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Undo.Actions Namespace