Grasshopper SDK
GH_Document.OnObjectsDeleted Method
 Raise the ObjectsDeleted event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnObjectsDeleted(
	IEnumerable<IGH_DocumentObject> doc_objects
)
Public Sub OnObjectsDeleted (
	doc_objects As IEnumerable(Of IGH_DocumentObject)
)
Parameters
doc_objects
Type: System.Collections.Generic.IEnumerable<IGH_DocumentObject>
Objects that were deleted.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace