Grasshopper SDK
GH_Component.AppendAdditionalMenuItems Method
 Adds typical component type items to the context menu: 1. Data comparison types 2. Custom (overridden) items 3. Nested input parameter context menu items 4. Nested output parameter context menu items
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void AppendAdditionalMenuItems(
	ToolStripDropDown menu
)
Public Overrides Sub AppendAdditionalMenuItems (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace