Grasshopper SDK
GH_PathOffset.ToString Method
 Format the Path Offset.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_PathOffset Class
Grasshopper.Kernel.Data Namespace