Grasshopper SDK
GH_VoronoiWarningForm Class
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Grasshopper.GUI.GH_VoronoiWarningForm
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_VoronoiWarningForm : Form
Public Class GH_VoronoiWarningForm
	Inherits Form
The GH_VoronoiWarningForm type exposes the following members.
Constructors
Name | Description
GH_VoronoiWarningForm
Initializes a new instance of the GH_VoronoiWarningForm class
Top
Methods
Name | Description
Dispose
Releases the unmanaged resources used by the GH_VoronoiWarningForm and optionally releases the managed resources
 (Overrides Form.Dispose(Boolean).)
Top
See Also
Reference
Grasshopper.GUI Namespace