Grasshopper SDK
GH_GDI_Util.FilletPolyline Method (Point[], Int32)
 Fillet all the corners of a freeform outline.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath FilletPolyline(
	Point[] corners,
	int radius
)
Public Shared Function FilletPolyline (
	corners As Point(),
	radius As Integer
) As GraphicsPath
Parameters
corners
Type: System.Drawing.Point[]
A list of corner points.
radius
Type: System.Int32
Fillet to apply to all corners.
Return Value
Type: GraphicsPath
A graphics path describing the filleted shape, or Nothing on failure.
See Also
Reference
GH_GDI_Util Class
FilletPolyline Overload
Grasshopper.GUI Namespace