Grasshopper SDK
GH_DigitNumber.Reset Method
 Reset all parts to zero.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Reset()
Public Sub Reset
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace