Grasshopper SDK
GH_IndexRuleSet.Evaluate Method
 Evaluate the index given the local rules.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RuleResult Evaluate(
	int index
)
Public Function Evaluate (
	index As Integer
) As GH_RuleResult
Parameters
index
Type: System.Int32
Index to evaluate.
Return Value
Type: GH_RuleResult
The result of the evaluation.
See Also
Reference
GH_IndexRuleSet Class
Grasshopper.Kernel.Data Namespace