Grasshopper SDK
GH_Author.NameReadonly Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string NameReadonly { get; }
Public ReadOnly Property NameReadonly As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Author.NameReadonly"]
Implements
IGH_Author.Name
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace