Grasshopper SDK
GH_SettingsCategory.Icon Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap Icon { get; }
Public ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.GH_SettingsCategory.Icon"]
Implements
IGH_SettingCategory.Icon
See Also
Reference
GH_SettingsCategory Class
Grasshopper.GUI Namespace