Grasshopper SDK
IGH_Component.Params Property
 Gets the Params object that managed input and output parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_ComponentParamServer Params { get; }
ReadOnly Property Params As GH_ComponentParamServer
	Get
Property Value
Type: GH_ComponentParamServer
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Component.Params"]
See Also
Reference
IGH_Component Interface
Grasshopper.Kernel Namespace