Grasshopper SDK
GH_GeometricGoo<T>.GetBoundingBox Method
 Compute an aligned boundingbox.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract BoundingBox GetBoundingBox(
	Transform xform
)
Public MustOverride Function GetBoundingBox (
	xform As Transform
) As BoundingBox
Parameters
xform
Type: Transform
Transformation to apply to geometry for BoundingBox computation.
Return Value
Type: BoundingBox
The world aligned boundingbox of the transformed geometry.
Implements
IGH_GeometricGoo.GetBoundingBox(Transform)
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace