Grasshopper SDK
CentralSettings.CanvasFullNames Property
 Gets or sets the global default for verbose UI. When CanvasFullNames=True, parameter nicknames are set to their actual (long) names upon addition.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool CanvasFullNames { get; set; }
Public Shared Property CanvasFullNames As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.CanvasFullNames"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace