Grasshopper SDK
GH_Lexer.PerformLexicalReplace<T> Method (GH_Lexer, GH_Lexer, IGH_Structure, GH_Structure<T>)
 Lexical Find..Replace operations.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void PerformLexicalReplace<T>(
	GH_Lexer source,
	GH_Lexer target,
	IGH_Structure structure_in,
	GH_Structure<T> structure_out
)
where T : IGH_Goo
Public Shared Sub PerformLexicalReplace(Of T As IGH_Goo) (
	source As GH_Lexer,
	target As GH_Lexer,
	structure_in As IGH_Structure,
	structure_out As GH_Structure(Of T)
)
Parameters
source
Type: Grasshopper.Kernel.Data.GH_Lexer
Search mask.
target
Type: Grasshopper.Kernel.Data.GH_Lexer
Replace pattern.
structure_in
Type: Grasshopper.Kernel.Data.IGH_Structure
Source data tree.
structure_out
Type: Grasshopper.Kernel.Data.GH_Structure<T>
Target data tree.
Type Parameters
T
Type of data in target tree.
See Also
Reference
GH_Lexer Class
PerformLexicalReplace Overload
Grasshopper.Kernel.Data Namespace