Grasshopper SDK
GH_Goo<T>.ScriptVariable Method
 This function will be called when the local IGH_Goo instance disappears into a user Script. This would be an excellent place to cast your IGH_Goo type to a simple data type.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual Object ScriptVariable()
Public Overridable Function ScriptVariable As Object
Return Value
Type: Object
The default implementation of this function returns the Value instance.
Implements
IGH_Goo.ScriptVariable()
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace