Grasshopper SDK
GH_Topic Class
 Represents a single topic in the Grasshopper help.
Inheritance Hierarchy
System.Object
 Grasshopper.Documentation.GH_Topic
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Topic
Public Class GH_Topic
The GH_Topic type exposes the following members.
Properties
Name | Description
Description
SafeDescription
Top
Methods
Name | Description
ParseFile
 Parse a *.topic file and return a topic entry.
Top
See Also
Reference
Grasshopper.Documentation Namespace