Grasshopper SDK
GH_UndoServer.UndoNames Property
 Gets a sorted list of all the undo Guids in this server.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string> UndoNames { get; }
Public ReadOnly Property UndoNames As List(Of String)
	Get
Property Value
Type: List<String>
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoServer.UndoNames"]
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace