Grasshopper SDK
IGH_Structure.Graft Method (Boolean)
Note: This API is now obsolete.
 Grafts all paths by reallocating all data into child paths.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("this method has been replaced by Graft(GH_GraftMode)")]
void Graft(
	bool clearSingleNulls
)
<ObsoleteAttribute("this method has been replaced by Graft(GH_GraftMode)")>
Sub Graft (
	clearSingleNulls As Boolean
)
Parameters
clearSingleNulls
Type: System.Boolean
If true, nulls will not be grafted.
See Also
Reference
IGH_Structure Interface
Graft Overload
Grasshopper.Kernel.Data Namespace