Grasshopper SDK
GH_Arc Constructor
 Default constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Arc()
Public Sub New
See Also
Reference
GH_Arc Class
GH_Arc Overload
Grasshopper.Kernel.Types Namespace