Grasshopper SDK
GH_ContentCollection.Count Property
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_ContentCollection.Count"]
See Also
Reference
GH_ContentCollection Class
Grasshopper.Documentation Namespace