Grasshopper SDK
GH_RuntimeFile.TagTitle Field
 String tag used to identify title fields in documentation source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagTitle = "TITLE"
Public Const TagTitle As String = "TITLE"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace