Grasshopper SDK
GH_BoundingBox Fields
The GH_BoundingBox type exposes the following members.
Fields
Name | Description
Max
 Maximum corner of box.
Min
 Minimum corner of box.
Top
See Also
Reference
GH_BoundingBox Structure
GH_IO.Types Namespace