Grasshopper SDK
GH_Point Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Point
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Point : IGH_GeometricGoo, IGH_BakeAwareData,
	IGH_PreviewData
Public Class GH_Point
	Implements IGH_GeometricGoo, IGH_BakeAwareData, IGH_PreviewData
The GH_Point type exposes the following members.
Constructors
Name | Description
GH_Point()
Initializes a new instance of the GH_Point class
GH_Point(Point3d)
Initializes a new instance of the GH_Point class
GH_Point(Guid)
Initializes a new instance of the GH_Point class
GH_Point(GH_Point)
Initializes a new instance of the GH_Point class
Top
Properties
Name | Description
Boundingbox
ClippingBox
IsGeometryLoaded
IsReferencedGeometry
IsValid
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
ReferenceData
 Gets or sets the reference data of this point geometry.
ReferenceID
TypeDescription
TypeName
Value
Top
Methods
Name | Description
BakeGeometry
CastFrom
CastTo<T>
ClearCaches
CreateFromCoordinate
 Create a new point geometry instance based on a fixed coordinate
CreateFromCurveDistance
 Create new point geometry instance based on a curve distance parameter
CreateFromCurveRatio
 Create new point geometry instance based on a curve parameter ratio
CreateFromEdgeDistance
 Create new point geometry instance based on a curve distance parameter
CreateFromEdgeRatio
 Create new point geometry instance based on an edge parameter ratio
CreateFromPointObject
 Create a new point geometry instance based on point object ID
CreateFromSurfaceParam
 Create new point geometry instance based on a curve distance parameter
DrawViewportMeshes
DrawViewportWires
Duplicate
DuplicateGeometry
DuplicatePoint
EmitProxy
EnsureReferenceData
 Creates new Reference data if it doesn't already exists
GetBoundingBox
LoadGeometry()
LoadGeometry(RhinoDoc)
Morph
Read
ReferenceCurve()
ReferenceCurve(RhinoObject)
ReferenceIndex()
 Retrieve the index of the point reference data.
ReferenceIndex(Int32)
 Sets the index of the point reference data.
ReferenceParam(Int32)
 Retrieve the indexed param of the point reference data.
ReferenceParam(Int32, Double)
 Sets the index of the point reference data.
ReferencesCurve
 Returns true if this point is based on a curve reference
ReferencesEdge
 Returns True if this point is based on an edge reference
ReferenceSurface
ReferenceType()
 Retrieve the reference type of this point object.
ReferenceType(GH_PointRefType)
 Sets the type of the point reference data.
ScriptVariable
SetReferenceParams
 Sets both param values of the point reference
ShowReferenceDialog()
ShowReferenceDialog(IWin32Window)
ToString |  (Overrides Object.ToString().)
Transform
Write
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace