Grasshopper SDK
GH_GooProxy<T>.TypeDescription Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string TypeDescription { get; }
Public ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GooProxy`1.TypeDescription"]
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace