Grasshopper SDK
GH_SettingsCategory.Name Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_SettingsCategory.Name"]
Implements
IGH_SettingCategory.Name
See Also
Reference
GH_SettingsCategory Class
Grasshopper.GUI Namespace