Grasshopper SDK
GH_CapsuleRenderEngine.RenderAlphaFill Method
 Render a standard transparancy background hatch. This is only needed when the capsule background colour is not fully opaque. This is usually the second stage in a capsule rendering, right after the Grips are drawn.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderAlphaFill(
	Graphics G
)
Public Sub RenderAlphaFill (
	G As Graphics
)
Parameters
G
Type: System.Drawing.Graphics
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace