Grasshopper SDK
GH_SamplingSphere Class
 Represents a coloured sphere that can be sampled at various rotations.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_SamplingSphere
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_SamplingSphere
Public Class GH_SamplingSphere
The GH_SamplingSphere type exposes the following members.
Constructors
Name | Description
GH_SamplingSphere
Initializes a new instance of the GH_SamplingSphere class
Top
Properties
Name | Description
SampleCount
 Gets the total number of samples contained in this sampling grid.
Size
 Gets the size of this sample grid.
Top
Methods
Name | Description
SampleSphere(Sphere)
 Sample the UV locations of a sphere. The sphere should be centered on the world origin.
SampleSphere(Sphere, GH_MemoryBitmap)
 Sample a sphere with a UV texture and return a bitmap of sampled values.
Top
See Also
Reference
Grasshopper.GUI Namespace