Grasshopper SDK
GH_ComponentParamServer.InventUniqueNickname Method (String, IEnumerable<String>)
 Create a new, unique parameter name.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string InventUniqueNickname(
	string allowedChars,
	IEnumerable<string> existingNames
)
Public Shared Function InventUniqueNickname (
	allowedChars As String,
	existingNames As IEnumerable(Of String)
) As String
Parameters
allowedChars
Type: System.String
Allowed character set for naming logic.
existingNames
Type: System.Collections.Generic.IEnumerable<String>
A collection of parameter names to avoid.
Return Value
Type: String
The first name combination that doesn't occur in the existingNames collection.
See Also
Reference
GH_ComponentParamServer Class
InventUniqueNickname Overload
Grasshopper.Kernel Namespace