Grasshopper SDK
GH_RhinoScriptInterface.IsEditorLoaded Method
 Returns the loaded state of the Grasshopper Main window.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsEditorLoaded()
Public Function IsEditorLoaded As Boolean
Return Value
Type: Boolean
True if the Main Grasshopper Window has been loaded.
Examples
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
  Dim GH
  Set GH = Rhino.GetPlugInObject("Grasshopper")
  Call Rhino.Print("Grasshopper Editor Loaded: " & GH.IsEditorLoaded())
  Set GH = Nothing
End Sub
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace