Grasshopper SDK
GH_ColourPickerBase.Padding Property
 Gets or sets the Padding for this control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Padding Padding { get; set; }
Public Property Padding As Padding
	Get
	Set
Property Value
Type: Padding
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.Padding"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace