Grasshopper SDK
GH_GraphicsUtil.HighlightBrush Method
 Gets a new brush object that can be used to draw the content of hover and focus rectangles. Caller is responsible for disposing the brush.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Brush HighlightBrush()
Public Shared Function HighlightBrush As Brush
Return Value
Type: Brush
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace