Grasshopper SDK
GH_QuickImageEditor.FrameFocus Property
 Gets or sets the rectangle of the focus frame.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle3d FrameFocus { get; set; }
Public Property FrameFocus As Rectangle3d
	Get
	Set
Property Value
Type: Rectangle3d
[Missing <value> documentation for "P:Grasshopper.GUI.GH_QuickImageEditor.FrameFocus"]
See Also
Reference
GH_QuickImageEditor Class
Grasshopper.GUI Namespace