Grasshopper SDK
GH_Param<T>.RelinkProxySources Method
 Attempt to replace all proxy sources with real sources. Proxy sources are used during file IO, when actual sources might not be available yet. Once an IO operation has been completed there should be no more proxy sources.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool RelinkProxySources(
	GH_Document document
)
Public Overridable Function RelinkProxySources (
	document As GH_Document
) As Boolean
Parameters
document
Type: Grasshopper.Kernel.GH_Document
The document from which to harvest the real source parameters.
Return Value
Type: Boolean
True on success, false on failure.
Implements
IGH_Param.RelinkProxySources(GH_Document)
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace