Grasshopper SDK
GH_DocumentObject.SetIconOverride Method
 Set a new custom icon override for this object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetIconOverride(
	Bitmap custom_icon
)
Public Sub SetIconOverride (
	custom_icon As Bitmap
)
Parameters
custom_icon
Type: System.Drawing.Bitmap
Icon override. Should be a 24x24 image.
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace