Grasshopper SDK
GH_PersistentParam<T>.SetPersistentData Method (T)
 Add a single item to the persistent data. This method will record an undo event, raise the OnObjectChanged event for PersistentData flags and place a call to ExpireSolution(False). If you want to add more than one piece of data, you should use the appropriate overload for this method.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetPersistentData(
	T item
)
Public Sub SetPersistentData (
	item As T
)
Parameters
item
Type: T
Item to add.
See Also
Reference
GH_PersistentParam<T> Class
SetPersistentData Overload
Grasshopper.Kernel Namespace