Grasshopper SDK
GH_Canvas.DocumentObjectMouseDownEventHandler Delegate
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void DocumentObjectMouseDownEventHandler(
	Object sender,
	GH_CanvasObjectMouseDownEventArgs e
)
Public Delegate Sub DocumentObjectMouseDownEventHandler (
	sender As Object,
	e As GH_CanvasObjectMouseDownEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.GUI.GH_CanvasObjectMouseDownEventArgs
See Also
Reference
Grasshopper.GUI.Canvas Namespace