Grasshopper SDK
IGH_FileDropTarget Interface
 Implement this interface in your IGH_DocumentObject if you want to participate in Drag+Drop events.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_FileDropTarget
Public Interface IGH_FileDropTarget
The IGH_FileDropTarget type exposes the following members.
Methods
Name | Description
AcceptableFile
 Gets a value indicating whether or not the path can be handled by the local object.
HandleDrop
 Handle a file drop.
Top
See Also
Reference
Grasshopper.GUI Namespace