Grasshopper SDK
GH_IndexRanges.Range Property
 Gets the range at the given index.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_IndexRange this[
	int index
] { get; }
Public ReadOnly Default Property Range (
	index As Integer
) As GH_IndexRange
	Get
Parameters
index
Type: System.Int32
Index of range to retrieve.
Property Value
Type: GH_IndexRange
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_IndexRanges.Range(System.Int32)"]
See Also
Reference
GH_IndexRanges Class
Grasshopper.Kernel.Data Namespace