Grasshopper SDK
GH_Component.GH_InputParamManager.AddAngleParameter Method (String, String, String, GH_ParamAccess, IEnumerable<Double>)
 Add a floating point Number parameter to the input list of this component. The parameter will be aware that it is representing angles.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int AddAngleParameter(
	string name,
	string nickname,
	string description,
	GH_ParamAccess access,
	IEnumerable<double> default
)
Public Function AddAngleParameter (
	name As String,
	nickname As String,
	description As String,
	access As GH_ParamAccess,
	default As IEnumerable(Of Double)
) As Integer
Parameters
name
Type: System.String
The name of the parameter. Keep it short, single words are best.
nickname
Type: System.String
The nickname of the parameter. Keep it short, single characters are best.
description
Type: System.String
The description of the parameter. Be succinct but clear, single sentences are best.
access
Type: Grasshopper.Kernel.GH_ParamAccess
Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default
Type: System.Collections.Generic.IEnumerable<Double>
A collection of default values to store in the parameter Persistent Data.
Return Value
Type: Int32
See Also
Reference
GH_Component.GH_InputParamManager Class
AddAngleParameter Overload
Grasshopper.Kernel Namespace