Grasshopper SDK
GH_LineCharge Constructor
Initializes a new instance of the GH_LineCharge class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LineCharge()
Public Sub New
See Also
Reference
GH_LineCharge Class
Grasshopper.Kernel.Types Namespace