Grasshopper SDK
GH_DoubleBufferedPanel Constructor
Initializes a new instance of the GH_DoubleBufferedPanel class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DoubleBufferedPanel()
Public Sub New
See Also
Reference
GH_DoubleBufferedPanel Class
Grasshopper.GUI Namespace