Grasshopper SDK
GH_Component.DocumentContextChanged Method
 Overrides the DocumentContextChanged method and delegates the call to all parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void DocumentContextChanged(
	GH_Document document,
	GH_DocumentContext context
)
Public Overrides Sub DocumentContextChanged (
	document As GH_Document,
	context As GH_DocumentContext
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document that owns this object.
context
Type: Grasshopper.Kernel.GH_DocumentContext
The reason for this event.
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace