Grasshopper SDK
GH_ObjectChangedEventArgs.m_tag Field
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected Object m_tag
Protected m_tag As Object
Field Value
Type: Object
See Also
Reference
GH_ObjectChangedEventArgs Class
Grasshopper.Kernel Namespace