Grasshopper SDK
GH_CanvasObjectMouseDownEventArgs Class
 Event arguments for the CanvasObjectMouseDown events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.GUI.GH_CanvasObjectMouseDownEventArgs
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_CanvasObjectMouseDownEventArgs : EventArgs
Public Class GH_CanvasObjectMouseDownEventArgs
	Inherits EventArgs
The GH_CanvasObjectMouseDownEventArgs type exposes the following members.
Constructors
Name | Description
GH_CanvasObjectMouseDownEventArgs
Initializes a new instance of the GH_CanvasObjectMouseDownEventArgs class
Top
Properties
Name | Description
Canvas
Document
Object
Top
See Also
Reference
Grasshopper.GUI Namespace