Grasshopper SDK
GH_Canvas.RemoveAllTagArtists Method
 Remove all IGH_TagArtists from this canvas. Do not use this method unless you want to screw over everyone else.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RemoveAllTagArtists()
Public Sub RemoveAllTagArtists
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace