Grasshopper SDK
GH_DigitScroller.AllowRadixDrag Property
 Gets or sets whether the radix symbol can be dragged.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AllowRadixDrag { get; set; }
Public Property AllowRadixDrag As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DigitScroller.AllowRadixDrag"]
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace