Grasshopper SDK
GH_Animator.PointAnimator Method (Point, Point)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<Point> PointAnimator(
	Point A,
	Point B
)
Public Shared Function PointAnimator (
	A As Point,
	B As Point
) As GH_Animator(Of Point)
Parameters
A
Type: System.Drawing.Point
B
Type: System.Drawing.Point
Return Value
Type: GH_Animator<Point>
See Also
Reference
GH_Animator Class
PointAnimator Overload
Grasshopper.GUI Namespace