Grasshopper SDK
GH_GraphicsUtil.LimitIntegers Method
 Limits RGB channels to the 0~255 range,
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void LimitIntegers(
	ref int r,
	ref int g,
	ref int b
)
Public Shared Sub LimitIntegers (
	ByRef r As Integer,
	ByRef g As Integer,
	ByRef b As Integer
)
Parameters
r
Type: System.Int32
g
Type: System.Int32
b
Type: System.Int32
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace