Grasshopper SDK
GH_ComponentServer.ExternalFiles Method
 Get lists of all the external files (GHA, GHUSER and GHCLUSTER) that will be loaded by Grasshopper. Note: this does not equal the files that may already have been loaded, just the files that we'll attempt to load if we were asked to load all plugins now. The list contains no duplicate file paths, but it may contain identical files which won't be filtered until actual loading.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<GH_ExternalFile> ExternalFiles(
	bool testGrasshopperCollisions,
	bool testExternalCollisions
)
Public Shared Function ExternalFiles (
	testGrasshopperCollisions As Boolean,
	testExternalCollisions As Boolean
) As List(Of GH_ExternalFile)
Parameters
testGrasshopperCollisions
Type: System.Boolean
If true, invalid duplicates of Grasshopper.dll will be tested for and warned about.
testExternalCollisions
Type: System.Boolean
If true, duplicates of GHA, GHUSER and GHCLUSTER files will be tested for and warned about.
Return Value
Type: List<GH_ExternalFile>
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace