Grasshopper SDK
GH_Parser.IsCommentLine Method
 Test whether a line is a comment. Commented lines begin with double slashes (//) and are ignored during parsing.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsCommentLine(
	string line
)
Public Shared Function IsCommentLine (
	line As String
) As Boolean
Parameters
line
Type: System.String
Line to test. If you supply a multi-line string, death's too good for you.
Return Value
Type: Boolean
True if the line is a comment line.
See Also
Reference
GH_Parser Class
Grasshopper.Documentation Namespace