Grasshopper SDK
GH_IndexRuleSet.AddDigitPatternRule Method (Int32[])
 Append a rule for filtering digit patterns.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddDigitPatternRule(
	int[] pattern
)
Public Sub AddDigitPatternRule (
	pattern As Integer()
)
Parameters
pattern
Type: System.Int32[]
Complete pattern. A complete pattern consists of at least three integers, the first one signifying the pattern lower bound, the last one signifying the patters upper bound (use Int32.MaxValue is you do not want to enforce an upper bound), and at least one integer in between defining the pattern growth.
See Also
Reference
GH_IndexRuleSet Class
AddDigitPatternRule Overload
Grasshopper.Kernel.Data Namespace