Grasshopper SDK
GH_DocEnabledEventArgs Class
 These arguments are passed along with SettingsChanged events on GH_Document.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_DocEnabledEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocEnabledEventArgs : EventArgs
Public Class GH_DocEnabledEventArgs
	Inherits EventArgs
The GH_DocEnabledEventArgs type exposes the following members.
Properties
Name | Description
Document
 Gets the document that raised the event.
Enabled
 Gets the value of the document Enabled flag at the time the event was raised, it may have been changed in between by other event handlers.
Top
See Also
Reference
Grasshopper.Kernel Namespace