Grasshopper SDK
GH_ComponentServer.Clear Method
 Clear all caches.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace