Grasshopper SDK
GH_GeometricGoo<T>.Boundingbox Property
 Gets the boundingbox for this geometry.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract BoundingBox Boundingbox { get; }
Public MustOverride ReadOnly Property Boundingbox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometricGoo`1.Boundingbox"]
Return Value
Type: BoundingBox
The boundingbox for this piece of geometry or Boundingbox.Empty if the geometry is null or invalid.
Implements
IGH_GeometricGoo.Boundingbox
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace