Grasshopper SDK
IGH_UpgradeObject.UpgradeFrom Property
 Gets the ComponentGuid of the old object (the object to be updated).
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid UpgradeFrom { get; }
ReadOnly Property UpgradeFrom As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_UpgradeObject.UpgradeFrom"]
See Also
Reference
IGH_UpgradeObject Interface
Grasshopper.Kernel Namespace