Grasshopper SDK
GH_String Constructor (GH_String)
Initializes a new instance of the GH_String class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_String(
	GH_String other
)
Public Sub New (
	other As GH_String
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_String
See Also
Reference
GH_String Class
GH_String Overload
Grasshopper.Kernel.Types Namespace