Grasshopper SDK
IGH_CanvasValidator.CanDragObject Method
 Validates whether some components can be dragged.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool CanDragObject(
	IGH_DocumentObject object,
	PointF dragFromPoint
)
Function CanDragObject (
	object As IGH_DocumentObject,
	dragFromPoint As PointF
) As Boolean
Parameters
object
Type: Grasshopper.Kernel.IGH_DocumentObject
dragFromPoint
Type: System.Drawing.PointF
Return Value
Type: Boolean
See Also
Reference
IGH_CanvasValidator Interface
Grasshopper.GUI.Canvas Namespace