Grasshopper SDK
GH_NamedView.SetToViewport Method (GH_Canvas, Int32)
 Animates a view transition.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetToViewport(
	GH_Canvas cv,
	int length
)
Public Sub SetToViewport (
	cv As GH_Canvas,
	length As Integer
)
Parameters
cv
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas to apply the transition to.
length
Type: System.Int32
Length (in milliseconds) of the transition.
See Also
Reference
GH_NamedView Class
SetToViewport Overload
Grasshopper.GUI.Canvas Namespace