Grasshopper SDK
GH_Plane.DrawPlane Method (DisplayPipeline, Plane, Double, Int32)
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void DrawPlane(
	DisplayPipeline display,
	Plane plane,
	double size,
	int frequency
)
Public Shared Sub DrawPlane (
	display As DisplayPipeline,
	plane As Plane,
	size As Double,
	frequency As Integer
)
Parameters
display
Type: DisplayPipeline
plane
Type: Plane
size
Type: System.Double
frequency
Type: System.Int32
See Also
Reference
GH_Plane Class
DrawPlane Overload
Grasshopper.Kernel.Types Namespace