Grasshopper SDK
GH_Structure<T>.Append Method (T, GH_Path)
 Append a data item to the specified branch in the structure. If the branch doesn't exist yet, it will be created.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Append(
	T data,
	GH_Path path
)
Public Sub Append (
	data As T,
	path As GH_Path
)
Parameters
data
Type: T
Data to append
path
Type: Grasshopper.Kernel.Data.GH_Path
Data path
See Also
Reference
GH_Structure<T> Class
Append Overload
Grasshopper.Kernel.Data Namespace