Grasshopper SDK
GH_Param<T>.InstantiateT Method
 Attempts to instantiate a new instance of T.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual T InstantiateT()
Protected Overridable Function InstantiateT As T
Return Value
Type: T
This function should return a newly constructed instance of T.
Remarks
 If T is an abstract class or if T has no default (empty) constructor, this function will ASSERT. In order to avoid a Try...Catch block performance impact, override this function and call the type constructor for T directly.
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace