Grasshopper SDK
GH_AssemblyInfo.AssemblyVersion Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string AssemblyVersion { get; }
Public Overridable ReadOnly Property AssemblyVersion As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.AssemblyVersion"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace