Grasshopper SDK
GH_Gradient.RemoveGrip Method (GH_Grip)
 Remove the specified grip.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RemoveGrip(
	GH_Grip grip
)
Public Sub RemoveGrip (
	grip As GH_Grip
)
Parameters
grip
Type: Grasshopper.GUI.Gradient.GH_Grip
Grip to remove.
See Also
Reference
GH_Gradient Class
RemoveGrip Overload
Grasshopper.GUI.Gradient Namespace