Grasshopper SDK
IGH_DataAccess.GetData<T> Method (String, T)
 Retrieve data from an input parameter during GH_Component.SolveInstance().
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool GetData<T>(
	string name,
	ref T destination
)
Function GetData(Of T) (
	name As String,
	ByRef destination As T
) As Boolean
Parameters
name
Type: System.String
destination
Type: T
Type Parameters
T
Type of the data to retrieve. If the data type does not match the parameter type, a conversion will be attempted.
Return Value
Type: Boolean
True on success, false on failure.
Remarks
Parameter access by index is faster, consider using the other overload if possible.
See Also
Reference
IGH_DataAccess Interface
GetData Overload
Grasshopper.Kernel Namespace