Grasshopper SDK
IGH_Attributes.AppendToAttributeTree Method
 Recursively append these attributes and all child attributes to the attribute list.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void AppendToAttributeTree(
	List<IGH_Attributes> attributes
)
Sub AppendToAttributeTree (
	attributes As List(Of IGH_Attributes)
)
Parameters
attributes
Type: System.Collections.Generic.List<IGH_Attributes>
List to append to.
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace