Grasshopper SDK
IGH_GooProxy.IsParsable Property
 Gets a value indicating whether or not the type can be instantiated from a String.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsParsable { get; }
ReadOnly Property IsParsable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_GooProxy.IsParsable"]
See Also
Reference
IGH_GooProxy Interface
Grasshopper.Kernel.Types Namespace