Grasshopper SDK
GH_MouseTracker.Duration Property
 Gets the timespan that has passed between the oldest and youngest recorded frames. This is not the same as the time that has passed since recording began.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public TimeSpan Duration { get; }
Public ReadOnly Property Duration As TimeSpan
	Get
Property Value
Type: TimeSpan
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MouseTracker.Duration"]
See Also
Reference
GH_MouseTracker Class
Grasshopper.GUI Namespace