Grasshopper SDK
GH_SliderBase.Epsilon Property
 Gets the smallest value change supported by the current slider properties.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Epsilon { get; }
Public ReadOnly Property Epsilon As Decimal
	Get
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.Epsilon"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace