Grasshopper SDK
GH_PreviewUtil Constructor
Initializes a new instance of the GH_PreviewUtil class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PreviewUtil()
Public Sub New
See Also
Reference
GH_PreviewUtil Class
GH_PreviewUtil Overload
Grasshopper.Kernel Namespace