Grasshopper SDK
GH_Canvas.TooltipDelay Property
 Gets the delay (in milliseconds) required for a tooltip popup. This delay is a user setting stored under the Canvas:TooltipDelay field of the core settings.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int TooltipDelay { get; }
Public ReadOnly Property TooltipDelay As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.TooltipDelay"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace