Grasshopper SDK
GH_ActiveObject.Menu_AppendWarningsAndErrors Method
Note: This API is now obsolete.
 This method is obsolete and has been replaced with Menu_AppendRuntimeMessages().
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("This method has been replaced by Menu_AppendRuntimeMessages()")]
protected void Menu_AppendWarningsAndErrors(
	ToolStripDropDown menu
)
<ObsoleteAttribute("This method has been replaced by Menu_AppendRuntimeMessages()")>
Protected Sub Menu_AppendWarningsAndErrors (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace