Grasshopper SDK
IGH_Tooltip.Diagram Property
 Sets the tooltip diagram image. The diagram image is optional and is displayed in the same area as the ToolTipDescription text.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Image Diagram { set; }
WriteOnly Property Diagram As Image
	Set
Property Value
Type: Image
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_Tooltip.Diagram"]
See Also
Reference
IGH_Tooltip Interface
Grasshopper.GUI Namespace