Grasshopper SDK
GH_Interpolation Enumeration
 Enumerates the possible animation progression types.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_Interpolation
Public Enumeration GH_Interpolation
Members
Member name | Value | Description
None | 0 |  No animation occurs.
NearestNeighbour | 1 |  Animation interpolation is either equal to A or B, whichever is closest.
Linear | 2 |  Linear interpolation between A and B.
EaseIn | 3 |  Interpolation that has a derivative of zero at the start.
EaseOut | 4 |  Inteprolation that has a derivative of zero at the end.
EaseInAndOut | 5 |  Interpolation that has a derivative of zero at both ends.
See Also
Reference
Grasshopper.GUI Namespace