Grasshopper SDK
GH_ComponentServer.AllAddOns Property
Note: This API is now obsolete.
 Gets a list of all the gha and ghuser files that will be loaded as Grasshopper add-ons.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("This property has been replaced by the ExternalFiles() Shared method")]
public static List<string> AllAddOns { get; }
<ObsoleteAttribute("This property has been replaced by the ExternalFiles() Shared method")>
Public Shared ReadOnly Property AllAddOns As List(Of String)
	Get
Property Value
Type: List<String>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.AllAddOns"]
Return Value
Type: List<String>
A list of target file paths.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace