Grasshopper SDK
GH_CanvasWireValidator.CanAcceptObject Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CanAcceptObject(
	Guid id
)
Public Overrides Function CanAcceptObject (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
Return Value
Type: Boolean
See Also
Reference
GH_CanvasWireValidator Class
Grasshopper.GUI.Canvas Namespace