Grasshopper SDK
SliderSnapRange.Merge Method
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public SliderSnapRange Merge(
	SliderSnapRange other
)
Public Function Merge (
	other As SliderSnapRange
) As SliderSnapRange
Parameters
other
Type: Grasshopper.GUI.Base.SliderSnapRange
Return Value
Type: SliderSnapRange
See Also
Reference
SliderSnapRange Structure
Grasshopper.GUI.Base Namespace