Grasshopper SDK
DataTree<T>.DataCount Property
 Gets the total number of data items (including nulls) stored in all branches.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int DataCount { get; }
Public ReadOnly Property DataCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.DataTree`1.DataCount"]
See Also
Reference
DataTree<T> Class
Grasshopper Namespace