Grasshopper SDK
IGH_DocumentObject.Icon_24x24_Locked Property
 The greyscale icon of this object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Bitmap Icon_24x24_Locked { get; }
ReadOnly Property Icon_24x24_Locked As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_DocumentObject.Icon_24x24_Locked"]
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace