Grasshopper SDK
GH_Format.FormatVectorValidity Method
 If the point is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatVectorValidity(
	Vector3d val,
	string identifier = "Vector",
	bool testZero = false,
	bool testUnit = false
)
Public Shared Function FormatVectorValidity (
	val As Vector3d,
	Optional identifier As String = "Vector",
	Optional testZero As Boolean = false,
	Optional testUnit As Boolean = false
) As String
Parameters
val
Type: Vector3d
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
testZero (Optional)
Type: System.Boolean
If True, zero-length vectors are considered to be invalid.
testUnit (Optional)
Type: System.Boolean
If True, non-unit-length vectors are considered to be invalid.
Return Value
Type: String
A string describing why the point is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace