Grasshopper SDK
GH_ComponentParamServer.Find Method
 Find the parameter that has the given InstanceGuid.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Param Find(
	Guid id
)
Public Function Find (
	id As Guid
) As IGH_Param
Parameters
id
Type: System.Guid
InstanceID to search for.
Return Value
Type: IGH_Param
The parameter with the matching ID or null on failure.
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace