Grasshopper SDK
GH_FontServer.StringToFont Method
 Convert a font description string back into a font.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font StringToFont(
	string text
)
Public Shared Function StringToFont (
	text As String
) As Font
Parameters
text
Type: System.String
Text to parse.
Return Value
Type: Font
Font represented by the text, or null if no font could be created.
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace