Grasshopper SDK
GH_GeometryGroup.Objects Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_GeometricGoo> Objects { get; }
Public ReadOnly Property Objects As List(Of IGH_GeometricGoo)
	Get
Property Value
Type: List<IGH_GeometricGoo>
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometryGroup.Objects"]
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace