Grasshopper SDK
IGH_FieldElement.BoundingBox Property
 Gets the visual boundingbox of all the geometry used to represent this element in 3D.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
BoundingBox BoundingBox { get; }
ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_FieldElement.BoundingBox"]
See Also
Reference
IGH_FieldElement Interface
Grasshopper.Kernel.Types Namespace