Grasshopper SDK
IGH_ValueProxy Interface
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_ValueProxy
Public Interface IGH_ValueProxy
The IGH_ValueProxy type exposes the following members.
Properties
Name | Description
IsParsable
 Gets a value indicating whether or not the type can be instantiated from a String
IsValid
 Gets a value indicating whether or not the current value is valid
ProxyName
 Gets a human-friendly name description of the template type
ProxyType
 Gets the System.Type description of the template type
ProxyValue
 Gets an instance of the local template type object
UserString
 Gets or sets the user-defined string that describes this proxy This only really makes sense if the Proxy is Parsable.
Top
Methods
Name | Description
Duplicate
 Create an exact duplicate of the type.
FromString
 If IsParsable(), then attempts to convert the string to a generic type value
MutateString
 Munge a string to remove obvious errors on account of the user.
ToString
 Returns a String description of the current value.
Top
See Also
Reference
Grasshopper.Kernel Namespace