Grasshopper SDK
GH_Document.EnabledChanged Event
 The Enabled state was changed on this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Document.EnabledChangedEventHandler EnabledChanged
Public Event EnabledChanged As GH_Document.EnabledChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.EnabledChangedEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace