Grasshopper SDK
GH_Goo<T>.TypeName Property
 Gets the name of the type of the implementation.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract string TypeName { get; }
Public MustOverride ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Goo`1.TypeName"]
Implements
IGH_Goo.TypeName
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace