Grasshopper SDK
Complex.Root Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Complex Root(
	Complex rootexponent
)
Public Function Root (
	rootexponent As Complex
) As Complex
Parameters
rootexponent
Type: Grasshopper.Kernel.Types.Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace