Grasshopper SDK
GH_Surface.GetPreviewMeshes Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Mesh[] GetPreviewMeshes()
Public Function GetPreviewMeshes As Mesh()
Return Value
Type: Mesh[]
Implements
IGH_PreviewMeshData.GetPreviewMeshes()
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace