Grasshopper SDK
GH_Format.FormatSurface Method (Brep)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatSurface(
	Brep data
)
Public Shared Function FormatSurface (
	data As Brep
) As String
Parameters
data
Type: Brep
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatSurface Overload
Grasshopper.Kernel Namespace