Grasshopper SDK
GH_Structure<T>.Write Method
 Write the entire GH_Structure to an archive. This method relies on the the serialization of the IGH_Goo items it contains.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Write(
	GH_IWriter writer
)
Public Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Archive to write to.
Return Value
Type: Boolean
True on success, false on failure.
Implements
GH_ISerializable.Write(GH_IWriter)
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace