Grasshopper SDK
GH_Vector Constructor
 Default constructor. Creates a zero-length vector.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Vector()
Public Sub New
See Also
Reference
GH_Vector Class
GH_Vector Overload
Grasshopper.Kernel.Types Namespace