Grasshopper SDK
GH_ColourPickerBase.ColorChangedEventHandler Delegate
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ColorChangedEventHandler(
	Object sender,
	GH_ColourPickerEventArgs e
)
Public Delegate Sub ColorChangedEventHandler (
	sender As Object,
	e As GH_ColourPickerEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.GUI.Base.GH_ColourPickerEventArgs
See Also
Reference
Grasshopper.GUI.Base Namespace