Grasshopper SDK
GH_VerticalScrollBar.TargetHeight Property
 Gets or sets the height of the target area (the area being scrolled)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int TargetHeight { get; set; }
Public Property TargetHeight As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_VerticalScrollBar.TargetHeight"]
See Also
Reference
GH_VerticalScrollBar Class
Grasshopper.GUI Namespace