Grasshopper SDK
GH_Convert.GetSurfaceFromDocument Method
 Harvest a surface object from a Rhino document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool GetSurfaceFromDocument(
	RhinoDoc doc,
	Guid id,
	out Surface srf
)
Public Shared Function GetSurfaceFromDocument (
	doc As RhinoDoc,
	id As Guid,
	<OutAttribute> ByRef srf As Surface
) As Boolean
Parameters
doc
Type: RhinoDoc
Document to search.
id
Type: System.Guid
ID of surface object.
srf
Type: Surface
Surface result.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace