Grasshopper SDK
GH_TreeRules Fields
The GH_TreeRules type exposes the following members.
Fields
Name | Description
AllowedChars
AndOperator
AnyNumbersSymbol
AnyNumberSymbol
ItemBrackets
ItemCloseBracket
ItemOpenBracket
NotOperator
OrOperator
PathBrackets
PathCloseBracket
PathOpenBracket
PathSeparator
RangeSymbol
RuleBrackets
RuleCloseBracket
RuleOpenBracket
Separator
SequenceCode
SequenceSymbol
Top
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace