Grasshopper SDK
GH_Point2D Fields
The GH_Point2D type exposes the following members.
Fields
Name | Description
x
 X coordinate of point.
y
 Y coordinate of point.
Top
See Also
Reference
GH_Point2D Structure
GH_IO.Types Namespace