Grasshopper SDK
GH_ComponentServer.IsObjectCached Method
 Tests the caches for an existing object type ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsObjectCached(
	Guid id
)
Public Function IsObjectCached (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
The ID to test for.
Return Value
Type: Boolean
True if the ID is cached, false if it aint.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace