Grasshopper SDK
GH_DocumentEditor.SetStatusBarEvent Method
 Set a new message on the Grasshopper status bar.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetStatusBarEvent(
	GH_RuntimeMessage event
)
Public Sub SetStatusBarEvent (
	event As GH_RuntimeMessage
)
Parameters
event
Type: Grasshopper.Kernel.GH_RuntimeMessage
Message to set
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace