Grasshopper SDK
GH_ComponentServer.DestroyLoadingUI Method
 Destroy the loading UI (the banner and the progress bar).
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DestroyLoadingUI()
Public Sub DestroyLoadingUI
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace