Grasshopper SDK
GH_Canvas.CanvasPrePaintWidgets Event
 Raised before Widgets are drawn.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPrePaintWidgetsEventHandler CanvasPrePaintWidgets
Public Event CanvasPrePaintWidgets As GH_Canvas.CanvasPrePaintWidgetsEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPrePaintWidgetsEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace