Grasshopper SDK
GH_Document.AlignObjects Method (GH_Align, GH_Distribute, List<IGH_DocumentObject>)
 Perform alignment and distribution logic on a set of objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AlignObjects(
	GH_Align align,
	GH_Distribute distribute,
	List<IGH_DocumentObject> objs
)
Public Sub AlignObjects (
	align As GH_Align,
	distribute As GH_Distribute,
	objs As List(Of IGH_DocumentObject)
)
Parameters
align
Type: GH_Align
distribute
Type: GH_Distribute
objs
Type: System.Collections.Generic.List<IGH_DocumentObject>
See Also
Reference
GH_Document Class
AlignObjects Overload
Grasshopper.Kernel Namespace