Grasshopper SDK
GH_DocumentEditor.ScriptAccess_SaveDocumentAs Method (String)
 Saves the currently active document to disk.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ScriptAccess_SaveDocumentAs(
	string path
)
Public Function ScriptAccess_SaveDocumentAs (
	path As String
) As Boolean
Parameters
path
Type: System.String
Path of save destination.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentEditor Class
ScriptAccess_SaveDocumentAs Overload
Grasshopper.GUI Namespace