Grasshopper SDK
GH_MemoryBitmap.Filter_Multiply Method (GH_BitmapChannel, Double, Byte)
 Multiply all values in a specific channel with a specific factor, using a custom scaling center anchor.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_Multiply(
	GH_BitmapChannel channel,
	double factor,
	byte anchor
)
Public Sub Filter_Multiply (
	channel As GH_BitmapChannel,
	factor As Double,
	anchor As Byte
)
Parameters
channel
Type: Grasshopper.Kernel.GH_BitmapChannel
Channel(s) to multiply.
factor
Type: System.Double
Multiplication factor.
anchor
Type: System.Byte
Byte value to scale from.
See Also
Reference
GH_MemoryBitmap Class
Filter_Multiply Overload
Grasshopper.Kernel Namespace