Grasshopper SDK
CentralSettings.PreviewBumpZBufferChanged Event
 Raised whenever the PreviewBumpZBuffer setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.PreviewBumpZBufferChangedEventHandler PreviewBumpZBufferChanged
Public Shared Event PreviewBumpZBufferChanged As CentralSettings.PreviewBumpZBufferChangedEventHandler
Value
Type: Grasshopper.CentralSettings.PreviewBumpZBufferChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace