Grasshopper SDK
GH_Point Constructor (Point3d)
Initializes a new instance of the GH_Point class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Point(
	Point3d pt
)
Public Sub New (
	pt As Point3d
)
Parameters
pt
Type: Point3d
See Also
Reference
GH_Point Class
GH_Point Overload
Grasshopper.Kernel.Types Namespace