Grasshopper SDK
GH_Matrix Constructor (GH_Matrix)
Initializes a new instance of the GH_Matrix class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Matrix(
	GH_Matrix other
)
Public Sub New (
	other As GH_Matrix
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Matrix
See Also
Reference
GH_Matrix Class
GH_Matrix Overload
Grasshopper.Kernel.Types Namespace