Grasshopper SDK
GH_SliderBase Constructor
Initializes a new instance of the GH_SliderBase class
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SliderBase()
Public Sub New
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace