Grasshopper SDK
CentralSettings.AuthorDetails Property
 Gets a new GH_AuthorDetails instance populated with the current settings. Changing this instance does not affect the settings.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static IGH_Author AuthorDetails { get; }
Public Shared ReadOnly Property AuthorDetails As IGH_Author
	Get
Property Value
Type: IGH_Author
[Missing <value> documentation for "P:Grasshopper.CentralSettings.AuthorDetails"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace