Grasshopper SDK
GH_AutoSaveSettings.SaveOnObjectAdded Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool SaveOnObjectAdded { get; set; }
Public Shared Property SaveOnObjectAdded As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AutoSaveSettings.SaveOnObjectAdded"]
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace