Grasshopper SDK
GH_Interval Constructor
 Default constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Interval()
Public Sub New
See Also
Reference
GH_Interval Class
GH_Interval Overload
Grasshopper.Kernel.Types Namespace