Grasshopper SDK
IGH_DocumentObject.OnAttributesChanged Method
 Raises the AttributesChanged event on the toplevel object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void OnAttributesChanged()
Sub OnAttributesChanged
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace