Grasshopper SDK
Folders.PluginFolder Property
 Gets the directory that contains the Grasshopper.dll file.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string PluginFolder { get; }
Public Shared ReadOnly Property PluginFolder As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.PluginFolder"]
See Also
Reference
Folders Class
Grasshopper Namespace