Grasshopper SDK
GH_Lexer.Mask Property
 Gets the original string that represents the user input for this lexer.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Mask { get; }
Public ReadOnly Property Mask As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Lexer.Mask"]
See Also
Reference
GH_Lexer Class
Grasshopper.Kernel.Data Namespace