Grasshopper SDK
GH_Document.RemoveObjects Method
 Remove the specified objects from the document. This removal is the precursor to object deletion. Do not call this function if you intend to transfer the objects to another GH_Document. This method does not add an Undo event, that is the responsibility of the caller.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int RemoveObjects(
	IEnumerable<IGH_DocumentObject> objectList,
	bool update
)
Public Function RemoveObjects (
	objectList As IEnumerable(Of IGH_DocumentObject),
	update As Boolean
) As Integer
Parameters
objectList
Type: System.Collections.Generic.IEnumerable<IGH_DocumentObject>
Objects to remove from this document.
update
Type: System.Boolean
If True, the solution will be recomputed.
Return Value
Type: Int32
The number of objects actually deleted.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace