Grasshopper SDK
Folders.CursorFolder Property
 Gets the directory that contains the cursor files that ship with Grasshopper.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string CursorFolder { get; }
Public Shared ReadOnly Property CursorFolder As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.CursorFolder"]
See Also
Reference
Folders Class
Grasshopper Namespace