Grasshopper SDK
GH_DigitAlign Enumeration
 Enumerates the possible alignments for digits inside the GH_DigitScroller control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_DigitAlign
Public Enumeration GH_DigitAlign
Members
Member name | Value | Description
Justify | 0 |  Digits expand to fill out the entire free space.
Left | 1 |  Digits are stacked against the left side of the control.
Center | 2 |  Digits are stacked together in the center of the control.
Right | 3 |  Digits are stacked against the right side of the control.
See Also
Reference
Grasshopper.GUI.Base Namespace