Grasshopper SDK
GH_InstanceDescription.Write Method
 Default serialization. Only stores Name, NickName, Description and InstanceGuid fields. If you want to store additional fields use WriteFull() instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool Write(
	GH_IWriter writer
)
Public Overridable Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Object to serialize with.
Return Value
Type: Boolean
Always True.
Implements
GH_ISerializable.Write(GH_IWriter)
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace