Grasshopper SDK
GH_Component.GH_OutputParamManager.RegisterParam Method (IGH_Param, GH_ParamAccess)
 Generic parameter registration. This class provides methods to register standard parameters, but if you have a special type you're in charge of setting it all up yourself.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RegisterParam(
	IGH_Param param,
	GH_ParamAccess access
)
Public Sub RegisterParam (
	param As IGH_Param,
	access As GH_ParamAccess
)
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
The parameter to add.
access
Type: Grasshopper.Kernel.GH_ParamAccess
Parameter access, you should set this field if you intend to output lists here.
See Also
Reference
GH_Component.GH_OutputParamManager Class
RegisterParam Overload
Grasshopper.Kernel Namespace