Grasshopper SDK
GH_ComponentAttributes.LayoutComponentBox Method
 Utility layout method for GH_Component style UI.
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static RectangleF LayoutComponentBox(
	IGH_Component owner
)
Public Shared Function LayoutComponentBox (
	owner As IGH_Component
) As RectangleF
Parameters
owner
Type: Grasshopper.Kernel.IGH_Component
Component to layout.
Return Value
Type: RectangleF
The rectangle describing the box of the component name/icon.
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace