Grasshopper SDK
GH_GDI_Util.FilletRectangle Method
 Create a rectangle with filleted corners.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath FilletRectangle(
	Rectangle box,
	int radius
)
Public Shared Function FilletRectangle (
	box As Rectangle,
	radius As Integer
) As GraphicsPath
Parameters
box
Type: System.Drawing.Rectangle
Rectangle to fillet.
radius
Type: System.Int32
Fillet radius, radius will be limited if too large.
Return Value
Type: GraphicsPath
GraphicsPath describing filletted rectangle.
See Also
Reference
GH_GDI_Util Class
Grasshopper.GUI Namespace