Grasshopper SDK
GH_DocumentServer.NextAvailableDocument Method
 Gets the most important, non-active document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document NextAvailableDocument()
Public Function NextAvailableDocument As GH_Document
Return Value
Type: GH_Document
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace