Grasshopper SDK
GH_DebugDescriptionWriter.WriteLine Method
 Write a new blank line to the log.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void WriteLine()
Public Sub WriteLine
See Also
Reference
GH_DebugDescriptionWriter Class
WriteLine Overload
Grasshopper.Kernel Namespace