Grasshopper SDK
GH_ActiveObject.ExpireDownStreamObjects Method
 This function is called whenever the solution for this object expires. Override this function if objects depend on you.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void ExpireDownStreamObjects()
Protected Overridable Sub ExpireDownStreamObjects
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace