Grasshopper SDK
IGH_Author.IsEmpty Property
 Gets whether any data has been assigned to this object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsEmpty { get; }
ReadOnly Property IsEmpty As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Author.IsEmpty"]
See Also
Reference
IGH_Author Interface
Grasshopper.Kernel Namespace