Grasshopper SDK
GH_RelevantObjectFilter Enumeration
 Enumerates the possible filters to use in relevant object searches.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[FlagsAttribute]
public enum GH_RelevantObjectFilter
<FlagsAttribute>
Public Enumeration GH_RelevantObjectFilter
Members
Member name | Value | Description
None | 0 |  Blank filter. When combined with another filter it is ignored.
Groups | 1 |  Include group objects in the search.
InputGrips | 2 |  Include input grips in the search.
OutputGrips | 4 |  Include output grips in the search.
Grips | 6 |  Include both input and outpu grips in the search.
Attributes | 8 |  Include attribute bounds in the search.
Wires | 1024 |  Include wires (currently not yet supported)
All | 2147483647 |  Search all possible objects.
See Also
Reference
Grasshopper.Kernel Namespace