Grasshopper SDK
GH_Convert.StringToGuid Method
 Create a Guid based on SHA256 hashing of a string.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Guid StringToGuid(
	string text
)
Public Shared Function StringToGuid (
	text As String
) As Guid
Parameters
text
Type: System.String
Text to hash.
Return Value
Type: Guid
A guid representing the string.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace