Grasshopper SDK
GH_ColourPickerBase.MinWidth Field
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int MinWidth = 100
Public Const MinWidth As Integer = 100
Field Value
Type: Int32
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace