Grasshopper SDK
GH_Viewport.ApplyProjection Method
 Apply the current display transformation to a Graphics object.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ApplyProjection(
	Graphics G
)
Public Sub ApplyProjection (
	G As Graphics
)
Parameters
G
Type: System.Drawing.Graphics
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace