Grasshopper SDK
CentralSettings.RibbonVisibleChangedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void RibbonVisibleChangedEventHandler()
Public Delegate Sub RibbonVisibleChangedEventHandler
See Also
Reference
Grasshopper Namespace