Grasshopper SDK
GH_PersistentParam<T>.PersistentData Property
 Gets the persistent data stored in this parameter. If you modify the persistent data, be sure to call the: OnObjectChanged(GH_ObjectEventType.PersistentData) event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Structure<T> PersistentData { get; }
Public ReadOnly Property PersistentData As GH_Structure(Of T)
	Get
Property Value
Type: GH_Structure<T>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PersistentParam`1.PersistentData"]
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace