Grasshopper SDK
GH_FontServer.Standard Property
 SystemFonts.CaptionFont, 8pt, regular
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font Standard { get; }
Public Shared ReadOnly Property Standard As Font
	Get
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FontServer.Standard"]
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace