Grasshopper SDK
GH_GeometryGroup.Morph Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_GeometricGoo Morph(
	SpaceMorph xmorph
)
Public Function Morph (
	xmorph As SpaceMorph
) As IGH_GeometricGoo
Parameters
xmorph
Type: SpaceMorph
Return Value
Type: IGH_GeometricGoo
Implements
IGH_GeometricGoo.Morph(SpaceMorph)
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace