Grasshopper SDK
GH_GeometricFont Class
 Exposes methods for drawing geometric characters.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_GeometricFont
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_GeometricFont
Public NotInheritable Class GH_GeometricFont
The GH_GeometricFont type exposes the following members.
Properties
Name | Description
Char0
 Gets the default geometry for '0'. Caller is responsible for disposing the path.
Char1
 Gets the default geometry for '1'. Caller is responsible for disposing the path.
Char2
 Gets the default geometry for '2'. Caller is responsible for disposing the path.
Char3
 Gets the default geometry for '3'. Caller is responsible for disposing the path.
Char4
 Gets the default geometry for '4'. Caller is responsible for disposing the path.
Char5
 Gets the default geometry for '5'. Caller is responsible for disposing the path.
Char6
 Gets the default geometry for '6'. Caller is responsible for disposing the path.
Char7
 Gets the default geometry for '7'. Caller is responsible for disposing the path.
Char8
 Gets the default geometry for '8'. Caller is responsible for disposing the path.
Char9
 Gets the default geometry for '9'. Caller is responsible for disposing the path.
CharBracketClose
 Gets the default geometry for '}'. Caller is responsible for disposing the path.
CharBracketOpen
 Gets the default geometry for '{'. Caller is responsible for disposing the path.
CharDash
 Gets the default geometry for '-'. Caller is responsible for disposing the path.
CharSemiColon
 Gets the default geometry for ';'. Caller is responsible for disposing the path.
Top
Methods
Name | Description
Draw0
 Draw the geometric character '0' at the specified location.
Draw1
 Draw the geometric character '1' at the specified location.
Draw2
 Draw the geometric character '2' at the specified location.
Draw3
 Draw the geometric character '3' at the specified location.
Draw4
 Draw the geometric character '4' at the specified location.
Draw5
 Draw the geometric character '5' at the specified location.
Draw6
 Draw the geometric character '6' at the specified location.
Draw7
 Draw the geometric character '7' at the specified location.
Draw8
 Draw the geometric character '8' at the specified location.
Draw9
 Draw the geometric character '9' at the specified location.
DrawBracketClose
 Draw the geometric character '}' at the specified location.
DrawBracketOpen
 Draw the geometric character '{' at the specified location.
DrawDash
 Draw the geometric character '-' at the specified location.
DrawNumber(Graphics, Int32, Color, PointF)
 Draw an integer at the specified location.
DrawNumber(Graphics, Int64, Color, PointF)
 Draw an integer at the specified location.
DrawNumber(Graphics, UInt32, Color, PointF)
 Draw an integer at the specified location.
DrawNumber(Graphics, UInt64, Color, PointF)
 Draw an integer at the specified location.
DrawPath
 Draw an entire path string at a specific location.
DrawSemiColon
 Draw the geometric character ';' at the specified location.
Top
See Also
Reference
Grasshopper.GUI Namespace