Grasshopper SDK
Folders.DefaultAssemblyFolder Property
 Gets the standard directory in windows ApplicationData that contains 3rd party GHA files.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string DefaultAssemblyFolder { get; }
Public Shared ReadOnly Property DefaultAssemblyFolder As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.DefaultAssemblyFolder"]
Return Value
Type: String
A directory path.
See Also
Reference
Folders Class
Grasshopper Namespace