Grasshopper SDK
IGH_Structure.RemovePath Method
 Removes a path and all associated data from the structure. If the path doesn't exist, nothing will happen.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void RemovePath(
	GH_Path path
)
Sub RemovePath (
	path As GH_Path
)
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path the remove.
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace