Grasshopper SDK
GH_InstanceDescription.SubCategory Property
 Gets or sets the SubCategory in which this object belongs. If HasSubCategory() returns false, this field has no meaning.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string SubCategory { get; set; }
Public Overridable Property SubCategory As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_InstanceDescription.SubCategory"]
Implements
IGH_InstanceDescription.SubCategory
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace