Grasshopper SDK
IGH_Structure.ShortestPathIndex Method
 Finds the path in this structure with the least dimensions. In case of multiple equally long longest paths, the first one will be returned.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int ShortestPathIndex()
Function ShortestPathIndex As Integer
Return Value
Type: Int32
The index of the shortest path or -1 if there are no paths.
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace