Grasshopper SDK
GH_Attributes<T>.Owner Property
 Gets the type-safe owner object of these attributes. This property is identical to the DocObject property.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public T Owner { get; }
Public ReadOnly Property Owner As T
	Get
Property Value
Type: T
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.Owner"]
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace