Grasshopper SDK
GH_Canvas.GH_ImageSettings.Extension Property
 Gets or sets the image extension of the target image.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Extension { get; set; }
Public Property Extension As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.Extension"]
See Also
Reference
GH_Canvas.GH_ImageSettings Class
Grasshopper.GUI.Canvas Namespace