Grasshopper SDK
GH_ComponentParamServer.AccessCount Method
 Returns the total number of input parameters that match the access mask.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int AccessCount(
	GH_ParamAccess access
)
Public Function AccessCount (
	access As GH_ParamAccess
) As Integer
Parameters
access
Type: Grasshopper.Kernel.GH_ParamAccess
Access flag mask.
Return Value
Type: Int32
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace