Grasshopper SDK
GH_IndexRuleSet.AddDigitRule Method
 Append a single digit rule.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddDigitRule(
	int digit,
	bool invert
)
Public Sub AddDigitRule (
	digit As Integer,
	invert As Boolean
)
Parameters
digit
Type: System.Int32
Digit to filter.
invert
Type: System.Boolean
If true, the digit will be filtered against rather than for.
See Also
Reference
GH_IndexRuleSet Class
Grasshopper.Kernel.Data Namespace