Grasshopper SDK
GH_NamedViewType Enumeration
 Types of named view anchor points.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_NamedViewType
Public Enumeration GH_NamedViewType
Members
Member name | Value | Description
target | 0 |  Anchor represents the location of the target (the canvas origin).
center | 1 |  Anchor represents the point that is supposed to end up in the middle of the canvas.
See Also
Reference
Grasshopper.GUI.Canvas Namespace