Grasshopper SDK
GH_ExpressionParser.Op_UnarySquare Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_Variant Op_UnarySquare(
	GH_Variant V
)
Protected Function Op_UnarySquare (
	V As GH_Variant
) As GH_Variant
Parameters
V
Type: Grasshopper.Kernel.Expressions.GH_Variant
Return Value
Type: GH_Variant
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace