Grasshopper SDK
GH_Component.Read Method
 Read all required data for deserialization from an IO archive.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool Read(
	GH_IReader reader
)
Public Overrides Function Read (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Object to read with.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace