Grasshopper SDK
GH_Gradient.AddGrip Method (GH_Grip)
 Add a new grip to the gradient. This method does not raise the GradientChanged event, so you need to do that yourself by calling OnGradientChanged().
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddGrip(
	GH_Grip grip
)
Public Sub AddGrip (
	grip As GH_Grip
)
Parameters
grip
Type: Grasshopper.GUI.Gradient.GH_Grip
Grip to add.
See Also
Reference
GH_Gradient Class
AddGrip Overload
Grasshopper.GUI.Gradient Namespace