Grasshopper SDK
GH_ActiveObject.RuntimeMessages Method
 Gets the list of cached runtime messages that were recorded during solver-time processes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual IList<string> RuntimeMessages(
	GH_RuntimeMessageLevel level
)
Public Overridable Function RuntimeMessages (
	level As GH_RuntimeMessageLevel
) As IList(Of String)
Parameters
level
Type: Grasshopper.Kernel.GH_RuntimeMessageLevel
Runtime message type to retrieve.
Return Value
Type: IList<String>
A list of runtime message strings.
Implements
IGH_ActiveObject.RuntimeMessages(GH_RuntimeMessageLevel)
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace