Grasshopper SDK
GH_IndexRange.IsSingular Property
 Gets whether the range has zero length.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsSingular { get; }
Public ReadOnly Property IsSingular As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_IndexRange.IsSingular"]
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace