Grasshopper SDK
Scale.ScaleZFactor Property
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double ScaleZFactor { get; set; }
Public Property ScaleZFactor As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Transforms.Scale.ScaleZFactor"]
See Also
Reference
Scale Class
Grasshopper.Kernel.Types.Transforms Namespace