Grasshopper SDK
GH_Document.FilePath Property
 Gets or sets the file path of this document. If the file path is not set Nothing is returned.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string FilePath { get; set; }
Public Property FilePath As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.FilePath"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace