Grasshopper SDK
Complex.ComplexUnit Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Complex ComplexUnit { get; }
Public Shared ReadOnly Property ComplexUnit As Complex
	Get
Property Value
Type: Complex
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Complex.ComplexUnit"]
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace