Grasshopper SDK
GH_PreviewMeshArgs Class
 This class is passed to objects that implement IGH_PreviewData during mesh drawing operations.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_PreviewMeshArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PreviewMeshArgs
Public Class GH_PreviewMeshArgs
The GH_PreviewMeshArgs type exposes the following members.
Constructors
Name | Description
GH_PreviewMeshArgs
Initializes a new instance of the GH_PreviewMeshArgs class
Top
Properties
Name | Description
Material
 Gets the material in which meshes ought to be drawn.
MeshingParameters
 Gets the meshing parameters which ought to be used for meshing breps and surfaces. If this property returns a null reference, meshes are supposed to be omitted.
Pipeline
 Gets the Display Pipeline we're currently drawing with.
Viewport
 Gets the Viewport in which we're currently drawing.
Top
See Also
Reference
Grasshopper.Kernel Namespace