Grasshopper SDK
GH_UserObject.ReadFromFile Method
 Force an update of the local data from the file. The Path field must be set for this to work.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ReadFromFile()
Public Sub ReadFromFile
Exceptions
Exception | Condition
InvalidOperationException | Thrown when the source file doesn't exist or is corrupted.
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace