Grasshopper SDK
DataTree<T>.Add Method (T, GH_Path)
 Add (append) a data item to the specified branch in the tree. If the branch doesn't exist yet, it will be created.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Add(
	T data,
	GH_Path path
)
Public Sub Add (
	data As T,
	path As GH_Path
)
Parameters
data
Type: T
Data to append.
path
Type: Grasshopper.Kernel.Data.GH_Path
Branch path to append to.
See Also
Reference
DataTree<T> Class
Add Overload
Grasshopper Namespace