Grasshopper SDK
TreeDelegates.Point3fCoordinates Method
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void Point3fCoordinates(
	Point3d pt,
	ref double x,
	ref double y,
	ref double z
)
Public Shared Sub Point3fCoordinates (
	pt As Point3d,
	ByRef x As Double,
	ByRef y As Double,
	ByRef z As Double
)
Parameters
pt
Type: Point3d
x
Type: System.Double
y
Type: System.Double
z
Type: System.Double
See Also
Reference
TreeDelegates Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace