Grasshopper SDK
GH_Format.FormatBoundingBoxValidity Method
 If the box is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatBoundingBoxValidity(
	BoundingBox val,
	string identifier = "Bounding Box"
)
Public Shared Function FormatBoundingBoxValidity (
	val As BoundingBox,
	Optional identifier As String = "Bounding Box"
) As String
Parameters
val
Type: BoundingBox
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the box is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace