Grasshopper SDK
GH_TreeRules.Apply Method (GH_Path)
 Apply all the local rules to a path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Apply(
	GH_Path path
)
Public Function Apply (
	path As GH_Path
) As Boolean
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to test.
Return Value
Type: Boolean
True if path passes all the rule tests.
See Also
Reference
GH_TreeRules Class
Apply Overload
Grasshopper.Kernel.Data Namespace