Grasshopper SDK
GH_PreviewUtil.AddMesh Method
 Add a mesh to the temporary Preview lists.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddMesh(
	Mesh mesh
)
Public Sub AddMesh (
	mesh As Mesh
)
Parameters
mesh
Type: Mesh
Mesh to add. Invalid meshes will be ignored.
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace