Grasshopper SDK
GH_SolverException Class
Inheritance Hierarchy
System.Object
 System.Exception
 Grasshopper.Kernel.Expressions.GH_SolverException
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_SolverException : Exception
Public Class GH_SolverException
	Inherits Exception
The GH_SolverException type exposes the following members.
Constructors
Name | Description
GH_SolverException
Initializes a new instance of the GH_SolverException class
Top
See Also
Reference
Grasshopper.Kernel.Expressions Namespace