Grasshopper SDK
GH_Variant.IsNumeric Property
 Gets a value indicating whether or not the Variant is a numeric type. Only Doubles and Integers are considered to be Numeric.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsNumeric { get; }
Public ReadOnly Property IsNumeric As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_Variant.IsNumeric"]
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace