Grasshopper SDK
GH_Link.Destination Property
 Gets the link target.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Destination { get; }
Public ReadOnly Property Destination As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_Link.Destination"]
See Also
Reference
GH_Link Class
Grasshopper.Documentation Namespace