Grasshopper SDK
GH_Document.EnableSolutionsChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void EnableSolutionsChangedEventHandler(
	bool state
)
Public Delegate Sub EnableSolutionsChangedEventHandler (
	state As Boolean
)
Parameters
state
Type: System.Boolean
See Also
Reference
Grasshopper.Kernel Namespace