Grasshopper SDK
GH_PersistentDataAction<T> Class
 Records the changes in the persistent data of a parameter.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.GH_ObjectUndoAction
 Grasshopper.Kernel.Undo.Actions.GH_PersistentDataAction<T>
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_PersistentDataAction<T> : GH_ObjectUndoAction
where T : class, IGH_Goo
Public Class GH_PersistentDataAction(Of T As {Class, IGH_Goo})
	Inherits GH_ObjectUndoAction
Type Parameters
T
The GH_PersistentDataAction<T> type exposes the following members.
Constructors
Name | Description
GH_PersistentDataAction<T>
Initializes a new instance of the GH_PersistentDataAction<T> class
Top
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
Methods
Name | Description
Object_Redo |  (Overrides GH_ObjectUndoAction.Object_Redo(GH_Document, IGH_DocumentObject).)
Object_Undo |  (Overrides GH_ObjectUndoAction.Object_Undo(GH_Document, IGH_DocumentObject).)
Top
See Also
Reference
Grasshopper.Kernel.Undo.Actions Namespace