Grasshopper SDK
GH_Structure<T>.EnsurePath Method (Int32[])
 Create a new branch with the specified path if it doesn't already exists.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<T> EnsurePath(
	params int[] path
)
Public Function EnsurePath (
	ParamArray path As Integer()
) As List(Of T)
Parameters
path
Type: System.Int32[]
Path of the branch to ensure.
Return Value
Type: List<T>
The list that belongs to the specified path.
See Also
Reference
GH_Structure<T> Class
EnsurePath Overload
Grasshopper.Kernel.Data Namespace