Grasshopper SDK
GH_SettingsServer.EntryType Method
 Gets the type of a specific entry.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SettingsType EntryType(
	string name
)
Public Function EntryType (
	name As String
) As GH_SettingsType
Parameters
name
Type: System.String
Name of entry.
Return Value
Type: GH_SettingsType
Type of entry. If entry doesn't exist, GH_SettingsType._unknown is returned.
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace