Grasshopper SDK
GH_GHXHarvester.HarvestBoundingBoxes Method (GH_Archive)
 Harvest all attribute bounding boxes from a GHX/GH archive.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<RectangleF> HarvestBoundingBoxes(
	GH_Archive archive
)
Public Shared Function HarvestBoundingBoxes (
	archive As GH_Archive
) As List(Of RectangleF)
Parameters
archive
Type: GH_IO.Serialization.GH_Archive
Archive to parse.
Return Value
Type: List<RectangleF>
A list of all attribute bounding boxes or null on failure.
See Also
Reference
GH_GHXHarvester Class
HarvestBoundingBoxes Overload
Grasshopper.Kernel Namespace