Grasshopper SDK
IGH_DataAccess.DisableGapLogic Method (Int32)
 Call this function if you want to disable the gap null logic for a specific output parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void DisableGapLogic(
	int paramIndex
)
Sub DisableGapLogic (
	paramIndex As Integer
)
Parameters
paramIndex
Type: System.Int32
Index of output parameter to disable.
See Also
Reference
IGH_DataAccess Interface
DisableGapLogic Overload
Grasshopper.Kernel Namespace