Grasshopper SDK
GH_SliderBase.ValueF Property
 Gets or sets the value of the slider in single precision.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float ValueF { get; set; }
Public Property ValueF As Single
	Get
	Set
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.ValueF"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace