Grasshopper SDK
GH_AnimationPhase Enumeration
 Enumerates the possible phases in which an animation can occur.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_AnimationPhase
Public Enumeration GH_AnimationPhase
Members
Member name | Value | Description
Before | 0 |  Animation hasn't started yet.
During | 1 |  Animation currently in progress.
After | 2 |  Animation has finished.
See Also
Reference
Grasshopper.GUI Namespace