Grasshopper SDK
GH_VerticalScrollBar Constructor
Initializes a new instance of the GH_VerticalScrollBar class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_VerticalScrollBar()
Public Sub New
See Also
Reference
GH_VerticalScrollBar Class
Grasshopper.GUI Namespace