Grasshopper SDK
GH_Path.PathLengthComparer Constructor
Initializes a new instance of the GH_Path.PathLengthComparer class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PathLengthComparer()
Public Sub New
See Also
Reference
GH_Path.PathLengthComparer Class
Grasshopper.Kernel.Data Namespace