Grasshopper SDK
GH_Surface Constructor
Initializes a new instance of the GH_Surface class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Surface()
Public Sub New
See Also
Reference
GH_Surface Class
GH_Surface Overload
Grasshopper.Kernel.Types Namespace