Grasshopper SDK
TreeDelegates.PointCoordinates Method
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void PointCoordinates(
	Point pt,
	ref double x,
	ref double y,
	ref double z
)
Public Shared Sub PointCoordinates (
	pt As Point,
	ByRef x As Double,
	ByRef y As Double,
	ByRef z As Double
)
Parameters
pt
Type: Point
x
Type: System.Double
y
Type: System.Double
z
Type: System.Double
See Also
Reference
TreeDelegates Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace