Grasshopper SDK
GH_Convert.ToRectangle Method
 Convert a floating point GDI rectangle structure to an integer rounded rectangle. Use this method for any and all GUI conversions as the specific rounding scheme used here avoids pixel jitter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Rectangle ToRectangle(
	RectangleF in
)
Public Shared Function ToRectangle (
	in As RectangleF
) As Rectangle
Parameters
in
Type: System.Drawing.RectangleF
RectangleF to convert.
Return Value
Type: Rectangle
Integer accuracy rectangle.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace