Grasshopper SDK
GH_Attributes<T>.InvalidateCanvas Method
 If the mouse location should cause a canvas invalidation then return true. You only need to override this function if you draw objects that are dependant on cursor positions outside the bounds of the attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool InvalidateCanvas(
	GH_Canvas canvas,
	GH_CanvasMouseEvent e
)
Public Overridable Function InvalidateCanvas (
	canvas As GH_Canvas,
	e As GH_CanvasMouseEvent
) As Boolean
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas to potentially invalidate.
e
Type: Grasshopper.GUI.GH_CanvasMouseEvent
Event arguments for canvas mousemove.
Return Value
Type: Boolean
True if the canvas ought to be invalidated.
Implements
IGH_Attributes.InvalidateCanvas(GH_Canvas, GH_CanvasMouseEvent)
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace