Grasshopper SDK
GH_PluginUtil Class
 Grasshopper plugin utility class. This class exports some static (Shared in VB) methods to do with plugin loading and unloading.
Inheritance Hierarchy
System.Object
 Grasshopper.Plugin.GH_PluginUtil
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_PluginUtil
Public NotInheritable Class GH_PluginUtil
The GH_PluginUtil type exposes the following members.
Methods
Name | Description
BringRhinoToTop
 Bring the Rhino window to the top of the stack.
BringWindowToTop
FocusOnRhino
 Set the focus to the Rhino command line.
SendKeyCodeToRhino(Char)
 Send a key-code to the Rhino command line.
SendKeyCodeToRhino(Int32)
 Send a key-code to the Rhino command line.
SendKeyCodeToRhino(String)
 Send a string of characters to the Rhino command line.
SendMessage
SetFocus
Top
See Also
Reference
Grasshopper.Plugin Namespace