Grasshopper SDK
GH_Format.FormatMesh Method (Mesh, String)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatMesh(
	Mesh data,
	string sPrefix = ""
)
Public Shared Function FormatMesh (
	data As Mesh,
	Optional sPrefix As String = ""
) As String
Parameters
data
Type: Mesh
sPrefix (Optional)
Type: System.String
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatMesh Overload
Grasshopper.Kernel Namespace