Grasshopper SDK
GH_DocumentIO.Open Method (String)
 Open the file at the given location.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Open(
	string filePath
)
Public Function Open (
	filePath As String
) As Boolean
Parameters
filePath
Type: System.String
Path of Grasshopper file to open.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentIO Class
Open Overload
Grasshopper.Kernel Namespace