Grasshopper SDK
GH_Canvas.CursorCanvasPosition Property
 Gets the location of the cursor in Canvas coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF CursorCanvasPosition { get; }
Public ReadOnly Property CursorCanvasPosition As PointF
	Get
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.CursorCanvasPosition"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace