Grasshopper SDK
GH_MenuTextBox.TextChanged Event
 Raised whenever the text in the textbox changes.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_MenuTextBox.TextChangedEventHandler TextChanged
Public Event TextChanged As GH_MenuTextBox.TextChangedEventHandler
Value
Type: Grasshopper.GUI.GH_MenuTextBox.TextChangedEventHandler
See Also
Reference
GH_MenuTextBox Class
Grasshopper.GUI Namespace