Grasshopper SDK
GH_LonLatCoordinate Constructor
Initializes a new instance of the GH_LonLatCoordinate class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LonLatCoordinate()
Public Sub New
See Also
Reference
GH_LonLatCoordinate Class
GH_LonLatCoordinate Overload
Grasshopper.Kernel.Types Namespace