Grasshopper SDK
GH_DigitNumber.Offset Property
 Gets the offset between the primary and secondary digits.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal Offset { get; }
Public ReadOnly Property Offset As Decimal
	Get
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitNumber.Offset"]
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace