Grasshopper SDK
GH_Document.CompareTo Method
 Compare two documents. This function does not compare document content.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int CompareTo(
	GH_Document other
)
Public Function CompareTo (
	other As GH_Document
) As Integer
Parameters
other
Type: Grasshopper.Kernel.GH_Document
Document to compare to.
Return Value
Type: Int32
Comparison key.
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace