Grasshopper SDK
GH_Material.GH_Material_Proxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Material>
 Grasshopper.Kernel.Types.GH_Material.GH_Material_Proxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Material_Proxy : GH_GooProxy<GH_Material>
Public Class GH_Material_Proxy
	Inherits GH_GooProxy(Of GH_Material)
The GH_Material.GH_Material_Proxy type exposes the following members.
Constructors
Name | Description
GH_Material.GH_Material_Proxy
Initializes a new instance of the GH_Material.GH_Material_Proxy class
Top
Properties
Name | Description
Diffuse
Emission
IsRDKMaterial
Shine
Specular
Transparency
Top
Methods
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace