Grasshopper SDK
IGH_Structure.Clear Method
 Clears the entire structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void Clear()
Sub Clear
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace