Grasshopper SDK
DataTree<T>.RenumberPaths Method (String)
 Renumber all paths in this data tree, using a single incrementing path index.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenumberPaths(
	string mask
)
Public Sub RenumberPaths (
	mask As String
)
Parameters
mask
Type: System.String
 String formatting mask for paths. Use semi-colons for path index separators and "{i}" as a path index placeholder. Examples:
"{i}" -> {i}
"0;{i}" -> {0;i}
"{i};0;0" -> {i;0;0}
See Also
Reference
DataTree<T> Class
RenumberPaths Overload
Grasshopper Namespace