Grasshopper SDK
GH_MeshingParameters.RhMesherSettings_Proxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_MeshingParameters>
 Grasshopper.Kernel.Types.GH_MeshingParameters.RhMesherSettings_Proxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class RhMesherSettings_Proxy : GH_GooProxy<GH_MeshingParameters>
Public Class RhMesherSettings_Proxy
	Inherits GH_GooProxy(Of GH_MeshingParameters)
The GH_MeshingParameters.RhMesherSettings_Proxy type exposes the following members.
Constructors
Name | Description
GH_MeshingParameters.RhMesherSettings_Proxy
Initializes a new instance of the GH_MeshingParameters.RhMesherSettings_Proxy class
Top
Properties
Name | Description
AngleTolerance
AspectRatio
GridMaxCount
GridMinCount
IsParsable |  (Overrides GH_GooProxy<T>.IsParsable.)
JaggedSeams
MaxEdgeLength
MinEdgeLength
Refine
SimplePlanes
Tolerance
Top
Methods
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace