Grasshopper SDK
GH_ConnectivityNode.NodeIn Property
 Gets the list of IDs that are connected to the input of this node.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public ReadOnlyCollection<Guid> NodeIn { get; }
Public ReadOnly Property NodeIn As ReadOnlyCollection(Of Guid)
	Get
Property Value
Type: ReadOnlyCollection<Guid>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ConnectivityNode.NodeIn"]
See Also
Reference
GH_ConnectivityNode Class
Grasshopper.Kernel Namespace