Grasshopper SDK
GH_Animator.InterpolateRectangle Method
 Utility interpolation delegate for System.Drawing.Rectangle values.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Rectangle InterpolateRectangle(
	Rectangle A,
	Rectangle B,
	double factor
)
Public Shared Function InterpolateRectangle (
	A As Rectangle,
	B As Rectangle,
	factor As Double
) As Rectangle
Parameters
A
Type: System.Drawing.Rectangle
B
Type: System.Drawing.Rectangle
factor
Type: System.Double
Return Value
Type: Rectangle
See Also
Reference
GH_Animator Class
Grasshopper.GUI Namespace