Grasshopper SDK
Folders.SDKDownloaderApplication Property
 Gets the location where the SDKDownloader.exe should be. If the application is not present, null is returned.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string SDKDownloaderApplication { get; }
Public Shared ReadOnly Property SDKDownloaderApplication As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.SDKDownloaderApplication"]
See Also
Reference
Folders Class
Grasshopper Namespace