Grasshopper SDK
GH_PaletteSettings.HiddenStandard Property
 Gets or sets the palette style for unselected Hidden palettes.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PaletteStyle HiddenStandard { get; set; }
Public Property HiddenStandard As GH_PaletteStyle
	Get
	Set
Property Value
Type: GH_PaletteStyle
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_PaletteSettings.HiddenStandard"]
See Also
Reference
GH_PaletteSettings Class
Grasshopper.GUI.Theme Namespace