Grasshopper SDK
GH_SettingsServer.WritePersistentSettings Method
 Store all settings in the xml file now. You must call this function if you want the current settings to persist between sessions.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void WritePersistentSettings()
Public Sub WritePersistentSettings
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace