Grasshopper SDK
GH_MemoryBitmap.Filter_SpectrumScale Method
 Convert the image to a spectral representation of the hues.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_SpectrumScale()
Public Sub Filter_SpectrumScale
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace