Grasshopper SDK
GH_Brep.BrepTightBoundingBox Method
 Compute the boundingbox of a Brep object without meshing.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static BoundingBox BrepTightBoundingBox(
	Brep in
)
Public Shared Function BrepTightBoundingBox (
	in As Brep
) As BoundingBox
Parameters
in
Type: Brep
Brep to measure.
Return Value
Type: BoundingBox
The world aligned boundingbox of the object.
See Also
Reference
GH_Brep Class
Grasshopper.Kernel.Types Namespace