Grasshopper SDK
GH_Convert.ObjRefToGeometry Method
 Convert a Rhino Object Reference into Grasshopper IGH_GeometricGoo.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static IGH_GeometricGoo ObjRefToGeometry(
	ObjRef in
)
Public Shared Function ObjRefToGeometry (
	in As ObjRef
) As IGH_GeometricGoo
Parameters
in
Type: ObjRef
Object reference to convert.
Return Value
Type: IGH_GeometricGoo
An instance that implements IGH_GeometricGoo on success or false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace