Grasshopper SDK
CentralSettings.RibbonAllIconsChanged Event
 Raised whenever the RibbonAllIcons setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.RibbonAllIconsChangedEventHandler RibbonAllIconsChanged
Public Shared Event RibbonAllIconsChanged As CentralSettings.RibbonAllIconsChangedEventHandler
Value
Type: Grasshopper.CentralSettings.RibbonAllIconsChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace