Grasshopper SDK
GH_Convert.ToPlane_Secondary Method
 Attempts to convert other data types into an OnPlane. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToPlane_Secondary(
	Object data,
	ref Plane rc
)
Public Shared Function ToPlane_Secondary (
	data As Object,
	ByRef rc As Plane
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Plane
Return Value
Type: Boolean
An OnPlane instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace