Grasshopper SDK
GH_Slider_Obsolete.Max Property
 Gets or sets the maximum allowed value.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Max { get; set; }
Public Property Max As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider_Obsolete.Max"]
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace