Grasshopper SDK
GH_Canvas.ShowMRUPanels Method
 Show any hidden MRU panels by sliding them back into view.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ShowMRUPanels()
Public Sub ShowMRUPanels
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace