Grasshopper SDK
GH_Structure<T>.Graft Method (GH_GraftMode)
 Grafts all paths by reallocating all data into child paths.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Graft(
	GH_GraftMode mode
)
Public Sub Graft (
	mode As GH_GraftMode
)
Parameters
mode
Type: Grasshopper.Kernel.Data.GH_GraftMode
Graft mode.
Implements
IGH_Structure.Graft(GH_GraftMode)
See Also
Reference
GH_Structure<T> Class
Graft Overload
Grasshopper.Kernel.Data Namespace