Grasshopper SDK
GH_FieldElement.BoundingBox Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract BoundingBox BoundingBox { get; }
Public MustOverride ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_FieldElement.BoundingBox"]
Implements
IGH_FieldElement.BoundingBox
See Also
Reference
GH_FieldElement Class
Grasshopper.Kernel.Types Namespace