Grasshopper SDK
GH_RuleAnyNumber Constructor
Initializes a new instance of the GH_RuleAnyNumber class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RuleAnyNumber()
Public Sub New
See Also
Reference
GH_RuleAnyNumber Class
Grasshopper.Kernel.Data Namespace