Grasshopper SDK
GH_Canvas.CanvasPaintEnd Event
 Raised after a paint operation completes. This event is always raised, even if the Canvas isn't visible.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPaintEndEventHandler CanvasPaintEnd
Public Event CanvasPaintEnd As GH_Canvas.CanvasPaintEndEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPaintEndEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace