Grasshopper SDK
IGH_RenderAwareData Methods
The IGH_RenderAwareData type exposes the following members.
Methods
Name | Description
AppendRenderGeometry
Top
See Also
Reference
IGH_RenderAwareData Interface
Grasshopper.Kernel Namespace