Grasshopper SDK
GH_PluginUtil.SetFocus Method
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void SetFocus(
	IntPtr hWnd
)
Public Shared Sub SetFocus (
	hWnd As IntPtr
)
Parameters
hWnd
Type: System.IntPtr
See Also
Reference
GH_PluginUtil Class
Grasshopper.Plugin Namespace