Grasshopper SDK
GH_Point.GH_PointProxy.Referenced Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Referenced { get; }
Public ReadOnly Property Referenced As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Point.GH_PointProxy.Referenced"]
See Also
Reference
GH_Point.GH_PointProxy Class
Grasshopper.Kernel.Types Namespace