Grasshopper SDK
GH_Format.FormatPoint Method (Point3d)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatPoint(
	Point3d data
)
Public Shared Function FormatPoint (
	data As Point3d
) As String
Parameters
data
Type: Point3d
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatPoint Overload
Grasshopper.Kernel Namespace