Grasshopper SDK
GH_UpgradeUtil.ReplaceInputParameters Method
 Move all input parameters from one component to another. Only use this function if the target component can handle the input layout of the source component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void ReplaceInputParameters(
	IGH_Component source,
	IGH_Component target
)
Public Shared Sub ReplaceInputParameters (
	source As IGH_Component,
	target As IGH_Component
)
Parameters
source
Type: Grasshopper.Kernel.IGH_Component
Component to move parameters from.
target
Type: Grasshopper.Kernel.IGH_Component
Component to move parameters to.
See Also
Reference
GH_UpgradeUtil Class
Grasshopper.Kernel Namespace