Grasshopper SDK
GH_DocDiagramPainter.MapPoint Method (Point)
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point MapPoint(
	Point pt
)
Public Function MapPoint (
	pt As Point
) As Point
Parameters
pt
Type: System.Drawing.Point
Return Value
Type: Point
See Also
Reference
GH_DocDiagramPainter Class
MapPoint Overload
Grasshopper.GUI.Canvas Namespace