Grasshopper SDK
GH_MeshFace.IsValid Property
 Test for validity. No negative indices are allowed and only C and D are allowed to be identical.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_MeshFace.IsValid"]
See Also
Reference
GH_MeshFace Class
Grasshopper.Kernel.Types Namespace