Grasshopper SDK
GH_ExpressionParser Constructor (Boolean)
Initializes a new instance of the GH_ExpressionParser class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ExpressionParser(
	bool bThrowExceptions
)
Public Sub New (
	bThrowExceptions As Boolean
)
Parameters
bThrowExceptions
Type: System.Boolean
See Also
Reference
GH_ExpressionParser Class
GH_ExpressionParser Overload
Grasshopper.Kernel.Expressions Namespace