Grasshopper SDK
GH_DigitScrollerBase.SetupScroller Method
 Set the minimum, maximum and value fields simultaneously.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetupScroller(
	decimal minimum,
	decimal maximum,
	decimal value
)
Public Sub SetupScroller (
	minimum As Decimal,
	maximum As Decimal,
	value As Decimal
)
Parameters
minimum
Type: System.Decimal
maximum
Type: System.Decimal
value
Type: System.Decimal
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace