Grasshopper SDK
GH_Document.ConstantServer Property
 Gets the dictionary of constants defined in this document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public SortedDictionary<string, GH_Variant> ConstantServer { get; }
Public ReadOnly Property ConstantServer As SortedDictionary(Of String, GH_Variant)
	Get
Property Value
Type: SortedDictionary<String, GH_Variant>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.ConstantServer"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace