Grasshopper SDK
IGH_DocumentObject.OnPingDocument Method
 Raise the PingDocument Event on the toplevel object and try to find the document which owns this object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_Document OnPingDocument()
Function OnPingDocument As GH_Document
Return Value
Type: GH_Document
The document which owns this object if successful, or nothing if no document owns this object.
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace