Grasshopper SDK
GH_PluginUtil.SendKeyCodeToRhino Method (Char)
 Send a key-code to the Rhino command line.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void SendKeyCodeToRhino(
	char key
)
Public Shared Sub SendKeyCodeToRhino (
	key As Char
)
Parameters
key
Type: System.Char
Key char.
See Also
Reference
GH_PluginUtil Class
SendKeyCodeToRhino Overload
Grasshopper.Plugin Namespace