Grasshopper SDK
GH_IndexRuleSet.AddAnyDigitRule Method
 Append a rule for any single digit.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddAnyDigitRule()
Public Sub AddAnyDigitRule
See Also
Reference
GH_IndexRuleSet Class
Grasshopper.Kernel.Data Namespace