Grasshopper SDK
IGH_Param.DataMapping Property
 Gets or sets the data mapping of this Parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_DataMapping DataMapping { get; set; }
Property DataMapping As GH_DataMapping
	Get
	Set
Property Value
Type: GH_DataMapping
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.DataMapping"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace