Grasshopper SDK
GH_DebugDescriptionWriter.WriteLogToFile Method
 Write the log to a text file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool WriteLogToFile(
	string path
)
Public Function WriteLogToFile (
	path As String
) As Boolean
Parameters
path
Type: System.String
Path of file to write to.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DebugDescriptionWriter Class
Grasshopper.Kernel Namespace