Grasshopper SDK
GH_Slider_Obsolete.NumericFormat Property
 Gets or sets the numeric format for the slider. This is the formatting that is applied to the number. The default is #0.00 which results in a two digit rounding scheme.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string NumericFormat { get; set; }
Public Property NumericFormat As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider_Obsolete.NumericFormat"]
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace