Grasshopper SDK
ITransform.Duplicate Method
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
ITransform Duplicate()
Function Duplicate As ITransform
Return Value
Type: ITransform
See Also
Reference
ITransform Interface
Grasshopper.Kernel.Types.Transforms Namespace