Grasshopper SDK
GH_PathOffset Constructor (IEnumerable<Int32>)
Initializes a new instance of the GH_PathOffset class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PathOffset(
	IEnumerable<int> pathShift
)
Public Sub New (
	pathShift As IEnumerable(Of Integer)
)
Parameters
pathShift
Type: System.Collections.Generic.IEnumerable<Int32>
See Also
Reference
GH_PathOffset Class
GH_PathOffset Overload
Grasshopper.Kernel.Data Namespace