Grasshopper SDK
IGH_DocumentObject.RecordUndoEvent Method (String, IGH_UndoAction)
 Record a specific object change undo event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid RecordUndoEvent(
	string name,
	IGH_UndoAction action
)
Function RecordUndoEvent (
	name As String,
	action As IGH_UndoAction
) As Guid
Parameters
name
Type: System.String
Name of undo record.
action
Type: Grasshopper.Kernel.Undo.IGH_UndoAction
Undo action to record.
Return Value
Type: Guid
See Also
Reference
IGH_DocumentObject Interface
RecordUndoEvent Overload
Grasshopper.Kernel Namespace