Grasshopper SDK
GH_DocumentRenderMeshProvider Constructor
Initializes a new instance of the GH_DocumentRenderMeshProvider class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentRenderMeshProvider()
Public Sub New
See Also
Reference
GH_DocumentRenderMeshProvider Class
Grasshopper.Kernel Namespace