Grasshopper SDK
GH_Lexer.Path Property
 Gets the list of path strings that was extracted from the mask. If the mask hasn't been parsed yet, it will be parsed now. If the returned list is still nothing, parsing failed.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string> Path { get; }
Public ReadOnly Property Path As List(Of String)
	Get
Property Value
Type: List<String>
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Lexer.Path"]
See Also
Reference
GH_Lexer Class
Grasshopper.Kernel.Data Namespace