Grasshopper SDK
GH_Alias.AliasToString Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string AliasToString(
	IEnumerable<string> aliases
)
Public Shared Function AliasToString (
	aliases As IEnumerable(Of String)
) As String
Parameters
aliases
Type: System.Collections.Generic.IEnumerable<String>
Return Value
Type: String
See Also
Reference
GH_Alias Class
Grasshopper.Kernel Namespace