Grasshopper SDK
GH_Document.PreviewColourSelected Property
 Gets or sets the colour of selected preview geometry.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color PreviewColourSelected { get; set; }
Public Property PreviewColourSelected As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.PreviewColourSelected"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace