Grasshopper SDK
GH_Convert.PureTimeTicks Field
 Represents the total number of ticks past a whole second that (by Grasshopper convention) identifies a pure time.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const long PureTimeTicks = 2
Public Const PureTimeTicks As Long = 2
Field Value
Type: Int64
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace