Grasshopper SDK
GH_DataMatchingAction Constructor
Initializes a new instance of the GH_DataMatchingAction class
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DataMatchingAction(
	IGH_Component obj
)
Public Sub New (
	obj As IGH_Component
)
Parameters
obj
Type: Grasshopper.Kernel.IGH_Component
See Also
Reference
GH_DataMatchingAction Class
Grasshopper.Kernel.Undo.Actions Namespace