Grasshopper SDK
GH_PaletteStyle Fields
The GH_PaletteStyle type exposes the following members.
Fields
Name | Description
m_edge
m_fill
m_text
Top
See Also
Reference
GH_PaletteStyle Class
Grasshopper.GUI.Canvas Namespace