Grasshopper SDK
GH_Document.GH_UndoUtil.CreateWireEvent Method (String, IEnumerable<IGH_Param>)
 Create a new undo record for a set of Connector wire changes. This function must be called before the wires are changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoRecord CreateWireEvent(
	string name,
	IEnumerable<IGH_Param> params
)
Public Function CreateWireEvent (
	name As String,
	params As IEnumerable(Of IGH_Param)
) As GH_UndoRecord
Parameters
name
Type: System.String
Name of undo record.
params
Type: System.Collections.Generic.IEnumerable<IGH_Param>
Target parameters for undo record.
Return Value
Type: GH_UndoRecord
A newly created undo record.
See Also
Reference
GH_Document.GH_UndoUtil Class
CreateWireEvent Overload
Grasshopper.Kernel Namespace