Grasshopper SDK
GH_Document.ModifiedChanged Event
 The modified flag on the document was changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Document.ModifiedChangedEventHandler ModifiedChanged
Public Event ModifiedChanged As GH_Document.ModifiedChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.ModifiedChangedEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace