Grasshopper SDK
GH_Boolean.TypeDescription Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string TypeDescription { get; }
Public Overrides ReadOnly Property TypeDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Boolean.TypeDescription"]
See Also
Reference
GH_Boolean Class
Grasshopper.Kernel.Types Namespace