Grasshopper SDK
IGH_DocumentObject.CreateAttributes Method
 Create new default attributes for this object. You should only call this function when the Attributes() field is null.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void CreateAttributes()
Sub CreateAttributes
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace