Grasshopper SDK
GH_SpinForce Constructor
Initializes a new instance of the GH_SpinForce class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SpinForce()
Public Sub New
See Also
Reference
GH_SpinForce Class
Grasshopper.Kernel.Types Namespace