Grasshopper SDK
IGH_ZuiAction.Perform Method
 This method will be called when the action needs to be performed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void Perform()
Sub Perform
See Also
Reference
IGH_ZuiAction Interface
Grasshopper.Kernel Namespace