Grasshopper SDK
GH_FontPicker Class
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Grasshopper.GUI.GH_FontPicker
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_FontPicker : UserControl
Public Class GH_FontPicker
	Inherits UserControl
The GH_FontPicker type exposes the following members.
Constructors
Name | Description
GH_FontPicker
Initializes a new instance of the GH_FontPicker class
Top
Properties
Name | Description
SelectedFont
Top
Methods
Name | Description
CreateFontPickerWindow
 Create a new window containing a Font Picker object and OK, Cancel buttons. Picked fonts will be stored in the Tag field of the form.
Dispose
Releases the unmanaged resources used by the GH_FontPicker and optionally releases the managed resources
 (Overrides ContainerControl.Dispose(Boolean).)
ShowFontPickerWindow(Font)
 Display the fontpicker in a window.
ShowFontPickerWindow(Font, Form)
 Display the fontpicker in a window.
Top
See Also
Reference
Grasshopper.GUI Namespace