Grasshopper SDK
GH_ValueProxy<T>.FromString Method
 Performs the String->Value parsing. The default implementation always returns False.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool FromString(
	string in
)
Public Overridable Function FromString (
	in As String
) As Boolean
Parameters
in
Type: System.String
The String to parse
Return Value
Type: Boolean
True in cae of success, False in case of failure.
Implements
IGH_ValueProxy.FromString(String)
Remarks
The result of the parse is stored in the local value pointer. If this function returns False there is no guarantee the local value is still valid.
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace