Grasshopper SDK
GH_DocModifiedEventArgs.Modified Property
 Gets the value of the document Modified flag at the time the event was raised, it may have been changed in between by other event handlers.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Modified { get; }
Public ReadOnly Property Modified As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocModifiedEventArgs.Modified"]
See Also
Reference
GH_DocModifiedEventArgs Class
Grasshopper.Kernel Namespace