Grasshopper SDK
GH_Link.Target Property
 Gets the link type.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Target Target { get; }
Public ReadOnly Property Target As GH_Target
	Get
Property Value
Type: GH_Target
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_Link.Target"]
See Also
Reference
GH_Link Class
Grasshopper.Documentation Namespace