Grasshopper SDK
IGH_Attributes.HasOutputGrip Property
 Gets a value indicating whether or not these attributes have an output grip.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool HasOutputGrip { get; }
ReadOnly Property HasOutputGrip As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.HasOutputGrip"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace