Grasshopper SDK
GH_SamplingSphere.Size Property
 Gets the size of this sample grid.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Size { get; }
Public ReadOnly Property Size As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_SamplingSphere.Size"]
See Also
Reference
GH_SamplingSphere Class
Grasshopper.GUI Namespace