Grasshopper SDK
GH_MeshFace.GH_MeshFaceProxy.C Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int C { get; set; }
Public Property C As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_MeshFace.GH_MeshFaceProxy.C"]
See Also
Reference
GH_MeshFace.GH_MeshFaceProxy Class
Grasshopper.Kernel.Types Namespace