Grasshopper SDK
CentralSettings.IsTemplateFile Property
 Gets whether a template file has been defined and whether that file ectually exists.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsTemplateFile { get; }
Public Shared ReadOnly Property IsTemplateFile As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.IsTemplateFile"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace