Grasshopper SDK
GH_HorizontalSeparator Constructor
Initializes a new instance of the GH_HorizontalSeparator class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_HorizontalSeparator()
Public Sub New
See Also
Reference
GH_HorizontalSeparator Class
Grasshopper.GUI Namespace