Grasshopper SDK
GH_Variant._Bool Property
 Gets the contents of this Variant as a bool.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool _Bool { get; }
Public ReadOnly Property _Bool As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_Variant._Bool"]
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace