Grasshopper SDK
GH_VoronoiWarningForm Constructor
Initializes a new instance of the GH_VoronoiWarningForm class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_VoronoiWarningForm()
Public Sub New
See Also
Reference
GH_VoronoiWarningForm Class
Grasshopper.GUI Namespace