Grasshopper SDK
IGH_Component.Message Property
 Gets or sets a custom message to be displayed underneath the component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Message { get; set; }
Property Message As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Component.Message"]
See Also
Reference
IGH_Component Interface
Grasshopper.Kernel Namespace