Grasshopper SDK
IGH_DataAccess.ParameterTargetIndex Method
 Get the target index for the specified output parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int ParameterTargetIndex(
	int paramIndex
)
Function ParameterTargetIndex (
	paramIndex As Integer
) As Integer
Parameters
paramIndex
Type: System.Int32
Index of output parameter.
Return Value
Type: Int32
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace