Grasshopper SDK
GH_Convert.ToCulture_Primary Method
 Performs a direct cast from System.Globalization.CultureInfo and GH_Culture.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToCulture_Primary(
	Object data,
	ref CultureInfo destination
)
Public Shared Function ToCulture_Primary (
	data As Object,
	ByRef destination As CultureInfo
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.Globalization.CultureInfo
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace