Grasshopper SDK
GH_Document.GH_UndoUtil.CreateEnabledEvent Method
 Create a new undo record for an object enabled change. This function must be called before the enabled flag is changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoRecord CreateEnabledEvent(
	string name,
	IGH_ActiveObject obj
)
Public Function CreateEnabledEvent (
	name As String,
	obj As IGH_ActiveObject
) As GH_UndoRecord
Parameters
name
Type: System.String
Name of undo record.
obj
Type: Grasshopper.Kernel.IGH_ActiveObject
Target object for undo record.
Return Value
Type: GH_UndoRecord
A newly created undo record.
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace