Grasshopper SDK
IGH_Component.DataComparison Property
 A data combination flag
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_DataComparison DataComparison { get; set; }
Property DataComparison As GH_DataComparison
	Get
	Set
Property Value
Type: GH_DataComparison
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Component.DataComparison"]
See Also
Reference
IGH_Component Interface
Grasshopper.Kernel Namespace