Grasshopper SDK
GH_SliderBase.Ticks Property
 Gets a list of all the tick offset x positions.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<int> Ticks { get; }
Public ReadOnly Property Ticks As List(Of Integer)
	Get
Property Value
Type: List<Int32>
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.Ticks"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace