Grasshopper SDK
IGH_TagArtist Interface
 Defines the interface for TagArtist objects. TagArtists can be used to paint additional stuff onto a GH_Canvas.
Namespace: Grasshopper.GUI.Canvas.TagArtists
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_TagArtist
Public Interface IGH_TagArtist
The IGH_TagArtist type exposes the following members.
Properties
Name | Description
ID
 Gets the ID of this Tag Artist object.
Top
Methods
Name | Description
Paint
 This method is called whenever a Canvas channel is painted
Top
See Also
Reference
Grasshopper.GUI.Canvas.TagArtists Namespace