Grasshopper SDK
GH_DocumentObject.Menu_AppendDigitScrollerItem Method
 Utility function for inserting a digit scroller into menus.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_DigitScrollerBase Menu_AppendDigitScrollerItem(
	ToolStripDropDown menu,
	decimal min,
	decimal max,
	decimal value,
	int decimals
)
Public Shared Function Menu_AppendDigitScrollerItem (
	menu As ToolStripDropDown,
	min As Decimal,
	max As Decimal,
	value As Decimal,
	decimals As Integer
) As GH_DigitScrollerBase
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
min
Type: System.Decimal
max
Type: System.Decimal
value
Type: System.Decimal
decimals
Type: System.Int32
Return Value
Type: GH_DigitScrollerBase
The digit scroller object that was inserted into the menu.
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace