Grasshopper SDK
GH_ConnectivityDiagram.GetAllInputs Method
 Get all the Nodes that are part of the specified node input.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Guid> GetAllInputs(
	Guid id
)
Public Function GetAllInputs (
	id As Guid
) As List(Of Guid)
Parameters
id
Type: System.Guid
ID of node to query.
Return Value
Type: List<Guid>
A list of input nodes.
See Also
Reference
GH_ConnectivityDiagram Class
Grasshopper.Kernel Namespace