Grasshopper SDK
Versioning Class
 Static class that provides information regarding the Grasshopper versioning.
Inheritance Hierarchy
System.Object
 Grasshopper.Versioning
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class Versioning
Public NotInheritable Class Versioning
The Versioning type exposes the following members.
Properties
Name | Description
BuildDate
 Gets the build date string. This is the visible release iteration tag. Typically the BuildDate is just the date (MMMM-dd, yyyy), but it may carry a prefix or suffix for special builds.
Version
 Gets the version of the current build of Grasshopper.
VersionString
 Gets the version of the current build of Grasshopper.
Top
Methods
Name | Description
SyncVersionHistoryData
 Attempts to download the version history information. The downloaded data (if the download works) will eventually be stored at: Grasshopper.Folders.VersionHistoryFile
VersionHistoryData
 Gets the currently most up-to-date version history data.
Top
See Also
Reference
Grasshopper Namespace