Grasshopper SDK
GH_Slider.DrawControlShadows Property
 Gets or sets whether the drop shadows of the slider should be drawn.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DrawControlShadows { get; set; }
Public Property DrawControlShadows As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.DrawControlShadows"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace