Grasshopper SDK
IGH_DataAccess.SetDataTree Method (Int32, IGH_Structure)
 Folds a utility tree representation into this tree.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool SetDataTree(
	int paramIndex,
	IGH_Structure tree
)
Function SetDataTree (
	paramIndex As Integer,
	tree As IGH_Structure
) As Boolean
Parameters
paramIndex
Type: System.Int32
Index of output parameter to merge with.
tree
Type: Grasshopper.Kernel.Data.IGH_Structure
Tree to merge
Return Value
Type: Boolean
See Also
Reference
IGH_DataAccess Interface
SetDataTree Overload
Grasshopper.Kernel Namespace