Grasshopper SDK
GH_PathOffset.ItemOffset Property
 Gets or sets the relative offset for branch items.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ItemOffset { get; set; }
Public Property ItemOffset As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_PathOffset.ItemOffset"]
See Also
Reference
GH_PathOffset Class
Grasshopper.Kernel.Data Namespace