Grasshopper SDK
GH_FloatingParamAttributes Class
 These Attributes are the default for stand-alone Parameters.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_Attributes<IGH_Param>
 Grasshopper.Kernel.Attributes.GH_FloatingParamAttributes
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_FloatingParamAttributes : GH_Attributes<IGH_Param>
Public Class GH_FloatingParamAttributes
	Inherits GH_Attributes(Of IGH_Param)
The GH_FloatingParamAttributes type exposes the following members.
Constructors
Name | Description
GH_FloatingParamAttributes
Initializes a new instance of the GH_FloatingParamAttributes class
Top
Properties
Name | Description
Top
Methods
Name | Description
ExpireLayout |  (Overrides GH_Attributes<T>.ExpireLayout().)
Layout |  (Overrides GH_Attributes<T>.Layout().)
Render |  (Overrides GH_Attributes<T>.Render(GH_Canvas, Graphics, GH_CanvasChannel).)
RespondToMouseDoubleClick |  (Overrides GH_Attributes<T>.RespondToMouseDoubleClick(GH_Canvas, GH_CanvasMouseEvent).)
SetupTooltip |  (Overrides GH_Attributes<T>.SetupTooltip(PointF, GH_TooltipDisplayEventArgs).)
Top
Fields
Name | Description
DefaultWidth
 Defines the default (and minimum) width of a floating parameter.
IconHeight
 Defines the default height of a floating parameter in Icon display mode.
TextHeight
 Defines the default height of a floating parameter in Text display mode.
Top
See Also
Reference
Grasshopper.Kernel.Attributes Namespace