Grasshopper SDK
GH_Structure<T>.StructureProxy Property
 Gets a proxy list of all the data-arrays in this structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<IList> StructureProxy { get; }
Public ReadOnly Property StructureProxy As IList(Of IList)
	Get
Property Value
Type: IList<IList>
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.StructureProxy"]
Implements
IGH_Structure.StructureProxy
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace