Grasshopper SDK
GH_RotationalTuningData<T> Constructor (T, PointF)
 Create a new instance of the rotational tuning data.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RotationalTuningData(
	T initialValue,
	PointF pivot
)
Public Sub New (
	initialValue As T,
	pivot As PointF
)
Parameters
initialValue
Type: T
Initial value to store. Whatever you want it to be.
pivot
Type: System.Drawing.PointF
Center of rotation.
See Also
Reference
GH_RotationalTuningData<T> Class
GH_RotationalTuningData<T> Overload
Grasshopper.GUI Namespace