Grasshopper SDK
GH_ZuiAction.TooltipEnabled Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool TooltipEnabled { get; }
Public ReadOnly Property TooltipEnabled As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ZuiAction.TooltipEnabled"]
Implements
IGH_TooltipAwareObject.TooltipEnabled
See Also
Reference
GH_ZuiAction Class
Grasshopper.Kernel Namespace