Grasshopper SDK
GH_SliderBase.ControlBackColour Property
 Gets or sets the BackColour for this slider control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color ControlBackColour { get; set; }
Public Property ControlBackColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.ControlBackColour"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace