Grasshopper SDK
IGH_Embeddable Interface
 Implement this interface in your custom control if you want to be called before a menu commits or cancels.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_Embeddable
Public Interface IGH_Embeddable
The IGH_Embeddable type exposes the following members.
Methods
Name | Description
PrepareForCancel
 This will be called prior to a Cancel operation.
PrepareForCommit
 This will be called prior to a Commit operation.
Top
See Also
Reference
Grasshopper.GUI Namespace