Grasshopper SDK
GH_Line Class
 Represents a 3D line segment. GH_Line re-implements the OpenNURBS OnLine class.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Line>
 Grasshopper.Kernel.Types.GH_GeometricGoo<Line>
 Grasshopper.Kernel.Types.GH_Line
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Line : GH_GeometricGoo<Line>,
	IGH_BakeAwareData, IGH_PreviewData
Public Class GH_Line
	Inherits GH_GeometricGoo(Of Line)
	Implements IGH_BakeAwareData, IGH_PreviewData
The GH_Line type exposes the following members.
Constructors
Name | Description
GH_Line()
 Default constructor
GH_Line(Line)
 Create a duplicate of another line.
GH_Line(GH_Line)
 Create a duplicate of another line.
Top
Properties
Name | Description
Boundingbox |  (Overrides GH_GeometricGoo<T>.Boundingbox.)
ClippingBox
IsValid
 Gets the validity of this instance. Lines with zero length are not considered to be valid.
 (Overrides GH_GeometricGoo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
BakeGeometry
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_GeometricGoo<T>.CastTo<Q>(Q).)
DrawViewportMeshes
DrawViewportWires
Duplicate |  (Overrides GH_GeometricGoo<T>.Duplicate().)
DuplicateGeometry
 Create a duplicate of this line.
 (Overrides GH_GeometricGoo<T>.DuplicateGeometry().)
DuplicateLine
 Create a duplicate of this line.
EmitProxy
 Returns a proxy that represents this line. Do not call this function unless you're
 (Overrides GH_GeometricGoo<T>.EmitProxy().)
GetBoundingBox |  (Overrides GH_GeometricGoo<T>.GetBoundingBox(Transform).)
Morph |  (Overrides GH_GeometricGoo<T>.Morph(SpaceMorph).)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString
 Format the line using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Transform |  (Overrides GH_GeometricGoo<T>.Transform(Transform).)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace