Grasshopper SDK
GH_ComponentParamServer.OutputWidth Property
 Gets the width of the largest output parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float OutputWidth { get; }
Public ReadOnly Property OutputWidth As Single
	Get
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentParamServer.OutputWidth"]
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace