Grasshopper SDK
GH_ArchivedUndoAction.SerializeToByteArray Method
 Serializes the obj into the local archive.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected byte[] SerializeToByteArray(
	GH_ISerializable obj
)
Protected Function SerializeToByteArray (
	obj As GH_ISerializable
) As Byte()
Parameters
obj
Type: GH_IO.GH_ISerializable
Object to serialize
Return Value
Type: Byte[]
See Also
Reference
GH_ArchivedUndoAction Class
Grasshopper.Kernel.Undo Namespace