Grasshopper SDK
GH_PreviewArgs.ShadeMaterial_Selected Property
 Gets the document default material for selected Faces.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DisplayMaterial ShadeMaterial_Selected { get; }
Public ReadOnly Property ShadeMaterial_Selected As DisplayMaterial
	Get
Property Value
Type: DisplayMaterial
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewArgs.ShadeMaterial_Selected"]
Implements
IGH_PreviewArgs.ShadeMaterial_Selected
See Also
Reference
GH_PreviewArgs Class
Grasshopper.Kernel Namespace