Grasshopper SDK
GH_Canvas.Widgets Property
 Gets a list of all the widgets on this canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_Widget> Widgets { get; }
Public ReadOnly Property Widgets As List(Of IGH_Widget)
	Get
Property Value
Type: List<IGH_Widget>
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.Widgets"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace