Grasshopper SDK
GH_DocFilePathEventArgs Constructor
 Create a new instance of the GH_DocFilePathEventArgs class.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocFilePathEventArgs(
	GH_Document document,
	string oldPath,
	string newPath
)
Public Sub New (
	document As GH_Document,
	oldPath As String,
	newPath As String
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
oldPath
Type: System.String
newPath
Type: System.String
See Also
Reference
GH_DocFilePathEventArgs Class
Grasshopper.Kernel Namespace