Grasshopper SDK
Node3d<T>.NearestItems Method (T, Int32)
 Find the N nearest items.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Index3d<T>> NearestItems(
	T locus,
	int groupSize
)
Public Function NearestItems (
	locus As T,
	groupSize As Integer
) As List(Of Index3d(Of T))
Parameters
locus
Type: T
Search locus.
groupSize
Type: System.Int32
Number of nearest items to return.
Return Value
Type: List<Index3d<T>>
A list of nearest items, sorted from nearest to furthest.
See Also
Reference
Node3d<T> Class
NearestItems Overload
Grasshopper.Kernel.Geometry.SpatialTrees Namespace