Grasshopper SDK
GH_ColourCube.ColorAtSlice Method
 Get the color at a position on the slice.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point4d ColorAtSlice(
	PointF pt
)
Public Function ColorAtSlice (
	pt As PointF
) As Point4d
Parameters
pt
Type: System.Drawing.PointF
Point on slice (will be projected into slice limits)
Return Value
Type: Point4d
Point4d structure representing the colour in the current space.
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace