Grasshopper SDK
GH_ZuiAction.Name Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ZuiAction.Name"]
Implements
IGH_ZuiAction.Name
See Also
Reference
GH_ZuiAction Class
Grasshopper.Kernel Namespace