Grasshopper SDK
GH_PointCharge.Location Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point3d Location { get; set; }
Public Property Location As Point3d
	Get
	Set
Property Value
Type: Point3d
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_PointCharge.Location"]
See Also
Reference
GH_PointCharge Class
Grasshopper.Kernel.Types Namespace