Grasshopper SDK
GH_PointUtil Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_PointUtil
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_PointUtil
Public NotInheritable Class GH_PointUtil
The GH_PointUtil type exposes the following members.
Methods
Name | Description
FitPlaneThroughPoints
 Fit a least-squares plane through a collection of points.
ProjectPointsToPlane
 Project a list of points onto the plane. The result will be points in plane-uv coordinates.
PullPointsToPlane
 Pull a list of points onto the plane. The result will be points in 3D world coordinates which are coincident with the given plane.
RemapPointsToPlane
 Remap a list of points onto the plane. This operation equals a ChangeBasisXForm for each point.
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace