Grasshopper SDK
IGH_Attributes.Parent Property
 Gets or sets the parent attributes. Top level attributes do not have parents.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_Attributes Parent { get; set; }
Property Parent As IGH_Attributes
	Get
	Set
Property Value
Type: IGH_Attributes
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.Parent"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace