Grasshopper SDK
GH_Variant Constructor (Vector3d)
 Create a new Point variant.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant(
	Vector3d value
)
Public Sub New (
	value As Vector3d
)
Parameters
value
Type: Vector3d
Value of Variant.
See Also
Reference
GH_Variant Class
GH_Variant Overload
Grasshopper.Kernel.Expressions Namespace