Grasshopper SDK
GH_ActiveObject.Menu_AppendEnableItem Method
 Append the default Enable/Disable menu item.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void Menu_AppendEnableItem(
	ToolStripDropDown menu
)
Protected Sub Menu_AppendEnableItem (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_ActiveObject Class
Grasshopper.Kernel Namespace