Grasshopper SDK
GH_Viewport.UnprojectPoint Method
 Project a point from control coordinates into canvas coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF UnprojectPoint(
	PointF pt
)
Public Function UnprojectPoint (
	pt As PointF
) As PointF
Parameters
pt
Type: System.Drawing.PointF
The point in control coordinates.
Return Value
Type: PointF
The associated point in canvas coordinates.
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace