Grasshopper SDK
GH_ExpressionSyntaxWriter Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Expressions.GH_ExpressionSyntaxWriter
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_ExpressionSyntaxWriter
Public NotInheritable Class GH_ExpressionSyntaxWriter
The GH_ExpressionSyntaxWriter type exposes the following members.
Methods
Name | Description
RewriteAll
 Apply all syntax rulesets to the expression.
RewriteForEvaluator(String)
 Rewrite the expression so that all temporary keywords and symbols are replaced by evaluator-specific chars. The expression will become less readable, do not let the user see the result of this function. You need to rewrite the expression with this function if you intend to feed it into the Evaluator.
RewriteForEvaluator(GH_CodeString)
 Rewrite the expression so that all temporary keywords and symbols are replaced by evaluator-specific chars. The expression will become less readable, do not let the user see the result of this function. You need to rewrite the expression with this function if you intend to feed it into the Evaluator.
RewriteForGraphicInterface(String)
 Rewrite the expression so that tags are replaced by the complex characters that make up the esoteric operators, functions and constants. The expression should become more readable
RewriteForGraphicInterface(GH_CodeString)
 Rewrite the expression so that tags are replaced by the complex characters that make up the esoteric operators, functions and constants. The expression should become more readable for humans.
Top
See Also
Reference
Grasshopper.Kernel.Expressions Namespace