Grasshopper SDK
GH_ComponentServer.AddCategoryShortName Method
 Add an abbreviation for a tab category. 2~4 letter abbreviations are best.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddCategoryShortName(
	string fullCategoryName,
	string categoryAbbreviation
)
Public Sub AddCategoryShortName (
	fullCategoryName As String,
	categoryAbbreviation As String
)
Parameters
fullCategoryName
Type: System.String
The full name of the category.
categoryAbbreviation
Type: System.String
The abbreviation to display on the tab.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace