Grasshopper SDK
GH_Matrix.CloneMatrix Method
 Duplicates a Matrix.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Matrix CloneMatrix(
	Matrix matrix
)
Public Shared Function CloneMatrix (
	matrix As Matrix
) As Matrix
Parameters
matrix
Type: Matrix
Return Value
Type: Matrix
See Also
Reference
GH_Matrix Class
Grasshopper.Kernel.Types Namespace