Grasshopper SDK
GH_Goo<T>.EmitProxy Method
 Create a new proxy for this instance. Return Null if this class does not support proxies.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual IGH_GooProxy EmitProxy()
Public Overridable Function EmitProxy As IGH_GooProxy
Return Value
Type: IGH_GooProxy
Implements
IGH_Goo.EmitProxy()
See Also
Reference
GH_Goo<T> Class
Grasshopper.Kernel.Types Namespace