Grasshopper SDK
GH_AsynchFileData Constructor (String, Boolean, GH_AsynchFileData.FileChangedDelegate)
 Asynchronous constructor. File properties will be loaded asychronously.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_AsynchFileData(
	string location,
	bool includeThumbnail,
	GH_AsynchFileData.FileChangedDelegate callback
)
Public Sub New (
	location As String,
	includeThumbnail As Boolean,
	callback As GH_AsynchFileData.FileChangedDelegate
)
Parameters
location
Type: System.String
Location of file
includeThumbnail
Type: System.Boolean
If true, thumbnail data will be loaded.
callback
Type: Grasshopper.GUI.GH_AsynchFileData.FileChangedDelegate
Callback delegate for file changes.
See Also
Reference
GH_AsynchFileData Class
GH_AsynchFileData Overload
Grasshopper.GUI Namespace