Grasshopper SDK
GH_Plane Constructor (GH_Plane)
 Create a duplicate of another plane.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Plane(
	GH_Plane other
)
Public Sub New (
	other As GH_Plane
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Plane
Plane to copy. If null, a default plane will be created.
See Also
Reference
GH_Plane Class
GH_Plane Overload
Grasshopper.Kernel.Types Namespace