Grasshopper SDK
GH_NamedView Constructor
 Create a default named view.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_NamedView()
Public Sub New
See Also
Reference
GH_NamedView Class
GH_NamedView Overload
Grasshopper.GUI.Canvas Namespace