Grasshopper SDK
GH_RhinoScriptInterface.LoadEditor Method
 Load the main Grasshopper Editor. If the editor has already been loaded nothing will happen.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void LoadEditor()
Public Sub LoadEditor
Examples
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
  Dim GH
  Set GH = Rhino.GetPlugInObject("Grasshopper")
  Call GH.LoadEditor()
  Set GH = Nothing
End Sub
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace