Grasshopper SDK
GH_ScriptVariantType Enumeration
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ScriptVariantType
Public Enumeration GH_ScriptVariantType
Members
Member name | Value | Description
nothing | 0
boolean | 1
integer | 2
double | 3
string | 5
datetime | 6
point | 10
vector | 11
plane | 12
object | 20
See Also
Reference
Grasshopper.Kernel.Expressions Namespace