Grasshopper SDK
GH_Attributes<T>.IsIconMode Method
 Utility function for determining Icon display modes. If the supplied mode is ::application, then it will be adjusted to match the current app settings.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected static bool IsIconMode(
	GH_IconDisplayMode mode
)
Protected Shared Function IsIconMode (
	mode As GH_IconDisplayMode
) As Boolean
Parameters
mode
Type: Grasshopper.Kernel.GH_IconDisplayMode
Return Value
Type: Boolean
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace