Grasshopper SDK
GH_Surface.GH_SurfaceProxy Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<GH_Surface>
 Grasshopper.Kernel.Types.GH_Surface.GH_SurfaceProxy
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_SurfaceProxy : GH_GooProxy<GH_Surface>
Public Class GH_SurfaceProxy
	Inherits GH_GooProxy(Of GH_Surface)
The GH_Surface.GH_SurfaceProxy type exposes the following members.
Constructors
Name | Description
GH_Surface.GH_SurfaceProxy
Initializes a new instance of the GH_Surface.GH_SurfaceProxy class
Top
Properties
Name | Description
Area
Closed
Deformable
EdgeCount
LoopCount
ObjectID
Periodic
Planar
Singular
Solid
Trimmed
VertexCount
Volume
Top
Methods
Name | Description
Construct |  (Overrides GH_GooProxy<T>.Construct().)
FromString |  (Overrides GH_GooProxy<T>.FromString(String).)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace