Grasshopper SDK
GH_CodeString Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Expressions.GH_CodeString
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_CodeString
Public Class GH_CodeString
The GH_CodeString type exposes the following members.
Constructors
Name | Description
GH_CodeString
Initializes a new instance of the GH_CodeString class
Top
Properties
Name | Description
Segments
Top
Methods
Name | Description
Flatten
ParseNewString
Replace
ReplaceToken
Top
Fields
Name | Description
DoubleQuote
m_Segments
Top
See Also
Reference
Grasshopper.Kernel.Expressions Namespace