Grasshopper SDK
GH_Document.SetPreviewFlags Method (List<IGH_DocumentObject>, Boolean)
 Set the preview flags of all specified objects to true or false
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetPreviewFlags(
	List<IGH_DocumentObject> objects,
	bool bPreview
)
Public Sub SetPreviewFlags (
	objects As List(Of IGH_DocumentObject),
	bPreview As Boolean
)
Parameters
objects
Type: System.Collections.Generic.List<IGH_DocumentObject>
bPreview
Type: System.Boolean
See Also
Reference
GH_Document Class
SetPreviewFlags Overload
Grasshopper.Kernel Namespace