Grasshopper SDK
GH_Capsule.SetJaggedEdges Method
 Assign left and right jagged edges.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetJaggedEdges(
	bool left,
	bool right
)
Public Sub SetJaggedEdges (
	left As Boolean,
	right As Boolean
)
Parameters
left
Type: System.Boolean
right
Type: System.Boolean
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace