Grasshopper SDK
GH_StandardIcons.FileIconGHXMissing_32x36 Property
 Gets the file icon used for missing Grasshopper Xml files.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Bitmap FileIconGHXMissing_32x36 { get; }
Public Shared ReadOnly Property FileIconGHXMissing_32x36 As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.GH_StandardIcons.FileIconGHXMissing_32x36"]
See Also
Reference
GH_StandardIcons Class
Grasshopper.GUI Namespace