Grasshopper SDK
GH_FontServer.Small Property
 SystemFonts.CaptionFont, 6pt, regular
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font Small { get; }
Public Shared ReadOnly Property Small As Font
	Get
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FontServer.Small"]
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace