Grasshopper SDK
GH_SliderInputMode Enumeration
 Enumerates all possible slider text input modes.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_SliderInputMode
Public Enumeration GH_SliderInputMode
Members
Member name | Value | Description
None | 0 |  Text input mode is not available.
OnKeyDown | 1 |  Text input mode will be available on keydown.
OnDoubleClick | 2 |  Text input mode will be available upon double click.
All | 3 |  All text input modes will be available.
See Also
Reference
Grasshopper.GUI Namespace