Grasshopper SDK
GH_DocumentIO.Open Method
 Perform a default Open operation and store the result as the internal document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Open()
Public Function Open As Boolean
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentIO Class
Open Overload
Grasshopper.Kernel Namespace