Grasshopper SDK
Versioning.VersionHistoryData Method
 Gets the currently most up-to-date version history data.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string[] VersionHistoryData()
Public Shared Function VersionHistoryData As String()
Return Value
Type: String[]
The latest version history or null if no such record exists.
See Also
Reference
Versioning Class
Grasshopper Namespace