Grasshopper SDK
GH_DocumentObject.GetValue Method (String, Boolean)
 Get a boolean value from the component value table.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected bool GetValue(
	string name,
	bool default
)
Protected Function GetValue (
	name As String,
	default As Boolean
) As Boolean
Parameters
name
Type: System.String
Name of boolean to retrieve.
default
Type: System.Boolean
Default value to return in case of missing named value.
Return Value
Type: Boolean
The boolean value with the given name of the default value.
See Also
Reference
GH_DocumentObject Class
GetValue Overload
Grasshopper.Kernel Namespace