Grasshopper SDK
GH_GooProxy<T> Class
 Abstract base implementation of IGH_GooProxy
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<T>
 More...
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_GooProxy<T> : IGH_GooProxy
where T : IGH_Goo
Public MustInherit Class GH_GooProxy(Of T As IGH_Goo)
	Implements IGH_GooProxy
Type Parameters
T
The GH_GooProxy<T> type exposes the following members.
Constructors
Name | Description
GH_GooProxy<T>
Initializes a new instance of the GH_GooProxy<T> class
Top
Properties
Name | Description
IsParsable
 Gets a value indicating whether or not the type can be instantiated from a String.
Owner
ProxyOwner
 Gets the piece of Grasshopper data that spawned this proxy.
TypeDescription
TypeName
UserString
 Gets or sets the user-defined string that describes this proxy. This only really makes sense if the Proxy is Parsable.
Valid
 Gets a value indicating whether this proxy represents valid data.
Top
Methods
Name | Description
Construct
 Override this method to supply a custom UI during proxy construction.
FormatInstance
 Returns a String description of the current value.
FromString
 If IsParsable(), then attempts to convert the string to a generic type value
MutateString
 Munge a string to remove obvious errors on account of the user.
NumberToString
StringToNumber
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GooProxy<T>
 Grasshopper.Kernel.Types.GH_Box.GH_BoxProxy
 Grasshopper.Kernel.Types.GH_Brep.GH_BrepProxy
 Grasshopper.Kernel.Types.GH_Circle.GH_CircleProxy
 Grasshopper.Kernel.Types.GH_Curve.GH_CurveProxy
 Grasshopper.Kernel.Types.GH_GeometryGroup.GH_GeometryGroupProxy
 Grasshopper.Kernel.Types.GH_Interval2D.GH_Interval2DProxy
 Grasshopper.Kernel.Types.GH_Line.GH_LineProxy
 Grasshopper.Kernel.Types.GH_Material.GH_Material_Proxy
 Grasshopper.Kernel.Types.GH_Mesh.GH_MeshProxy
 Grasshopper.Kernel.Types.GH_MeshFace.GH_MeshFaceProxy
 Grasshopper.Kernel.Types.GH_MeshingParameters.RhMesherSettings_Proxy
 Grasshopper.Kernel.Types.GH_Plane.GH_PlaneProxy
 Grasshopper.Kernel.Types.GH_Point.GH_PointProxy
 Grasshopper.Kernel.Types.GH_Rectangle.GH_RectangleProxy
 Grasshopper.Kernel.Types.GH_Surface.GH_SurfaceProxy
 Grasshopper.Kernel.Types.GH_Vector.GH_VectorProxy