Grasshopper SDK
GH_GeometryGroup.ReferenceID Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid ReferenceID { get; set; }
Public Property ReferenceID As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometryGroup.ReferenceID"]
Implements
IGH_GeometricGoo.ReferenceID
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace