Grasshopper SDK
GH_ComponentServer.GHAFileLoaded Event
 Raised whenever a GHA file has been successfully loaded.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_ComponentServer.GHAFileLoadedEventHandler GHAFileLoaded
Public Event GHAFileLoaded As GH_ComponentServer.GHAFileLoadedEventHandler
Value
Type: Grasshopper.Kernel.GH_ComponentServer.GHAFileLoadedEventHandler
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace