Grasshopper SDK
GH_GlossaryItem Class
 Represents a single glossary entry in the Grasshopper help.
Inheritance Hierarchy
System.Object
 Grasshopper.Documentation.GH_GlossaryItem
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_GlossaryItem
Public Class GH_GlossaryItem
The GH_GlossaryItem type exposes the following members.
Properties
Name | Description
Author
 Gets the author of this glossary entry. This field is optional and may not be defined.
Contact
 Gets the contact information for the glossary entry author. This field is optional and may not be defined.
Descriptions
 Gets the description (definition) for this glossary entry.
Path
 Gets the source file for this glossary entry.
Pronunciation
 Gets the pronunciation guide to the word. This field is optional and may not be defined.
Synonyms
 Gets the synonyms for this glossary entry.
Word
 Gets the word this glossary entry is about.
Top
Methods
Name | Description
ParseFile
 Parse a *.glossary file and return a glossary entry.
Top
See Also
Reference
Grasshopper.Documentation Namespace