Grasshopper SDK
GH_DocumentServer Constructor
Initializes a new instance of the GH_DocumentServer class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentServer()
Public Sub New
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace