Grasshopper SDK
GH_CanvasValidator Class
 Abstract implementation of IGH_CanvasValidator. Inherit from this class rather than implementing IGH_CanvasValidator from scratch.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Canvas.GH_CanvasValidator
 Grasshopper.GUI.Canvas.GH_CanvasDropTargetValidator
 Grasshopper.GUI.Canvas.GH_CanvasWireValidator
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_CanvasValidator : IGH_CanvasValidator
Public MustInherit Class GH_CanvasValidator
	Implements IGH_CanvasValidator
The GH_CanvasValidator type exposes the following members.
Constructors
Name | Description
GH_CanvasValidator
Initializes a new instance of the GH_CanvasValidator class
Top
Properties
Name | Description
Canvas
 Gets the canvas this validator is associated with.
Document
 Gets the document (if it exists) that is currently loaded in the canvas.
Top
Methods
Name | Description
AddedToCanvas
 Override this method if you want to be informed when this validator gets assigned to a canvas. But *always* call the base class method.
AppliesToDocument
CanAcceptObject
CanCreateObject
CanCreateWire
CanDeleteObject
CanDeleteWire
CanDragObject
CanNavigateCanvas
CanShowCanvasMenu
CanShowComponentSearchBox
CanShowObjectMenu
RemovedFromCanvas
 Override this method if you want to be informed when this validator gets removed from a canvas. But *always* call the base class method.
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace