Grasshopper SDK
GH_ResizableAttributes<T> Constructor
Initializes a new instance of the GH_ResizableAttributes<T> class
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_ResizableAttributes(
	T owner
)
Protected Sub New (
	owner As T
)
Parameters
owner
Type: T
See Also
Reference
GH_ResizableAttributes<T> Class
Grasshopper.Kernel.Attributes Namespace