Grasshopper SDK
GH_Canvas.GH_ImageSettings.BackColour Property
 Gets or sets the background colour to use for the high-resolution rendering.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color BackColour { get; set; }
Public Property BackColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.BackColour"]
See Also
Reference
GH_Canvas.GH_ImageSettings Class
Grasshopper.GUI.Canvas Namespace