Grasshopper SDK
GH_LonLatCoordinate Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_LonLatCoordinate
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_LonLatCoordinate : IGH_Goo
Public Class GH_LonLatCoordinate
	Implements IGH_Goo
The GH_LonLatCoordinate type exposes the following members.
Constructors
Name | Description
GH_LonLatCoordinate()
Initializes a new instance of the GH_LonLatCoordinate class
GH_LonLatCoordinate(Double, Double)
Initializes a new instance of the GH_LonLatCoordinate class
Top
Properties
Name | Description
IsValid
IsValidWhyNot
Latitude
 Gets or sets the longitude (in degrees) of the location.
Longitude
 Gets or sets the longitude (in degrees) of the location.
SphereUParameter
 Gets the spherical U parameter.
SphereVParameter
 Gets the spherical V parameter.
TypeDescription
TypeName
Top
Methods
Name | Description
CastFrom
CastTo<T>
Duplicate
EmitProxy
Read
ScriptVariable
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace