Grasshopper SDK
GH_AssemblyInfo.AssemblyDescription Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string AssemblyDescription { get; }
Public Overridable ReadOnly Property AssemblyDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.AssemblyDescription"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace