Grasshopper SDK
IGH_Param.ReplaceSource Method (Guid, IGH_Param)
 Replace an existing source with a new one. If the old_source does not exist in this parameter, nothing happens.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void ReplaceSource(
	Guid old_source_id,
	IGH_Param new_source
)
Sub ReplaceSource (
	old_source_id As Guid,
	new_source As IGH_Param
)
Parameters
old_source_id
Type: System.Guid
Source to replace.
new_source
Type: Grasshopper.Kernel.IGH_Param
Source to replace with.
See Also
Reference
IGH_Param Interface
ReplaceSource Overload
Grasshopper.Kernel Namespace