Grasshopper SDK
GH_Document.DefineConstant Method
 Add a new constant to the document. Constants are not case-sensitive, when you define a constant with an existing name, the old one will be replaced. Note: constants are as of yet unused. Eventually they are supposed to become accessible to all expressions running inside a document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DefineConstant(
	string name,
	GH_Variant value
)
Public Sub DefineConstant (
	name As String,
	value As GH_Variant
)
Parameters
name
Type: System.String
Name of constant.
value
Type: Grasshopper.Kernel.Expressions.GH_Variant
Value of constant.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace