Grasshopper SDK
GH_Format.FormatCircleValidity Method
 If the circle is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatCircleValidity(
	Circle val,
	string identifier = "Circle"
)
Public Shared Function FormatCircleValidity (
	val As Circle,
	Optional identifier As String = "Circle"
) As String
Parameters
val
Type: Circle
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the circle is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace