Grasshopper SDK
GH_ColourPickerBase.ChannelBox1 Property
 Gets the rectangle containing the tag string for the second channel slider.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle ChannelBox1 { get; }
Public ReadOnly Property ChannelBox1 As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.ChannelBox1"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace