Grasshopper SDK
GH_Canvas Constructor
Initializes a new instance of the GH_Canvas class
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Canvas()
Public Sub New
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace