Grasshopper SDK
GH_Author Constructor
Initializes a new instance of the GH_Author class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Author()
Public Sub New
See Also
Reference
GH_Author Class
GH_Author Overload
Grasshopper.Kernel Namespace