Grasshopper SDK
GH_Document.ScheduleRecursive Field
 Defines the delay used to indicate the schedule should be immedate and recursive.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int ScheduleRecursive = 0
Public Const ScheduleRecursive As Integer = 0
Field Value
Type: Int32
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace