Grasshopper SDK
IGH_Structure.IsEmpty Property
 Gets the Empty state of the structure. If the structure is Empty when it contains no paths and no branches.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsEmpty { get; }
ReadOnly Property IsEmpty As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.IGH_Structure.IsEmpty"]
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace