Grasshopper SDK
IGH_GeometricGoo.Transform Method
 Transforms the object or a deformable representation of the object.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_GeometricGoo Transform(
	Transform xform
)
Function Transform (
	xform As Transform
) As IGH_GeometricGoo
Parameters
xform
Type: Transform
Transformation matrix.
Return Value
Type: IGH_GeometricGoo
Transformed geometry. If the local geometry can be transformed accurately, then the returned instance equals this instance. Not all geometry types can be accurately transformed under all circumstances though, if this is the case, this function will return an instance of another IGH_GeometricGoo derived type which can be transformed.
See Also
Reference
IGH_GeometricGoo Interface
Grasshopper.Kernel.Types Namespace