Grasshopper SDK
GH_Curve.IsValid Property
 Gets the validity of this curve. If the curve is referenced but cannot be loaded, the curve is not valid.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Curve.IsValid"]
See Also
Reference
GH_Curve Class
Grasshopper.Kernel.Types Namespace