Grasshopper SDK
IGH_Attributes.GetTopLevel Property
 Gets the top level attributes of these attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_Attributes GetTopLevel { get; }
ReadOnly Property GetTopLevel As IGH_Attributes
	Get
Property Value
Type: IGH_Attributes
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.GetTopLevel"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace