Grasshopper SDK
IGH_Component.RunCount Property
 Gets a value indicating how many times the SolveInstance method was called on this component during the last solution. This property will return -1 if no valid runcount is available.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int RunCount { get; }
ReadOnly Property RunCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Component.RunCount"]
See Also
Reference
IGH_Component Interface
Grasshopper.Kernel Namespace