Grasshopper SDK
GH_RhinoScriptInterface.OpenDocument Method
 Open a Grasshopper document. The editor will be loaded if necessary, but it will not be automatically shown.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool OpenDocument(
	string filename
)
Public Function OpenDocument (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
Path of file to open (must be a *.gh or *.ghx extension).
Return Value
Type: Boolean
True on success, false on failure.
Examples
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
  Dim GH
  Set GH = Rhino.GetPlugInObject("Grasshopper")
  Call GH.OpenDocument("C:\ExampleFile.ghx")
  Set GH = Nothing
End Sub
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace