Grasshopper SDK
GH_GlossaryItem.Pronunciation Property
 Gets the pronunciation guide to the word. This field is optional and may not be defined.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Content Pronunciation { get; }
Public ReadOnly Property Pronunciation As IGH_Content
	Get
Property Value
Type: IGH_Content
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_GlossaryItem.Pronunciation"]
See Also
Reference
GH_GlossaryItem Class
Grasshopper.Documentation Namespace