Grasshopper SDK
GH_UndoRecord.ActionCount Property
 Gets the number of actions stored in this record.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ActionCount { get; }
Public ReadOnly Property ActionCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoRecord.ActionCount"]
See Also
Reference
GH_UndoRecord Class
Grasshopper.Kernel.Undo Namespace