Grasshopper SDK
GH_ExpressionString.IsWhiteSpace Method
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsWhiteSpace(
	int index
)
Public Function IsWhiteSpace (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Return Value
Type: Boolean
See Also
Reference
GH_ExpressionString Class
Grasshopper.Kernel.Expressions Namespace