Grasshopper SDK
GH_Param<T>.Simplify Property
 Gets or sets the simplify modifier for this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Simplify { get; set; }
Public Property Simplify As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.Simplify"]
Implements
IGH_Param.Simplify
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace