Grasshopper SDK
GH_LoadProtectDialog Class
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Grasshopper.GUI.GH_LoadProtectDialog
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_LoadProtectDialog : Form
Public Class GH_LoadProtectDialog
	Inherits Form
The GH_LoadProtectDialog type exposes the following members.
Constructors
Name | Description
GH_LoadProtectDialog
Initializes a new instance of the GH_LoadProtectDialog class
Top
Methods
Name | Description
Dispose
Releases the unmanaged resources used by the GH_LoadProtectDialog and optionally releases the managed resources
 (Overrides Form.Dispose(Boolean).)
SetAssemblyName
Top
See Also
Reference
Grasshopper.GUI Namespace