Grasshopper SDK
GH_Document.IsModified Property
 Gets or sets the modified flag. If the new value differs from the old value, the ModifiedChanged() event is raised.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsModified { get; set; }
Public Property IsModified As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.IsModified"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace