Grasshopper SDK
GH_Capsule.AddOutputGrip Method (PointF)
 Add an output grip to this UI Box.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddOutputGrip(
	PointF P
)
Public Sub AddOutputGrip (
	P As PointF
)
Parameters
P
Type: System.Drawing.PointF
Coordinate of grip.
See Also
Reference
GH_Capsule Class
AddOutputGrip Overload
Grasshopper.GUI.Canvas Namespace