Grasshopper SDK
GH_ColourPickerBase.SliderSize Field
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int SliderSize = 20
Public Const SliderSize As Integer = 20
Field Value
Type: Int32
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace