Grasshopper SDK
GH_Point2D.y Field
 Y coordinate of point.
Namespace: GH_IO.Types
Assembly: GH_IO (in GH_IO.dll) Version: Rhino 6.0
Syntax
public double y
Public y As Double
Field Value
Type: Double
See Also
Reference
GH_Point2D Structure
GH_IO.Types Namespace