Grasshopper SDK
GH_InstanceDescription.HasCategory Property
 Gets whether or not the Category field has been set.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool HasCategory { get; }
Public ReadOnly Property HasCategory As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_InstanceDescription.HasCategory"]
Implements
IGH_InstanceDescription.HasCategory
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace