Grasshopper SDK
GH_Parser.IsChapterHeaderLine Method
 Test whether a line represents a chapter header underline. Chapter header underlines contain at least 4 consecutive equals symbols preceded or followed by any amount of white space.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsChapterHeaderLine(
	string line
)
Public Shared Function IsChapterHeaderLine (
	line As String
) As Boolean
Parameters
line
Type: System.String
Line to test.
Return Value
Type: Boolean
True if the line is considered to be a chapter header underline.
See Also
Reference
GH_Parser Class
Grasshopper.Documentation Namespace