Grasshopper SDK
GH_ExpressionString.space Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected static char space
Protected Shared space As Char
Field Value
Type: Char
See Also
Reference
GH_ExpressionString Class
Grasshopper.Kernel.Expressions Namespace