Grasshopper SDK
GH_PointRefType Enumeration
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_PointRefType
Public Enumeration GH_PointRefType
Members
Member name | Value | Description
coordinate | 1
point_object | 2
curve_ratio | 10
curve_dist_start | 11
curve_dist_end | 12
srf_param | 20
See Also
Reference
Grasshopper.Kernel.Types Namespace