Grasshopper SDK
GH_Integer Class
 Represents a 32-bit signed integer. GH_Integer re-implements the framework System.Int32 type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Int32>
 Grasshopper.Kernel.Types.GH_Integer
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Integer : GH_Goo<int>
Public Class GH_Integer
	Inherits GH_Goo(Of Integer)
The GH_Integer type exposes the following members.
Constructors
Name | Description
GH_Integer()
 Blank constructor
GH_Integer(Int32)
Initializes a new instance of the GH_Integer class
GH_Integer(GH_Integer)
Initializes a new instance of the GH_Integer class
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance. Integers are always valid.
 (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateInteger
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace