Grasshopper SDK
GH_CodeString.Segments Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<GH_CodeStringSegment> Segments { get; }
Public ReadOnly Property Segments As List(Of GH_CodeStringSegment)
	Get
Property Value
Type: List<GH_CodeStringSegment>
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_CodeString.Segments"]
See Also
Reference
GH_CodeString Class
Grasshopper.Kernel.Expressions Namespace