Grasshopper SDK
GH_Curve Constructor (GH_Curve)
 Create a duplicate of another GH_Curve. This constructor also copies reference data.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Curve(
	GH_Curve other
)
Public Sub New (
	other As GH_Curve
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Curve
Curve to duplicate
See Also
Reference
GH_Curve Class
GH_Curve Overload
Grasshopper.Kernel.Types Namespace