Grasshopper SDK
GH_Capsule.Box Property
 Gets the outline box for this Capsule.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle Box { get; }
Public ReadOnly Property Box As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.Box"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace