Grasshopper SDK
GH_WindowsControlUtil.FixTextRenderingDefault Method (Control)
 Sets the UseCompatibleTextRendering value to False on the control.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void FixTextRenderingDefault(
	Control control
)
Public Shared Sub FixTextRenderingDefault (
	control As Control
)
Parameters
control
Type: System.Windows.Forms.Control
See Also
Reference
GH_WindowsControlUtil Class
FixTextRenderingDefault Overload
Grasshopper.GUI Namespace