Grasshopper SDK
GH_DocumentObject.PreviewExpired Event
 Raised whenever the display (in the Rhino viewports) of a certain object becomes invalid.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event IGH_DocumentObject.PreviewExpiredEventHandler PreviewExpired
Public Event PreviewExpired As IGH_DocumentObject.PreviewExpiredEventHandler
Value
Type: Grasshopper.Kernel.IGH_DocumentObject.PreviewExpiredEventHandler
Implements
IGH_DocumentObject.PreviewExpired
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace