Grasshopper SDK
GH_Convert.ToPointF Method
 Convert a Rhino SDK point structure to a GDI point structure.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static PointF ToPointF(
	Point3d in
)
Public Shared Function ToPointF (
	in As Point3d
) As PointF
Parameters
in
Type: Point3d
Point3d to convert.
Return Value
Type: PointF
Floating point accuracy GDI point.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace