Grasshopper SDK
IGH_Structure.EnsureCapacity Method
 Ensures that all branches have a certain capacity
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void EnsureCapacity(
	int capacity
)
Sub EnsureCapacity (
	capacity As Integer
)
Parameters
capacity
Type: System.Int32
Capacity per branch.
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace