Grasshopper SDK
GH_Interval Class
 Represents a one-dimensional numeric domain.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Interval>
 Grasshopper.Kernel.Types.GH_Interval
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Interval : GH_Goo<Interval>
Public Class GH_Interval
	Inherits GH_Goo(Of Interval)
The GH_Interval type exposes the following members.
Constructors
Name | Description
GH_Interval()
 Default constructor
GH_Interval(Interval)
 Create a duplicate of another interval
GH_Interval(GH_Interval)
 Create a duplicate from another interval.
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance. Intervals are invalid if either of the extremes is a #NaN.
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. this stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate
 Create a duplicate of this interval.
 (Overrides GH_Goo<T>.Duplicate().)
DuplicateInterval
 Create a duplicate of this interval.
EmitProxy
 Returns a proxy that represents this interval. Do not call this function unless you're
 (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString
 Format the interval using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace