Grasshopper SDK
GH_ObjectSettings Class
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Theme.GH_ObjectSettings
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ObjectSettings
Public Class GH_ObjectSettings
The GH_ObjectSettings type exposes the following members.
Properties
Name | Description
GroupColour
 Gets or sets the default fill colour for group objects.
PanelColour
 Gets or sets the default fill colour for panel objects.
ZuiEdgeColour
 Gets or sets the edge colour for ZUI elements.
ZuiFillColour
 Gets or sets the fill colour for ZUI elements.
Top
See Also
Reference
Grasshopper.GUI.Theme Namespace