Grasshopper SDK
GH_Attributes<T>.Parent Property
 Gets or sets the parent attributes. Top level attributes do not have parents.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Attributes Parent { get; set; }
Public Property Parent As IGH_Attributes
	Get
	Set
Property Value
Type: IGH_Attributes
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.Parent"]
Implements
IGH_Attributes.Parent
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace