Grasshopper SDK
GH_ComponentParamServer.OnParametersChanged Method
 Call this function when you change input/output parameter lists or types. This function will wipe all caches that are potentially invalid. PerformLayout on the component attributes will be called.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnParametersChanged()
Public Sub OnParametersChanged
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace