Grasshopper SDK
GH_ScrollBarVerticalBase.BeginDrag Method
 Start a new drag operation.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void BeginDrag(
	RectangleF region,
	double start
)
Public Sub BeginDrag (
	region As RectangleF,
	start As Double
)
Parameters
region
Type: System.Drawing.RectangleF
Scroll bar region (the rectangle in which the scroll bar is allowed to move).
start
Type: System.Double
Vertical offset of scroll drag.
See Also
Reference
GH_ScrollBarVerticalBase Class
Grasshopper.GUI.Base Namespace