Grasshopper SDK
GH_Point.ReferenceCurve Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Curve ReferenceCurve()
Public Function ReferenceCurve As Curve
Return Value
Type: Curve
See Also
Reference
GH_Point Class
ReferenceCurve Overload
Grasshopper.Kernel.Types Namespace