Grasshopper SDK
GH_Surface.Value Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override Brep Value { get; set; }
Public Overrides Property Value As Brep
	Get
	Set
Property Value
Type: Brep
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Surface.Value"]
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace