Grasshopper SDK
GH_Path.ToString Method
 Concatenates the indices in the path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_Path Class
ToString Overload
Grasshopper.Kernel.Data Namespace