Grasshopper SDK
GH_PaletteStyle.CreateBrush Method
 Create a fill brush. At low zoom levels the brush will be solid colour, at medium to high zoom levels the brush will have a gradient.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual Brush CreateBrush(
	RectangleF rec,
	float zoom
)
Public Overridable Function CreateBrush (
	rec As RectangleF,
	zoom As Single
) As Brush
Parameters
rec
Type: System.Drawing.RectangleF
Target rectangle of fill brush.
zoom
Type: System.Single
Zoom level of target graphics surface.
Return Value
Type: Brush
A brush object that can be used to fill a custom area.
See Also
Reference
GH_PaletteStyle Class
Grasshopper.GUI.Canvas Namespace