Grasshopper SDK
IGH_StateTag.Icon Property
 Gets the 16 by 16 pixel icon associated with this state tag.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Bitmap Icon { get; }
ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_StateTag.Icon"]
See Also
Reference
IGH_StateTag Interface
Grasshopper.Kernel Namespace