Grasshopper SDK
GH_CanvasValidator.CanNavigateCanvas Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool CanNavigateCanvas()
Public Overridable Function CanNavigateCanvas As Boolean
Return Value
Type: Boolean
Implements
IGH_CanvasValidator.CanNavigateCanvas()
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace