Grasshopper SDK
GH_RotationalTuningData<T>.TotalAngle Method
 Compute the total angle from the first to the last frame.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double TotalAngle()
Public Function TotalAngle As Double
Return Value
Type: Double
See Also
Reference
GH_RotationalTuningData<T> Class
Grasshopper.GUI Namespace