Grasshopper SDK
GH_ScrollBarVerticalBase.Content Property
 Gets or sets the height of the content
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Content { get; set; }
Public Property Content As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.Content"]
See Also
Reference
GH_ScrollBarVerticalBase Class
Grasshopper.GUI.Base Namespace