Grasshopper SDK
GH_Format.FormatPlaneValidity Method
 If the plane is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatPlaneValidity(
	Plane val,
	string identifier = "Plane",
	bool testUnitAxes = false
)
Public Shared Function FormatPlaneValidity (
	val As Plane,
	Optional identifier As String = "Plane",
	Optional testUnitAxes As Boolean = false
) As String
Parameters
val
Type: Plane
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
testUnitAxes (Optional)
Type: System.Boolean
If True, planes with non-unit axis vectors are considered to be invalid.
Return Value
Type: String
A string describing why the plane is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace