Grasshopper SDK
GH_Convert.ToBoolean_Secondary Method
 Performs indirect casts from other data types into booleans.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToBoolean_Secondary(
	Object data,
	ref bool destination
)
Public Shared Function ToBoolean_Secondary (
	data As Object,
	ByRef destination As Boolean
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.Boolean
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
Remarks
This converted relies on ToInt32_Secondary()
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace