Grasshopper SDK
GH_RenderArgs.Geomety Property
 Gets the geometry primitive list to append to.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RenderPrimitiveList Geomety { get; }
Public ReadOnly Property Geomety As RenderPrimitiveList
	Get
Property Value
Type: RenderPrimitiveList
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RenderArgs.Geomety"]
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace