Grasshopper SDK
GH_Curve Constructor
 Default constructor, creates an invalid curve.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Curve()
Public Sub New
See Also
Reference
GH_Curve Class
GH_Curve Overload
Grasshopper.Kernel.Types Namespace