Grasshopper SDK
GH_PageSettings.DrawShadow Property
 Gets or sets whether the page shadow ought to be drawn. If the page is not drawn, neither is the page shadow, irregardless of this property.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DrawShadow { get; set; }
Public Property DrawShadow As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_PageSettings.DrawShadow"]
See Also
Reference
GH_PageSettings Class
Grasshopper.GUI.Theme Namespace