Grasshopper SDK
GH_StateTag.RenderTagPolygonIcon Method
 Render a filled polygon with default shading.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void RenderTagPolygonIcon(
	Graphics graphics,
	PointF[] polygon
)
Protected Sub RenderTagPolygonIcon (
	graphics As Graphics,
	polygon As PointF()
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
polygon
Type: System.Drawing.PointF[]
Polygon corners.
See Also
Reference
GH_StateTag Class
Grasshopper.Kernel Namespace