Grasshopper SDK
CentralSettings.LoadProtectionChangedEventHandler Delegate
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void LoadProtectionChangedEventHandler(
	string pluginName
)
Public Delegate Sub LoadProtectionChangedEventHandler (
	pluginName As String
)
Parameters
pluginName
Type: System.String
See Also
Reference
Grasshopper Namespace