Grasshopper SDK
GH_Alias.CompareTo Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int CompareTo(
	GH_Alias other
)
Public Function CompareTo (
	other As GH_Alias
) As Integer
Parameters
other
Type: Grasshopper.Kernel.GH_Alias
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
GH_Alias Class
Grasshopper.Kernel Namespace