Grasshopper SDK
GH_AsynchFileData.CallbackDelegate Property
 Gets or sets the callback delegate to be used when properties are updated.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_AsynchFileData.FileChangedDelegate CallbackDelegate { get; set; }
Public Property CallbackDelegate As GH_AsynchFileData.FileChangedDelegate
	Get
	Set
Property Value
Type: GH_AsynchFileData.FileChangedDelegate
[Missing <value> documentation for "P:Grasshopper.GUI.GH_AsynchFileData.CallbackDelegate"]
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace