Grasshopper SDK
GH_RotationalFrame.Angle Property
 Gets or sets the local angle of the rotation event.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Angle { get; set; }
Public Property Angle As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.GUI.GH_RotationalFrame.Angle"]
See Also
Reference
GH_RotationalFrame Structure
Grasshopper.GUI Namespace