Grasshopper SDK
GH_Convert.ToMesh_Secondary Method
 Attempts to convert other data types into an OnMesh. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToMesh_Secondary(
	Object data,
	ref Mesh rc
)
Public Shared Function ToMesh_Secondary (
	data As Object,
	ByRef rc As Mesh
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Mesh
Return Value
Type: Boolean
An OnMesh instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace