Grasshopper SDK
GH_DataComparison Enumeration
 Enumerates all possible Data Matching algorithms for Components.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_DataComparison
Public Enumeration GH_DataComparison
Members
Member name | Value | Description
ShortestList | 0 |  Matches data in all lists until the shortest list runs dry. This flag will omit data entries if lists have a different length
LongestList | 1 |  Matches data in all lists until the longest list runs dry. This is the default behaviour
CrossReference | 2 |  Matches data in all lists in all possible combinations. Careful, since this might results in stupendous amounts of data
See Also
Reference
Grasshopper.Kernel Namespace