Grasshopper SDK
GH_ParserSymbol.m_class Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ParserTokenClass m_class
Public m_class As GH_ParserTokenClass
Field Value
Type: GH_ParserTokenClass
See Also
Reference
GH_ParserSymbol Class
Grasshopper.Kernel.Expressions Namespace