Grasshopper SDK
GH_InstanceDescription.Name Property
 Gets or sets the name of the object. This field typically remains fixed during the lifetime of an object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string Name { get; set; }
Public Overridable Property Name As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_InstanceDescription.Name"]
Implements
IGH_InstanceDescription.Name
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace