Grasshopper SDK
GH_TypeLib.id_rectanglef Field
System.Drawing.RectangleF
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Guid id_rectanglef
Public Shared id_rectanglef As Guid
Field Value
Type: Guid
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace