Grasshopper SDK
GH_Param<T>.SetPrincipal Method
 Set the principal parameter state.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool SetPrincipal(
	bool set,
	bool recordUndo,
	bool recompute
)
Public Function SetPrincipal (
	set As Boolean,
	recordUndo As Boolean,
	recompute As Boolean
) As Boolean
Parameters
set
Type: System.Boolean
recordUndo
Type: System.Boolean
recompute
Type: System.Boolean
Return Value
Type: Boolean
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace