Grasshopper SDK
GH_Circle.GH_CircleProxy Constructor
Initializes a new instance of the GH_Circle.GH_CircleProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CircleProxy(
	GH_Circle nOwner
)
Public Sub New (
	nOwner As GH_Circle
)
Parameters
nOwner
Type: Grasshopper.Kernel.Types.GH_Circle
See Also
Reference
GH_Circle.GH_CircleProxy Class
Grasshopper.Kernel.Types Namespace