Grasshopper SDK
GH_GeometricGoo<T> Constructor (T)
 Data constructor, m_value will be set to internal_data.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_GeometricGoo(
	T internal_data
)
Protected Sub New (
	internal_data As T
)
Parameters
internal_data
Type: T
Value to store inside this Goo instance.
See Also
Reference
GH_GeometricGoo<T> Class
GH_GeometricGoo<T> Overload
Grasshopper.Kernel.Types Namespace