Grasshopper SDK
GH_MenuTextBox.CloseEntireMenuStructure Method
 Call this function to close the ENTIRE menu structure.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CloseEntireMenuStructure()
Public Sub CloseEntireMenuStructure
See Also
Reference
GH_MenuTextBox Class
Grasshopper.GUI Namespace