Grasshopper SDK
GH_AsynchFileData.StartPeriodicUpdate Method (TimeSpan)
 Starts periodic updating (from now).
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void StartPeriodicUpdate(
	TimeSpan period
)
Public Sub StartPeriodicUpdate (
	period As TimeSpan
)
Parameters
period
Type: System.TimeSpan
Period between updates.
See Also
Reference
GH_AsynchFileData Class
StartPeriodicUpdate Overload
Grasshopper.GUI Namespace