Grasshopper SDK
GH_Viewport Constructor (GH_Viewport)
Initializes a new instance of the GH_Viewport class
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Viewport(
	GH_Viewport viewport
)
Public Sub New (
	viewport As GH_Viewport
)
Parameters
viewport
Type: Grasshopper.GUI.Canvas.GH_Viewport
See Also
Reference
GH_Viewport Class
GH_Viewport Overload
Grasshopper.GUI.Canvas Namespace