Grasshopper SDK
GH_Structure<T>.PathIndex Method
 Find the indices that surround the given path domain. Indices may be out of bounds.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void PathIndex(
	GH_Path path,
	ref int idx0,
	ref int idx1
)
Public Sub PathIndex (
	path As GH_Path,
	ByRef idx0 As Integer,
	ByRef idx1 As Integer
)
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to search for (it need not exist in the structure).
idx0
Type: System.Int32
The index of the path itself or the first smaller path if the path is not defined.
idx1
Type: System.Int32
The index of th path itself of the first larger path if the path is not defined.
Implements
IGH_Structure.PathIndex(GH_Path, Int32, Int32)
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace