Grasshopper SDK
GH_Document.GH_UndoUtil.RecordPreviewEvent Method
 Create and Record a new PreviewChanged undo record.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid RecordPreviewEvent(
	string name,
	IGH_ActiveObject obj
)
Public Function RecordPreviewEvent (
	name As String,
	obj As IGH_ActiveObject
) As Guid
Parameters
name
Type: System.String
Name of undo record.
obj
Type: Grasshopper.Kernel.IGH_ActiveObject
Target object for undo record.
Return Value
Type: Guid
The ID of the newly added undo record or Guid.Empty on failure.
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace