Grasshopper SDK
GH_ExpressionString.bracket_open Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected static char bracket_open
Protected Shared bracket_open As Char
Field Value
Type: Char
See Also
Reference
GH_ExpressionString Class
Grasshopper.Kernel.Expressions Namespace