Grasshopper SDK
GH_PersistentGeometryParam<T>.OnVolatileDataCollected Method
 This override removes all instances that fail to load their geometry.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override void OnVolatileDataCollected()
Protected Overrides Sub OnVolatileDataCollected
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace