Grasshopper SDK
GH_MemoryBitmap.PadBitmap Method
 Add padding edges around a bitmap.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Bitmap PadBitmap(
	Image bmp,
	Padding padding,
	Color padding_color
)
Public Shared Function PadBitmap (
	bmp As Image,
	padding As Padding,
	padding_color As Color
) As Bitmap
Parameters
bmp
Type: System.Drawing.Image
Source bitmap.
padding
Type: System.Windows.Forms.Padding
Padding to apply.
padding_color
Type: System.Drawing.Color
Color of padded edges.
Return Value
Type: Bitmap
A new bitmap with padded edges and the same PixelFormat as the original bitmap.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace