Grasshopper SDK
CentralSettings.PreviewPlaneRadius Property
 Gets or sets the global Plane radius.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static double PreviewPlaneRadius { get; set; }
Public Shared Property PreviewPlaneRadius As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.CentralSettings.PreviewPlaneRadius"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace