Grasshopper SDK
IGH_UndoAction.Undo Method
 Undo the action stored in this record.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void Undo(
	GH_Document doc
)
Sub Undo (
	doc As GH_Document
)
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
The target document.
Exceptions
Exception | Condition
GH_UndoException | Thrown when the State flag conflicts with an undo action.
See Also
Reference
IGH_UndoAction Interface
Grasshopper.Kernel.Undo Namespace