Grasshopper SDK
GH_Param<T> Constructor (String, String, String, String, String, GH_ParamAccess)
Initializes a new instance of the GH_Param<T> class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_Param(
	string name,
	string nickname,
	string description,
	string category,
	string subcategory,
	GH_ParamAccess access
)
Protected Sub New (
	name As String,
	nickname As String,
	description As String,
	category As String,
	subcategory As String,
	access As GH_ParamAccess
)
Parameters
name
Type: System.String
nickname
Type: System.String
description
Type: System.String
category
Type: System.String
subcategory
Type: System.String
access
Type: Grasshopper.Kernel.GH_ParamAccess
See Also
Reference
GH_Param<T> Class
GH_Param<T> Overload
Grasshopper.Kernel Namespace