Grasshopper SDK
DataTree<T> Constructor (IEnumerable<T>, GH_Path)
 Create a tree with a single branch
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DataTree(
	IEnumerable<T> data,
	GH_Path root = null
)
Public Sub New (
	data As IEnumerable(Of T),
	Optional root As GH_Path = Nothing
)
Parameters
data
Type: System.Collections.Generic.IEnumerable<T>
Data to append to the tree.
root (Optional)
Type: Grasshopper.Kernel.Data.GH_Path
Branch path of first branch. If Null, the default path is used.
See Also
Reference
DataTree<T> Class
DataTree<T> Overload
Grasshopper Namespace