Grasshopper SDK
GH_CursorServer.ResetCursor Method
 Reset the cursor of the given control to default.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ResetCursor(
	Control control
)
Public Function ResetCursor (
	control As Control
) As Boolean
Parameters
control
Type: System.Windows.Forms.Control
Control to reset.
Return Value
Type: Boolean
True if control was successfully reset, false if iControl is a null reference.
See Also
Reference
GH_CursorServer Class
Grasshopper.GUI Namespace