Grasshopper SDK
GH_Convert.StringToTime Method
 Convert a string representing a time into an pure time. Allowed separators of hour, minute and second portions are colons, semi-colons, points and commas. Grasshopper itself uses colons when formatting times. A PM or AM symbol is allowed provided it does not border on any alphabetical characters. A time can be prefixed by a "X day[s] + " string which defines the total number of 24-hour periods to include.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool StringToTime(
	string text,
	ref DateTime time
)
Public Shared Function StringToTime (
	text As String,
	ByRef time As DateTime
) As Boolean
Parameters
text
Type: System.String
String to parse.
time
Type: System.DateTime
If the string could be parsed, the pure time will be returned here.
Return Value
Type: Boolean
True if string was successfully parsed, false if not.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace