Grasshopper SDK
GH_ColourSwatchEventArgs Constructor
Initializes a new instance of the GH_ColourSwatchEventArgs class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ColourSwatchEventArgs(
	Color colour
)
Public Sub New (
	colour As Color
)
Parameters
colour
Type: System.Drawing.Color
See Also
Reference
GH_ColourSwatchEventArgs Class
Grasshopper.GUI Namespace