Grasshopper SDK
GH_ComponentServer.EmitObjectIcon Method
 Get the icon that is associated with the given Object ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap EmitObjectIcon(
	Guid id
)
Public Function EmitObjectIcon (
	id As Guid
) As Bitmap
Parameters
id
Type: System.Guid
ID to search for.
Return Value
Type: Bitmap
Icon of object or null if object is not defined or if object does not have an icon.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace