Grasshopper SDK
GH_Painter.DrawNULLBuffer Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DrawNULLBuffer()
Public Sub DrawNULLBuffer
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace