Grasshopper SDK
CentralSettings.CanvasRadialMenuChanged Event
 Raised whenever the CanvasRadialMenu setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.CanvasRadialMenuChangedEventHandler CanvasRadialMenuChanged
Public Shared Event CanvasRadialMenuChanged As CentralSettings.CanvasRadialMenuChangedEventHandler
Value
Type: Grasshopper.CentralSettings.CanvasRadialMenuChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace