Grasshopper SDK
GH_Gradient.GripCount Property
 Gets the number of grips in this gradient.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int GripCount { get; }
Public ReadOnly Property GripCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_Gradient.GripCount"]
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace