Grasshopper SDK
Instances.IsDocumentEditorOnTopOfViewports Property
 Gets whether the Grasshopper document editor (or any of its child forms) is obscuring a significant part of the Rhino viewports.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool IsDocumentEditorOnTopOfViewports { get; }
Public Shared ReadOnly Property IsDocumentEditorOnTopOfViewports As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Instances.IsDocumentEditorOnTopOfViewports"]
See Also
Reference
Instances Class
Grasshopper Namespace