Grasshopper SDK
GH_Slider.ControlShadowColour Property
 Gets or sets the Shadow colour for this control.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color ControlShadowColour { get; set; }
Public Property ControlShadowColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.ControlShadowColour"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace