Grasshopper SDK
GH_Convert.ToDate_Primary Method
 Performs a direct cast from DateTime or GH_DateTime.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToDate_Primary(
	Object data,
	ref DateTime destination
)
Public Shared Function ToDate_Primary (
	data As Object,
	ByRef destination As DateTime
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.DateTime
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace