Grasshopper SDK
IGH_ValueProxy.Duplicate Method
 Create an exact duplicate of the type.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_ValueProxy Duplicate()
Function Duplicate As IGH_ValueProxy
Return Value
Type: IGH_ValueProxy
Remarks
Implementors: Do not maintain references to class instances. Copy EVERYTHING.
See Also
Reference
IGH_ValueProxy Interface
Grasshopper.Kernel Namespace