Grasshopper SDK
IGH_Rule.Apply Method
 Applies this rule to an integer.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool Apply(
	int number
)
Function Apply (
	number As Integer
) As Boolean
Parameters
number
Type: System.Int32
Integer to match.
Return Value
Type: Boolean
True if the integer passes the rule test.
See Also
Reference
IGH_Rule Interface
Grasshopper.Kernel.Data Namespace