Grasshopper SDK
GH_MemoryBitmap.Filter_Shift Method
 Shift all values in a specific channel with a specific amount.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_Shift(
	GH_BitmapChannel channel,
	byte amount
)
Public Sub Filter_Shift (
	channel As GH_BitmapChannel,
	amount As Byte
)
Parameters
channel
Type: Grasshopper.Kernel.GH_BitmapChannel
Channel(s) to shift.
amount
Type: System.Byte
Shift amount.
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace