Grasshopper SDK
GH_StandardIcons Class
 Provides access to a set of standard icons.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.GH_StandardIcons
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_StandardIcons
Public NotInheritable Class GH_StandardIcons
The GH_StandardIcons type exposes the following members.
Properties
Name | Description
BlankObjectIcon_24x24
 Gets the base icon for objects; an empty white square.
BlankParameterIcon_24x24
 Gets the base icon for parameters; an empty black hexagon.
ClusterIcon_24x24
 Gets the icon used for clusters.
FileIconDll_32x32
 Gets the file icon used for Dll files.
FileIconExe_32x32
 Gets the file icon used for Exe files.
FileIconGH_32x36
 Gets the file icon used for Grasshopper Binary files.
FileIconGha_32x32
 Gets the file icon used for Gha files.
FileIconGHMissing_32x36
 Gets the file icon used for missing Grasshopper Binary files.
FileIconGHX_32x36
 Gets the file icon used for Grasshopper Xml files.
FileIconGHXMissing_32x36
 Gets the file icon used for missing Grasshopper Xml files.
FileIconRhp_32x32
 Gets the file icon used for Rhp files.
FlattenIcon_24x24
 Gets the trunk icon used to indicate flattening.
GraftIcon_24x24
 Gets the twig icon used to indicate grafting.
GroupIcon_24x24
 Gets the icon used for canvas groups.
UnknownObjectIcon_24x24
 Gets the icon used for objects that do not have their own icon and unknown objects.
UserObjectIcon_24x24
 Gets the icon used for user objects.
Top
See Also
Reference
Grasshopper.GUI Namespace