Grasshopper SDK
GH_SliderBase.ShowTextInputBox Method (Control, Boolean, Matrix, String)
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ShowTextInputBox(
	Control owner,
	bool limitToBoundary,
	Matrix transform,
	string content
)
Public Sub ShowTextInputBox (
	owner As Control,
	limitToBoundary As Boolean,
	transform As Matrix,
	content As String
)
Parameters
owner
Type: System.Windows.Forms.Control
limitToBoundary
Type: System.Boolean
transform
Type: System.Drawing.Drawing2D.Matrix
content
Type: System.String
See Also
Reference
GH_SliderBase Class
ShowTextInputBox Overload
Grasshopper.GUI.Base Namespace