Grasshopper SDK
GH_Skin.zui_fill Field
 Specifies the default fill colour for ZUI elements.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Color zui_fill
Public Shared zui_fill As Color
Field Value
Type: Color
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace