Grasshopper SDK
GH_InstanceDescription.CopyFrom Method
 Copy all fields (except the instance ID) from another instance description.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CopyFrom(
	IGH_InstanceDescription other
)
Public Sub CopyFrom (
	other As IGH_InstanceDescription
)
Parameters
other
Type: Grasshopper.Kernel.IGH_InstanceDescription
Object to mimic.
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace