Grasshopper SDK
GH_ComponentServer.CompareProxies Method
 Compare two object proxies. Names and exposures are taken into account.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int CompareProxies(
	IGH_ObjectProxy A,
	IGH_ObjectProxy B
)
Public Shared Function CompareProxies (
	A As IGH_ObjectProxy,
	B As IGH_ObjectProxy
) As Integer
Parameters
A
Type: Grasshopper.Kernel.IGH_ObjectProxy
First proxy to compare.
B
Type: Grasshopper.Kernel.IGH_ObjectProxy
Second proxy to compare.
Return Value
Type: Int32
 -1 if A is valued lower than B, 0 if A and B are considered equal, +1 if A is valued higher than B.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace