Grasshopper SDK
GH_AutoSaveSettings.AutoSaveFileFormatChanged Event
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_AutoSaveSettings.AutoSaveFileFormatChangedEventHandler AutoSaveFileFormatChanged
Public Shared Event AutoSaveFileFormatChanged As GH_AutoSaveSettings.AutoSaveFileFormatChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_AutoSaveSettings.AutoSaveFileFormatChangedEventHandler
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace