Grasshopper SDK
GH_VarParamEventArgs Class
 Arguments used in Variable Parameter events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_VarParamEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_VarParamEventArgs : EventArgs
Public Class GH_VarParamEventArgs
	Inherits EventArgs
The GH_VarParamEventArgs type exposes the following members.
Constructors
Name | Description
GH_VarParamEventArgs(IGH_Param, GH_VarParamSide)
Initializes a new instance of the GH_VarParamEventArgs class
GH_VarParamEventArgs(IGH_Param, GH_VarParamSide, Int32)
Initializes a new instance of the GH_VarParamEventArgs class
Top
Properties
Name | Description
Index
 Gets the index of the parameter.
Param
 Gets the parameter.
Side
 Gets the side of the parameter.
Top
See Also
Reference
Grasshopper.Kernel Namespace