Grasshopper SDK
GH_FileWatcher.FileChangedSimple Delegate
 Delegate method for file change callbacks.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void FileChangedSimple(
	string filename
)
Public Delegate Sub FileChangedSimple (
	filename As String
)
Parameters
filename
Type: System.String
Path to file that is being watched.
Remarks
See Also
Reference
Grasshopper.Kernel Namespace