Grasshopper SDK
IGH_GooProxy Interface
 Base interface for all type proxies.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_GooProxy
Public Interface IGH_GooProxy
The IGH_GooProxy type exposes the following members.
Properties
Name | Description
IsParsable
 Gets a value indicating whether or not the type can be instantiated from a String.
ProxyOwner
 Gets the piece of Grasshopper data that spawned this proxy.
UserString
 Gets or sets the user-defined string that describes this proxy. This only really makes sense if the Proxy is Parsable.
Valid
 Gets a value indicating whether this proxy represents valid data.
Top
Methods
Name | Description
Construct
 This method will be called when a new instance of this type is constructed. It allows implementers to supply a customized UI to be shown during construction. This method should never throw exceptions.
FormatInstance
 Returns a String description of the current value.
FromString
 If IsParsable(), then attempts to convert the string to a generic type value
MutateString
 Munge a string to remove obvious errors on account of the user.
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace