Grasshopper SDK
GH_Convert.ToBox_Primary Method
 Performs a direct cast from Box. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToBox_Primary(
	Object data,
	ref Box rc
)
Public Shared Function ToBox_Primary (
	data As Object,
	ByRef rc As Box
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Box
Return Value
Type: Boolean
An OnBoundingBox instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace