Grasshopper SDK
Complex.Argument Property
 Gets or sets the complex argument.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Argument { get; set; }
Public Property Argument As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Complex.Argument"]
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace