Grasshopper SDK
GH_DocFilePathEventArgs Class
 These arguments are passed along with FilePathChanged events on GH_Document.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_DocFilePathEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocFilePathEventArgs : EventArgs
Public Class GH_DocFilePathEventArgs
	Inherits EventArgs
The GH_DocFilePathEventArgs type exposes the following members.
Constructors
Name | Description
GH_DocFilePathEventArgs
 Create a new instance of the GH_DocFilePathEventArgs class.
Top
Properties
Name | Description
Document
 Gets the document that raised this event.
NewFilePath
 Gets the new filepath, the one currently assigned to this document.
OldFilePath
 Gets the old filepath, prior to the change that triggered this event.
Top
See Also
Reference
Grasshopper.Kernel Namespace