Grasshopper SDK
GH_Mesh.Transform Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IGH_GeometricGoo Transform(
	Transform xform
)
Public Overrides Function Transform (
	xform As Transform
) As IGH_GeometricGoo
Parameters
xform
Type: Transform
Return Value
Type: IGH_GeometricGoo
See Also
Reference
GH_Mesh Class
Grasshopper.Kernel.Types Namespace