Grasshopper SDK
GH_IndexRange.MaxValue Property
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_IndexRange MaxValue { get; }
Public Shared ReadOnly Property MaxValue As GH_IndexRange
	Get
Property Value
Type: GH_IndexRange
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_IndexRange.MaxValue"]
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace