Grasshopper SDK
CentralSettings.AuthorWebsite Property
 Gets or sets the default author website to be used for all data generated by this Grasshopper installation.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string AuthorWebsite { get; set; }
Public Shared Property AuthorWebsite As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.CentralSettings.AuthorWebsite"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace