Grasshopper SDK
GH_Gradient.Locked Property
 Gets or sets whether this gradient is locked. A locked gradient cannot be modified by the user.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Locked { get; set; }
Public Property Locked As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_Gradient.Locked"]
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace