Grasshopper SDK
GH_Canvas.RemoveTagArtist Method (Guid)
 Remove all IGH_TagArtists from this canvas that match a certain ID.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int RemoveTagArtist(
	Guid artistId
)
Public Function RemoveTagArtist (
	artistId As Guid
) As Integer
Parameters
artistId
Type: System.Guid
ID of IGH_TagArtists to remove.
Return Value
Type: Int32
The number of IGH_TagArtist instances removed.
See Also
Reference
GH_Canvas Class
RemoveTagArtist Overload
Grasshopper.GUI.Canvas Namespace