Grasshopper SDK
GH_ComponentServer.FindObjects Method (String[], Int32)
 Searches the list of cached object proxies for objects that might be implied by a search term.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<IGH_ObjectProxy> FindObjects(
	string[] terms,
	int max_hits
)
Public Function FindObjects (
	terms As String(),
	max_hits As Integer
) As IList(Of IGH_ObjectProxy)
Parameters
terms
Type: System.String[]
Search terms to use.
max_hits
Type: System.Int32
Maximum number of allowed hits.
Return Value
Type: IList<IGH_ObjectProxy>
A sorted list of search results.
See Also
Reference
GH_ComponentServer Class
FindObjects Overload
Grasshopper.Kernel Namespace