Grasshopper SDK
IGH_Attributes.PerformLayout Method
 Recompute the layout for these attributes. This function is automatically called during Drawing operations, so you typically don't have to.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void PerformLayout()
Sub PerformLayout
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace