Grasshopper SDK
GH_Canvas.ViewportChanged Event
 This event is raised whenever the viewport properties are modified, for example when the pan or zoom values are affected.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.ViewportChangedEventHandler ViewportChanged
Public Event ViewportChanged As GH_Canvas.ViewportChangedEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.ViewportChangedEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace