Grasshopper SDK
GH_List Class
 Represents a list of items in the Grasshopper help.
Inheritance Hierarchy
System.Object
 Grasshopper.Documentation.GH_List
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_List : IGH_Content
Public Class GH_List
	Implements IGH_Content
The GH_List type exposes the following members.
Properties
Name | Description
Items
Ordered
Top
Methods
Name | Description
Create(Boolean)
Create(Boolean, IEnumerable<IGH_Content>)
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
Grasshopper.Documentation Namespace