Grasshopper SDK
GH_ExternalFile.FileName Property
 Gets the file name (without the extension).
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ExternalFile.FileName"]
See Also
Reference
GH_ExternalFile Class
Grasshopper.Kernel Namespace