Grasshopper SDK
GH_SliderBase.GripTopColour Property
 Gets or sets the fill colour for the top edge of the slider grip.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color GripTopColour { get; set; }
Public Property GripTopColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.GripTopColour"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace