Grasshopper SDK
GH_Param<T>.RemoveEffects Method
 Remove all post-process effects. Note to implementors, you must call the base method if you override this function.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void RemoveEffects()
Public Overridable Sub RemoveEffects
Implements
IGH_Param.RemoveEffects()
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace