Grasshopper SDK
GH_LexerCombo Constructor
Initializes a new instance of the GH_LexerCombo class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_LexerCombo()
Public Sub New
See Also
Reference
GH_LexerCombo Class
GH_LexerCombo Overload
Grasshopper.Kernel.Data Namespace