Grasshopper SDK
GH_Structure<T>.Clear Method
 Clears the entire structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Clear()
Public Sub Clear
Implements
IGH_Structure.Clear()
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace