Grasshopper SDK
GH_WireSettings Class
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Theme.GH_WireSettings
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_WireSettings
Public Class GH_WireSettings
The GH_WireSettings type exposes the following members.
Properties
Name | Description
DefaultColour
 Gets or sets the colour to use for standard wires.
EmptyColour
 Gets or sets the colour to use for empty wires.
SelectedColour0
 Gets or sets the colour of a wire at the selected extreme.
SelectedColour1
 Gets or sets the colour of a wire at the unselected extreme.
Top
See Also
Reference
Grasshopper.GUI.Theme Namespace