Grasshopper SDK
GH_ContentCollection Class
 Represents an ordered collection of IGH_Content.
Inheritance Hierarchy
System.Object
 Grasshopper.Documentation.GH_ContentCollection
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ContentCollection : IGH_Content
Public Class GH_ContentCollection
	Implements IGH_Content
The GH_ContentCollection type exposes the following members.
Constructors
Name | Description
GH_ContentCollection
Initializes a new instance of the GH_ContentCollection class
Top
Properties
Name | Description
Content
Count
Item
Top
Methods
Name | Description
ToString |  (Overrides Object.ToString().)
Top
See Also
Reference
Grasshopper.Documentation Namespace