Grasshopper SDK
GH_ComponentAttributes Constructor
Initializes a new instance of the GH_ComponentAttributes class
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ComponentAttributes(
	IGH_Component component
)
Public Sub New (
	component As IGH_Component
)
Parameters
component
Type: Grasshopper.Kernel.IGH_Component
See Also
Reference
GH_ComponentAttributes Class
Grasshopper.Kernel.Attributes Namespace