Grasshopper SDK
GH_Animator<T> Constructor (T, T, DateTime, DateTime, GH_Animator<T>.Interpolate)
 Create a new instance of the generic animator.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Animator(
	T A,
	T B,
	DateTime startTime,
	DateTime endTime,
	GH_Animator<T>.Interpolate interpolator
)
Public Sub New (
	A As T,
	B As T,
	startTime As DateTime,
	endTime As DateTime,
	interpolator As GH_Animator<T>.Interpolate
)
Parameters
A
Type: T
Start value of animation.
B
Type: T
End value of animation.
startTime
Type: System.DateTime
Start of animation, should be expressed in UTC time.
endTime
Type: System.DateTime
End of animation, should be expressed in UTC time.
interpolator
Type: Grasshopper.GUI.GH_Animator<T>.Interpolate
Interpolation delegate.
See Also
Reference
GH_Animator<T> Class
GH_Animator<T> Overload
Grasshopper.GUI Namespace