Grasshopper SDK
GH_Point.DrawViewportMeshes Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DrawViewportMeshes(
	GH_PreviewMeshArgs args
)
Public Sub DrawViewportMeshes (
	args As GH_PreviewMeshArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_PreviewMeshArgs
Implements
IGH_PreviewData.DrawViewportMeshes(GH_PreviewMeshArgs)
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace