Grasshopper SDK
Complex.NegativeInfinity Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Complex NegativeInfinity { get; }
Public Shared ReadOnly Property NegativeInfinity As Complex
	Get
Property Value
Type: Complex
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Complex.NegativeInfinity"]
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace