Grasshopper SDK
GH_SliderBase.RenderDelegate_Grip Property
 Gets or sets the delegate called after the grip of the slider has been drawn.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SliderBase.DrawSliderChannel RenderDelegate_Grip { get; set; }
Public Property RenderDelegate_Grip As GH_SliderBase.DrawSliderChannel
	Get
	Set
Property Value
Type: GH_SliderBase.DrawSliderChannel
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.RenderDelegate_Grip"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace