Grasshopper SDK
GH_Path.CompareTo Method
 Compare this path to another path. This function determines the Sorting behaviour of paths.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int CompareTo(
	GH_Path other
)
Public Function CompareTo (
	other As GH_Path
) As Integer
Parameters
other
Type: Grasshopper.Kernel.Data.GH_Path
Return Value
Type: Int32
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace