Grasshopper SDK
GH_UndoAction Class
 Base class implementation for undo actions.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.Actions.GH_AddObjectAction
 Grasshopper.Kernel.Undo.Actions.GH_WireAction
 Grasshopper.Kernel.Undo.GH_ArchivedUndoAction
 Grasshopper.Kernel.Undo.GH_ObjectUndoAction
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_UndoAction : IGH_UndoAction
Public MustInherit Class GH_UndoAction
	Implements IGH_UndoAction
The GH_UndoAction type exposes the following members.
Constructors
Name | Description
GH_UndoAction
Initializes a new instance of the GH_UndoAction class
Top
Properties
Name | Description
ExpiresDisplay
 Override this property if you want the Rhino viewport display to refresh upon undo completion.
ExpiresSolution
 Override this property if you want the Grasshopper solution to refresh upon undo completion.
State
Top
Methods
Name | Description
Internal_Redo
Internal_Undo
Read
Redo
Undo
Write
Top
See Also
Reference
Grasshopper.Kernel.Undo Namespace