Grasshopper SDK
GH_Viewport.XFormMatrix Method
 Gets the display transformation cached by this viewport.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Matrix XFormMatrix(
	GH_Viewport.GH_DisplayMatrix projection
)
Public Function XFormMatrix (
	projection As GH_Viewport.GH_DisplayMatrix
) As Matrix
Parameters
projection
Type: Grasshopper.GUI.Canvas.GH_Viewport.GH_DisplayMatrix
Return Value
Type: Matrix
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace