Grasshopper SDK
GH_Document.DefaultSelectedPreviewColourChanged Event
 This even is raised whenever the global default for Selected preview colour is changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_Document.DefaultSelectedPreviewColourChangedEventHandler DefaultSelectedPreviewColourChanged
Public Shared Event DefaultSelectedPreviewColourChanged As GH_Document.DefaultSelectedPreviewColourChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.DefaultSelectedPreviewColourChangedEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace