Grasshopper SDK
GH_DocumentObject.SetValue Method (String, String)
 Set a named value. This value will be serialized with the component.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void SetValue(
	string name,
	string value
)
Protected Sub SetValue (
	name As String,
	value As String
)
Parameters
name
Type: System.String
Name of value.
value
Type: System.String
Value itself.
See Also
Reference
GH_DocumentObject Class
SetValue Overload
Grasshopper.Kernel Namespace