Grasshopper SDK
GH_Param<T>.AddSource Method (IGH_Param, Int32)
 Insert a new Source parameter into the Sources list. Sources provide this parameter with data at runtime.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void AddSource(
	IGH_Param source,
	int index
)
Public Overridable Sub AddSource (
	source As IGH_Param,
	index As Integer
)
Parameters
source
Type: Grasshopper.Kernel.IGH_Param
Source to append.
index
Type: System.Int32
Insertion index of source.
Implements
IGH_Param.AddSource(IGH_Param, Int32)
See Also
Reference
GH_Param<T> Class
AddSource Overload
Grasshopper.Kernel Namespace