Grasshopper SDK
GH_Component.ProcessorTime Property
 Gets the total processor time (profiler) spend by this component and all input parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override TimeSpan ProcessorTime { get; }
Public Overrides ReadOnly Property ProcessorTime As TimeSpan
	Get
Property Value
Type: TimeSpan
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.ProcessorTime"]
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace