Grasshopper SDK
GH_BracketMismatchException Constructor
Initializes a new instance of the GH_BracketMismatchException class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_BracketMismatchException()
Public Sub New
See Also
Reference
GH_BracketMismatchException Class
GH_BracketMismatchException Overload
Grasshopper.Kernel.Data Namespace