Grasshopper SDK
Instances.UnloadAllObjects Method
 Clears and unloads all cached objects. This function is called by the _GrasshopperUnloadPlugin command. Please don't use it.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void UnloadAllObjects()
Public Shared Sub UnloadAllObjects
See Also
Reference
Instances Class
Grasshopper Namespace