Grasshopper SDK
GH_ExternalFile.IsIdenticalTo Method
 Compares two files for content. If the size and the hash or the other file are equal to this one, the files are considered identical.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsIdenticalTo(
	GH_ExternalFile other
)
Public Function IsIdenticalTo (
	other As GH_ExternalFile
) As Boolean
Parameters
other
Type: Grasshopper.Kernel.GH_ExternalFile
Return Value
Type: Boolean
See Also
Reference
GH_ExternalFile Class
Grasshopper.Kernel Namespace