Grasshopper SDK
GH_ValueProxy<T> Constructor
 Default constructor for the base class. All derived classes must call this constructor.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_ValueProxy(
	T nValue,
	string nProxyName,
	bool bIsStringProxy
)
Protected Sub New (
	nValue As T,
	nProxyName As String,
	bIsStringProxy As Boolean
)
Parameters
nValue
Type: T
The value to store in this proxy
nProxyName
Type: System.String
The human-friendly name of this value type
bIsStringProxy
Type: System.Boolean
If True, then this proxy becomes Parsable.
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace