Grasshopper SDK
GH_Convert.PureDateTicks Field
 Represents the total number of ticks past midnight that (by Grasshopper convention) identifies a pure date.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const long PureDateTicks = 1
Public Const PureDateTicks As Long = 1
Field Value
Type: Int64
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace