Grasshopper SDK
GH_RuntimeFile.TagPronunciation Field
 String tag used to identify Pronunciaion Guide fields (IPA) in glossary source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagPronunciation = "PRONUNCIATION"
Public Const TagPronunciation As String = "PRONUNCIATION"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace