Grasshopper SDK
GH_RuntimeFile.Path Property
 Gets the path of this help file.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_RuntimeFile.Path"]
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace