Grasshopper SDK
GH_Viewport.Project Method
 Transform a point from canvas into control coordinate space.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Project(
	ref PointF pt
)
Public Sub Project (
	ByRef pt As PointF
)
Parameters
pt
Type: System.Drawing.PointF
Point to transform.
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace