Grasshopper SDK
GH_RenderArgs.MaterialNormal Property
 Gets the material hint to use for unselected objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RenderMaterial MaterialNormal { get; }
Public ReadOnly Property MaterialNormal As RenderMaterial
	Get
Property Value
Type: RenderMaterial
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RenderArgs.MaterialNormal"]
See Also
Reference
GH_RenderArgs Class
Grasshopper.Kernel Namespace