Grasshopper SDK
GH_Attributes<T>.RespondToMouseDoubleClick Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual GH_ObjectResponse RespondToMouseDoubleClick(
	GH_Canvas sender,
	GH_CanvasMouseEvent e
)
Public Overridable Function RespondToMouseDoubleClick (
	sender As GH_Canvas,
	e As GH_CanvasMouseEvent
) As GH_ObjectResponse
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
e
Type: Grasshopper.GUI.GH_CanvasMouseEvent
Return Value
Type: GH_ObjectResponse
Implements
IGH_ResponsiveObject.RespondToMouseDoubleClick(GH_Canvas, GH_CanvasMouseEvent)
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace