Grasshopper SDK
GH_Format.FormatMeshFace Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatMeshFace(
	GH_MeshFace data
)
Public Shared Function FormatMeshFace (
	data As GH_MeshFace
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_MeshFace
Return Value
Type: String
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace