Grasshopper SDK
GH_MemoryBitmap.SizeOf Property
 Gets the size (in bytes) of the local image.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int SizeOf { get; }
Public ReadOnly Property SizeOf As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_MemoryBitmap.SizeOf"]
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace