Grasshopper SDK
GH_FieldElement.IsCoincident Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool IsCoincident(
	Point3d point,
	double tolerance
)
Public Overridable Function IsCoincident (
	point As Point3d,
	tolerance As Double
) As Boolean
Parameters
point
Type: Point3d
tolerance
Type: System.Double
Return Value
Type: Boolean
Implements
IGH_FieldElement.IsCoincident(Point3d, Double)
See Also
Reference
GH_FieldElement Class
Grasshopper.Kernel.Types Namespace