Grasshopper SDK
GH_GeometricGoo<T>.DuplicateGeometry Method
 Make a complete duplicate of this geometry. No shallow copies.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract IGH_GeometricGoo DuplicateGeometry()
Public MustOverride Function DuplicateGeometry As IGH_GeometricGoo
Return Value
Type: IGH_GeometricGoo
Implements
IGH_GeometricGoo.DuplicateGeometry()
Remarks
Each class that implements this interface should also provide a type specific duplication method
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace