Grasshopper SDK
IGH_InitCodeAware Interface
 Implement this interface in your IGH_DocumentObject class if you want to handle initialization codes from Canvas Search boxes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_InitCodeAware
Public Interface IGH_InitCodeAware
The IGH_InitCodeAware type exposes the following members.
Methods
Name | Description
SetInitCode
 This method will be called when the user inserts an object via the Canvas Search popup and supplies an "=XXXX" string init code. Do not throw exceptions in this method! Either handle the code correctly or ignore it.
Top
See Also
Reference
Grasshopper.Kernel Namespace