Grasshopper SDK
GH_AssemblyInfo.AuthorName Property
 Gets the name of the individual/company/organisation that is responsible for this assembly. Return null if you do not wish to associate an author with this assembly.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual string AuthorName { get; }
Public Overridable ReadOnly Property AuthorName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.AuthorName"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace