Grasshopper SDK
Coordinates3d<T> Delegate
 Delegate for coordinate retrieval.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void Coordinates3d<T>(
	T element,
	out double x,
	out double y,
	out double z
)
Public Delegate Sub Coordinates3d(Of T) (
	element As T,
	<OutAttribute> ByRef x As Double,
	<OutAttribute> ByRef y As Double,
	<OutAttribute> ByRef z As Double
)
Parameters
element
Type: T
Element to retrieve coordinates from.
x
Type: System.Double
X coordinate of element.
y
Type: System.Double
Y coordinate of element.
z
Type: System.Double
Z coordinate of element.
Type Parameters
T
Element type.
See Also
Reference
Grasshopper.Kernel.Geometry.SpatialTrees Namespace