Grasshopper SDK
IGH_Attributes.InvalidateCanvas Method
 If the mouse location should cause a canvas invalidation then return true. You only need to override this function if you draw objects that are dependant on cursor positions outside the bounds of the attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool InvalidateCanvas(
	GH_Canvas canvas,
	GH_CanvasMouseEvent e
)
Function InvalidateCanvas (
	canvas As GH_Canvas,
	e As GH_CanvasMouseEvent
) As Boolean
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas to potentially invalidate.
e
Type: Grasshopper.GUI.GH_CanvasMouseEvent
Event arguments for canvas mousemove.
Return Value
Type: Boolean
True if the canvas ought to be invalidated.
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace