Grasshopper SDK
GH_AsynchFileData.StartPeriodicUpdate Method (Int32)
 Starts periodic updating (from now).
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void StartPeriodicUpdate(
	int period
)
Public Sub StartPeriodicUpdate (
	period As Integer
)
Parameters
period
Type: System.Int32
Milliseconds between updates.
See Also
Reference
GH_AsynchFileData Class
StartPeriodicUpdate Overload
Grasshopper.GUI Namespace