Grasshopper SDK
GH_Document.SetEnabledFlags Method (List<IGH_DocumentObject>, Boolean)
 Set the enabled flags of all specified objects to true or false
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetEnabledFlags(
	List<IGH_DocumentObject> objects,
	bool bEnable
)
Public Sub SetEnabledFlags (
	objects As List(Of IGH_DocumentObject),
	bEnable As Boolean
)
Parameters
objects
Type: System.Collections.Generic.List<IGH_DocumentObject>
bEnable
Type: System.Boolean
See Also
Reference
GH_Document Class
SetEnabledFlags Overload
Grasshopper.Kernel Namespace