Grasshopper SDK
GH_MeshFace Constructor (MeshFace)
 Create a duplicate of another mesh face.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_MeshFace(
	MeshFace other
)
Public Sub New (
	other As MeshFace
)
Parameters
other
Type: MeshFace
Mesh face to duplicate.
See Also
Reference
GH_MeshFace Class
GH_MeshFace Overload
Grasshopper.Kernel.Types Namespace