Grasshopper SDK
GH_DocumentSettings Enumeration
 Enumerates all possible types of settings for a GH_Document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_DocumentSettings
Public Enumeration GH_DocumentSettings
Members
Member name | Value | Description
Preview | 0
Properties | 1
See Also
Reference
Grasshopper.Kernel Namespace