Grasshopper SDK
GH_ColourPicker.ShowChannelSliders Property
 Gets or sets whether the channel sliders are included.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ShowChannelSliders { get; set; }
Public Property ShowChannelSliders As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_ColourPicker.ShowChannelSliders"]
See Also
Reference
GH_ColourPicker Class
Grasshopper.GUI Namespace