Grasshopper SDK
GH_Animator.InterpolatePoint Method
 Utility interpolation delegate for System.Drawing.Point values.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Point InterpolatePoint(
	Point A,
	Point B,
	double factor
)
Public Shared Function InterpolatePoint (
	A As Point,
	B As Point,
	factor As Double
) As Point
Parameters
A
Type: System.Drawing.Point
B
Type: System.Drawing.Point
factor
Type: System.Double
Return Value
Type: Point
See Also
Reference
GH_Animator Class
Grasshopper.GUI Namespace