Grasshopper SDK
GH_ExpressionString Constructor
Initializes a new instance of the GH_ExpressionString class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ExpressionString(
	string in
)
Public Sub New (
	in As String
)
Parameters
in
Type: System.String
See Also
Reference
GH_ExpressionString Class
Grasshopper.Kernel.Expressions Namespace