Grasshopper SDK
GH_CanvasMouseEvent.Clicks Property
 Gets the number of times the mouse button was pressed and released.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Clicks { get; }
Public ReadOnly Property Clicks As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasMouseEvent.Clicks"]
See Also
Reference
GH_CanvasMouseEvent Class
Grasshopper.GUI Namespace