Grasshopper SDK
GH_Time Constructor
 Blank constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Time()
Public Sub New
See Also
Reference
GH_Time Class
GH_Time Overload
Grasshopper.Kernel.Types Namespace