Grasshopper SDK
Complex.IsRealNonNegative Property
 Gets whether this complex number only has a positive real component.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsRealNonNegative { get; }
Public ReadOnly Property IsRealNonNegative As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Complex.IsRealNonNegative"]
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace