Grasshopper SDK
GH_Interval2D.GH_Interval2DProxy.UIsIncreasing Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool UIsIncreasing { get; set; }
Public Property UIsIncreasing As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Interval2D.GH_Interval2DProxy.UIsIncreasing"]
See Also
Reference
GH_Interval2D.GH_Interval2DProxy Class
Grasshopper.Kernel.Types Namespace