Grasshopper SDK
GH_Format.FormatInteger Method (Int32)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatInteger(
	int data
)
Public Shared Function FormatInteger (
	data As Integer
) As String
Parameters
data
Type: System.Int32
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatInteger Overload
Grasshopper.Kernel Namespace