Grasshopper SDK
GH_FieldElement Class
 Abstract implementation of IGH_FieldElement, derive from this class rather than implementing IGH_FieldElement to save yourself time and effort.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_FieldElement
 Grasshopper.Kernel.Types.GH_LineCharge
 Grasshopper.Kernel.Types.GH_PointCharge
 Grasshopper.Kernel.Types.GH_SpinForce
 Grasshopper.Kernel.Types.GH_VectorForce
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_FieldElement : IGH_FieldElement
Public MustInherit Class GH_FieldElement
	Implements IGH_FieldElement
The GH_FieldElement type exposes the following members.
Constructors
Name | Description
GH_FieldElement
Initializes a new instance of the GH_FieldElement class
Top
Properties
Name | Description
BoundingBox
ClippingBox
ElementGuid
IsLimited
Limits
Top
Methods
Name | Description
DrawViewportMeshes
DrawViewportWires
Duplicate
Force
IsCoincident
Read
Write
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace