Grasshopper SDK
GH_PaletteStyle Constructor (Color)
 Construct a new GH_Box_Palette_Colours instance with a single base colour.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PaletteStyle(
	Color fill
)
Public Sub New (
	fill As Color
)
Parameters
fill
Type: System.Drawing.Color
Colour to use for background fills. All other colours are computed based on this colour.
See Also
Reference
GH_PaletteStyle Class
GH_PaletteStyle Overload
Grasshopper.GUI.Canvas Namespace