Grasshopper SDK
GH_PreviewMeshArgs.Pipeline Property
 Gets the Display Pipeline we're currently drawing with.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DisplayPipeline Pipeline { get; }
Public ReadOnly Property Pipeline As DisplayPipeline
	Get
Property Value
Type: DisplayPipeline
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewMeshArgs.Pipeline"]
See Also
Reference
GH_PreviewMeshArgs Class
Grasshopper.Kernel Namespace