Grasshopper SDK
IGH_DataAccess.SetData Method (String, Object)
 Stores data in an output parameter during GH_Component.SolveInstance().
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool SetData(
	string paramName,
	Object data
)
Function SetData (
	paramName As String,
	data As Object
) As Boolean
Parameters
paramName
Type: System.String
Name of the output parameter at which to store the data.
data
Type: System.Object
Data to store. Data will be converted if necessary, but it will not be duplicated automatically.
Return Value
Type: Boolean
Remarks
Parameter access by index is faster, consider using the other overload if possible.
See Also
Reference
IGH_DataAccess Interface
SetData Overload
Grasshopper.Kernel Namespace