Grasshopper SDK
IGH_GeometricGoo.Boundingbox Property
 Gets the (cached) boundingbox for this geometry. Not all geometry types cache boundingbox results.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
BoundingBox Boundingbox { get; }
ReadOnly Property Boundingbox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_GeometricGoo.Boundingbox"]
Return Value
Type: BoundingBox
The boundingbox for this piece of geometry or Boundingbox.Empty if the geometry is null or invalid.
See Also
Reference
IGH_GeometricGoo Interface
Grasshopper.Kernel.Types Namespace