Grasshopper SDK
GH_TrackerFrame.Keys Field
 The state of the modifier keys (Contro, Shift and Alt) of the frame.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Keys Keys
Public Keys As Keys
Field Value
Type: Keys
See Also
Reference
GH_TrackerFrame Structure
Grasshopper.GUI Namespace