Grasshopper SDK
GH_LinkedParamAttributes.HasOutputGrip Property
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool HasOutputGrip { get; }
Public Overrides ReadOnly Property HasOutputGrip As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Attributes.GH_LinkedParamAttributes.HasOutputGrip"]
See Also
Reference
GH_LinkedParamAttributes Class
Grasshopper.Kernel.Attributes Namespace