Grasshopper SDK
GH_PreviewUtil.Dispose Method
Releases all resources used by the GH_PreviewUtil
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace