Grasshopper SDK
Node3d<T>.NearestItem Method (Double, Double, Double, Validation3d<T>)
 Find the nearest item using custom validation criteria.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Index3d<T> NearestItem(
	double x,
	double y,
	double z,
	Validation3d<T> validationDelegate
)
Public Function NearestItem (
	x As Double,
	y As Double,
	z As Double,
	validationDelegate As Validation3d(Of T)
) As Index3d(Of T)
Parameters
x
Type: System.Double
x coordinate to search from.
y
Type: System.Double
y coordinate to search from.
z
Type: System.Double
z coordinate to search from.
validationDelegate
Type: Grasshopper.Kernel.Geometry.SpatialTrees.Validation3d<T>
Item validation delegate.
Return Value
Type: Index3d<T>
The index of the nearest item or null if no nearest item could be found.
See Also
Reference
Node3d<T> Class
NearestItem Overload
Grasshopper.Kernel.Geometry.SpatialTrees Namespace