Grasshopper SDK
GH_Convert.ToMatrix_Primary Method
 Performs a direct cast from Matrix or GH_Matrix.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToMatrix_Primary(
	Object data,
	ref Matrix rc
)
Public Shared Function ToMatrix_Primary (
	data As Object,
	ByRef rc As Matrix
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Matrix
[out] Matrix cast.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace