Grasshopper SDK
GH_DocumentServer.DocumentCount Property
 Gets the number of documents stored in the global list.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int DocumentCount { get; }
Public ReadOnly Property DocumentCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentServer.DocumentCount"]
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace