Grasshopper SDK
GH_ConnectivityDisparity Class
 Maintains two connectivity diagrams, one of which is a subset of the other.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_ConnectivityDisparity
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ConnectivityDisparity
Public Class GH_ConnectivityDisparity
The GH_ConnectivityDisparity type exposes the following members.
Constructors
Name | Description
GH_ConnectivityDisparity
 Create a new instance of the Connectivity Disparity utility class.
Top
Properties
Name | Description
SubNodes
 Gets a proxy for all the Nodes in the Subset diagram.
SubSet
 Gets a pointer to the subset diagram stored in this disparity class.
TopNodes
 Gets a proxy for all the Nodes in the Top Level diagram.
TopSet
 Gets a pointer to the complete diagram stored in this disparity class.
Top
Methods
Name | Description
ExternalInputs
 Find all external sources for a given id in the subset.
ExternalOutputs
 Find all external recipients for a given id in the subset.
InternalInputs
 Find all internal sources for a given id in the subset.
InternalOutputs
 Find all external recipients for a given id in the subset.
Top
See Also
Reference
Grasshopper.Kernel Namespace