Grasshopper SDK
GH_ColourPickerBase.PickColour Property
 Gets the picked colour.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color PickColour { get; }
Public ReadOnly Property PickColour As Color
	Get
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.PickColour"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace