Grasshopper SDK
CentralSettings.ComponentCascadeMenusChanged Event
 Raised whenever the ComponentCascadeMenus setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.ComponentCascadeMenusChangedEventHandler ComponentCascadeMenusChanged
Public Shared Event ComponentCascadeMenusChanged As CentralSettings.ComponentCascadeMenusChangedEventHandler
Value
Type: Grasshopper.CentralSettings.ComponentCascadeMenusChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace