Grasshopper SDK
GH_GraphicsUtil.EtchVertical Method (Graphics, Single, Single, Single, Int32)
 Draws an etched line segment.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void EtchVertical(
	Graphics g,
	float x,
	float y0,
	float y1,
	int alpha = 50
)
Public Shared Sub EtchVertical (
	g As Graphics,
	x As Single,
	y0 As Single,
	y1 As Single,
	Optional alpha As Integer = 50
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
x
Type: System.Single
x component of line segment.
y0
Type: System.Single
x component of start point.
y1
Type: System.Single
y component of end point.
alpha (Optional)
Type: System.Int32
Alpha level of etched line.
See Also
Reference
GH_GraphicsUtil Class
EtchVertical Overload
Grasshopper.GUI Namespace