Grasshopper SDK
GH_Author.Address Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Address { get; set; }
Public Property Address As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Author.Address"]
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace