Grasshopper SDK
Identity Class
 Implements a null-transform.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.Transforms.Identity
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class Identity : ITransform
Public Class Identity
	Implements ITransform
The Identity type exposes the following members.
Constructors
Name | Description
Identity
Initializes a new instance of the Identity class
Top
Properties
Name | Description
Name
Top
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Grasshopper.Kernel.Types.Transforms Namespace