Grasshopper SDK
GH_Format.FormatArc Method (GH_Arc)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatArc(
	GH_Arc data
)
Public Shared Function FormatArc (
	data As GH_Arc
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Arc
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatArc Overload
Grasshopper.Kernel Namespace