Grasshopper SDK
IGH_GooProxy.ProxyOwner Property
 Gets the piece of Grasshopper data that spawned this proxy.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_Goo ProxyOwner { get; }
ReadOnly Property ProxyOwner As IGH_Goo
	Get
Property Value
Type: IGH_Goo
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.IGH_GooProxy.ProxyOwner"]
See Also
Reference
IGH_GooProxy Interface
Grasshopper.Kernel.Types Namespace