Grasshopper SDK
GH_Convert.ToBrep_Secondary Method
 Attempts to convert other data types into an OnBrep. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToBrep_Secondary(
	Object data,
	ref Brep rc
)
Public Shared Function ToBrep_Secondary (
	data As Object,
	ByRef rc As Brep
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Brep
Return Value
Type: Boolean
An OnBrep instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace