Grasshopper SDK
GH_DocumentObject.IconDisplayMode Property
 Gets the current display mode of the object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_IconDisplayMode IconDisplayMode { get; set; }
Public Property IconDisplayMode As GH_IconDisplayMode
	Get
	Set
Property Value
Type: GH_IconDisplayMode
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentObject.IconDisplayMode"]
Implements
IGH_DocumentObject.IconDisplayMode
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace