Grasshopper SDK
GH_DocumentObject.OnObjectChanged Method (GH_ObjectEventType)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnObjectChanged(
	GH_ObjectEventType eventType
)
Public Sub OnObjectChanged (
	eventType As GH_ObjectEventType
)
Parameters
eventType
Type: Grasshopper.Kernel.GH_ObjectEventType
Implements
IGH_DocumentObject.OnObjectChanged(GH_ObjectEventType)
See Also
Reference
GH_DocumentObject Class
OnObjectChanged Overload
Grasshopper.Kernel Namespace