Grasshopper SDK
GH_MenuTextBox.KeyDownEventHandler Delegate
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void KeyDownEventHandler(
	GH_MenuTextBox sender,
	KeyEventArgs e
)
Public Delegate Sub KeyDownEventHandler (
	sender As GH_MenuTextBox,
	e As KeyEventArgs
)
Parameters
sender
Type: Grasshopper.GUI.GH_MenuTextBox
e
Type: System.Windows.Forms.KeyEventArgs
See Also
Reference
Grasshopper.GUI Namespace