Grasshopper SDK
GH_List.Create Method (Boolean, IEnumerable<IGH_Content>)
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_List Create(
	bool ordered,
	IEnumerable<IGH_Content> items
)
Public Shared Function Create (
	ordered As Boolean,
	items As IEnumerable(Of IGH_Content)
) As GH_List
Parameters
ordered
Type: System.Boolean
items
Type: System.Collections.Generic.IEnumerable<IGH_Content>
Return Value
Type: GH_List
See Also
Reference
GH_List Class
Create Overload
Grasshopper.Documentation Namespace