Grasshopper SDK
GH_Line Constructor
 Default constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Line()
Public Sub New
See Also
Reference
GH_Line Class
GH_Line Overload
Grasshopper.Kernel.Types Namespace