Grasshopper SDK
GH_Field.CurvatureAt Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double CurvatureAt(
	Point3d location
)
Public Function CurvatureAt (
	location As Point3d
) As Double
Parameters
location
Type: Point3d
Return Value
Type: Double
See Also
Reference
GH_Field Class
Grasshopper.Kernel.Types Namespace