Grasshopper SDK
IGH_Param.AddVolatileDataList Method
 Inserts a list of items into the data structure.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool AddVolatileDataList(
	GH_Path path,
	IEnumerable list
)
Function AddVolatileDataList (
	path As GH_Path,
	list As IEnumerable
) As Boolean
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
The branch path of the data. If the path doesn't exist yet, it will be created.
list
Type: System.Collections.IEnumerable
The data list to store.
Return Value
Type: Boolean
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace