Grasshopper SDK
GH_InstanceDescription.ReadFull Method
 GH_InstanceDescription does not by default serialize all fields. Use this function to read all fields from the archive. This method is compatible with the default Write()/Read() operations.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool ReadFull(
	GH_IReader reader
)
Public Overridable Function ReadFull (
	reader As GH_IReader
) As Boolean
Parameters
reader
Type: GH_IO.Serialization.GH_IReader
Writer for deserialization.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace