Grasshopper SDK
Instances.AutoHideBanner Property
 Gets or sets a value indicating whether the banner ought to be hidden automatically when loading completes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool AutoHideBanner { get; set; }
Public Shared Property AutoHideBanner As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Instances.AutoHideBanner"]
See Also
Reference
Instances Class
Grasshopper Namespace