Grasshopper SDK
GH_ComponentParamServer.ParameterChanged Event
 Raised whenever there is a change to any parameter. If you only care about NickName or Source changes, handle the ParameterNickNameChanged or ParameterSourcesChanged events instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_ComponentParamServer.ParameterChangedEventHandler ParameterChanged
Public Event ParameterChanged As GH_ComponentParamServer.ParameterChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_ComponentParamServer.ParameterChangedEventHandler
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace