Grasshopper SDK
IGH_Param.SourceCount Property
 Gets the number of sources for this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int SourceCount { get; }
ReadOnly Property SourceCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.SourceCount"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace