Grasshopper SDK
GH_CanvasDropTargetValidator.DropDelegate Property
 Gets or sets the delegate to be invoked when a component is dropped inside the dropregion.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Action DropDelegate { get; set; }
Public Property DropDelegate As Action
	Get
	Set
Property Value
Type: Action
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasDropTargetValidator.DropDelegate"]
See Also
Reference
GH_CanvasDropTargetValidator Class
Grasshopper.GUI.Canvas Namespace