Grasshopper SDK
GH_Time Constructor (GH_Time)
Initializes a new instance of the GH_Time class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Time(
	GH_Time other
)
Public Sub New (
	other As GH_Time
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Time
See Also
Reference
GH_Time Class
GH_Time Overload
Grasshopper.Kernel.Types Namespace