Grasshopper SDK
GH_VerticalSeparator Class
 GUI elements for creating visual separations.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.Panel
 Grasshopper.GUI.GH_DoubleBufferedPanel
 Grasshopper.GUI.GH_VerticalSeparator
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_VerticalSeparator : GH_DoubleBufferedPanel
Public Class GH_VerticalSeparator
	Inherits GH_DoubleBufferedPanel
The GH_VerticalSeparator type exposes the following members.
Constructors
Name | Description
GH_VerticalSeparator
Initializes a new instance of the GH_VerticalSeparator class
Top
Methods
Name | Description
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
Top
See Also
Reference
Grasshopper.GUI Namespace