Grasshopper SDK
GH_PointRefData.SetCurveDistFromEndParam Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected bool SetCurveDistFromEndParam(
	Curve c,
	double t
)
Protected Function SetCurveDistFromEndParam (
	c As Curve,
	t As Double
) As Boolean
Parameters
c
Type: Curve
t
Type: System.Double
Return Value
Type: Boolean
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace