Grasshopper SDK
GH_DocumentObject.ExpireSolution Method
 Call this function whenever you do something which expires the current solution. This will make sure all caches are erased, all downstream objects are expired and that the event is raised. The default implementation merely places a call to OnSolutionExpired(), override this function in derived classes to make sure you clear local data caches and expire downstream objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void ExpireSolution(
	bool recompute
)
Public Overridable Sub ExpireSolution (
	recompute As Boolean
)
Parameters
recompute
Type: System.Boolean
If True, the solution will be recomputed straight away.
Implements
IGH_DocumentObject.ExpireSolution(Boolean)
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace