Grasshopper SDK
GH_AutoSaveSettings Class
 Provides access to all AutoSave event flags.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_AutoSaveSettings
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_AutoSaveSettings
Public NotInheritable Class GH_AutoSaveSettings
The GH_AutoSaveSettings type exposes the following members.
Constructors
Name | Description
GH_AutoSaveSettings
Initializes a new instance of the GH_AutoSaveSettings class
Top
Properties
Name | Description
EnableAutoSave
SaveOnDataFlattening
SaveOnDocumentUnload
SaveOnObjectAdded
SaveOnObjectChange
SaveOnObjectRemoved
SaveOnWireEvent
Top
Methods
Name | Description
AutosaveFilter
 Tests a given trigger to see if it allows an autosave operation.
Top
Events
Name | Description
AutoSaveFileFormatChanged
EnableAutoSaveChanged
SaveOnDataFlatteningChanged
SaveOnDocumentUnloadChanged
SaveOnObjectAddedChanged
SaveOnObjectChangeChanged
SaveOnObjectRemovedChanged
SaveOnWireEventChanged
Top
See Also
Reference
Grasshopper.Kernel Namespace