Grasshopper SDK
DataTree<T>.TrimExcess Method
 Trims the excess allocated memory in all branches
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void TrimExcess()
Public Sub TrimExcess
See Also
Reference
DataTree<T> Class
Grasshopper Namespace