Grasshopper SDK
GH_Param<T>.ProxySourceCount Property
 Gets the number of proxy sources for this parameter. Proxy sources are used during file IO, when actual sources might not be available yet. Once an IO operation has been completed there should be no more proxy sources.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual int ProxySourceCount { get; }
Public Overridable ReadOnly Property ProxySourceCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.ProxySourceCount"]
Return Value
Type: Int32
The number of proxy sources associated with this parameter.
Implements
IGH_Param.ProxySourceCount
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace