Grasshopper SDK
Instances.AutoShowBanner Property
 Gets or sets a value indicating whether or not the banner will be displayed during the ComponentServer Loading process.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool AutoShowBanner { get; set; }
Public Shared Property AutoShowBanner As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Instances.AutoShowBanner"]
See Also
Reference
Instances Class
Grasshopper Namespace