Grasshopper SDK
GH_FileWatcher Class
 Provides easy mechanisms to monitor changes to the local File System.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_FileWatcher
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_FileWatcher : IDisposable
Public Class GH_FileWatcher
	Implements IDisposable
The GH_FileWatcher type exposes the following members.
Properties
Name | Description
Active
 Gets or sets the active flag on this watcher.
Buffer
 Gets or sets the time during which events are buffered. If multiple events for the same file occur within the buffered timespan, they will be merged into one event.
InvokeOnDefaultThread
 Gets or sets invoke behaviour for events. If true, then the event delegate is called via the Grasshopper main UI thread. This is almost always what you need.
IsDisposed
Path
 Gets the file or folder path currently being watched.
Top
Methods
Name | Description
CreateDirectoryWatcher(String, String, GH_FileWatcherEvents, GH_FileWatcher.FileChanged)
 Create a new FileSystem Watcher object aimed at a specific file.
CreateDirectoryWatcher(String, String, GH_FileWatcherEvents, GH_FileWatcher.FileChangedSimple)
 Create a new FileSystem Watcher object aimed at a specific file.
CreateFileWatcher(String, GH_FileWatcherEvents, GH_FileWatcher.FileChanged)
 Create a new FileSystem Watcher object aimed at a specific file.
CreateFileWatcher(String, GH_FileWatcherEvents, GH_FileWatcher.FileChangedSimple)
 Create a new FileSystem Watcher object aimed at a specific file.
Dispose()
Releases all resources used by the GH_FileWatcher
Dispose(Boolean)
Releases the unmanaged resources used by the GH_FileWatcher and optionally releases the managed resources
SetCustomUIThread(Control)
 If you want to override the default Invoke behaviour, you must set InvokeOnDefaultThread to False and supply either a custom Control or a Form.
SetCustomUIThread(Form)
 If you want to override the default Invoke behaviour, you must set InvokeOnDefaultThread to False and supply either a custom Control or a Form.
Top
See Also
Reference
Grasshopper.Kernel Namespace