Grasshopper SDK
GH_Capsule.CreateTextCapsule Method (Rectangle, Rectangle, GH_Palette, String)
 Create a new capsule with content text.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Capsule CreateTextCapsule(
	Rectangle box,
	Rectangle textbox,
	GH_Palette palette,
	string text
)
Public Shared Function CreateTextCapsule (
	box As Rectangle,
	textbox As Rectangle,
	palette As GH_Palette,
	text As String
) As GH_Capsule
Parameters
box
Type: System.Drawing.Rectangle
Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox
Type: System.Drawing.Rectangle
Box into which the text will be drawn.
palette
Type: Grasshopper.GUI.Canvas.GH_Palette
Colour palette to apply.
text
Type: System.String
Text to display inside the capsule.
Return Value
Type: GH_Capsule
A new instance of GH_Capsule. Caller is responsible for disposing of the object.
See Also
Reference
GH_Capsule Class
CreateTextCapsule Overload
Grasshopper.GUI.Canvas Namespace