Grasshopper SDK
Orientation Class
 Implements an orientation (ChangeBasis) transformation.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.Transforms.Orientation
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class Orientation : ITransform
Public Class Orientation
	Implements ITransform
The Orientation type exposes the following members.
Constructors
Name | Description
Orientation()
Initializes a new instance of the Orientation class
Orientation(Plane, Plane)
Initializes a new instance of the Orientation class
Top
Properties
Name | Description
Name
SourceFrame
TargetFrame
Top
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Grasshopper.Kernel.Types.Transforms Namespace