Grasshopper SDK
GH_DocumentIO.SubsidiaryDocumentSavePrompt Method (GH_Document)
 Display a 'stuff has changed do you want to save' message box with Yes/No/Cancel options.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static DialogResult SubsidiaryDocumentSavePrompt(
	GH_Document document
)
Public Shared Function SubsidiaryDocumentSavePrompt (
	document As GH_Document
) As DialogResult
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Top level document.
Return Value
Type: DialogResult
Yes, No, Cancel or None state.
See Also
Reference
GH_DocumentIO Class
SubsidiaryDocumentSavePrompt Overload
Grasshopper.Kernel Namespace