Grasshopper SDK
GH_Convert.ToInt32_Secondary Method
 Performs indirect casts from other data types into Integers.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToInt32_Secondary(
	Object data,
	ref int destination
)
Public Shared Function ToInt32_Secondary (
	data As Object,
	ByRef destination As Integer
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.Int32
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace