Grasshopper SDK
GH_AsynchFileData.UpdatePropertiesAsynch Method
 Updates all file properties on a low-priority background thread.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void UpdatePropertiesAsynch()
Public Sub UpdatePropertiesAsynch
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace