Grasshopper SDK
GH_TagArtist Class
 Provides a basic implementation of the IGH_TagArtist interface.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Canvas.TagArtists.GH_TagArtist
 Grasshopper.GUI.Canvas.TagArtists.GH_TagArtist_WirePainter
Namespace: Grasshopper.GUI.Canvas.TagArtists
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_TagArtist : IGH_TagArtist
Public MustInherit Class GH_TagArtist
	Implements IGH_TagArtist
The GH_TagArtist type exposes the following members.
Constructors
Name | Description
GH_TagArtist
Initializes a new instance of the GH_TagArtist class
Top
Properties
Name | Description
ID
 Gets the ID of this TagArtist object.
Top
Methods
Name | Description
Paint
 This method is called whenever a Canvas channel is painted
Top
See Also
Reference
Grasshopper.GUI.Canvas.TagArtists Namespace