Grasshopper SDK
GH_MenuTextBox.Text Property
 Gets or sets the current text.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_MenuTextBox.Text"]
See Also
Reference
GH_MenuTextBox Class
Grasshopper.GUI Namespace