Grasshopper SDK
GH_ValueProxy<T>.m_Name Field
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected string m_Name
Protected m_Name As String
Field Value
Type: String
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace