Grasshopper SDK
GH_Structure<T>.Duplicate Method
 Create an exact duplicate of this structure. All data items are copied as well.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Structure<T> Duplicate()
Public Function Duplicate As GH_Structure(Of T)
Return Value
Type: GH_Structure<T>
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace