Grasshopper SDK
Rotation Class
 Implements a rotation transformation.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.Transforms.Rotation
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class Rotation : ITransform
Public Class Rotation
	Implements ITransform
The Rotation type exposes the following members.
Constructors
Name | Description
Rotation()
Initializes a new instance of the Rotation class
Rotation(Point3d, Vector3d, Vector3d)
Initializes a new instance of the Rotation class
Rotation(Point3d, Vector3d, Double)
Initializes a new instance of the Rotation class
Top
Properties
Name | Description
Name
RotationAngle
RotationAxis
RotationCenter
Top
Methods
Name | Description
Duplicate
Read
Reverse
ToMatrix
ToString |  (Overrides Object.ToString().)
Write
Top
See Also
Reference
Grasshopper.Kernel.Types.Transforms Namespace