Grasshopper SDK
GH_ObjectEventType Enumeration
 Represents common changes which can cause the ObjectChanged event to be raised.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ObjectEventType
Public Enumeration GH_ObjectEventType
Members
Member name | Value | Description
Unset | 0 |  No type is specified.
NickName | 1 |  The NickName has been changed.
NickNameAccepted | 2 |  The nickname has been changed and the change was accepted. This event is only raised once per a NickName change process.
Icon | 3 |  The object icon has been changed.
IconDisplayMode | 4 |  The icon display mode of the object has been changed.
Layout | 5 |  The layout of the attributes has changed. This usually happens when the pivot is moved, or when the object is resized, but it can also be due to a change in the object structure.
Sources | 6 |  A source list of this object has been altered.
Selected | 7 |  The object selected state has been toggled.
Enabled | 8 |  The object enabled state has been toggled.
Preview | 9 |  The preview of this object has been toggled.
PersistentData | 10 |  The persistent data inside this object has been changed.
DataMatching | 11 |  The Data matching settings of this object have been changed.
DataMapping | 12 |  The Data mapping settings of this object have been changed.
Options | 13 |  Custom options of this object have been changed.
Custom | 2147483647 |  A non-standard change occured. See the Custom property on the GH_ObjectChangedEventArgs for further details.
See Also
Reference
Grasshopper.Kernel Namespace