Grasshopper SDK
GH_TooltipComponent.Hide Method
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Hide()
Public Sub Hide
See Also
Reference
GH_TooltipComponent Class
Grasshopper.GUI Namespace