Grasshopper SDK
UVInterval Constructor
Initializes a new instance of the UVInterval class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public UVInterval(
	Interval newU,
	Interval newV
)
Public Sub New (
	newU As Interval,
	newV As Interval
)
Parameters
newU
Type: Interval
newV
Type: Interval
See Also
Reference
UVInterval Structure
Grasshopper.Kernel.Types Namespace