Grasshopper SDK
GH_Document.FilterObjects Method (GH_Filter, GH_Filter, GH_Filter)
 Returns all objects in the document that pass the filter specification
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_DocumentObject> FilterObjects(
	GH_Filter selectedObjects = GH_Filter.DontCare,
	GH_Filter enabledObjects = GH_Filter.DontCare,
	GH_Filter activeObjects = GH_Filter.DontCare
)
Public Function FilterObjects (
	Optional selectedObjects As GH_Filter = GH_Filter.DontCare,
	Optional enabledObjects As GH_Filter = GH_Filter.DontCare,
	Optional activeObjects As GH_Filter = GH_Filter.DontCare
) As List(Of IGH_DocumentObject)
Parameters
selectedObjects (Optional)
Type: Grasshopper.Kernel.GH_Filter
enabledObjects (Optional)
Type: Grasshopper.Kernel.GH_Filter
activeObjects (Optional)
Type: Grasshopper.Kernel.GH_Filter
Return Value
Type: List<IGH_DocumentObject>
See Also
Reference
GH_Document Class
FilterObjects Overload
Grasshopper.Kernel Namespace