Grasshopper SDK
GH_FloatingParamAttributes.DefaultWidth Field
 Defines the default (and minimum) width of a floating parameter.
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int DefaultWidth = 50
Public Const DefaultWidth As Integer = 50
Field Value
Type: Int32
See Also
Reference
GH_FloatingParamAttributes Class
Grasshopper.Kernel.Attributes Namespace