Grasshopper SDK
GH_ComponentServer.LoadAliases Method
 Load the Alias table from the settings directory. Only use this function if you suspect the alias table settings file has changed due to some external process.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void LoadAliases()
Public Sub LoadAliases
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace