Grasshopper SDK
GH_Param<T>.AddVolatileDataTree Method (IGH_Structure)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AddVolatileDataTree(
	IGH_Structure tree
)
Public Function AddVolatileDataTree (
	tree As IGH_Structure
) As Boolean
Parameters
tree
Type: Grasshopper.Kernel.Data.IGH_Structure
Return Value
Type: Boolean
Implements
IGH_Param.AddVolatileDataTree(IGH_Structure)
See Also
Reference
GH_Param<T> Class
AddVolatileDataTree Overload
Grasshopper.Kernel Namespace