Grasshopper SDK
IGH_CanvasValidator.CanAcceptObject Method
 Validates whether a specific component can be accepted by the canvas at all.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool CanAcceptObject(
	Guid id
)
Function CanAcceptObject (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
Return Value
Type: Boolean
See Also
Reference
IGH_CanvasValidator Interface
Grasshopper.GUI.Canvas Namespace