Grasshopper SDK
GH_DocDiagramPainter.UnmapRectangle Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle UnmapRectangle(
	Rectangle rec
)
Public Function UnmapRectangle (
	rec As Rectangle
) As Rectangle
Parameters
rec
Type: System.Drawing.Rectangle
Return Value
Type: Rectangle
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace