Grasshopper SDK
GH_Interval2D Class
 Represents a two-dimensional numeric domain.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<UVInterval>
 Grasshopper.Kernel.Types.GH_Interval2D
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Interval2D : GH_Goo<UVInterval>
Public Class GH_Interval2D
	Inherits GH_Goo(Of UVInterval)
The GH_Interval2D type exposes the following members.
Constructors
Name | Description
GH_Interval2D()
 Default constructor. Creates two empty intervals.
GH_Interval2D(GH_Interval2D)
 Create a duplicate of another two-dimensional interval
GH_Interval2D(UVInterval)
 Duplicates a one-dimensional interval in both directions.
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance. Valid intervals contain no #NaN extremes
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. this stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate
 Create a duplicate of this interval.
 (Overrides GH_Goo<T>.Duplicate().)
DuplicateInterval
 Create a duplicate of this interval.
EmitProxy
 Returns a proxy that represents this interval. Do not call this function unless you're
 (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString
 Format the interval using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace