Grasshopper SDK
IGH_ActiveObject.DependsOn Method
 Solve the inheritance relationship between this object and a potential parental object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool DependsOn(
	IGH_ActiveObject PotentialSource
)
Function DependsOn (
	PotentialSource As IGH_ActiveObject
) As Boolean
Parameters
PotentialSource
Type: Grasshopper.Kernel.IGH_ActiveObject
Return Value
Type: Boolean
See Also
Reference
IGH_ActiveObject Interface
Grasshopper.Kernel Namespace