Grasshopper SDK
IGH_GeometricGoo.LoadGeometry Method (RhinoDoc)
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool LoadGeometry(
	RhinoDoc doc
)
Function LoadGeometry (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: RhinoDoc
Document to use for loading.
Return Value
Type: Boolean
See Also
Reference
IGH_GeometricGoo Interface
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace