Grasshopper SDK
GH_MemoryBitmap.Filter_Blur Method (Int32, Int32, Int32)
 Blur the image N times in both directions.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_Blur(
	int N,
	int interior_weight,
	int exterior_weight
)
Public Sub Filter_Blur (
	N As Integer,
	interior_weight As Integer,
	exterior_weight As Integer
)
Parameters
N
Type: System.Int32
Number of times to perform the blurring operation.
interior_weight
Type: System.Int32
Weighting factor for pixels at the center of the convolution matrix.
exterior_weight
Type: System.Int32
Weighting factor for pixels at the edges of the convolution matrix.
See Also
Reference
GH_MemoryBitmap Class
Filter_Blur Overload
Grasshopper.Kernel Namespace