Grasshopper SDK
GH_TreeFilter Class
 Represents a collection of rules for validating DataTree paths and indices.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_TreeFilter
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_TreeFilter
Public Class GH_TreeFilter
The GH_TreeFilter type exposes the following members.
Constructors
Name | Description
GH_TreeFilter
Initializes a new instance of the GH_TreeFilter class
Top
Methods
Name | Description
FindItemBrackets
 Locate the two parenthesis that delineate the index segment of an Index Rule set.
FindNextLevelChar
 Find the next occurance of a char in a string that is level with the search start index.
FindPathBrackets
 Locate the two curly brackets that delineate the path segment of an Index Rule set.
FindPrevLevelChar
 Find the previous occurance of a char in a string that is level with the search start index.
ParsePattern
 Parses a textual filter and returns an instance of the GH_TreeFilter. If the filter cannot be parsed an exception will be thrown.
SplitStringWithExpressions
 Split a string into segments using level-aware split. This method throws exceptions if the input string is not correctly formatted.
Top
Fields
Name | Description
ItemClose
ItemOpen
PathClose
PathOpen
PathSeparator
SegmentSeparator
StringDelimeter
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace