Grasshopper SDK
CentralSettings.AuthorAddress Property
 Gets or sets the default author address to be used for all data generated by this Grasshopper installation.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string AuthorAddress { get; set; }
Public Shared Property AuthorAddress As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.CentralSettings.AuthorAddress"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace