Grasshopper SDK
GH_Document.SelectionTopology Property
 Gets the selection topology of the document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SelectionTopology SelectionTopology { get; }
Public ReadOnly Property SelectionTopology As GH_SelectionTopology
	Get
Property Value
Type: GH_SelectionTopology
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.SelectionTopology"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace