Grasshopper SDK
GH_Animator.SingleAnimator Method (Single, Single, DateTime, DateTime)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<float> SingleAnimator(
	float A,
	float B,
	DateTime time0,
	DateTime time1
)
Public Shared Function SingleAnimator (
	A As Single,
	B As Single,
	time0 As DateTime,
	time1 As DateTime
) As GH_Animator(Of Single)
Parameters
A
Type: System.Single
B
Type: System.Single
time0
Type: System.DateTime
time1
Type: System.DateTime
Return Value
Type: GH_Animator<Single>
See Also
Reference
GH_Animator Class
SingleAnimator Overload
Grasshopper.GUI Namespace