Grasshopper SDK
GH_Convert.ToComplex_Secondary Method
 Performs indirect casts from other data types into Complex.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToComplex_Secondary(
	Object data,
	ref Complex destination
)
Public Shared Function ToComplex_Secondary (
	data As Object,
	ByRef destination As Complex
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: Grasshopper.Kernel.Types.Complex
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace