Grasshopper SDK
GH_TagArtist Constructor
Initializes a new instance of the GH_TagArtist class
Namespace: Grasshopper.GUI.Canvas.TagArtists
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_TagArtist(
	Guid id
)
Protected Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
See Also
Reference
GH_TagArtist Class
Grasshopper.GUI.Canvas.TagArtists Namespace