Grasshopper SDK
IGH_RenderAwareObject Interface
 Implement this interface in your IGH_DocumentObject type if you wish to send geometry to a render queue.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_RenderAwareObject
Public Interface IGH_RenderAwareObject
The IGH_RenderAwareObject type exposes the following members.
Methods
Name | Description
AppendRenderGeometry
Top
See Also
Reference
Grasshopper.Kernel Namespace