Grasshopper SDK
GH_RuleNumber Constructor
Initializes a new instance of the GH_RuleNumber class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RuleNumber(
	int number,
	bool negate
)
Public Sub New (
	number As Integer,
	negate As Boolean
)
Parameters
number
Type: System.Int32
negate
Type: System.Boolean
See Also
Reference
GH_RuleNumber Class
Grasshopper.Kernel.Data Namespace