Grasshopper SDK
GH_PointUtil.FitPlaneThroughPoints Method
 Fit a least-squares plane through a collection of points.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Plane FitPlaneThroughPoints(
	IEnumerable<GH_Point> pts
)
Public Shared Function FitPlaneThroughPoints (
	pts As IEnumerable(Of GH_Point)
) As Plane
Parameters
pts
Type: System.Collections.Generic.IEnumerable<GH_Point>
Points to fit, may contain nulls.
Return Value
Type: Plane
Best fit plane or null if insufficient points were supplied.
See Also
Reference
GH_PointUtil Class
Grasshopper.Kernel.Types Namespace