Grasshopper SDK
GH_Param<T>.WireDisplay Property
 Gets or sets the wire display style for this parameter. Wire display only affects the wires connected to the parameter input.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ParamWireDisplay WireDisplay { get; set; }
Public Property WireDisplay As GH_ParamWireDisplay
	Get
	Set
Property Value
Type: GH_ParamWireDisplay
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.WireDisplay"]
Implements
IGH_Param.WireDisplay
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace