Grasshopper SDK
GH_SliderBase.GripText Property
 Gets the text that will be drawn on the slider.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string GripText { get; }
Public ReadOnly Property GripText As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.GripText"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace