Grasshopper SDK
GH_Surface.ClearCaches Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void ClearCaches()
Public Overrides Sub ClearCaches
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace