Grasshopper SDK
GH_UserObject Constructor
 Empty constructor
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UserObject()
Public Sub New
See Also
Reference
GH_UserObject Class
GH_UserObject Overload
Grasshopper.Kernel Namespace