Grasshopper SDK
GH_UndoServer.FirstRedoName Property
 Gets the name of the last item in the redo stack (the first item to be redone).
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string FirstRedoName { get; }
Public ReadOnly Property FirstRedoName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoServer.FirstRedoName"]
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace