Grasshopper SDK
GH_RuntimeFile.Content Property
 Gets the data associated with a certain key. For every time the key appears in the file, an array of content strings will be returned.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<string[]> this[
	string key
] { get; }
Public ReadOnly Default Property Content (
	key As String
) As List(Of String())
	Get
Parameters
key
Type: System.String
Key to search for, key comparison is not case-sensitive.
Property Value
Type: List<String[]>
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_RuntimeFile.Content(System.String)"]
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace