Grasshopper SDK
GH_UndoServer.FirstUndoName Property
 Gets the name of the last item in the undo stack (the first item to be undone).
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string FirstUndoName { get; }
Public ReadOnly Property FirstUndoName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoServer.FirstUndoName"]
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace