Grasshopper SDK
Folders.ImageStitcherApplication Property
 Gets the location where the ImageStitcher.exe should be. If the application is not present, null is returned.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string ImageStitcherApplication { get; }
Public Shared ReadOnly Property ImageStitcherApplication As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.ImageStitcherApplication"]
See Also
Reference
Folders Class
Grasshopper Namespace