Grasshopper SDK
GH_Painter Class
 This class performs most of the drawing operations required for Grasshopper Canvas controls.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Canvas.GH_Painter
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Painter
Public Class GH_Painter
The GH_Painter type exposes the following members.
Constructors
Name | Description
GH_Painter
 Constructor.
Top
Methods
Name | Description
ConnectionPath
ConnectionVisible
 Test whether a wire ought to be drawn at all.
DetermineWireType
 Utility method for determining wire display types.
DrawBackground
DrawConnection
DrawMiddleGround
DrawNoDocumentMessage
DrawNULLBuffer
DrawPivots
DrawRecipientLinks(GH_Document)
DrawRecipientLinks(IGH_Param)
DrawStateFlags
GenerateWirePen_Fill
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace