Grasshopper SDK
IGH_Embeddable.PrepareForCommit Method
 This will be called prior to a Commit operation.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void PrepareForCommit()
Sub PrepareForCommit
See Also
Reference
IGH_Embeddable Interface
Grasshopper.GUI Namespace