Grasshopper SDK
GH_ObjectType Enumeration
 Enumerates all types of object that can be referenced by a GH_ObjectProxy instance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ObjectType
Public Enumeration GH_ObjectType
Members
Member name | Value | Description
None | 0 |  Object type is unset.
CompiledObject | 1 |  Represents a compiled object inside a GHA assembly.
UserObject | 2 |  Represents a user defined object in a remote file.
See Also
Reference
Grasshopper.Kernel Namespace