Grasshopper SDK
GH_Viewport.MidPoint Property
 Gets or sets the canvas coordinate that is directly underneath the center of the viewport.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF MidPoint { get; set; }
Public Property MidPoint As PointF
	Get
	Set
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.MidPoint"]
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace