Grasshopper SDK
GH_FadeAnimation.IsFinished Property
 Gets a value indicating whether this animator has finished animating.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsFinished { get; }
Public ReadOnly Property IsFinished As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FadeAnimation.IsFinished"]
See Also
Reference
GH_FadeAnimation Class
Grasshopper.GUI Namespace