Grasshopper SDK
GH_PreviewUtil.WireColour Property
 Gets or sets the colour to use for Preview geometry.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color WireColour { get; set; }
Public Property WireColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewUtil.WireColour"]
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace