Grasshopper SDK
GH_ExpressionParser.CacheSymbols Method
 Create a Symbols array from the expression. Use this method if you intend to evaluate the same expression multiple times. At this point, the expression has to be in correct syntax format. Use the GH_ExpressionSyntaxWriter.RewriteAll() method to make sure.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool CacheSymbols(
	string Expression
)
Public Function CacheSymbols (
	Expression As String
) As Boolean
Parameters
Expression
Type: System.String
Return Value
Type: Boolean
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace