Grasshopper SDK
GH_AddObjectAction Class
 Records a single object addition.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoAction
 Grasshopper.Kernel.Undo.Actions.GH_AddObjectAction
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_AddObjectAction : GH_UndoAction
Public Class GH_AddObjectAction
	Inherits GH_UndoAction
The GH_AddObjectAction type exposes the following members.
Constructors
Name | Description
GH_AddObjectAction
Initializes a new instance of the GH_AddObjectAction class
Top
Properties
Name | Description
ExpiresSolution |  (Overrides GH_UndoAction.ExpiresSolution.)
Top
Methods
Name | Description
Internal_Redo |  (Overrides GH_UndoAction.Internal_Redo(GH_Document).)
Internal_Undo |  (Overrides GH_UndoAction.Internal_Undo(GH_Document).)
Top
See Also
Reference
Grasshopper.Kernel.Undo.Actions Namespace