Grasshopper SDK
GH_StateServer.NewStateFromDocument Method
 Displays UI for new state creation. If the user aborts, then null is returned. If the user successfully defines a new state, it is appended to this server.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_State NewStateFromDocument()
Public Function NewStateFromDocument As GH_State
Return Value
Type: GH_State
See Also
Reference
GH_StateServer Class
Grasshopper.Kernel Namespace