Grasshopper SDK
GH_FontServer.NewFont Method (Font, Single)
 Safe font constructor.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font NewFont(
	Font font,
	float size
)
Public Shared Function NewFont (
	font As Font,
	size As Single
) As Font
Parameters
font
Type: System.Drawing.Font
Base font.
size
Type: System.Single
New size (points)
Return Value
Type: Font
See Also
Reference
GH_FontServer Class
NewFont Overload
Grasshopper.Kernel Namespace