Grasshopper SDK
GH_RemoveStateAction Constructor
Initializes a new instance of the GH_RemoveStateAction class
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RemoveStateAction(
	int index,
	GH_State state
)
Public Sub New (
	index As Integer,
	state As GH_State
)
Parameters
index
Type: System.Int32
state
Type: Grasshopper.Kernel.GH_State
See Also
Reference
GH_RemoveStateAction Class
Grasshopper.Kernel.Undo.Actions Namespace