Grasshopper SDK
GH_RuleSequence.Kind Property
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RuleKind Kind { get; }
Public ReadOnly Property Kind As GH_RuleKind
	Get
Property Value
Type: GH_RuleKind
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_RuleSequence.Kind"]
Implements
IGH_Rule.Kind
See Also
Reference
GH_RuleSequence Class
Grasshopper.Kernel.Data Namespace