Grasshopper SDK
GH_Line.GH_LineProxy.Ax Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Ax { get; set; }
Public Property Ax As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Line.GH_LineProxy.Ax"]
See Also
Reference
GH_Line.GH_LineProxy Class
Grasshopper.Kernel.Types Namespace