Grasshopper SDK
GH_Author.Company Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Company { get; set; }
Public Property Company As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Author.Company"]
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace