Grasshopper SDK
GH_DocumentEditor.FadeOut Method
 Call this method if the prompt switches to Rhino.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void FadeOut()
Public Sub FadeOut
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace