Grasshopper SDK
GH_Alias.StringToAlias Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string[] StringToAlias(
	string text
)
Public Shared Function StringToAlias (
	text As String
) As String()
Parameters
text
Type: System.String
Return Value
Type: String[]
See Also
Reference
GH_Alias Class
Grasshopper.Kernel Namespace