Grasshopper SDK
GH_GHXHarvester Class
 Provides static methods for harvesting data from GHX and GH files.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_GHXHarvester
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_GHXHarvester
Public NotInheritable Class GH_GHXHarvester
Methods
Name | Description
HarvestBoundingBoxes(String)
 Harvest all attribute bounding boxes from a GHX/GH archive.
HarvestBoundingBoxes(GH_Archive)
 Harvest all attribute bounding boxes from a GHX/GH archive.
HarvestBoundingBoxes(GH_IReader)
 Harvest all attribute bounding boxes from a GHX/GH node.
HarvestPivots(String)
 Harvest all attribute pivots from a GHX/GH archive.
HarvestPivots(GH_Archive)
 Harvest all attribute pivots from a GHX/GH archive.
HarvestPivots(GH_IReader)
 Harvest all attribute pivots from a GHX/GH node.
Top
See Also
Reference
Grasshopper.Kernel Namespace