Grasshopper SDK
GH_TreeRules.HasItemRule Property
 Gets whether this rule set has a defined index rule.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool HasItemRule { get; }
Public ReadOnly Property HasItemRule As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_TreeRules.HasItemRule"]
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace