Grasshopper SDK
GH_FadeAnimation.FadeFactor Property
 Gets the blend factor for the current state. 0.0 means fully hidden, 1.0 means fully shown.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double FadeFactor { get; }
Public ReadOnly Property FadeFactor As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FadeAnimation.FadeFactor"]
See Also
Reference
GH_FadeAnimation Class
Grasshopper.GUI Namespace