Grasshopper SDK
GH_SettingsCategory Constructor (String, String, Bitmap)
 Create a new nested category.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_SettingsCategory(
	string name,
	string parent,
	Bitmap icon
)
Protected Sub New (
	name As String,
	parent As String,
	icon As Bitmap
)
Parameters
name
Type: System.String
Category name, keep it short.
parent
Type: System.String
Name of parent category. If the parent category hasn't been defined, the category will be placed under a "Misc" category.
icon
Type: System.Drawing.Bitmap
Category icon. If you supply an icon, it must be 48x48 pixels. If you supply a null instance, a generic Settings icon will be assigned.
See Also
Reference
GH_SettingsCategory Class
GH_SettingsCategory Overload
Grasshopper.GUI Namespace