Grasshopper SDK
GH_Document.PreviewColour Property
 Gets or sets the colour of unselected preview geometry.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color PreviewColour { get; set; }
Public Property PreviewColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.PreviewColour"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace