Grasshopper SDK
GH_DocumentIO Constructor
 Create a new instance of GH_DocumentIO without an internal document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentIO()
Public Sub New
See Also
Reference
GH_DocumentIO Class
GH_DocumentIO Overload
Grasshopper.Kernel Namespace