Grasshopper SDK
GH_Rectangle.GH_RectangleProxy.Height Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Interval_Wrapper Height { get; }
Public ReadOnly Property Height As GH_Interval_Wrapper
	Get
Property Value
Type: GH_Interval_Wrapper
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Rectangle.GH_RectangleProxy.Height"]
See Also
Reference
GH_Rectangle.GH_RectangleProxy Class
Grasshopper.Kernel.Types Namespace