Grasshopper SDK
GH_DocumentRenderMeshProvider Methods
The GH_DocumentRenderMeshProvider type exposes the following members.
Methods
Name | Description
BoundingBox |  (Overrides CustomRenderMeshProvider.BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean).)
BuildCustomMeshes |  (Overrides CustomRenderMeshProvider.BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, Boolean).)
WillBuildCustomMeshes |  (Overrides CustomRenderMeshProvider.WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean).)
Top
See Also
Reference
GH_DocumentRenderMeshProvider Class
Grasshopper.Kernel Namespace