Grasshopper SDK
GH_ComponentParamServer.GetHashCode Method (GH_ParamHashFields)
 Creates a SHA1 hash from the parameter data.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid GetHashCode(
	GH_ParamHashFields fields
)
Public Function GetHashCode (
	fields As GH_ParamHashFields
) As Guid
Parameters
fields
Type: Grasshopper.Kernel.GH_ParamHashFields
Fields to include.
Return Value
Type: Guid
A Guid representing a SHA hash of the parameter fields.
See Also
Reference
GH_ComponentParamServer Class
GetHashCode Overload
Grasshopper.Kernel Namespace