Grasshopper SDK
GH_Author Constructor (IGH_Author)
Initializes a new instance of the GH_Author class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Author(
	IGH_Author other
)
Public Sub New (
	other As IGH_Author
)
Parameters
other
Type: Grasshopper.Kernel.IGH_Author
See Also
Reference
GH_Author Class
GH_Author Overload
Grasshopper.Kernel Namespace