Grasshopper SDK
GH_StateTagList.RenderStateTags Method
 Render all StateTags in this list to the designated Graphics surface.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RenderStateTags(
	Graphics G
)
Public Sub RenderStateTags (
	G As Graphics
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with.
See Also
Reference
GH_StateTagList Class
Grasshopper.Kernel Namespace