Grasshopper SDK
GH_DocumentEditor Constructor
Initializes a new instance of the GH_DocumentEditor class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentEditor()
Public Sub New
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace