Grasshopper SDK
CentralSettings.AuthorCopyrightChanged Event
 Raised whenever the AuthorCopyright field is changed.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.AuthorCopyrightChangedEventHandler AuthorCopyrightChanged
Public Shared Event AuthorCopyrightChanged As CentralSettings.AuthorCopyrightChangedEventHandler
Value
Type: Grasshopper.CentralSettings.AuthorCopyrightChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace