Grasshopper SDK
GH_FontServer.ScriptSmall Property
 FontFamily.GenericSansSerif, 8pt, italic
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font ScriptSmall { get; }
Public Shared ReadOnly Property ScriptSmall As Font
	Get
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FontServer.ScriptSmall"]
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace