Grasshopper SDK
GH_FontServer.ConsoleSmall Property
 FontFamily.GenericMonospace, 8pt, regular
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font ConsoleSmall { get; }
Public Shared ReadOnly Property ConsoleSmall As Font
	Get
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FontServer.ConsoleSmall"]
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace