Grasshopper SDK
GH_SettingsType Enumeration
 Lists all the data types available in the GH_SettingsServer class.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_SettingsType
Public Enumeration GH_SettingsType
Members
Member name | Value | Description
_unknown | -1
_null | 0
_boolean | 1
_byte | 2
_integer | 3
_double | 4
_string | 6
_date | 7
_color | 8
_point | 9
_size | 10
_rectangle | 11
See Also
Reference
Grasshopper.Kernel Namespace