Grasshopper SDK
IGH_Rule Interface
 Interface for individual pattern elements.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_Rule
Public Interface IGH_Rule
The IGH_Rule type exposes the following members.
Properties
Name | Description
Kind
 Gets the type of rule.
Notation
 Gets the string notation (representation) for this rule.
Top
Methods
Name | Description
Apply
 Applies this rule to an integer.
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace