Grasshopper SDK
GH_Document.FindObject Method (PointF, Single)
 Find the topmost object that is closest to the point
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_DocumentObject FindObject(
	PointF pt,
	float radius
)
Public Function FindObject (
	pt As PointF,
	radius As Single
) As IGH_DocumentObject
Parameters
pt
Type: System.Drawing.PointF
Canvas coordinates for object lookup
radius
Type: System.Single
Radius, (in canvas units) for search.
Return Value
Type: IGH_DocumentObject
See Also
Reference
GH_Document Class
FindObject Overload
Grasshopper.Kernel Namespace