Grasshopper SDK
GH_ComponentServer.FindObjectByName Method
 Find an object by name. Obsolete and hidden objects are ignored. Only exact matches are included.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_ObjectProxy FindObjectByName(
	string name,
	bool ignoreWhiteSpace,
	bool ignoreCapitalisation
)
Public Function FindObjectByName (
	name As String,
	ignoreWhiteSpace As Boolean,
	ignoreCapitalisation As Boolean
) As IGH_ObjectProxy
Parameters
name
Type: System.String
Name to search for. Name may be prefixed by Category and Subcategory.
ignoreWhiteSpace
Type: System.Boolean
If true, whitespace is ignored during matching.
ignoreCapitalisation
Type: System.Boolean
If true, capitalisation is ignored during matching.
Return Value
Type: IGH_ObjectProxy
The proxy that matches the name, or null if no such object could be found.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace