Grasshopper SDK
GH_Capsule.Render Method (Graphics, Image, Boolean, Boolean, Boolean)
 Render the capsule onto a graphics context.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Render(
	Graphics G,
	Image icon,
	bool selected,
	bool locked,
	bool hidden
)
Public Sub Render (
	G As Graphics,
	icon As Image,
	selected As Boolean,
	locked As Boolean,
	hidden As Boolean
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with. Zoom factor is implied by the G.Transform property.
icon
Type: System.Drawing.Image
Icon to render in center of content/bounding box.
selected
Type: System.Boolean
If true, the capsule will be drawn with selected colours.
locked
Type: System.Boolean
If True, the capcule will be drawn in Locked style.
hidden
Type: System.Boolean
If True, the capsule will be drawn in Hidden style.
See Also
Reference
GH_Capsule Class
Render Overload
Grasshopper.GUI.Canvas Namespace