Grasshopper SDK
GH_Viewport.UnprojectRectangle Method
 Project a rectangle from control coordinates into canvas coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RectangleF UnprojectRectangle(
	RectangleF rec
)
Public Function UnprojectRectangle (
	rec As RectangleF
) As RectangleF
Parameters
rec
Type: System.Drawing.RectangleF
The rectangle in control coordinates.
Return Value
Type: RectangleF
The associated rectangle in canvas coordinates.
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace