Grasshopper SDK
GH_SliderBase.TickDisplay Property
 Gets or sets how the slider ticks are drawn.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SliderTickDisplay TickDisplay { get; set; }
Public Property TickDisplay As GH_SliderTickDisplay
	Get
	Set
Property Value
Type: GH_SliderTickDisplay
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.TickDisplay"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace