Grasshopper SDK
GH_SimplificationMode Enumeration
 Enumerates the possible data structure simplification modes.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_SimplificationMode
Public Enumeration GH_SimplificationMode
Members
Member name | Value | Description
None | 0 |  Specifies no simplification is to take place.
CollapseLeadingOverlaps | 1 |  Only overlaps at the leading portion of paths will be simplified.
CollapseAllOverlaps | 2 |  Overlaps along the entire span of the paths will be simplified.
See Also
Reference
Grasshopper.Kernel.Data Namespace