Grasshopper SDK
GH_QuickImageEditor.ViewportName Property
 Gets or sets the viewport name to include. If the name string is null or empty, the active viewport is used.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string ViewportName { get; set; }
Public Property ViewportName As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_QuickImageEditor.ViewportName"]
See Also
Reference
GH_QuickImageEditor Class
Grasshopper.GUI Namespace