Grasshopper SDK
GH_Point.ReferenceIndex Method
 Retrieve the index of the point reference data.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ReferenceIndex()
Public Function ReferenceIndex As Integer
Return Value
Type: Int32
The index of the reference data. This index describes the sub-object of the reference.
Remarks
If there exists no reference data, -1 is returned.
See Also
Reference
GH_Point Class
ReferenceIndex Overload
Grasshopper.Kernel.Types Namespace