Grasshopper SDK
GH_ColourPickerBase.ColourCubeBox Property
 Gets the rectangle that contains the colour space cube.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle ColourCubeBox { get; }
Public ReadOnly Property ColourCubeBox As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.ColourCubeBox"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace