Grasshopper SDK
CentralSettings.RibbonVisibleChanged Event
 Raised whenever the RibbonVisible setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.RibbonVisibleChangedEventHandler RibbonVisibleChanged
Public Shared Event RibbonVisibleChanged As CentralSettings.RibbonVisibleChangedEventHandler
Value
Type: Grasshopper.CentralSettings.RibbonVisibleChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace