Grasshopper SDK
GH_Format.FormatPoint Method (GH_Point)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatPoint(
	GH_Point data
)
Public Shared Function FormatPoint (
	data As GH_Point
) As String
Parameters
data
Type: Grasshopper.Kernel.Types.GH_Point
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatPoint Overload
Grasshopper.Kernel Namespace