Grasshopper SDK
GH_Animator.InterpolateRectangleF Method
 Utility interpolation delegate for System.Drawing.RectangleF values.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static RectangleF InterpolateRectangleF(
	RectangleF A,
	RectangleF B,
	double factor
)
Public Shared Function InterpolateRectangleF (
	A As RectangleF,
	B As RectangleF,
	factor As Double
) As RectangleF
Parameters
A
Type: System.Drawing.RectangleF
B
Type: System.Drawing.RectangleF
factor
Type: System.Double
Return Value
Type: RectangleF
See Also
Reference
GH_Animator Class
Grasshopper.GUI Namespace