Grasshopper SDK
GH_ValueProxy<T>.m_Value Field
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected T m_Value
Protected m_Value As T
Field Value
Type: T
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace