Grasshopper SDK
GH_ObjectChangedEventArgs.m_type Field
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_ObjectEventType m_type
Protected m_type As GH_ObjectEventType
Field Value
Type: GH_ObjectEventType
See Also
Reference
GH_ObjectChangedEventArgs Class
Grasshopper.Kernel Namespace