Grasshopper SDK
IGH_ResponsiveObject.RespondToKeyDown Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_ObjectResponse RespondToKeyDown(
	GH_Canvas sender,
	KeyEventArgs e
)
Function RespondToKeyDown (
	sender As GH_Canvas,
	e As KeyEventArgs
) As GH_ObjectResponse
Parameters
sender
Type: Grasshopper.GUI.Canvas.GH_Canvas
e
Type: System.Windows.Forms.KeyEventArgs
Return Value
Type: GH_ObjectResponse
See Also
Reference
IGH_ResponsiveObject Interface
Grasshopper.GUI.Canvas Namespace