Grasshopper SDK
GH_PersistentParam<T> Constructor (String, String, String, String, String)
Initializes a new instance of the GH_PersistentParam<T> class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_PersistentParam(
	string name,
	string nickname,
	string description,
	string category,
	string subcategory
)
Protected Sub New (
	name As String,
	nickname As String,
	description As String,
	category As String,
	subcategory As String
)
Parameters
name
Type: System.String
nickname
Type: System.String
description
Type: System.String
category
Type: System.String
subcategory
Type: System.String
See Also
Reference
GH_PersistentParam<T> Class
GH_PersistentParam<T> Overload
Grasshopper.Kernel Namespace