Grasshopper SDK
GH_CapsuleRenderEngine.GetPaletteStyle Method (GH_Palette, IGH_Attributes)
Note: This API is now obsolete.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("this method has been replaced by GetImpliedStyle")]
public static GH_PaletteStyle GetPaletteStyle(
	GH_Palette palette,
	IGH_Attributes attributes
)
<ObsoleteAttribute("this method has been replaced by GetImpliedStyle")>
Public Shared Function GetPaletteStyle (
	palette As GH_Palette,
	attributes As IGH_Attributes
) As GH_PaletteStyle
Parameters
palette
Type: Grasshopper.GUI.Canvas.GH_Palette
attributes
Type: Grasshopper.Kernel.IGH_Attributes
Return Value
Type: GH_PaletteStyle
See Also
Reference
GH_CapsuleRenderEngine Class
GetPaletteStyle Overload
Grasshopper.GUI.Canvas Namespace