Grasshopper SDK
GH_UserObject Constructor (String)
 Create a new user object from an existing *.ghuser file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UserObject(
	string source_file
)
Public Sub New (
	source_file As String
)
Parameters
source_file
Type: System.String
File that contains the User Object definition.
See Also
Reference
GH_UserObject Class
GH_UserObject Overload
Grasshopper.Kernel Namespace