Grasshopper SDK
GH_Variant._Plane Property
 Gets the contents of this Variant as a Plane.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Plane _Plane { get; }
Public ReadOnly Property _Plane As Plane
	Get
Property Value
Type: Plane
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_Variant._Plane"]
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace