Grasshopper SDK
GH_Canvas.GH_ImageSettings Class
 Settings class for high-resolution image output.
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_ImageSettings
Public Class GH_ImageSettings
The GH_Canvas.GH_ImageSettings type exposes the following members.
Constructors
Name | Description
GH_Canvas.GH_ImageSettings()
 Create a new instance of the GH_ImageSettings class with default values.
GH_Canvas.GH_ImageSettings(String)
 Create a new instance of the GH_ImageSettings class.
GH_Canvas.GH_ImageSettings(String, String, String)
 Create a new instance of the GH_ImageSettings class.
Top
Properties
Name | Description
BackColour
 Gets or sets the background colour to use for the high-resolution rendering.
Extension
 Gets or sets the image extension of the target image.
FileName
 Gets or sets the filename of the target image.
Folder
 Gets or sets the folder in which the target image will be saved.
TileSize
 Gets the default tile size for high-resolution export. This is a constant value.
Zoom
 Gets or sets the zoom at which to export the high-resolution image.
Top
See Also
Reference
Grasshopper.GUI.Canvas Namespace