Grasshopper SDK
GH_ParamKind Enumeration
 Enumerates the different guises of parameter
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ParamKind
Public Enumeration GH_ParamKind
Members
Member name | Value | Description
unknown | 0 |  Unknown, when this happens, something went wrong. Most likely it is due to someone deriving from GH_Param and not setting the kind.
floating | 1 |  Parameter is top-level.
input | 2 |  Parameter is tied to an owner component as an input.
output | 3 |  Parameter is tied to an owner component as an output.
See Also
Reference
Grasshopper.Kernel Namespace