Grasshopper SDK
GH_GooProxy<T> Constructor
Initializes a new instance of the GH_GooProxy<T> class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_GooProxy(
	T owner
)
Protected Sub New (
	owner As T
)
Parameters
owner
Type: T
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace