Grasshopper SDK
GH_ExpressionParser.ClearVariables Method
 Destroy the variable cache.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearVariables()
Public Sub ClearVariables
See Also
Reference
GH_ExpressionParser Class
Grasshopper.Kernel.Expressions Namespace