Grasshopper SDK
GH_Canvas.Validator Property
 Provides access to all the validators associated with this canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_CanvasValidator Validator { get; }
Public ReadOnly Property Validator As IGH_CanvasValidator
	Get
Property Value
Type: IGH_CanvasValidator
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.Validator"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace