Grasshopper SDK
GH_ParamServerEventArgs.ParameterIndex Property
 Gets the index of the parameter that caused the original event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ParameterIndex { get; }
Public ReadOnly Property ParameterIndex As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ParamServerEventArgs.ParameterIndex"]
See Also
Reference
GH_ParamServerEventArgs Class
Grasshopper.Kernel Namespace