Grasshopper SDK
GH_GraphicsUtil.RenderWarningIcon Method
 Render a typical warning icon into a graphics context. A warning icon is an upright yellow triangle.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderWarningIcon(
	Graphics graphics,
	PointF center,
	float radius,
	int alpha
)
Public Shared Sub RenderWarningIcon (
	graphics As Graphics,
	center As PointF,
	radius As Single,
	alpha As Integer
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
center
Type: System.Drawing.PointF
Center of icon.
radius
Type: System.Single
Radius of icon.
alpha
Type: System.Int32
Transparency of icon.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace