Grasshopper SDK
GH_FileWatcher.Buffer Property
 Gets or sets the time during which events are buffered. If multiple events for the same file occur within the buffered timespan, they will be merged into one event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public TimeSpan Buffer { get; set; }
Public Property Buffer As TimeSpan
	Get
	Set
Property Value
Type: TimeSpan
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FileWatcher.Buffer"]
See Also
Reference
GH_FileWatcher Class
Grasshopper.Kernel Namespace