Grasshopper SDK
GH_AutoSaveSettings.SaveOnDataFlatteningChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void SaveOnDataFlatteningChangedEventHandler()
Public Delegate Sub SaveOnDataFlatteningChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace