Grasshopper SDK
IGH_Goo.EmitProxy Method
 Create a new proxy for this instance. Return Null if this class does not support proxies.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_GooProxy EmitProxy()
Function EmitProxy As IGH_GooProxy
Return Value
Type: IGH_GooProxy
See Also
Reference
IGH_Goo Interface
Grasshopper.Kernel.Types Namespace