Grasshopper SDK
GH_NamedView.SetToViewport Method (GH_Canvas)
 Set the named view to the canvas viewport and redraw the canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetToViewport(
	GH_Canvas cv
)
Public Sub SetToViewport (
	cv As GH_Canvas
)
Parameters
cv
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas to set
See Also
Reference
GH_NamedView Class
SetToViewport Overload
Grasshopper.GUI.Canvas Namespace