Grasshopper SDK
GH_Attributes<T>.InstanceGuid Property
 Gets the instance ID of the document object that owns these attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid InstanceGuid { get; }
Public ReadOnly Property InstanceGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.InstanceGuid"]
Implements
IGH_Attributes.InstanceGuid
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace