Grasshopper SDK
GH_Path.CullFirstElement Method
 Removes the first index value from the path. If the path is already empty, nothing will happen.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Path CullFirstElement()
Public Function CullFirstElement As GH_Path
Return Value
Type: GH_Path
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace