Grasshopper SDK
GH_Rectangle Constructor (GH_Rectangle)
 Create a duplicate of another circle.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Rectangle(
	GH_Rectangle other
)
Public Sub New (
	other As GH_Rectangle
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Rectangle
Circle to mimic.
See Also
Reference
GH_Rectangle Class
GH_Rectangle Overload
Grasshopper.Kernel.Types Namespace