Grasshopper SDK
GH_Skin.palette_warning_selected Field
 Warnings, selected palette. Default background for parameters and components that carry warnings.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_PaletteStyle palette_warning_selected
Public Shared palette_warning_selected As GH_PaletteStyle
Field Value
Type: GH_PaletteStyle
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace