Grasshopper SDK
GH_TreeFilter.FindPrevLevelChar Method
 Find the previous occurance of a char in a string that is level with the search start index.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int FindPrevLevelChar(
	string text,
	int index,
	char char
)
Public Shared Function FindPrevLevelChar (
	text As String,
	index As Integer,
	char As Char
) As Integer
Parameters
text
Type: System.String
String to search.
index
Type: System.Int32
Index to search from.
char
Type: System.Char
Char to match.
Return Value
Type: Int32
The index of the first level character match or -1 if no such character could be found.
See Also
Reference
GH_TreeFilter Class
Grasshopper.Kernel.Data Namespace