Grasshopper SDK
GH_SliderBase.ValueChanged Event
 Raised whenever the value of this slider is changed due to User-Interface methods.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_SliderBase.ValueChangedEventHandler ValueChanged
Public Event ValueChanged As GH_SliderBase.ValueChangedEventHandler
Value
Type: Grasshopper.GUI.Base.GH_SliderBase.ValueChangedEventHandler
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace