Grasshopper SDK
GH_StringMismatchException Class
 Exception used during Rule Set parsing.
Inheritance Hierarchy
System.Object
 System.Exception
 Grasshopper.Kernel.Data.GH_StringMismatchException
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_StringMismatchException : Exception
Public Class GH_StringMismatchException
	Inherits Exception
Constructors
Name | Description
GH_StringMismatchException()
Initializes a new instance of the GH_StringMismatchException class
GH_StringMismatchException(String)
Initializes a new instance of the GH_StringMismatchException class
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace