Grasshopper SDK
GH_SettingsCategory Constructor (String, Bitmap)
 Create a new top-level category.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_SettingsCategory(
	string name,
	Bitmap icon
)
Protected Sub New (
	name As String,
	icon As Bitmap
)
Parameters
name
Type: System.String
Category name, keep it short.
icon
Type: System.Drawing.Bitmap
Category icon. If you supply an icon, it must be 48x48 pixels. If you supply a null instance, a generic Settings icon will be assigned.
See Also
Reference
GH_SettingsCategory Class
GH_SettingsCategory Overload
Grasshopper.GUI Namespace