Grasshopper SDK
GH_Material.CastFrom Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool CastFrom(
	Object source
)
Public Overrides Function CastFrom (
	source As Object
) As Boolean
Parameters
source
Type: System.Object
Return Value
Type: Boolean
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace