Grasshopper SDK
Node3d<T>.WeightedSubdivision Property
 Gets or sets whether subdivision is weighted based on content averages. Setting this value will only affect future subdivisions, not existing ones.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool WeightedSubdivision { get; set; }
Public Property WeightedSubdivision As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.WeightedSubdivision"]
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace