Grasshopper SDK
GH_SettingsServer.ConstainsEntry Method
 Tests to see if a given entry is stored in this settings database.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ConstainsEntry(
	string name
)
Public Function ConstainsEntry (
	name As String
) As Boolean
Parameters
name
Type: System.String
Entry name to query.
Return Value
Type: Boolean
True if the entry exists, false otherwise.
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace