Grasshopper SDK
GH_ComponentServer.AddCategorySymbolName Method
 Add a single char category description.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddCategorySymbolName(
	string fullCategoryName,
	char symbol
)
Public Sub AddCategorySymbolName (
	fullCategoryName As String,
	symbol As Char
)
Parameters
fullCategoryName
Type: System.String
The full name of the category.
symbol
Type: System.Char
The single char representing the category.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace