Grasshopper SDK
IGH_StateTag.Description Property
 Gets the description of this state tag.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Description { get; }
ReadOnly Property Description As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_StateTag.Description"]
See Also
Reference
IGH_StateTag Interface
Grasshopper.Kernel Namespace