Grasshopper SDK
GH_Grip.GripId Property
 Gets the Grip ID.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid GripId { get; }
Public ReadOnly Property GripId As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_Grip.GripId"]
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace