Grasshopper SDK
GH_DocumentObject.TriggerAutoSave Method
 Triggers the AutoSave function on the owner document with the object_changed flag.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void TriggerAutoSave()
Public Sub TriggerAutoSave
Implements
IGH_DocumentObject.TriggerAutoSave()
See Also
Reference
GH_DocumentObject Class
TriggerAutoSave Overload
Grasshopper.Kernel Namespace