Grasshopper SDK
GH_DocumentObject.Icon Property
 Override this function to supply a custom icon (24x24 pixels). The result of this property is cached, so don't worry if icon retrieval is not very fast.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual Bitmap Icon { get; }
Protected Overridable ReadOnly Property Icon As Bitmap
	Get
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentObject.Icon"]
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace