Grasshopper SDK
GH_PersistentParam<T>.Menu_AppendInternaliseData Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void Menu_AppendInternaliseData(
	ToolStripDropDown menu
)
Protected Overridable Sub Menu_AppendInternaliseData (
	menu As ToolStripDropDown
)
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace