Grasshopper SDK
GH_TextBoxInputBase.Font Property
 Gets or sets the Font to use in this control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual Font Font { get; set; }
Public Overridable Property Font As Font
	Get
	Set
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_TextBoxInputBase.Font"]
See Also
Reference
GH_TextBoxInputBase Class
Grasshopper.GUI.Base Namespace