Grasshopper SDK
GH_Plane.GH_PlaneProxy Constructor
Initializes a new instance of the GH_Plane.GH_PlaneProxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PlaneProxy(
	GH_Plane nOwner
)
Public Sub New (
	nOwner As GH_Plane
)
Parameters
nOwner
Type: Grasshopper.Kernel.Types.GH_Plane
See Also
Reference
GH_Plane.GH_PlaneProxy Class
Grasshopper.Kernel.Types Namespace