Grasshopper SDK
GH_GraphicsUtil.RenderBalloonTag Method (Graphics, String, Font, Color, Color, PointF, Boolean)
 Draw a balloon tag in a container.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderBalloonTag(
	Graphics g,
	string text,
	Font font,
	Color backColor,
	Color foreColor,
	PointF tip,
	bool upright
)
Public Shared Sub RenderBalloonTag (
	g As Graphics,
	text As String,
	font As Font,
	backColor As Color,
	foreColor As Color,
	tip As PointF,
	upright As Boolean
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
text
Type: System.String
Text of tag.
font
Type: System.Drawing.Font
Font of tag.
backColor
Type: System.Drawing.Color
Background colour of balloon.
foreColor
Type: System.Drawing.Color
Foreground colour of balloon edge and text.
tip
Type: System.Drawing.PointF
Tip of balloon.
upright
Type: System.Boolean
If true, the balloon will be above the tip point.
See Also
Reference
GH_GraphicsUtil Class
RenderBalloonTag Overload
Grasshopper.GUI Namespace