Grasshopper SDK
GH_Document.InactiveObjects Method
 Returns all objects in the document that don't implement the IGH_ActiveObject interface
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_ActiveObject> InactiveObjects()
Public Function InactiveObjects As List(Of IGH_ActiveObject)
Return Value
Type: List<IGH_ActiveObject>
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace