Grasshopper SDK
GH_GraphicsUtil.RenderIcon Method
 Render an icon into a frame. The icon is positioned in the center and will be drawn at its own size multiplied by the system UiScale, provided it doesn't exceed the frame.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderIcon(
	Graphics graphics,
	RectangleF frame,
	Image icon
)
Public Shared Sub RenderIcon (
	graphics As Graphics,
	frame As RectangleF,
	icon As Image
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
frame
Type: System.Drawing.RectangleF
Limiting frame.
icon
Type: System.Drawing.Image
Icon to draw.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace