Grasshopper SDK
GH_Component.AddedToDocument Method
 Overrides the AddedToDocument method and delegates the call to all parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void AddedToDocument(
	GH_Document document
)
Public Overrides Sub AddedToDocument (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document that now owns this object.
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace