Grasshopper SDK
GH_Path.Dimension Property
 Gets or sets the value of the path at the given dimension index.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int this[
	int index
] { get; set; }
Public Default Property Dimension (
	index As Integer
) As Integer
	Get
	Set
Parameters
index
Type: System.Int32
Index of dimension.
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Path.Dimension(System.Int32)"]
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace