Grasshopper SDK
GH_Tooltip.AssignTooltipFields Method
 Set all fields of the Tooltip. You'll still need to call Show() to display the tooltip.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void AssignTooltipFields(
	string title = null,
	string text = null,
	string description = null,
	Image icon = null,
	Image diagram = null
)
Public Shared Sub AssignTooltipFields (
	Optional title As String = Nothing,
	Optional text As String = Nothing,
	Optional description As String = Nothing,
	Optional icon As Image = Nothing,
	Optional diagram As Image = Nothing
)
Parameters
title (Optional)
Type: System.String
The Title text on the tooltip
text (Optional)
Type: System.String
The text content of the tooltip
description (Optional)
Type: System.String
The block text to be displayed in the sunken area of the tooltip.
icon (Optional)
Type: System.Drawing.Image
The Icon to be displayed next to the Title.
diagram (Optional)
Type: System.Drawing.Image
The image to be displayed in the sunken area.
See Also
Reference
GH_Tooltip Class
Grasshopper.GUI Namespace