Grasshopper SDK
Utility.InvokeGetterSafe Method
 Call a getter property via its name. No exceptions are thrown.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Object InvokeGetterSafe(
	Object target,
	string property
)
Public Shared Function InvokeGetterSafe (
	target As Object,
	property As String
) As Object
Parameters
target
Type: System.Object
Object to invoke on.
property
Type: System.String
Name of property to invoke.
Return Value
Type: Object
The return value of the method.
See Also
Reference
Utility Class
Grasshopper Namespace