Grasshopper SDK
GH_ColourPickerBase.Bounds Property
 Gets or sets the Bounds for this control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle Bounds { get; set; }
Public Property Bounds As Rectangle
	Get
	Set
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.Bounds"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace