Grasshopper SDK
Instances.MarkovChain Property
 Gets the MarkovChain instance cached by the Instance Server. The Markov chain will be instantiated if it hasn't been already.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_MarkovChain MarkovChain { get; }
Public Shared ReadOnly Property MarkovChain As GH_MarkovChain
	Get
Property Value
Type: GH_MarkovChain
[Missing <value> documentation for "P:Grasshopper.Instances.MarkovChain"]
See Also
Reference
Instances Class
Grasshopper Namespace