Grasshopper SDK
GH_ParserSymbol.m_token Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string m_token
Public m_token As String
Field Value
Type: String
See Also
Reference
GH_ParserSymbol Class
Grasshopper.Kernel.Expressions Namespace