Grasshopper SDK
GH_UserObject.Guid Property
 Gets or sets the Guid of this User Object. The Guid is created anew during construction and is not stored in the User Object File. You should never have to set this field.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid Guid { get; set; }
Public Property Guid As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_UserObject.Guid"]
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace