Grasshopper SDK
GH_MouseTracker.DropFrames Method (Double)
 Find the youngest frame that deviates too much from the current locus and drop it and everything preceding it.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DropFrames(
	double deviation
)
Public Sub DropFrames (
	deviation As Double
)
Parameters
deviation
Type: System.Double
Local deviation.
See Also
Reference
GH_MouseTracker Class
DropFrames Overload
Grasshopper.GUI Namespace