Grasshopper SDK
GH_TreeFilter.FindPathBrackets Method
 Locate the two curly brackets that delineate the path segment of an Index Rule set.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool FindPathBrackets(
	string text,
	out int index0,
	out int index1
)
Public Shared Function FindPathBrackets (
	text As String,
	<OutAttribute> ByRef index0 As Integer,
	<OutAttribute> ByRef index1 As Integer
) As Boolean
Parameters
text
Type: System.String
String to search.
index0
Type: System.Int32
Index of opening curly bracket.
index1
Type: System.Int32
Index of closing curly bracket.
Return Value
Type: Boolean
True if valid brackets were found, false if not.
See Also
Reference
GH_TreeFilter Class
Grasshopper.Kernel.Data Namespace