Grasshopper SDK
GH_Document.FilterInactive Method
 Filter a list of objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static List<IGH_ActiveObject> FilterInactive(
	List<IGH_DocumentObject> in
)
Public Shared Function FilterInactive (
	in As List(Of IGH_DocumentObject)
) As List(Of IGH_ActiveObject)
Parameters
in
Type: System.Collections.Generic.List<IGH_DocumentObject>
The object list to filter
Return Value
Type: List<IGH_ActiveObject>
A list containing only the objects that don't implement the IGH_ActiveObject interface
Remarks
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace