Grasshopper SDK
GH_GeometryGroup.TypeName Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string TypeName { get; }
Public ReadOnly Property TypeName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometryGroup.TypeName"]
Implements
IGH_Goo.TypeName
See Also
Reference
GH_GeometryGroup Class
Grasshopper.Kernel.Types Namespace