Grasshopper SDK
GH_Point.ReferenceType Method (GH_PointRefType)
 Sets the type of the point reference data.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ReferenceType(
	GH_PointRefType new_type
)
Public Sub ReferenceType (
	new_type As GH_PointRefType
)
Parameters
new_type
Type: Grasshopper.Kernel.Types.GH_PointRefType
The new type, if type = Coordinate or Unset, then the Reference data will be erased.
Remarks
If there is no reference data, this function will create a new instance.
See Also
Reference
GH_Point Class
ReferenceType Overload
Grasshopper.Kernel.Types Namespace