Grasshopper SDK
GH_Variant Constructor (Plane)
 Create a new Plane variant.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant(
	Plane value
)
Public Sub New (
	value As Plane
)
Parameters
value
Type: Plane
Value of Variant.
See Also
Reference
GH_Variant Class
GH_Variant Overload
Grasshopper.Kernel.Expressions Namespace