Grasshopper SDK
GH_Document.GH_UndoUtil.RecordAddStateEvent Method
 Create and Record a new CreateAddStateEvent undo record.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid RecordAddStateEvent(
	string name,
	int stateIndex,
	GH_State state
)
Public Function RecordAddStateEvent (
	name As String,
	stateIndex As Integer,
	state As GH_State
) As Guid
Parameters
name
Type: System.String
Name of undo record.
stateIndex
Type: System.Int32
Index of state.
state
Type: Grasshopper.Kernel.GH_State
Solution state.
Return Value
Type: Guid
The ID of the newly added undo record or Guid.Empty on failure.
See Also
Reference
GH_Document.GH_UndoUtil Class
Grasshopper.Kernel Namespace