Grasshopper SDK
GH_ComponentServer.LoadingExceptions Property
 Gets a list of all the exceptions that were recorded during the most recent loading sequence.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<GH_LoadingException> LoadingExceptions { get; }
Public ReadOnly Property LoadingExceptions As List(Of GH_LoadingException)
	Get
Property Value
Type: List<GH_LoadingException>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.LoadingExceptions"]
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace