Grasshopper SDK
GH_DigitScrollerBase.SignBox Property
 Gets the Sign box for this control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle SignBox { get; }
Public ReadOnly Property SignBox As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.SignBox"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace