Grasshopper SDK
IGH_ObjectProxy.Desc Property
 Gets the Instance Description associated with this proxy.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_InstanceDescription Desc { get; }
ReadOnly Property Desc As IGH_InstanceDescription
	Get
Property Value
Type: IGH_InstanceDescription
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ObjectProxy.Desc"]
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace