Grasshopper SDK
CentralSettings.CanvasZuiZoomLevelChanged Event
 Raised whenever the CanvasZuiZoomLevel setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.CanvasZuiZoomLevelChangedEventHandler CanvasZuiZoomLevelChanged
Public Shared Event CanvasZuiZoomLevelChanged As CentralSettings.CanvasZuiZoomLevelChangedEventHandler
Value
Type: Grasshopper.CentralSettings.CanvasZuiZoomLevelChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace