Grasshopper SDK
GH_Link.Text Property
 Gets the list text.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Content Text { get; }
Public ReadOnly Property Text As IGH_Content
	Get
Property Value
Type: IGH_Content
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_Link.Text"]
See Also
Reference
GH_Link Class
Grasshopper.Documentation Namespace