Grasshopper SDK
GH_ConnectivityDiagram.GetAllOutputs Method
 Get all the Nodes that are part of the specified node output.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Guid> GetAllOutputs(
	Guid id
)
Public Function GetAllOutputs (
	id As Guid
) As List(Of Guid)
Parameters
id
Type: System.Guid
ID of node to query.
Return Value
Type: List<Guid>
A list of output nodes.
See Also
Reference
GH_ConnectivityDiagram Class
Grasshopper.Kernel Namespace