Grasshopper SDK
GH_ZuiAction.SetupTooltip Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract void SetupTooltip(
	PointF canvasPoint,
	GH_TooltipDisplayEventArgs e
)
Public MustOverride Sub SetupTooltip (
	canvasPoint As PointF,
	e As GH_TooltipDisplayEventArgs
)
Parameters
canvasPoint
Type: System.Drawing.PointF
e
Type: Grasshopper.GUI.GH_TooltipDisplayEventArgs
Implements
IGH_TooltipAwareObject.SetupTooltip(PointF, GH_TooltipDisplayEventArgs)
See Also
Reference
GH_ZuiAction Class
Grasshopper.Kernel Namespace