Grasshopper SDK
GH_TreeRules.AllowedChars Field
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string AllowedChars = "0123456789-|~&!,.;?*{}[]()<>="
Public Const AllowedChars As String = "0123456789-|~&!,.;?*{}[]()<>="
Field Value
Type: String
See Also
Reference
GH_TreeRules Class
Grasshopper.Kernel.Data Namespace