Grasshopper SDK
IGH_Structure.TopologyDescription Property
 Gets a description of the topology of the structure. Useful for debugging purposes.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string TopologyDescription { get; }
ReadOnly Property TopologyDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.IGH_Structure.TopologyDescription"]
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace