Grasshopper SDK
GH_Convert.ToVariableName Method
 Extract the implied variable name from a compound string. A string is considered compound if it contains a parenthesis pair with at least one character within the brackets.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string ToVariableName(
	string compound
)
Public Shared Function ToVariableName (
	compound As String
) As String
Parameters
compound
Type: System.String
String to parse.
Return Value
Type: String
The variable name as extracted or the original compound if no name was implied.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace