Grasshopper SDK
GH_Link.Tooltip Property
 Gets the link tooltip text.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Tooltip { get; }
Public ReadOnly Property Tooltip As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_Link.Tooltip"]
See Also
Reference
GH_Link Class
Grasshopper.Documentation Namespace