Grasshopper SDK
GH_Point.ReferenceSurface Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public BrepFace ReferenceSurface()
Public Function ReferenceSurface As BrepFace
Return Value
Type: BrepFace
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace