Grasshopper SDK
GH_RotationalFrame.Point Property
 Gets or sets the location of the rotation event.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF Point { get; set; }
Public Property Point As PointF
	Get
	Set
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.GUI.GH_RotationalFrame.Point"]
See Also
Reference
GH_RotationalFrame Structure
Grasshopper.GUI Namespace