Grasshopper SDK
GH_GeometricFont.DrawNumber Method (Graphics, Int64, Color, PointF)
 Draw an integer at the specified location.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void DrawNumber(
	Graphics graphics,
	long number,
	Color colour,
	PointF position
)
Public Shared Sub DrawNumber (
	graphics As Graphics,
	number As Long,
	colour As Color,
	position As PointF
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics to draw with.
number
Type: System.Int64
Number to draw.
colour
Type: System.Drawing.Color
Colour to draw with.
position
Type: System.Drawing.PointF
Position for first character.
See Also
Reference
GH_GeometricFont Class
DrawNumber Overload
Grasshopper.GUI Namespace