Grasshopper SDK
GH_RuntimeMessage Class
 Contains all fields that together define a RuntimeMessage. Runtime Messages are created and recorded by document objects during Grasshopper solutions.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_RuntimeMessage
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_RuntimeMessage
Public Class GH_RuntimeMessage
The GH_RuntimeMessage type exposes the following members.
Constructors
Name | Description
GH_RuntimeMessage
Initializes a new instance of the GH_RuntimeMessage class
Top
Properties
Name | Description
Event
 Gets the time at which the message was recorded.
HasSource
 Gets a value indicating whether or not this message has a source.
Message
 Gets the contents of the message.
Source
 Gets a string describing the source object that created the message.
Type
 Gets the type qualifier of the message.
Top
See Also
Reference
Grasshopper.Kernel Namespace