Grasshopper SDK
GH_UserObject.InstantiateObject Method
 Instantiate a new IGH_DocumentObject from this User Object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_DocumentObject InstantiateObject()
Public Function InstantiateObject As IGH_DocumentObject
Return Value
Type: IGH_DocumentObject
The IGH_DocumentObject instance defined inside the UserObject file or null on error.
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace