Grasshopper SDK
GH_NickNameAction.Object_Redo Method
Namespace: Grasshopper.Kernel.Undo.Actions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override void Object_Redo(
	GH_Document doc,
	IGH_DocumentObject obj
)
Protected Overrides Sub Object_Redo (
	doc As GH_Document,
	obj As IGH_DocumentObject
)
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
obj
Type: Grasshopper.Kernel.IGH_DocumentObject
See Also
Reference
GH_NickNameAction Class
Grasshopper.Kernel.Undo.Actions Namespace