Grasshopper SDK
GH_ComponentServer.EmitObjectProxy Method
 Get the proxy that is associated with the given Object ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_ObjectProxy EmitObjectProxy(
	Guid id
)
Public Function EmitObjectProxy (
	id As Guid
) As IGH_ObjectProxy
Parameters
id
Type: System.Guid
ID to search for.
Return Value
Type: IGH_ObjectProxy
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace