Grasshopper SDK
GH_PanelEditorControl Constructor
Initializes a new instance of the GH_PanelEditorControl class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PanelEditorControl()
Public Sub New
See Also
Reference
GH_PanelEditorControl Class
Grasshopper.GUI Namespace