Grasshopper SDK
IGH_PreviewArgs.ShadeMaterial Property
 Gets the document default material for unselected Faces.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
DisplayMaterial ShadeMaterial { get; }
ReadOnly Property ShadeMaterial As DisplayMaterial
	Get
Property Value
Type: DisplayMaterial
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_PreviewArgs.ShadeMaterial"]
See Also
Reference
IGH_PreviewArgs Interface
Grasshopper.Kernel Namespace