Grasshopper SDK
GH_DocumentTree Constructor
 Create a new document tree.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentTree(
	GH_Document root
)
Public Sub New (
	root As GH_Document
)
Parameters
root
Type: Grasshopper.Kernel.GH_Document
Root document.
See Also
Reference
GH_DocumentTree Class
Grasshopper.Kernel Namespace