Grasshopper SDK
GH_PointRefData.m_RefIndex Field
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int m_RefIndex
Public m_RefIndex As Integer
Field Value
Type: Int32
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace