Grasshopper SDK
IGH_Author Interface
 Provides of collection of basic author details.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_Author
Public Interface IGH_Author
The IGH_Author type exposes the following members.
Properties
Name | Description
Address
 Gets the address of the author.
Company
 Gets the Company name of the author.
Copyright
 Gets the copyright message for these details.
Email
 Gets the email of the author.
IsEmpty
 Gets whether any data has been assigned to this object.
Name
 Gets the name of the author.
Phone
 Gets the phone number of the author.
Website
 Gets the website of the author.
Top
See Also
Reference
Grasshopper.Kernel Namespace