Grasshopper SDK
GH_Convert.ToUVInterval Method
 Convert data into Grasshopper.Kernel.Types.UVInterval.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToUVInterval(
	Object data,
	ref UVInterval rc,
	GH_Conversion conversion_level
)
Public Shared Function ToUVInterval (
	data As Object,
	ByRef rc As UVInterval,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Grasshopper.Kernel.Types.UVInterval
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace