Grasshopper SDK
IGH_Attributes.HasInputGrip Property
 Gets a value indicating whether or not these attributes have an input grip.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool HasInputGrip { get; }
ReadOnly Property HasInputGrip As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.HasInputGrip"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace