Grasshopper SDK
GH_ComponentParamServer.RegisterOutputParam Method (IGH_Param, Int32)
 Add a parameter at the specific index of the output list.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RegisterOutputParam(
	IGH_Param new_param,
	int at_index
)
Public Function RegisterOutputParam (
	new_param As IGH_Param,
	at_index As Integer
) As Boolean
Parameters
new_param
Type: Grasshopper.Kernel.IGH_Param
at_index
Type: System.Int32
Return Value
Type: Boolean
See Also
Reference
GH_ComponentParamServer Class
RegisterOutputParam Overload
Grasshopper.Kernel Namespace