Grasshopper SDK
GH_Slider.DecimalPlaces Property
 Gets or sets the number of decimal places allowed for Floating Point Sliders.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int DecimalPlaces { get; set; }
Public Property DecimalPlaces As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.DecimalPlaces"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace