Grasshopper SDK
CentralSettings.FormatENotationDigits Property
 Gets or sets how many digits ought to be used for scientific notation formatted numbers.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int FormatENotationDigits { get; set; }
Public Shared Property FormatENotationDigits As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.CentralSettings.FormatENotationDigits"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace