Grasshopper SDK
Folders.AutoSaveFolder Property
 Gets the directory in windows ApplicationData that contains the Grasshopper autosave files.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string AutoSaveFolder { get; }
Public Shared ReadOnly Property AutoSaveFolder As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Folders.AutoSaveFolder"]
Return Value
Type: String
A directory path.
See Also
Reference
Folders Class
Grasshopper Namespace