Grasshopper SDK
GH_RuntimeFile.TagErranyms Field
 String tag used to identify Do Not Confuse collections in documentation source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagErranyms = "DONTCONFUSE"
Public Const TagErranyms As String = "DONTCONFUSE"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace