Grasshopper SDK
GH_Border.Contains Method
 Test a point for border inclusion.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Contains(
	PointF pt
)
Public Function Contains (
	pt As PointF
) As Boolean
Parameters
pt
Type: System.Drawing.PointF
Point to test.
Return Value
Type: Boolean
True if pt is inside or on this border.
See Also
Reference
GH_Border Class
Grasshopper.GUI.Canvas Namespace