Grasshopper SDK
GH_Convert.ToSurface_Secondary Method
 Attempts to convert other data types into an IOnSurface. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToSurface_Secondary(
	Object data,
	ref Surface rc
)
Public Shared Function ToSurface_Secondary (
	data As Object,
	ByRef rc As Surface
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Surface
Return Value
Type: Boolean
An IOnSurface instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace