Grasshopper SDK
GH_Variant.Type Property
 Gets the Type of this Variant.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_VariantType Type { get; }
Public ReadOnly Property Type As GH_VariantType
	Get
Property Value
Type: GH_VariantType
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_Variant.Type"]
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace