Grasshopper SDK
GH_Canvas.CursorControlPosition Property
 Gets the location of the cursor in Control coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point CursorControlPosition { get; }
Public ReadOnly Property CursorControlPosition As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.CursorControlPosition"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace