Grasshopper SDK
CentralSettings.FormatMultiplesOfPi Property
 Gets or sets whether multiples of 0.5*Pi ought to be special cased.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool FormatMultiplesOfPi { get; set; }
Public Shared Property FormatMultiplesOfPi As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.FormatMultiplesOfPi"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace