Grasshopper SDK
GH_Slider_Obsolete.DrawRail Property
 Gets or sets a flag that control whether or not grip rails are drawn.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DrawRail { get; set; }
Public Property DrawRail As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider_Obsolete.DrawRail"]
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace