Grasshopper SDK
GH_UndoAction Constructor
Initializes a new instance of the GH_UndoAction class
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_UndoAction()
Protected Sub New
See Also
Reference
GH_UndoAction Class
Grasshopper.Kernel.Undo Namespace