Grasshopper SDK
IGH_ValueProxy.UserString Property
 Gets or sets the user-defined string that describes this proxy This only really makes sense if the Proxy is Parsable.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string UserString { get; set; }
Property UserString As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ValueProxy.UserString"]
Return Value
Type: String
If the proxy contains no user-string, the ToString result is returned instead
See Also
Reference
IGH_ValueProxy Interface
Grasshopper.Kernel Namespace