Grasshopper SDK
IGH_UpgradeObject.Upgrade Method
 Upgrade an existing object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_DocumentObject Upgrade(
	IGH_DocumentObject target,
	GH_Document document
)
Function Upgrade (
	target As IGH_DocumentObject,
	document As GH_Document
) As IGH_DocumentObject
Parameters
target
Type: Grasshopper.Kernel.IGH_DocumentObject
Object to upgrade.
document
Type: Grasshopper.Kernel.GH_Document
Document that contains the object.
Return Value
Type: IGH_DocumentObject
The newly created object on success, null on failure.
See Also
Reference
IGH_UpgradeObject Interface
Grasshopper.Kernel Namespace