Grasshopper SDK
GH_BracketMismatchException Constructor (String, Int32)
Initializes a new instance of the GH_BracketMismatchException class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_BracketMismatchException(
	string message,
	int location
)
Public Sub New (
	message As String,
	location As Integer
)
Parameters
message
Type: System.String
location
Type: System.Int32
See Also
Reference
GH_BracketMismatchException Class
GH_BracketMismatchException Overload
Grasshopper.Kernel.Data Namespace