Grasshopper SDK
GH_BackgroundSettings.Hatch Property
 Background hatch brush style. This property is only used if BackgroundStyle is set to GH_ThemeBackgroundStyle.Hatch.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public HatchStyle Hatch { get; set; }
Public Property Hatch As HatchStyle
	Get
	Set
Property Value
Type: HatchStyle
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_BackgroundSettings.Hatch"]
See Also
Reference
GH_BackgroundSettings Class
Grasshopper.GUI.Theme Namespace