Grasshopper SDK
GH_AssemblyInfo.Id Property
 Gets the Id of this assembly. By default the Id is a hash of the name.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual Guid Id { get; }
Public Overridable ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.Id"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace