Grasshopper SDK
GH_StateTagList Class
 Maintains a collection of IGH_StateTag objects.
Inheritance Hierarchy
System.Object
 System.Collections.Generic.List<IGH_StateTag>
 Grasshopper.Kernel.GH_StateTagList
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_StateTagList : List<IGH_StateTag>,
	IGH_TooltipAwareObject
Public Class GH_StateTagList
	Inherits List(Of IGH_StateTag)
	Implements IGH_TooltipAwareObject
The GH_StateTagList type exposes the following members.
Constructors
Name | Description
GH_StateTagList
Initializes a new instance of the GH_StateTagList class
Top
Properties
Name | Description
BoundingBox
 Gets the boundingbox of all StateTags.
Top
Methods
Name | Description
Layout
 Layout the StateTags.
RenderStateTags
 Render all StateTags in this list to the designated Graphics surface.
Top
See Also
Reference
Grasshopper.Kernel Namespace