Grasshopper SDK
Scale.ScalingFrame Property
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Plane ScalingFrame { get; set; }
Public Property ScalingFrame As Plane
	Get
	Set
Property Value
Type: Plane
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Transforms.Scale.ScalingFrame"]
See Also
Reference
Scale Class
Grasshopper.Kernel.Types.Transforms Namespace