Grasshopper SDK
GH_Viewport.ScreenPort Property
 Gets the dimensions of the viewport in control coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle ScreenPort { get; }
Public ReadOnly Property ScreenPort As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.ScreenPort"]
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace