Grasshopper SDK
GH_MouseTracker.Deviation Method (DateTime, DateTime)
 Gets the maximum deviation of the recorded mouse path. The maximum deviation is the furthest distance the mouse has been from the first point in the history span. It does not measure the largest deviation between any two points in the time span, only the first and any subsequent point.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Deviation(
	DateTime t0,
	DateTime t1
)
Public Function Deviation (
	t0 As DateTime,
	t1 As DateTime
) As Double
Parameters
t0
Type: System.DateTime
Represents the earliest time to include.
t1
Type: System.DateTime
Represents the latest time to include.
Return Value
Type: Double
See Also
Reference
GH_MouseTracker Class
Deviation Overload
Grasshopper.GUI Namespace