Grasshopper SDK
GH_Component.InstanceDescription Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string InstanceDescription { get; }
Public Overrides ReadOnly Property InstanceDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.InstanceDescription"]
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace