Grasshopper SDK
GH_SliderBase.TextColour Property
 Gets or sets the fill colour for the slider text.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color TextColour { get; set; }
Public Property TextColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.TextColour"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace