Grasshopper SDK
GH_Document.Undo Method
 Perform the first undo event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Undo()
Public Function Undo As Boolean
Return Value
Type: Boolean
True on success, false on no undo event or invalid undo event.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace