Grasshopper SDK
IGH_StateTag.Render Method
 Render this tag into a graphics surface.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void Render(
	Graphics graphics
)
Sub Render (
	graphics As Graphics
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw to.
See Also
Reference
IGH_StateTag Interface
Grasshopper.Kernel Namespace