Grasshopper SDK
GH_SolutionSpan Constructor
 Creates a new instance of the GH_SolutionSpan structure.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SolutionSpan(
	DateTime t0,
	DateTime t1
)
Public Sub New (
	t0 As DateTime,
	t1 As DateTime
)
Parameters
t0
Type: System.DateTime
Time of solution start.
t1
Type: System.DateTime
Time of solution end.
See Also
Reference
GH_SolutionSpan Structure
Grasshopper.Kernel Namespace