Grasshopper SDK
GH_Component.RemovedFromDocument Method
 Overrides the RemovedFromDocument method and delegates the call to all parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void RemovedFromDocument(
	GH_Document document
)
Public Overrides Sub RemovedFromDocument (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document that now no longer owns this object.
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace