Grasshopper SDK
GH_ScrollBarVerticalBase.ScrollBar Method (Rectangle)
 Compute the size and position of the scroll bar in the scroll rail.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle ScrollBar(
	Rectangle rail
)
Public Function ScrollBar (
	rail As Rectangle
) As Rectangle
Parameters
rail
Type: System.Drawing.Rectangle
Rail for scroll bar to move around in.
Return Value
Type: Rectangle
A rectangle describing the location and extends of the scroll bar.
See Also
Reference
GH_ScrollBarVerticalBase Class
ScrollBar Overload
Grasshopper.GUI.Base Namespace