Grasshopper SDK
GH_Painter.ConnectionPath Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath ConnectionPath(
	PointF A,
	PointF B,
	GH_WireDirection ADir,
	GH_WireDirection BDir
)
Public Shared Function ConnectionPath (
	A As PointF,
	B As PointF,
	ADir As GH_WireDirection,
	BDir As GH_WireDirection
) As GraphicsPath
Parameters
A
Type: System.Drawing.PointF
B
Type: System.Drawing.PointF
ADir
Type: Grasshopper.GUI.Canvas.GH_WireDirection
BDir
Type: Grasshopper.GUI.Canvas.GH_WireDirection
Return Value
Type: GraphicsPath
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace