Grasshopper SDK
GH_PreviewExpiredEventArgs Constructor
Initializes a new instance of the GH_PreviewExpiredEventArgs class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PreviewExpiredEventArgs(
	bool eForceRedraw
)
Public Sub New (
	eForceRedraw As Boolean
)
Parameters
eForceRedraw
Type: System.Boolean
See Also
Reference
GH_PreviewExpiredEventArgs Class
Grasshopper.Kernel Namespace