Grasshopper SDK
GH_Gradient.ColourAt Method
 Evaluate the colour at a specific parameter.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color ColourAt(
	double t
)
Public Function ColourAt (
	t As Double
) As Color
Parameters
t
Type: System.Double
Parameter to evaluate.
Return Value
Type: Color
The colour at the given parameter.
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace