Grasshopper SDK
IGH_Attributes.IsPickRegion Method (RectangleF, GH_PickBox)
 Determines whether a rectangle is a valid pick region for this object. By default, the picking rectangle is intersected with the Bounds rectangle.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsPickRegion(
	RectangleF box,
	GH_PickBox method
)
Function IsPickRegion (
	box As RectangleF,
	method As GH_PickBox
) As Boolean
Parameters
box
Type: System.Drawing.RectangleF
Selection box.
method
Type: Grasshopper.Kernel.GH_PickBox
Selection method.
Return Value
Type: Boolean
See Also
Reference
IGH_Attributes Interface
IsPickRegion Overload
Grasshopper.Kernel Namespace