Grasshopper SDK
GH_Path.IsAncestor Method
 Test another path to see if it is an ancestor of this path. For a path to be considered an ancestor, it must share the initial dimensions.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsAncestor(
	GH_Path potential_ancestor,
	ref int additional_generations
)
Public Function IsAncestor (
	potential_ancestor As GH_Path,
	ByRef additional_generations As Integer
) As Boolean
Parameters
potential_ancestor
Type: Grasshopper.Kernel.Data.GH_Path
Parental path to test.
additional_generations
Type: System.Int32
This value will hold the number of generations between parent and child path.
Return Value
Type: Boolean
True if other overlaps completely with this path while being at least one element shorter.
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace