Grasshopper SDK
GH_DocumentObject.ValuesChanged Method
 Override this method if you want to respond to changes to the value table. The base implementation is empty, so you don't have to call it.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void ValuesChanged()
Protected Overridable Sub ValuesChanged
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace