Grasshopper SDK
GH_FontServer.ConsoleAdjusted Property
 FontFamily.GenericMonospace, 10pt, regular, adjusted to counter UI scaling.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font ConsoleAdjusted { get; }
Public Shared ReadOnly Property ConsoleAdjusted As Font
	Get
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FontServer.ConsoleAdjusted"]
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace