Grasshopper SDK
GH_DocumentEditor.ScriptAccess_OpenDocument Method (String)
 Loads a specific file off the hard disk into the Canvas.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ScriptAccess_OpenDocument(
	string filename
)
Public Function ScriptAccess_OpenDocument (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
File to load.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_DocumentEditor Class
ScriptAccess_OpenDocument Overload
Grasshopper.GUI Namespace