Grasshopper SDK
GH_ObjectChangedEventArgs Constructor (IGH_DocumentObject, String, Object)
Initializes a new instance of the GH_ObjectChangedEventArgs class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ObjectChangedEventArgs(
	IGH_DocumentObject eSender,
	string eCustomDescription,
	Object eTag
)
Public Sub New (
	eSender As IGH_DocumentObject,
	eCustomDescription As String,
	eTag As Object
)
Parameters
eSender
Type: Grasshopper.Kernel.IGH_DocumentObject
eCustomDescription
Type: System.String
eTag
Type: System.Object
See Also
Reference
GH_ObjectChangedEventArgs Class
GH_ObjectChangedEventArgs Overload
Grasshopper.Kernel Namespace