Grasshopper SDK
Instances.HideRemotePanel Method
 Hides the remote control panel.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool HideRemotePanel()
Public Shared Function HideRemotePanel As Boolean
Return Value
Type: Boolean
See Also
Reference
Instances Class
Grasshopper Namespace