Grasshopper SDK
Param_MeshParameters.ComponentGuid Property
Namespace: Grasshopper.Kernel.Parameters
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override Guid ComponentGuid { get; }
Public Overrides ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.Param_MeshParameters.ComponentGuid"]
See Also
Reference
Param_MeshParameters Class
Grasshopper.Kernel.Parameters Namespace