Grasshopper SDK
GH_Attributes<T>.Bounds Property
 Gets the rectangle that contains the active content of the attributes. Typically the Contents determine the active area for menus, tooltips etc. Attributes are not supposed to draw objects beyond the Bounds.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual RectangleF Bounds { get; set; }
Public Overridable Property Bounds As RectangleF
	Get
	Set
Property Value
Type: RectangleF
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.Bounds"]
Implements
IGH_Attributes.Bounds
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace