Grasshopper SDK
GH_DocumentObject.PingDocument Event
 Raised whenever an object needs to know which GH_Document it belongs to.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event IGH_DocumentObject.PingDocumentEventHandler PingDocument
Public Event PingDocument As IGH_DocumentObject.PingDocumentEventHandler
Value
Type: Grasshopper.Kernel.IGH_DocumentObject.PingDocumentEventHandler
Implements
IGH_DocumentObject.PingDocument
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace