Grasshopper SDK
IGH_Attributes.InstanceGuid Property
 Gets the instance ID for these attributes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid InstanceGuid { get; }
ReadOnly Property InstanceGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.InstanceGuid"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace