Grasshopper SDK
GH_GuidConflictSolution Enumeration
 Contains a list of all possible Assembly GUID conflict solutions
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_GuidConflictSolution
Public Enumeration GH_GuidConflictSolution
Members
Member name | Value | Description
Unset | 0 |  Indicates there is no solution picked yet
Replace | 1 |  Replace the loaded proxy with the conflicting proxy
ReplaceAll | 2 |  Replace all loaded proxies with all conflicting proxies in the current assembly
Skip | 3 |  Skip the conflicting proxy
SkipAll | 4 |  Skip all conflicting proxies in the current assembly
See Also
Reference
Grasshopper.Kernel Namespace