Grasshopper SDK
GH_IndexRuleSet.AddAnyDigitsRule Method
 Append a rule for any amount of digits.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddAnyDigitsRule()
Public Sub AddAnyDigitsRule
See Also
Reference
GH_IndexRuleSet Class
Grasshopper.Kernel.Data Namespace