Grasshopper SDK
GH_State.RemoveStateObject Method
 Remove an object from the database.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RemoveStateObject(
	Guid obj_id
)
Public Sub RemoveStateObject (
	obj_id As Guid
)
Parameters
obj_id
Type: System.Guid
See Also
Reference
GH_State Class
Grasshopper.Kernel Namespace