Grasshopper SDK
IGH_PreviewArgs.DefaultCurveThickness Property
 Gets the curve thickness as defined by the viewport display scheme.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
int DefaultCurveThickness { get; }
ReadOnly Property DefaultCurveThickness As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_PreviewArgs.DefaultCurveThickness"]
See Also
Reference
IGH_PreviewArgs Interface
Grasshopper.Kernel Namespace