Grasshopper SDK
GH_Theme Constructor (GH_Theme)
 Make a duplicate of another theme.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Theme(
	GH_Theme other
)
Public Sub New (
	other As GH_Theme
)
Parameters
other
Type: Grasshopper.GUI.Theme.GH_Theme
Theme to copy.
See Also
Reference
GH_Theme Class
GH_Theme Overload
Grasshopper.GUI.Theme Namespace