Grasshopper SDK
Versioning.BuildDate Property
 Gets the build date string. This is the visible release iteration tag. Typically the BuildDate is just the date (MMMM-dd, yyyy), but it may carry a prefix or suffix for special builds.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string BuildDate { get; }
Public Shared ReadOnly Property BuildDate As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Versioning.BuildDate"]
See Also
Reference
Versioning Class
Grasshopper Namespace