Grasshopper SDK
GH_Circle.IsValid Property
 Gets the validity of this instance. Circles are valid when their base planes are valid and when the radius is larger than zero.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool IsValid { get; }
Public Overrides ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Circle.IsValid"]
See Also
Reference
GH_Circle Class
Grasshopper.Kernel.Types Namespace