Grasshopper SDK
GH_Gradient.DisplayGradientEditor Method
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DisplayGradientEditor()
Public Sub DisplayGradientEditor
See Also
Reference
GH_Gradient Class
Grasshopper.GUI.Gradient Namespace