Grasshopper SDK
GH_SignatureException Constructor
Initializes a new instance of the GH_SignatureException class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SignatureException(
	List<GH_Variant> args,
	string name
)
Public Sub New (
	args As List(Of GH_Variant),
	name As String
)
Parameters
args
Type: System.Collections.Generic.List<GH_Variant>
name
Type: System.String
See Also
Reference
GH_SignatureException Class
Grasshopper.Kernel.Expressions Namespace