Grasshopper SDK
GH_Canvas.NavigationPanRight Property
 Gets or sets the special key for panning right.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Keys NavigationPanRight { get; set; }
Public Shared Property NavigationPanRight As Keys
	Get
	Set
Property Value
Type: Keys
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.NavigationPanRight"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace