Grasshopper SDK
GH_Canvas.ModifiersEnabled Property
 Gets or sets the modifiers enabled flag. When modifiers are disabled, only zooming and panning is still allowed.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ModifiersEnabled { get; set; }
Public Property ModifiersEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.ModifiersEnabled"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace