Grasshopper SDK
GH_Convert.FindRhinoObjectByNameAndType Method
 Search the current Rhino document for an object with a given name of a given type.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static RhinoObject FindRhinoObjectByNameAndType(
	string name,
	ObjectType type
)
Public Shared Function FindRhinoObjectByNameAndType (
	name As String,
	type As ObjectType
) As RhinoObject
Parameters
name
Type: System.String
Name of object.
type
Type: ObjectType
Geometry type of object.
Return Value
Type: RhinoObject
An object that matches the name + type filter or null if no object could be found.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace