Grasshopper SDK
GH_ComplexNumber Constructor (Complex)
Initializes a new instance of the GH_ComplexNumber class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ComplexNumber(
	Complex number
)
Public Sub New (
	number As Complex
)
Parameters
number
Type: Grasshopper.Kernel.Types.Complex
See Also
Reference
GH_ComplexNumber Class
GH_ComplexNumber Overload
Grasshopper.Kernel.Types Namespace