Grasshopper SDK
GH_Param<T>.SourceCount Property
 Gets the number of sources for this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual int SourceCount { get; }
Public Overridable ReadOnly Property SourceCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.SourceCount"]
Implements
IGH_Param.SourceCount
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace