Grasshopper SDK
GH_Curve Constructor (Guid, Int32)
 Create a new references edge curve that references an edge index in a Rhino Brep object.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Curve(
	Guid ref_guid,
	int ref_edge
)
Public Sub New (
	ref_guid As Guid,
	ref_edge As Integer
)
Parameters
ref_guid
Type: System.Guid
ID of Brep to reference.
ref_edge
Type: System.Int32
Edge index of Brep to reference.
See Also
Reference
GH_Curve Class
GH_Curve Overload
Grasshopper.Kernel.Types Namespace