Grasshopper SDK
IGH_FieldElement.Duplicate Method
 Create an exact copy of this element.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_FieldElement Duplicate()
Function Duplicate As IGH_FieldElement
Return Value
Type: IGH_FieldElement
See Also
Reference
IGH_FieldElement Interface
Grasshopper.Kernel.Types Namespace