Grasshopper SDK
GH_Param<T>.ClearProxySources Method
 Remove all proxy sources without attempting to relink them.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void ClearProxySources()
Public Overridable Sub ClearProxySources
Implements
IGH_Param.ClearProxySources()
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace