Grasshopper SDK
GH_Attributes<T>.OutputGrip Property
 Gets the output grip location for these attributes. If HasOutputGrip equals False, this point is meaningless.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual PointF OutputGrip { get; }
Public Overridable ReadOnly Property OutputGrip As PointF
	Get
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.OutputGrip"]
Implements
IGH_Attributes.OutputGrip
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace