Grasshopper SDK
IGH_PreviewMeshData.DestroyPreviewMeshes Method
 Erase all cached preview meshes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void DestroyPreviewMeshes()
Sub DestroyPreviewMeshes
See Also
Reference
IGH_PreviewMeshData Interface
Grasshopper.Kernel Namespace