Grasshopper SDK
GH_DocumentObject.OnPingDocument Method
 Raise the PingDocument Event on the toplevel object and try to find the document which owns this object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document OnPingDocument()
Public Function OnPingDocument As GH_Document
Return Value
Type: GH_Document
The document which owns this object if successful, or nothing if no document owns this object.
Implements
IGH_DocumentObject.OnPingDocument()
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace