Grasshopper SDK
GH_IndexRange.Union Method
 Create a range which contains both input ranges.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_IndexRange Union(
	GH_IndexRange range0,
	GH_IndexRange range1
)
Public Shared Function Union (
	range0 As GH_IndexRange,
	range1 As GH_IndexRange
) As GH_IndexRange
Parameters
range0
Type: Grasshopper.Kernel.Data.GH_IndexRange
range1
Type: Grasshopper.Kernel.Data.GH_IndexRange
Return Value
Type: GH_IndexRange
Smallest range big enough to contain both range0 and range1.
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace