Grasshopper SDK
GH_ComponentServer.AddCategoryIcon Method
 Add an icon for a tab category. 16x16 images are required.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddCategoryIcon(
	string fullCategoryName,
	Bitmap icon
)
Public Sub AddCategoryIcon (
	fullCategoryName As String,
	icon As Bitmap
)
Parameters
fullCategoryName
Type: System.String
The full name of the category.
icon
Type: System.Drawing.Bitmap
the icon to display on the tab (has to be a 16x16 image).
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace