Grasshopper SDK
GH_Grip Constructor (Double, Color, Color)
Initializes a new instance of the GH_Grip class
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Grip(
	double parameter,
	Color colourLeft,
	Color colourRight
)
Public Sub New (
	parameter As Double,
	colourLeft As Color,
	colourRight As Color
)
Parameters
parameter
Type: System.Double
colourLeft
Type: System.Drawing.Color
colourRight
Type: System.Drawing.Color
See Also
Reference
GH_Grip Class
GH_Grip Overload
Grasshopper.GUI.Gradient Namespace