Grasshopper SDK
GH_PointRefData.m_RefType Field
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PointRefType m_RefType
Public m_RefType As GH_PointRefType
Field Value
Type: GH_PointRefType
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace