Grasshopper SDK
GH_ZuiAction.IsTooltipRegion Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsTooltipRegion(
	PointF canvasPoint
)
Public Function IsTooltipRegion (
	canvasPoint As PointF
) As Boolean
Parameters
canvasPoint
Type: System.Drawing.PointF
Return Value
Type: Boolean
Implements
IGH_TooltipAwareObject.IsTooltipRegion(PointF)
See Also
Reference
GH_ZuiAction Class
Grasshopper.Kernel Namespace