Grasshopper SDK
GH_Slider.TextColour Property
 Gets or sets the fill colour for the slider text.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color TextColour { get; set; }
Public Property TextColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.TextColour"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace