Grasshopper SDK
GH_UndoState Enumeration
 State enumeration for undo records.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_UndoState
Public Enumeration GH_UndoState
Members
Member name | Value | Description
undo | 0 |  Record can be undone.
redo | 1 |  Record can be redone
See Also
Reference
Grasshopper.Kernel.Undo Namespace