Grasshopper SDK
GH_Canvas.Document_SettingsChangedEventHandler Delegate
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void Document_SettingsChangedEventHandler(
	GH_Document sender,
	GH_DocSettingsEventArgs e
)
Public Delegate Sub Document_SettingsChangedEventHandler (
	sender As GH_Document,
	e As GH_DocSettingsEventArgs
)
Parameters
sender
Type: Grasshopper.Kernel.GH_Document
e
Type: Grasshopper.Kernel.GH_DocSettingsEventArgs
See Also
Reference
Grasshopper.GUI.Canvas Namespace