Grasshopper SDK
GH_ExpressionParser.AddVariable Method (String, Vector3d)
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddVariable(
	string name,
	Vector3d val
)
Public Sub AddVariable (
	name As String,
	val As Vector3d
)
Parameters
name
Type: System.String
val
Type: Vector3d
See Also
Reference
GH_ExpressionParser Class
AddVariable Overload
Grasshopper.Kernel.Expressions Namespace