Grasshopper SDK
GH_Component.DrawViewportMeshes Method
 Draw preview meshes for this component and all associated parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void DrawViewportMeshes(
	IGH_PreviewArgs args
)
Public Overridable Sub DrawViewportMeshes (
	args As IGH_PreviewArgs
)
Parameters
args
Type: Grasshopper.Kernel.IGH_PreviewArgs
Display data used during preview drawing.
Implements
IGH_PreviewObject.DrawViewportMeshes(IGH_PreviewArgs)
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace