Grasshopper SDK
GH_RelevantObjectData.Point Property
 Gets the point for which this GH_RelevantObjectData has been made.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF Point { get; }
Public ReadOnly Property Point As PointF
	Get
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RelevantObjectData.Point"]
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace