Grasshopper SDK
GH_Document.ToString Method
 A document serializes itself using the filename of the current path. This is useful for sorting purposes and ListBoxes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace