Grasshopper SDK
GH_DebugDescriptionWriter.CreateBlock Method
 Begin a new block. This will increase the depth by 1. You must call CloseBlock() if you call this function.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateBlock(
	string name
)
Public Sub CreateBlock (
	name As String
)
Parameters
name
Type: System.String
See Also
Reference
GH_DebugDescriptionWriter Class
Grasshopper.Kernel Namespace