Grasshopper SDK
GH_GeometricGoo<T>.LoadGeometry Method
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool LoadGeometry()
Public Overridable Function LoadGeometry As Boolean
Return Value
Type: Boolean
Implements
IGH_GeometricGoo.LoadGeometry()
See Also
Reference
GH_GeometricGoo<T> Class
LoadGeometry Overload
Grasshopper.Kernel.Types Namespace