Grasshopper SDK
GH_Document.ScheduleSolution Method (Int32)
 Schedule a new solution after a specified time interval. The schedule is erased if another solution is triggered before the schedule is executed. Tight schedules override loose schedules. If this method is called during a solution, the schedule will be started after the current solution completes.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ScheduleSolution(
	int delay
)
Public Sub ScheduleSolution (
	delay As Integer
)
Parameters
delay
Type: System.Int32
The delay (in milliseconds) between the completion of this solution and the start of the scheduled solution. If the delay is 1ms or more, a timer will be used to trigger a new solution sometime in the future. If a delay of 0ms is used, then the next solution will run recursively within the current solution. You should not use a delay of zero milliseconds too often as it will cause the Rhino process to run out of stack-space. The SolutionDepth property can be used to see how deeply recursive the solution currently is.
See Also
Reference
GH_Document Class
ScheduleSolution Overload
Grasshopper.Kernel Namespace