Grasshopper SDK
GH_Author.Write Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Write(
	GH_IWriter writer
)
Public Function Write (
	writer As GH_IWriter
) As Boolean
Parameters
writer
Type: GH_IO.Serialization.GH_IWriter
Return Value
Type: Boolean
Implements
GH_ISerializable.Write(GH_IWriter)
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace