Grasshopper SDK
GH_Document.FindParameter Method
 Search for parameters using an ID filter
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Param FindParameter(
	Guid id
)
Public Function FindParameter (
	id As Guid
) As IGH_Param
Parameters
id
Type: System.Guid
ID to search for
Return Value
Type: IGH_Param
The parameter with the ID, or Null if no parameter could be found
Remarks
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace