Grasshopper SDK
GH_Material.GH_Material_Proxy.IsRDKMaterial Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsRDKMaterial { get; }
Public ReadOnly Property IsRDKMaterial As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Material.GH_Material_Proxy.IsRDKMaterial"]
See Also
Reference
GH_Material.GH_Material_Proxy Class
Grasshopper.Kernel.Types Namespace