Grasshopper SDK
GH_ParserOperator.m_precedence Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ParserPrecedence m_precedence
Public m_precedence As GH_ParserPrecedence
Field Value
Type: GH_ParserPrecedence
See Also
Reference
GH_ParserOperator Class
Grasshopper.Kernel.Expressions Namespace