Grasshopper SDK
Instances.ActiveCanvas Property
 Gets the currently active Grasshopper canvas (if any)
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Canvas ActiveCanvas { get; }
Public Shared ReadOnly Property ActiveCanvas As GH_Canvas
	Get
Property Value
Type: GH_Canvas
[Missing <value> documentation for "P:Grasshopper.Instances.ActiveCanvas"]
See Also
Reference
Instances Class
Grasshopper Namespace