Grasshopper SDK
GH_PageSettings.GridPattern Property
 Gets or sets the dash pattern to apply to grid lines. Leave null or empty for a solid line.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float[] GridPattern { get; set; }
Public Property GridPattern As Single()
	Get
	Set
Property Value
Type: Single[]
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_PageSettings.GridPattern"]
See Also
Reference
GH_PageSettings Class
Grasshopper.GUI.Theme Namespace