Grasshopper SDK
GH_PathOffset Constructor
Initializes a new instance of the GH_PathOffset class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PathOffset()
Public Sub New
See Also
Reference
GH_PathOffset Class
GH_PathOffset Overload
Grasshopper.Kernel.Data Namespace