Grasshopper SDK
GH_Topic.ParseFile Method
 Parse a *.topic file and return a topic entry.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Topic ParseFile(
	string path
)
Public Shared Function ParseFile (
	path As String
) As GH_Topic
Parameters
path
Type: System.String
File to parse.
Return Value
Type: GH_Topic
The topic defined by the file. This function always returns a valid topic or it throws an exception.
See Also
Reference
GH_Topic Class
Grasshopper.Documentation Namespace