Grasshopper SDK
GH_Canvas.ModifiersChanged Event
 This event is raised whenever the ModifiersEnabled property changes.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.ModifiersChangedEventHandler ModifiersChanged
Public Event ModifiersChanged As GH_Canvas.ModifiersChangedEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.ModifiersChangedEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace