Grasshopper SDK
GH_Constraint Enumeration
 Constraints used during UI dragging operations.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_Constraint
Public Enumeration GH_Constraint
Members
Member name | Value | Description
None | 0 |  No constraint is placed on drag direction.
Vertical | 1 |  Dragging is constrainted to the vertical direction.
Horizontal | 2 |  Dragging is constrainted to the horizontal direction.
See Also
Reference
Grasshopper.GUI Namespace