Grasshopper SDK
GH_FieldElement.ElementGuid Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract Guid ElementGuid { get; }
Public MustOverride ReadOnly Property ElementGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_FieldElement.ElementGuid"]
Implements
IGH_FieldElement.ElementGuid
See Also
Reference
GH_FieldElement Class
Grasshopper.Kernel.Types Namespace