Grasshopper SDK
GH_StateTag.Stage Property
 Gets or sets the stage rectangle for this tag.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual Rectangle Stage { get; set; }
Public Overridable Property Stage As Rectangle
	Get
	Set
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_StateTag.Stage"]
Implements
IGH_StateTag.Stage
See Also
Reference
GH_StateTag Class
Grasshopper.Kernel Namespace