Grasshopper SDK
GH_RuleGroup Constructor
Initializes a new instance of the GH_RuleGroup class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RuleGroup(
	IEnumerable<int> numbers,
	bool negate
)
Public Sub New (
	numbers As IEnumerable(Of Integer),
	negate As Boolean
)
Parameters
numbers
Type: System.Collections.Generic.IEnumerable<Int32>
negate
Type: System.Boolean
See Also
Reference
GH_RuleGroup Class
Grasshopper.Kernel.Data Namespace