Grasshopper SDK
GH_Painter.DrawConnection Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DrawConnection(
	PointF a,
	PointF b,
	GH_WireDirection adir,
	GH_WireDirection bdir,
	bool asel,
	bool bsel,
	GH_WireType type
)
Public Sub DrawConnection (
	a As PointF,
	b As PointF,
	adir As GH_WireDirection,
	bdir As GH_WireDirection,
	asel As Boolean,
	bsel As Boolean,
	type As GH_WireType
)
Parameters
a
Type: System.Drawing.PointF
b
Type: System.Drawing.PointF
adir
Type: Grasshopper.GUI.Canvas.GH_WireDirection
bdir
Type: Grasshopper.GUI.Canvas.GH_WireDirection
asel
Type: System.Boolean
bsel
Type: System.Boolean
type
Type: Grasshopper.GUI.Canvas.GH_WireType
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace