Grasshopper SDK
Node3d<T>.Limit Property
 Gets the subdivision limit for this tree. This limit can only be set once when you create a new tree. It is fixed forever after.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Limit { get; }
Public ReadOnly Property Limit As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.Limit"]
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace