Grasshopper SDK
GH_TreeIndex Constructor
 Create a new instance of the GH_TreeIndex structure with preset path and item index.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_TreeIndex(
	GH_Path path,
	int item
)
Public Sub New (
	path As GH_Path,
	item As Integer
)
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
item
Type: System.Int32
See Also
Reference
GH_TreeIndex Structure
Grasshopper.Kernel.Data Namespace