Grasshopper SDK
GH_Document.Select Method (GH_RelevantObjectData, Boolean, Boolean)
 Default pick selection behaviour
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SelectionState Select(
	GH_RelevantObjectData obj_dat,
	bool bAdd,
	bool bRemove
)
Public Function Select (
	obj_dat As GH_RelevantObjectData,
	bAdd As Boolean,
	bRemove As Boolean
) As GH_SelectionState
Parameters
obj_dat
Type: Grasshopper.Kernel.GH_RelevantObjectData
Information regarding the object to be selected.
bAdd
Type: System.Boolean
If True, it will add the topmost unselected object that contains pt to the selection set. If False, the selection set will be cleared when an unselected object is picked
bRemove
Type: System.Boolean
If True, it will remove the topmost selected object that contains pt from the selection set.
Return Value
Type: GH_SelectionState
See Also
Reference
GH_Document Class
Select Overload
Grasshopper.Kernel Namespace