Grasshopper SDK
GH_ColourPickerBase.SRCSpaceBox Property
 Gets the rectangle containing the eye-dropper function.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle SRCSpaceBox { get; }
Public ReadOnly Property SRCSpaceBox As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.SRCSpaceBox"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace