Grasshopper SDK
GH_DocumentEventServer Constructor
 Create and register a new event server.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentEventServer(
	GH_Document document
)
Public Sub New (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document that owns this event server.
See Also
Reference
GH_DocumentEventServer Class
Grasshopper.Kernel Namespace