Grasshopper SDK
GH_Param<T>.Access Property
 Gets or sets the Access level for this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual GH_ParamAccess Access { get; set; }
Public Overridable Property Access As GH_ParamAccess
	Get
	Set
Property Value
Type: GH_ParamAccess
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.Access"]
Implements
IGH_Param.Access
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace