Grasshopper SDK
GH_RelevantObjectData Constructor
 Construct a new instance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RelevantObjectData(
	PointF pt
)
Public Sub New (
	pt As PointF
)
Parameters
pt
Type: System.Drawing.PointF
Point for relevant data aquisition.
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace