Grasshopper SDK
GH_CanvasNavigation Enumeration
 Enumerates all possible canvas navigations.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_CanvasNavigation
Public Enumeration GH_CanvasNavigation
Members
Member name | Value | Description
None | 0
PanLeft | 1
PanRight | 2
PanUp | 3
PanDown | 4
ZoomIn | 5
ZoomOut | 6
See Also
Reference
Grasshopper.GUI.Canvas Namespace