Grasshopper SDK
GH_Capsule.Highlight Property
 Gets the highlight size for this Capsule. Zero or negative means there is no highlight.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Highlight { get; }
Public ReadOnly Property Highlight As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Capsule.Highlight"]
See Also
Reference
GH_Capsule Class
Grasshopper.GUI.Canvas Namespace