Grasshopper SDK
Tracing.Assert Method (Guid, Exception)
 Display a typical assert dialog with stack information.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void Assert(
	Guid assert_id,
	Exception exception
)
Public Shared Sub Assert (
	assert_id As Guid,
	exception As Exception
)
Parameters
assert_id
Type: System.Guid
ID of assert message. Every assert must have a unique ID so individual messages can be ignored.
exception
Type: System.Exception
Exception object to harvest further information from.
See Also
Reference
Tracing Class
Assert Overload
Grasshopper Namespace