Grasshopper SDK
GH_Attributes<T>.Layout Method
 Perform dedicated layout logic specific to this particular DocumentObject. This method is called from PerformLayout if the existing layout is stale.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void Layout()
Protected Overridable Sub Layout
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace