Grasshopper SDK
GH_FieldElement.Force Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract Vector3d Force(
	Point3d location
)
Public MustOverride Function Force (
	location As Point3d
) As Vector3d
Parameters
location
Type: Point3d
Return Value
Type: Vector3d
Implements
IGH_FieldElement.Force(Point3d)
See Also
Reference
GH_FieldElement Class
Grasshopper.Kernel.Types Namespace