Grasshopper SDK
IGH_Structure.ClearData Method
 Removes all data from all paths without affecting the structure topology.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void ClearData()
Sub ClearData
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace