Grasshopper SDK
GH_StateTagLayoutDirection Enumeration
 Enumerates the possible layout directions for parameter state tags.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_StateTagLayoutDirection
Public Enumeration GH_StateTagLayoutDirection
Members
Member name | Value | Description
Left | 0 |  Floating and Input parameters should be layed out towards the left.
Right | 1 |  Output parameters should be layed out towards the right.
See Also
Reference
Grasshopper.Kernel Namespace