Grasshopper SDK
GH_Path Constructor (GH_Path)
 Creates an exact copy of another path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Path(
	GH_Path Other
)
Public Sub New (
	Other As GH_Path
)
Parameters
Other
Type: Grasshopper.Kernel.Data.GH_Path
Path to copy, cannot be null.
Exceptions
Exception | Condition
ArgumentNullException | Thrown if Other is a null reference
See Also
Reference
GH_Path Class
GH_Path Overload
Grasshopper.Kernel.Data Namespace