Grasshopper SDK
GH_Brep Constructor (GH_Brep)
Initializes a new instance of the GH_Brep class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Brep(
	GH_Brep other
)
Public Sub New (
	other As GH_Brep
)
Parameters
other
Type: Grasshopper.Kernel.Types.GH_Brep
See Also
Reference
GH_Brep Class
GH_Brep Overload
Grasshopper.Kernel.Types Namespace