Grasshopper SDK
GH_DigitScroller.Radix Property
 Gets or sets the radix point index.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Radix { get; set; }
Public Property Radix As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DigitScroller.Radix"]
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace