Grasshopper SDK
GH_HorizontalSeparator.DisplayMode Property
 Gets or sets the separator display mode.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SeparatorDisplay DisplayMode { get; set; }
Public Property DisplayMode As GH_SeparatorDisplay
	Get
	Set
Property Value
Type: GH_SeparatorDisplay
[Missing <value> documentation for "P:Grasshopper.GUI.GH_HorizontalSeparator.DisplayMode"]
See Also
Reference
GH_HorizontalSeparator Class
Grasshopper.GUI Namespace