Grasshopper SDK
GH_Curve.GH_CurveProxy.Type Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Type { get; }
Public ReadOnly Property Type As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Curve.GH_CurveProxy.Type"]
See Also
Reference
GH_Curve.GH_CurveProxy Class
Grasshopper.Kernel.Types Namespace