Grasshopper SDK
IGH_Tooltip.Text Property
 Gets or sets the tooltip Text.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Text { get; set; }
Property Text As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_Tooltip.Text"]
See Also
Reference
IGH_Tooltip Interface
Grasshopper.GUI Namespace