Grasshopper SDK
GH_PointRefData.EvSurface Method
 Evaluate this reference structure when applied to the surface
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point3d EvSurface(
	Surface s
)
Public Function EvSurface (
	s As Surface
) As Point3d
Parameters
s
Type: Surface
The surface to act on.
Return Value
Type: Point3d
A point if successful, or Nothing
Remarks
Surface is evaluated at normalized {uv} parameters
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace