Grasshopper SDK
GH_DigitNumber Constructor (Int32, Int32)
 Create a new GH_DigitNumber instance with the specified number of decimal places and a given radix position.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DigitNumber(
	int decimalPlaces,
	int radixPosition
)
Public Sub New (
	decimalPlaces As Integer,
	radixPosition As Integer
)
Parameters
decimalPlaces
Type: System.Int32
Amount of decimal places
radixPosition
Type: System.Int32
Index of radix symbol, -1 to disable the radix altogether.
See Also
Reference
GH_DigitNumber Class
GH_DigitNumber Overload
Grasshopper.GUI.Base Namespace