Grasshopper SDK
GH_SignatureException Class
Inheritance Hierarchy
System.Object
 System.Exception
 Grasshopper.Kernel.Expressions.GH_SignatureException
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_SignatureException : Exception
Public Class GH_SignatureException
	Inherits Exception
The GH_SignatureException type exposes the following members.
Constructors
Name | Description
GH_SignatureException
Initializes a new instance of the GH_SignatureException class
Top
Properties
Name | Description
Message |  (Overrides Exception.Message.)
Top
See Also
Reference
Grasshopper.Kernel.Expressions Namespace