Grasshopper SDK
GH_Document.ToggleEnabledFlags Method
 Toggle the enabled flags of all selected objects
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ToggleEnabledFlags()
Public Sub ToggleEnabledFlags
See Also
Reference
GH_Document Class
ToggleEnabledFlags Overload
Grasshopper.Kernel Namespace