Grasshopper SDK
GH_Time Class
 Represents a date and time. GH_Time re-implements the framework System.DateTime type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<DateTime>
 Grasshopper.Kernel.Types.GH_Time
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Time : GH_Goo<DateTime>
Public Class GH_Time
	Inherits GH_Goo(Of DateTime)
The GH_Time type exposes the following members.
Constructors
Name | Description
GH_Time()
 Blank constructor
GH_Time(DateTime)
Initializes a new instance of the GH_Time class
GH_Time(GH_Time)
Initializes a new instance of the GH_Time class
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance. Datetime is valid if it's not equal to DateTime.MaxValue
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateDateTime
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace