Grasshopper SDK
GH_Document.SolutionEnd Event
 This event is raised whenever a new solution request has been handled. Even if the document is locked.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Document.SolutionEndEventHandler SolutionEnd
Public Event SolutionEnd As GH_Document.SolutionEndEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.SolutionEndEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace