Grasshopper SDK
ITransform Interface
 Basic interface for a single Grasshopper transformation.
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface ITransform : GH_ISerializable
Public Interface ITransform
	Inherits GH_ISerializable
The ITransform type exposes the following members.
Properties
Name | Description
Name
Top
Methods
Name | Description
Duplicate
Reverse
ToMatrix
ToString
Top
See Also
Reference
Grasshopper.Kernel.Types.Transforms Namespace