Grasshopper SDK
GH_Component.AfterSolveInstance Method
 Override this method if you want to be called after the last call to SolveInstance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void AfterSolveInstance()
Protected Overridable Sub AfterSolveInstance
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace