Grasshopper SDK
GH_Format.FormatDate Method (DateTime)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatDate(
	DateTime data
)
Public Shared Function FormatDate (
	data As DateTime
) As String
Parameters
data
Type: System.DateTime
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatDate Overload
Grasshopper.Kernel Namespace