Grasshopper SDK
GH_State Class
 Represents a single recorded document state. A state contains values for an arbitrary set of objects inside the document.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_State
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_State : GH_ISerializable
Public Class GH_State
	Implements GH_ISerializable
The GH_State type exposes the following members.
Constructors
Name | Description
GH_State()
Initializes a new instance of the GH_State class
GH_State(GH_State)
Initializes a new instance of the GH_State class
Top
Properties
Name | Description
Data[Guid]
 Gets the state data stored under the specified ID
Data[Int32]
 Gets the state data stored under the specified index
LastModified
 Gets the date at which this state was last modified.
Name
 Gets or sets the name of this state.
StateCount
 Gets the number of items stored in the state database.
StateData
 Gets a pointer to the internal database of states.
Top
Methods
Name | Description
AddStateObject
 Append a new object to the database.
ClearStates
 Removes all items from the state database.
CreateStateFromDocument
 Creates a state database from a document.
Read
RemoveStateObject
 Remove an object from the database.
Write
Top
See Also
Reference
Grasshopper.Kernel Namespace