Grasshopper SDK
GH_Component.GH_InputParamManager.AddParameter Method (IGH_Param, String, String, String, GH_ParamAccess)
 Generic parameter addition. If you cannot use one of the utility methods provided by this class, you can register a customized parameter using this method.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int AddParameter(
	IGH_Param param,
	string name,
	string nickname,
	string description,
	GH_ParamAccess access
)
Public Function AddParameter (
	param As IGH_Param,
	name As String,
	nickname As String,
	description As String,
	access As GH_ParamAccess
) As Integer
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
The parameter to add.
name
Type: System.String
The name of the parameter. Keep it short, single words are best.
nickname
Type: System.String
The nickname of the parameter. Keep it short, single characters are best.
description
Type: System.String
The description of the parameter. Be succinct but clear, single sentences are best.
access
Type: Grasshopper.Kernel.GH_ParamAccess
Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
Return Value
Type: Int32
Index of the newly added parameter.
See Also
Reference
GH_Component.GH_InputParamManager Class
AddParameter Overload
Grasshopper.Kernel Namespace