Grasshopper SDK
GH_DigitScrollerBase.EdgeColour Property
 Gets or sets the edge colour of the control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color EdgeColour { get; set; }
Public Property EdgeColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.EdgeColour"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace