Grasshopper SDK
GH_Canvas.Painting Property
 Gets whether this canvas is currently busy painting itself.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Painting { get; }
Public ReadOnly Property Painting As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.Painting"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace