Grasshopper SDK
GH_NumberSliderSnappingEditor Class
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Grasshopper.GUI.GH_NumberSliderSnappingEditor
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_NumberSliderSnappingEditor : Form
Public Class GH_NumberSliderSnappingEditor
	Inherits Form
The GH_NumberSliderSnappingEditor type exposes the following members.
Constructors
Name | Description
GH_NumberSliderSnappingEditor
Initializes a new instance of the GH_NumberSliderSnappingEditor class
Top
Properties
Name | Description
SnapLines
Top
Methods
Name | Description
Dispose
Releases the unmanaged resources used by the GH_NumberSliderSnappingEditor and optionally releases the managed resources
 (Overrides Form.Dispose(Boolean).)
Top
See Also
Reference
Grasshopper.GUI Namespace