Grasshopper SDK
GH_Convert.ParseExpression Method
 Attempts to parse an expression.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Variant ParseExpression(
	string exp,
	bool recursive
)
Public Shared Function ParseExpression (
	exp As String,
	recursive As Boolean
) As GH_Variant
Parameters
exp
Type: System.String
Expression to parse.
recursive
Type: System.Boolean
If True, and the result of the expression is a String, the result is parsed again until the result is no longer a String or until the expression fails.
Return Value
Type: GH_Variant
The result of the (recursive) expression.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace