Grasshopper SDK
GH_ObjectWrapper.ClippingBox Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public BoundingBox ClippingBox { get; }
Public ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_ObjectWrapper.ClippingBox"]
Implements
IGH_PreviewData.ClippingBox
See Also
Reference
GH_ObjectWrapper Class
Grasshopper.Kernel.Types Namespace