Grasshopper SDK
GH_Convert.ToGHColour Method
 Convert data into GH_Colour.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToGHColour(
	Object data,
	GH_Conversion conversion_level,
	ref GH_Colour target
)
Public Shared Function ToGHColour (
	data As Object,
	conversion_level As GH_Conversion,
	ByRef target As GH_Colour
) As Boolean
Parameters
data
Type: System.Object
Data to convert
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
target
Type: Grasshopper.Kernel.Types.GH_Colour
Destination of conversion. If Null, a new instance will be created.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace