Grasshopper SDK
GH_Canvas.CanvasPostPaintGroups Event
 Raised after group drawing completes.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPostPaintGroupsEventHandler CanvasPostPaintGroups
Public Event CanvasPostPaintGroups As GH_Canvas.CanvasPostPaintGroupsEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPostPaintGroupsEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace