Grasshopper SDK
GH_CanvasViewportChangedEventArgs.Canvas Property
 Gets the Canvas whose viewport was changed.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Canvas Canvas { get; }
Public ReadOnly Property Canvas As GH_Canvas
	Get
Property Value
Type: GH_Canvas
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasViewportChangedEventArgs.Canvas"]
See Also
Reference
GH_CanvasViewportChangedEventArgs Class
Grasshopper.GUI.Canvas Namespace