Grasshopper SDK
GH_DigitScrollerBase.Render Method
 Render all UI elements.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Render(
	Graphics G
)
Public Sub Render (
	G As Graphics
)
Parameters
G
Type: System.Drawing.Graphics
Graphics object to draw with.
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace