Grasshopper SDK
GH_RelevantObjectData Class
 Contains information about relevant objects at a specific canvas location.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_RelevantObjectData
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_RelevantObjectData
Public Class GH_RelevantObjectData
The GH_RelevantObjectData type exposes the following members.
Constructors
Name | Description
GH_RelevantObjectData
 Construct a new instance.
Top
Properties
Name | Description
Attributes
 Gets the attributes that belong to the object.
Group
 Gets the cast of the DocObject to GH_Group.
IsTopLevelObject
 Gets a value indicating whether or not the Object is a top-level object.
Object
 Gets the raw object cached in this data instance.
ObjectType
 Gets the type of object indicated by this data.
Parameter
 Gets the cast of the DocObject to IGH_Param. If the DocObject is not of type IGH_Param, the attributes of the object will be perused to find a nested IGH_Param at the point.
Point
 Gets the point for which this GH_RelevantObjectData has been made.
TopLevelObject
 Gets the top-level object.
Top
Methods
Name | Description
CreateBalloonData
CreateGripData
CreateGroupData
CreateObjectData
CreateWireData
Top
See Also
Reference
Grasshopper.Kernel Namespace