Grasshopper SDK
GH_Surface.GH_SurfaceProxy.Periodic Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Periodic { get; }
Public ReadOnly Property Periodic As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Surface.GH_SurfaceProxy.Periodic"]
See Also
Reference
GH_Surface.GH_SurfaceProxy Class
Grasshopper.Kernel.Types Namespace