Grasshopper SDK
GH_Structure<T>.GetEnumerator Method
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IEnumerator GetEnumerator()
Public Function GetEnumerator As IEnumerator
Return Value
Type: IEnumerator
Implements
IEnumerable.GetEnumerator()
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace