Grasshopper SDK
GH_LonLatCoordinate.SphereVParameter Property
 Gets the spherical V parameter.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double SphereVParameter { get; }
Public ReadOnly Property SphereVParameter As Double
	Get
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_LonLatCoordinate.SphereVParameter"]
See Also
Reference
GH_LonLatCoordinate Class
Grasshopper.Kernel.Types Namespace