Grasshopper SDK
CentralSettings.CanvasFullNamesChanged Event
 Raised whenever the CanvasFullNames setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.CanvasFullNamesChangedEventHandler CanvasFullNamesChanged
Public Shared Event CanvasFullNamesChanged As CentralSettings.CanvasFullNamesChangedEventHandler
Value
Type: Grasshopper.CentralSettings.CanvasFullNamesChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace