Grasshopper SDK
GH_Document.SolutionStart Event
 This event is raised whenever a new solution is requested. Even if the document is locked.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Document.SolutionStartEventHandler SolutionStart
Public Event SolutionStart As GH_Document.SolutionStartEventHandler
Value
Type: Grasshopper.Kernel.GH_Document.SolutionStartEventHandler
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace