Grasshopper SDK
GH_AutoSaveSettings.SaveOnWireEventChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void SaveOnWireEventChangedEventHandler()
Public Delegate Sub SaveOnWireEventChangedEventHandler
See Also
Reference
Grasshopper.Kernel Namespace