Grasshopper SDK
GH_Document.Redo Method
 Perform the first redo event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Redo()
Public Function Redo As Boolean
Return Value
Type: Boolean
True on success, false on no redo event or invalid redo event.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace