Grasshopper SDK
GH_UndoServer Class
 Provides access to a documents undo data.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Undo.GH_UndoServer
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_UndoServer : IGH_DebugDescription
Public Class GH_UndoServer
	Implements IGH_DebugDescription
The GH_UndoServer type exposes the following members.
Constructors
Name | Description
GH_UndoServer
Initializes a new instance of the GH_UndoServer class
Top
Properties
Name | Description
FirstRedoName
 Gets the name of the last item in the redo stack (the first item to be redone).
FirstUndoName
 Gets the name of the last item in the undo stack (the first item to be undone).
MaxRecords
 Gets or sets the maximum number of undo records that can be stored.
RedoCount
 Number of redo records currently in the stack.
RedoGuids
 Gets a sorted list of all the redo Guids in this server.
RedoNames
 Gets a sorted list of all the redo Guids in this server.
UndoCount
 Number of undo records currently in the stack.
UndoGuids
 Gets a sorted list of all the undo Guids in this server.
UndoNames
 Gets a sorted list of all the undo Guids in this server.
Top
Methods
Name | Description
AppendToDebugLog
Clear
 Clear both undo and redo lists.
ClearRedo
 Clear the undo list.
ClearUndo
 Clear the redo list.
PerformRedo
 Performs a single Redo step if possible and migrates the record onto the undo stack. This function may throw all kinds of exceptions, if you're calling it from a UI thread, use a Try..Catch block to prevent crashes.
PerformUndo
 Performs a single Undo step when possible and migrates the record onto the redo stack. This function may throw all kinds of exceptions, if you're calling it from a UI thread, use a Try..Catch block to prevent crashes.
PushUndoRecord(GH_UndoRecord)
 Add a new undo record to the undo stack, this function clears the Redo stack.
PushUndoRecord(String, GH_UndoAction)
 Add a new undo record to the undo stack, this function clears the Redo stack.
RemoveRecord
 Remove the record with the specified ID from the undo or redo stack.
Top
See Also
Reference
Grasshopper.Kernel.Undo Namespace