Grasshopper SDK
DataTree<T>.Add Method (T)
 Add (append) a data item to the last branch in the tree. If no branches exist yet, a new one will be created with [path = {0}]
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Add(
	T data
)
Public Sub Add (
	data As T
)
Parameters
data
Type: T
Data to append.
See Also
Reference
DataTree<T> Class
Add Overload
Grasshopper Namespace