Grasshopper SDK
GH_Path Constructor
 Default constructor, creates a path with zero elements.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Path()
Public Sub New
See Also
Reference
GH_Path Class
GH_Path Overload
Grasshopper.Kernel.Data Namespace