Grasshopper SDK
GH_Document.DisplayName Property
 Gets the display name for this document. The display name is highly context sensitive and is only supposed to give the user a good idea of which document this is and whether it has been modified.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string DisplayName { get; }
Public ReadOnly Property DisplayName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.DisplayName"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace