Grasshopper SDK
GH_Structure<T>.TopologyDescription Property
 Gets a description of the topology of the structure. Useful for debugging purposes.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string TopologyDescription { get; }
Public ReadOnly Property TopologyDescription As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.TopologyDescription"]
Implements
IGH_Structure.TopologyDescription
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace