Grasshopper SDK
GH_Document.OnEnabledChanged Method
 Raise the EnabledChanged event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnEnabledChanged()
Public Sub OnEnabledChanged
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace