Grasshopper SDK
GH_CanvasMouseEvent.ControlX Property
 Gets the x-coordinate of the cursor location in control pixel coordinates.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ControlX { get; }
Public ReadOnly Property ControlX As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasMouseEvent.ControlX"]
See Also
Reference
GH_CanvasMouseEvent Class
Grasshopper.GUI Namespace