Grasshopper SDK
GH_Material.RdkMaterialId Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid RdkMaterialId { get; set; }
Public Property RdkMaterialId As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Material.RdkMaterialId"]
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace