Grasshopper SDK
IGH_SettingFrontend.Name Property
 Name of this setting.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Name { get; }
ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.IGH_SettingFrontend.Name"]
See Also
Reference
IGH_SettingFrontend Interface
Grasshopper.GUI Namespace