Grasshopper SDK
GH_State.StateCount Property
 Gets the number of items stored in the state database.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int StateCount { get; }
Public ReadOnly Property StateCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_State.StateCount"]
See Also
Reference
GH_State Class
Grasshopper.Kernel Namespace