Grasshopper SDK
GH_PersistentParam<T> Constructor (GH_InstanceDescription, Boolean)
Note: This API is now obsolete.
Initializes a new instance of the GH_PersistentParam<T> class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
[ObsoleteAttribute("This constructor is Obsolete and will be removed in future versions of Grasshopper.")]
protected GH_PersistentParam(
	GH_InstanceDescription nTag,
	bool bIsListParam
)
<ObsoleteAttribute("This constructor is Obsolete and will be removed in future versions of Grasshopper.")>
Protected Sub New (
	nTag As GH_InstanceDescription,
	bIsListParam As Boolean
)
Parameters
nTag
Type: Grasshopper.Kernel.GH_InstanceDescription
bIsListParam
Type: System.Boolean
See Also
Reference
GH_PersistentParam<T> Class
GH_PersistentParam<T> Overload
Grasshopper.Kernel Namespace