Grasshopper SDK
GH_Canvas.ZoomFadeHigh Property
 Gets the ZUI fade alpha value for the high zoom level threshold. This static field gets set on every Canvas paint start. The high threshold is typically used for ZUI elements that only appear when zoomed in.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int ZoomFadeHigh { get; }
Public Shared ReadOnly Property ZoomFadeHigh As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.ZoomFadeHigh"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace