Grasshopper SDK
CentralSettings.AuthorCopyrightFormatted Property
 Gets the authorCopyright message formatted to match the current date.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string AuthorCopyrightFormatted { get; }
Public Shared ReadOnly Property AuthorCopyrightFormatted As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.CentralSettings.AuthorCopyrightFormatted"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace