Grasshopper SDK
GH_Component.CollectData Method
 Calls CollectData on all input parameters and makes sure the Component and all associated parameters are left in a valid state.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void CollectData()
Public Overrides Sub CollectData
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace