Grasshopper SDK
GH_InstanceDescription.InstanceGuid Property
 Gets the ID of this runtime instance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid InstanceGuid { get; }
Public ReadOnly Property InstanceGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_InstanceDescription.InstanceGuid"]
Implements
IGH_InstanceDescription.InstanceGuid
See Also
Reference
GH_InstanceDescription Class
Grasshopper.Kernel Namespace