Grasshopper SDK
GH_RotationalTuningData<T>.InitialValue Property
 Gets the initial value.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public T InitialValue { get; }
Public ReadOnly Property InitialValue As T
	Get
Property Value
Type: T
[Missing <value> documentation for "P:Grasshopper.GUI.GH_RotationalTuningData`1.InitialValue"]
See Also
Reference
GH_RotationalTuningData<T> Class
Grasshopper.GUI Namespace