Grasshopper SDK
GH_Point.ReferencesCurve Method
 Returns true if this point is based on a curve reference
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ReferencesCurve()
Public Function ReferencesCurve As Boolean
Return Value
Type: Boolean
Remarks
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace