Grasshopper SDK
GH_DocumentEditor.ToggleForm Method
 Collapses the form if it's currently expanded or expands the form if it's currently collapsed.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ToggleForm()
Public Sub ToggleForm
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace