Grasshopper SDK
GH_RotationalFrame.Time Property
 Gets or sets the time when the event was recorded.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime Time { get; set; }
Public Property Time As DateTime
	Get
	Set
Property Value
Type: DateTime
[Missing <value> documentation for "P:Grasshopper.GUI.GH_RotationalFrame.Time"]
See Also
Reference
GH_RotationalFrame Structure
Grasshopper.GUI Namespace