Grasshopper SDK
GH_DocumentServer.RemoveDocument Method
 Removes a specific document from the global list. If the document isn't registered nothing will happen. If the document is owned by an IGH_DocumentOwner, the owner will be informed of the removal.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void RemoveDocument(
	GH_Document document
)
Public Sub RemoveDocument (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document to remove.
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace