Grasshopper SDK
GH_Point.DuplicateGeometry Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_GeometricGoo DuplicateGeometry()
Public Function DuplicateGeometry As IGH_GeometricGoo
Return Value
Type: IGH_GeometricGoo
Implements
IGH_GeometricGoo.DuplicateGeometry()
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace