Grasshopper SDK
GH_Component.RuntimeMessages Method
 Gets the list of cached runtime messages that were recorded during solver-time processes. For components, the set of runtime messages also includes input and output parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IList<string> RuntimeMessages(
	GH_RuntimeMessageLevel level
)
Public Overrides Function RuntimeMessages (
	level As GH_RuntimeMessageLevel
) As IList(Of String)
Parameters
level
Type: Grasshopper.Kernel.GH_RuntimeMessageLevel
Runtime message type to retrieve.
Return Value
Type: IList<String>
A list of runtime message strings.
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace