Grasshopper SDK
GH_Format.FormatInterval Method (Double, Double)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatInterval(
	double t0,
	double t1
)
Public Shared Function FormatInterval (
	t0 As Double,
	t1 As Double
) As String
Parameters
t0
Type: System.Double
t1
Type: System.Double
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatInterval Overload
Grasshopper.Kernel Namespace