Grasshopper SDK
Folders Class
 Provides access to all standard Grasshopper file and folder locations.
Inheritance Hierarchy
System.Object
 Grasshopper.Folders
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class Folders
Public NotInheritable Class Folders
The Folders type exposes the following members.
Properties
Name | Description
AppDataFolder
 Gets the appdata folder for Grasshopper. This folder is defined as %appdata%\Grasshopper\ and the physical uri may differ depending on Windows version.
AssemblyFolders
 Gets a list of all the directories from which GHA assemblies are loaded. Note: this is not the same as all folders from which GHA files were loaded at startup. This list includes the default Grasshopper folders, custom GHA folders and the locations provided by Rhino.Runtime.HostUtils.GetAssemblySearchPaths(). Folders which do not contain GHA files are omitted, as are duplicate entries.
AutoSaveFolder
 Gets the directory in windows ApplicationData that contains the Grasshopper autosave files.
ClusterFolders
 Gets a list of all the directories from which GHCLUSTER files are loaded. GHUSER files are loaded from subfolders as well.
CursorFolder
 Gets the directory that contains the cursor files that ship with Grasshopper.
CustomAssemblyFolders
 Gets or sets all custom assembly folders.
DefaultAssemblyFolder
 Gets the standard directory in windows ApplicationData that contains 3rd party GHA files.
DefaultClusterFolder
 Gets the standard directory in windows ApplicationData that contains GHCLUSTER files.
DefaultTemplateFolder
 Gets the standard directory in windows ApplicationData that contains template files.
DefaultUserObjectFolder
 Gets the standard directory in windows ApplicationData that contains GHUSER files.
Desktop
 Gets the desktop directory of the current user profile.
DownloaderApplication
 Gets the location where the Downloader.exe should be. If the application is not present, null is returned.
FileViewerApplication
 Gets the location where the FileViewer.exe should be. If the application is not present, null is returned.
IconFolder
 Gets the directory that contains the icon files that ship with Grasshopper.
ImageStitcherApplication
 Gets the location where the ImageStitcher.exe should be. If the application is not present, null is returned.
PluginFolder
 Gets the directory that contains the Grasshopper.dll file.
SDKDownloaderApplication
 Gets the location where the SDKDownloader.exe should be. If the application is not present, null is returned.
SettingsFolder
 Gets the folder into which all Grasshopper settings are stored. This folder might not exist until some settings are actually saved.
TemplateFolders
 Gets a list of all the directories from which template files are loaded. Templates are not loaded from subfolders.
ToolsFolder |  Obsolete.
 Gets the directory that contains the additional executables that ship with Grasshopper.
TutorialFiles
 Gets an array of all the tutorial files. This includes all the files with the *.gh or *.ghx extension in the Tutorials folder. Subfolders are not traversed.
TutorialFolder
 Gets the directory that contains the tutorial files that ship with Grasshopper.
UserObjectFolders
 Gets a list of all the directories from which GHUSER files are loaded. GHUSER files are loaded from subfolders as well.
VersionHistoryFile
 Gets the text file location where Grasshopper will save the latest version information.
VersionHistoryUrl
 Gets the url of the version history data.
Top
Methods
Name | Description
ShowFolderInExplorer
 Open a specific folder in Windows Explorer.
Top
See Also
Reference
Grasshopper Namespace