Grasshopper SDK
IGH_ValueProxy.ProxyValue Property
 Gets an instance of the local template type object
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Object ProxyValue { get; }
ReadOnly Property ProxyValue As Object
	Get
Property Value
Type: Object
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_ValueProxy.ProxyValue"]
See Also
Reference
IGH_ValueProxy Interface
Grasshopper.Kernel Namespace