Grasshopper SDK
GH_ParamServerEventArgs.Server Property
 Gets the GH_ComponentParamServer object that raised the event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ComponentParamServer Server { get; }
Public ReadOnly Property Server As GH_ComponentParamServer
	Get
Property Value
Type: GH_ComponentParamServer
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ParamServerEventArgs.Server"]
See Also
Reference
GH_ParamServerEventArgs Class
Grasshopper.Kernel Namespace