Grasshopper SDK
Param_MeshParameters Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_InstanceDescription
 Grasshopper.Kernel.GH_DocumentObject
 Grasshopper.Kernel.GH_ActiveObject
 Grasshopper.Kernel.GH_Param<GH_MeshingParameters>
 Grasshopper.Kernel.GH_PersistentParam<GH_MeshingParameters>
 Grasshopper.Kernel.Parameters.Param_MeshParameters
Namespace: Grasshopper.Kernel.Parameters
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class Param_MeshParameters : GH_PersistentParam<GH_MeshingParameters>
Public Class Param_MeshParameters
	Inherits GH_PersistentParam(Of GH_MeshingParameters)
The Param_MeshParameters type exposes the following members.
Constructors
Name | Description
Param_MeshParameters
Initializes a new instance of the Param_MeshParameters class
Top
Properties
Name | Description
ComponentGuid |  (Overrides GH_DocumentObject.ComponentGuid.)
Exposure |  (Overrides GH_DocumentObject.Exposure.)
Icon |  (Overrides GH_DocumentObject.Icon.)
Top
Methods
Name | Description
Menu_AppendPromptMore |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptMore(ToolStripDropDown).)
Menu_AppendPromptOne |  (Overrides GH_PersistentParam<T>.Menu_AppendPromptOne(ToolStripDropDown).)
Prompt_Plural |  (Overrides GH_PersistentParam<T>.Prompt_Plural(List<T>).)
Prompt_Singular |  (Overrides GH_PersistentParam<T>.Prompt_Singular(T).)
Top
Events
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Parameters Namespace