Grasshopper SDK
GH_ColourPickerBase.AutoSize Property
 Gets or sets a value indicating whether the width and height of the Bounds are adjusted to fit the UI.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool AutoSize { get; set; }
Public Property AutoSize As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.AutoSize"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace