Grasshopper SDK
GH_Circle Constructor (Circle)
 Create a duplicate of another circle
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Circle(
	Circle circle
)
Public Sub New (
	circle As Circle
)
Parameters
circle
Type: Circle
Circle to copy. If null, a default circle will be created.
See Also
Reference
GH_Circle Class
GH_Circle Overload
Grasshopper.Kernel.Types Namespace