Grasshopper SDK
IGH_VarParamComponent.IsVariableParam Method
 Returns a value indicating whether a specific parameter is considered to be variable.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsVariableParam(
	GH_VarParamEventArgs e
)
Function IsVariableParam (
	e As GH_VarParamEventArgs
) As Boolean
Parameters
e
Type: Grasshopper.Kernel.GH_VarParamEventArgs
Return Value
Type: Boolean
See Also
Reference
IGH_VarParamComponent Interface
Grasshopper.Kernel Namespace