Grasshopper SDK
GH_Animator.RectangleFAnimator Method (RectangleF, RectangleF, DateTime, DateTime)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<RectangleF> RectangleFAnimator(
	RectangleF A,
	RectangleF B,
	DateTime time0,
	DateTime time1
)
Public Shared Function RectangleFAnimator (
	A As RectangleF,
	B As RectangleF,
	time0 As DateTime,
	time1 As DateTime
) As GH_Animator(Of RectangleF)
Parameters
A
Type: System.Drawing.RectangleF
B
Type: System.Drawing.RectangleF
time0
Type: System.DateTime
time1
Type: System.DateTime
Return Value
Type: GH_Animator<RectangleF>
See Also
Reference
GH_Animator Class
RectangleFAnimator Overload
Grasshopper.GUI Namespace