Grasshopper SDK
GH_TreeFilter.ItemOpen Field
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const char ItemOpen = '('
Public Const ItemOpen As Char = "("C
Field Value
Type: Char
See Also
Reference
GH_TreeFilter Class
Grasshopper.Kernel.Data Namespace