Grasshopper SDK
GH_DocDiagramPainter.Zoom Property
 Gets the zoom factor for this diagram.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float Zoom { get; }
Public ReadOnly Property Zoom As Single
	Get
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_DocDiagramPainter.Zoom"]
See Also
Reference
GH_DocDiagramPainter Class
Grasshopper.GUI.Canvas Namespace