Grasshopper SDK
GH_ColourCube.ColorAtRail Method
 Get the color at a position along the depth rail.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point4d ColorAtRail(
	PointF pt
)
Public Function ColorAtRail (
	pt As PointF
) As Point4d
Parameters
pt
Type: System.Drawing.PointF
Point along rail (will be projected into rail limits)
Return Value
Type: Point4d
Point4d structure representing the colour in the current space.
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace