Grasshopper SDK
GH_PanelEditorControl.OnPaint Method
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override void OnPaint(
	PaintEventArgs e
)
Protected Overrides Sub OnPaint (
	e As PaintEventArgs
)
Parameters
e
Type: System.Windows.Forms.PaintEventArgs
See Also
Reference
GH_PanelEditorControl Class
Grasshopper.GUI Namespace