Grasshopper SDK
GH_CustomEventServer Class
 RhinoCommon only event server.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_CustomEventServer
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_CustomEventServer
Public Class GH_CustomEventServer
The GH_CustomEventServer type exposes the following members.
Constructors
Name | Description
GH_CustomEventServer
 Create and register a new event server.
Top
Properties
Name | Description
Enabled
 Gets or sets the enabled state flag for this event watcher.
GuidTable
 Gets direct access to the internal guid table. The table contains pairs of object Ids and runtime serial numbers.
GuidTableCount
 Gets the number of stored ids in the Guid Table.
Top
See Also
Reference
Grasshopper.Kernel Namespace