Grasshopper SDK
GH_DocumentObject.m_attributes Field
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected IGH_Attributes m_attributes
Protected m_attributes As IGH_Attributes
Field Value
Type: IGH_Attributes
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace