Grasshopper SDK
GH_CanvasWireValidator.WireSource Property
 Gets or sets the wire source filter.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid WireSource { get; set; }
Public Property WireSource As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasWireValidator.WireSource"]
See Also
Reference
GH_CanvasWireValidator Class
Grasshopper.GUI.Canvas Namespace