Grasshopper SDK
GH_ParserSymbol Constructor
Initializes a new instance of the GH_ParserSymbol class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ParserSymbol()
Public Sub New
See Also
Reference
GH_ParserSymbol Class
GH_ParserSymbol Overload
Grasshopper.Kernel.Expressions Namespace