Grasshopper SDK
GH_Mesh.GH_MeshProxy.FaceCount Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int FaceCount { get; }
Public ReadOnly Property FaceCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Mesh.GH_MeshProxy.FaceCount"]
See Also
Reference
GH_Mesh.GH_MeshProxy Class
Grasshopper.Kernel.Types Namespace