Grasshopper SDK
IGH_DataAccess.ParameterTargetPath Method
 Get the target path for the specified output parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_Path ParameterTargetPath(
	int paramIndex
)
Function ParameterTargetPath (
	paramIndex As Integer
) As GH_Path
Parameters
paramIndex
Type: System.Int32
Index of output parameter.
Return Value
Type: GH_Path
See Also
Reference
IGH_DataAccess Interface
Grasshopper.Kernel Namespace