Grasshopper SDK
GH_Document.Properties Property
 The properties of this document
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DocumentProperties Properties { get; }
Public ReadOnly Property Properties As GH_DocumentProperties
	Get
Property Value
Type: GH_DocumentProperties
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.Properties"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace