Grasshopper SDK
GH_AssemblyInfo.License Property
 Gets the license type for this assembly.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual GH_LibraryLicense License { get; }
Public Overridable ReadOnly Property License As GH_LibraryLicense
	Get
Property Value
Type: GH_LibraryLicense
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_AssemblyInfo.License"]
See Also
Reference
GH_AssemblyInfo Class
Grasshopper.Kernel Namespace