Grasshopper SDK
GH_SettingsServer.SetValue Method (String, Int32)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetValue(
	string key,
	int value
)
Public Sub SetValue (
	key As String,
	value As Integer
)
Parameters
key
Type: System.String
value
Type: System.Int32
See Also
Reference
GH_SettingsServer Class
SetValue Overload
Grasshopper.Kernel Namespace