Grasshopper SDK
GH_Structure<T>.Reverse Method
 Reverse the order of items in all branches.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Reverse()
Public Sub Reverse
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace