Grasshopper SDK
GH_Document.FindObjects Method
 Find the objects in the document that match the search term. Top level object names and nicknames are searched, as well as descriptions. Some objects are special cased to allow for more targeted searches. Data descriptions are not searched.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<IGH_DocumentObject> FindObjects(
	List<string> keys,
	int maxCount
)
Public Function FindObjects (
	keys As List(Of String),
	maxCount As Integer
) As List(Of IGH_DocumentObject)
Parameters
keys
Type: System.Collections.Generic.List<String>
maxCount
Type: System.Int32
Return Value
Type: List<IGH_DocumentObject>
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace