Grasshopper SDK
GH_SliderBase.OnValueChanged Method
 Raise the ValueChanged event.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void OnValueChanged(
	bool intermediate
)
Public Sub OnValueChanged (
	intermediate As Boolean
)
Parameters
intermediate
Type: System.Boolean
Set the intermediate state of the event arguments.
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace