Grasshopper SDK
GH_CapsuleRenderEngine.CreateRoundedRectangle Method (RectangleF, Single, Single, Single, Single)
 Static (Shared in VB) method for creating rectangles with rounded corners.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath CreateRoundedRectangle(
	RectangleF rec,
	float R0,
	float R1,
	float R2,
	float R3
)
Public Shared Function CreateRoundedRectangle (
	rec As RectangleF,
	R0 As Single,
	R1 As Single,
	R2 As Single,
	R3 As Single
) As GraphicsPath
Parameters
rec
Type: System.Drawing.RectangleF
Rectangle to fillet. Rectangles smaller than 3 pixels wide/high will be grown.
R0
Type: System.Single
Radius of upper left corner. Zero or negative values omit fillets.
R1
Type: System.Single
Radius of upper right corner. Zero or negative values omit fillets.
R2
Type: System.Single
Radius of lower right corner. Zero or negative values omit fillets.
R3
Type: System.Single
Radius of lower left corner. Zero or negative values omit fillets.
Return Value
Type: GraphicsPath
Graphics path that describes the rounded rectangle.
See Also
Reference
GH_CapsuleRenderEngine Class
CreateRoundedRectangle Overload
Grasshopper.GUI.Canvas Namespace