Grasshopper SDK
GH_SamplingSphere.SampleSphere Method (Sphere, GH_MemoryBitmap)
 Sample a sphere with a UV texture and return a bitmap of sampled values.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap SampleSphere(
	Sphere sphere,
	GH_MemoryBitmap texture
)
Public Function SampleSphere (
	sphere As Sphere,
	texture As GH_MemoryBitmap
) As Bitmap
Parameters
sphere
Type: Sphere
Sphere to sample, it should be centered on the world origin.
texture
Type: Grasshopper.Kernel.GH_MemoryBitmap
Texture to sample, the texture will not be modified.
Return Value
Type: Bitmap
A bitmap of Size x Size pixels.
See Also
Reference
GH_SamplingSphere Class
SampleSphere Overload
Grasshopper.GUI Namespace