Grasshopper SDK
GH_Curve.Value Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override Curve Value { get; set; }
Public Overrides Property Value As Curve
	Get
	Set
Property Value
Type: Curve
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_Curve.Value"]
See Also
Reference
GH_Curve Class
Grasshopper.Kernel.Types Namespace