Grasshopper SDK
Complex.IsValid Property
 Gets the validity of this number.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Complex.IsValid"]
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace