Grasshopper SDK
GH_NamedView.Zoom Property
 Gets or sets the zoom factor of the named view.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float Zoom { get; set; }
Public Property Zoom As Single
	Get
	Set
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_NamedView.Zoom"]
See Also
Reference
GH_NamedView Class
Grasshopper.GUI.Canvas Namespace