Grasshopper SDK
GH_ComponentParamServer.ParameterSourcesChanged Event
 Raised whenever the source list of an input parameter is changed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_ComponentParamServer.ParameterSourcesChangedEventHandler ParameterSourcesChanged
Public Event ParameterSourcesChanged As GH_ComponentParamServer.ParameterSourcesChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_ComponentParamServer.ParameterSourcesChangedEventHandler
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace