Grasshopper SDK
Index3d<T>.Item Property
 Gets the actual item.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public T Item { get; }
Public ReadOnly Property Item As T
	Get
Property Value
Type: T
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Index3d`1.Item"]
See Also
Reference
Index3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace