Grasshopper SDK
GH_GradientChangedEventArgs Class
 Arguments for te GradientChanged event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.GUI.Gradient.GH_GradientChangedEventArgs
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_GradientChangedEventArgs : EventArgs
Public Class GH_GradientChangedEventArgs
	Inherits EventArgs
The GH_GradientChangedEventArgs type exposes the following members.
Constructors
Name | Description
GH_GradientChangedEventArgs
Initializes a new instance of the GH_GradientChangedEventArgs class
Top
Properties
Name | Description
Gradient
 Gets the gradient that raised this event.
Intermediate
 Gets whether this event is intermediate. I.e. whether it will be followed by another, similar event.
Top
See Also
Reference
Grasshopper.GUI.Gradient Namespace