Grasshopper SDK
GH_Structure<T>.NonNulls Property
 Get an enumerator for this structure that allow linear iteration over the data hierarchy while skipping all Null entries. This Enumerator has been optimized, do not cache instances of it.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IEnumerable<T> NonNulls { get; }
Public ReadOnly Property NonNulls As IEnumerable(Of T)
	Get
Property Value
Type: IEnumerable<T>
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.NonNulls"]
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace