Grasshopper SDK
Param_MeshParameters Constructor
Initializes a new instance of the Param_MeshParameters class
Namespace: Grasshopper.Kernel.Parameters
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Param_MeshParameters()
Public Sub New
See Also
Reference
Param_MeshParameters Class
Grasshopper.Kernel.Parameters Namespace