Grasshopper SDK
GH_DocumentEditor.Collapsed Property
 Gets a value indicating whether or not the form is currently collapsed.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Collapsed { get; }
Public ReadOnly Property Collapsed As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DocumentEditor.Collapsed"]
See Also
Reference
GH_DocumentEditor Class
Grasshopper.GUI Namespace