Grasshopper SDK
IGH_Author.Phone Property
 Gets the phone number of the author.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Phone { get; }
ReadOnly Property Phone As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Author.Phone"]
See Also
Reference
IGH_Author Interface
Grasshopper.Kernel Namespace