Grasshopper SDK
IGH_Structure.Graft Method (GH_GraftMode)
 Grafts all paths by reallocating all data into child paths.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void Graft(
	GH_GraftMode mode
)
Sub Graft (
	mode As GH_GraftMode
)
Parameters
mode
Type: Grasshopper.Kernel.Data.GH_GraftMode
Graft mode.
See Also
Reference
IGH_Structure Interface
Graft Overload
Grasshopper.Kernel.Data Namespace