Grasshopper SDK
GH_SolutionExpiredEventArgs.Recompute Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Recompute { get; }
Public ReadOnly Property Recompute As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_SolutionExpiredEventArgs.Recompute"]
See Also
Reference
GH_SolutionExpiredEventArgs Class
Grasshopper.Kernel Namespace