Grasshopper SDK
GH_DocUndoEventArgs.Operation Property
 Gets the type of undo operation that caused this event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoOperation Operation { get; }
Public ReadOnly Property Operation As GH_UndoOperation
	Get
Property Value
Type: GH_UndoOperation
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocUndoEventArgs.Operation"]
See Also
Reference
GH_DocUndoEventArgs Class
Grasshopper.Kernel Namespace