Grasshopper SDK
GH_ConnectivityDiagram.ContainsID Method
 Test the diagram for a given Node ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool ContainsID(
	Guid id
)
Public Function ContainsID (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
ID to search for.
Return Value
Type: Boolean
True if the ID is part of this diagram, false if otherwise.
See Also
Reference
GH_ConnectivityDiagram Class
Grasshopper.Kernel Namespace