Grasshopper SDK
GH_ColourPickerBase.Spacing Field
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const int Spacing = 12
Public Const Spacing As Integer = 12
Field Value
Type: Int32
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace