Grasshopper SDK
GH_BackgroundSettings.Colour2 Property
 Second background colour. Depending on the background style, this colour is used in different ways.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Colour2 { get; set; }
Public Property Colour2 As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_BackgroundSettings.Colour2"]
See Also
Reference
GH_BackgroundSettings Class
Grasshopper.GUI.Theme Namespace