Grasshopper SDK
GH_ComponentServer.GHAFileLoadedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void GHAFileLoadedEventHandler(
	Object sender,
	GH_GHALoadingEventArgs e
)
Public Delegate Sub GHAFileLoadedEventHandler (
	sender As Object,
	e As GH_GHALoadingEventArgs
)
Parameters
sender
Type: System.Object
e
Type: Grasshopper.Kernel.GH_GHALoadingEventArgs
See Also
Reference
Grasshopper.Kernel Namespace