Grasshopper SDK
GH_GraphicsUtil.ShadowVertical Method (Graphics, Int32, Int32, Int32, Int32, Boolean, Color)
 Draws a vertical shadow edge.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void ShadowVertical(
	Graphics g,
	int x,
	int y0,
	int y1,
	int size,
	bool right,
	Color color
)
Public Shared Sub ShadowVertical (
	g As Graphics,
	x As Integer,
	y0 As Integer,
	y1 As Integer,
	size As Integer,
	right As Boolean,
	color As Color
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
x
Type: System.Int32
Offset of shadow edge.
y0
Type: System.Int32
Start of shadow edge.
y1
Type: System.Int32
End of shadow edge.
size
Type: System.Int32
Length of cast shadow.
right
Type: System.Boolean
If true, shadow is drawn to the right of the elevated line.
color
Type: System.Drawing.Color
Color at shadow edge.
See Also
Reference
GH_GraphicsUtil Class
ShadowVertical Overload
Grasshopper.GUI Namespace