Grasshopper SDK
GH_MeshFace.GH_MeshFaceProxy.D Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int D { get; set; }
Public Property D As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_MeshFace.GH_MeshFaceProxy.D"]
See Also
Reference
GH_MeshFace.GH_MeshFaceProxy Class
Grasshopper.Kernel.Types Namespace