Grasshopper SDK
GH_ScriptVariant.Point Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point3d Point { get; }
Public ReadOnly Property Point As Point3d
	Get
Property Value
Type: Point3d
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ScriptVariant.Point"]
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace