Grasshopper SDK
GH_Component.BeforeSolveInstance Method
 Override this method if you want to be called before the first call to SolveInstance.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected virtual void BeforeSolveInstance()
Protected Overridable Sub BeforeSolveInstance
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace