Grasshopper SDK
GH_FontPicker.ShowFontPickerWindow Method (Font, Form)
 Display the fontpicker in a window.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font ShowFontPickerWindow(
	Font font,
	Form parent
)
Public Shared Function ShowFontPickerWindow (
	font As Font,
	parent As Form
) As Font
Parameters
font
Type: System.Drawing.Font
Default font.
parent
Type: System.Windows.Forms.Form
Parent window.
Return Value
Type: Font
A newly picked font.
See Also
Reference
GH_FontPicker Class
ShowFontPickerWindow Overload
Grasshopper.GUI Namespace