Grasshopper SDK
GH_FontServer.StandardAdjusted Property
 SystemFonts.CaptionFont, 8pt, regular, adjusted for logical pixel size.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Font StandardAdjusted { get; }
Public Shared ReadOnly Property StandardAdjusted As Font
	Get
Property Value
Type: Font
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FontServer.StandardAdjusted"]
See Also
Reference
GH_FontServer Class
Grasshopper.Kernel Namespace