Grasshopper SDK
GH_Canvas.SetSmartTextRenderingHint Method
 When this method is called during a redraw, the TextRenderingHint of the associated graphics object will be set to either GH_CrispText or GH_SmoothText depending on zoom level.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetSmartTextRenderingHint()
Public Sub SetSmartTextRenderingHint
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace