Grasshopper SDK
GH_Skin.palette_locked_standard Field
 Locked, unselected palette. Default background for locked parameters and components.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_PaletteStyle palette_locked_standard
Public Shared palette_locked_standard As GH_PaletteStyle
Field Value
Type: GH_PaletteStyle
See Also
Reference
GH_Skin Class
Grasshopper.GUI.Canvas Namespace