Grasshopper SDK
GH_Vector Class
 Represents a 3D vector. GH_Vector re-implements the OpenNURBS On3dVector class.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<Vector3d>
 Grasshopper.Kernel.Types.GH_Vector
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Vector : GH_Goo<Vector3d>
Public Class GH_Vector
	Inherits GH_Goo(Of Vector3d)
The GH_Vector type exposes the following members.
Constructors
Name | Description
GH_Vector()
 Default constructor. Creates a zero-length vector.
GH_Vector(Vector3d)
 Create a vector from x, y and z components.
GH_Vector(GH_Vector)
 Create a duplicate of another vector
Top
Properties
Name | Description
IsValid |  (Overrides GH_Goo<T>.IsValid.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom
 Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T)
 Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.
 (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate
 Create a duplicate of this vector.
 (Overrides GH_Goo<T>.Duplicate().)
DuplicateVector
 Create a duplicate of this vector.
EmitProxy
 Returns a proxy that represents this vector. Do not call this function unless you're
 (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString
 Format the vector using default grasshopper formatting logic.
 (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace