Grasshopper SDK
GH_String Class
 Represents a literal string. GH_String re-implements the framework System.String type.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<String>
 Grasshopper.Kernel.Types.GH_String
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_String : GH_Goo<string>
Public Class GH_String
	Inherits GH_Goo(Of String)
The GH_String type exposes the following members.
Constructors
Name | Description
GH_String()
 Blank constructor
GH_String(String)
Initializes a new instance of the GH_String class
GH_String(GH_String)
Initializes a new instance of the GH_String class
Top
Properties
Name | Description
IsValid
 Gets the validity of this instance. String are valid if they are not null.
 (Overrides GH_Goo<T>.IsValid.)
IsValidWhyNot
 Gets a string describing the state of "invalidness". If the instance is valid, then this property should return Nothing or String.Empty.
 (Overrides GH_Goo<T>.IsValidWhyNot.)
TypeDescription |  (Overrides GH_Goo<T>.TypeDescription.)
TypeName |  (Overrides GH_Goo<T>.TypeName.)
Top
Methods
Name | Description
CastFrom |  (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<T>(T) |  (Overrides GH_Goo<T>.CastTo<Q>(Q).)
Duplicate |  (Overrides GH_Goo<T>.Duplicate().)
DuplicateString
EmitProxy |  (Overrides GH_Goo<T>.EmitProxy().)
Read |  (Overrides GH_Goo<T>.Read(GH_IReader).)
ToString |  (Overrides GH_Goo<T>.ToString().)
Write |  (Overrides GH_Goo<T>.Write(GH_IWriter).)
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace