Grasshopper SDK
GH_MemoryBitmap.Filter_Blur Method
 Blur the image in both directions.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_Blur()
Public Sub Filter_Blur
See Also
Reference
GH_MemoryBitmap Class
Filter_Blur Overload
Grasshopper.Kernel Namespace