Grasshopper SDK
GH_DigitScrollerBase.ShadowColour Property
 Gets or sets the colour used for the shadows.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color ShadowColour { get; set; }
Public Property ShadowColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.ShadowColour"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace