Grasshopper SDK
IGH_Param.RemoveEffects Method
 Remove all post-process effects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void RemoveEffects()
Sub RemoveEffects
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace