Grasshopper SDK
GH_GetterResult Enumeration
 Enumerates typical getter results.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_GetterResult
Public Enumeration GH_GetterResult
Members
Member name | Value | Description
accept | 0
success | 1
cancel | 2
See Also
Reference
Grasshopper.Kernel Namespace