Grasshopper SDK
GH_SliderTickDisplay Enumeration
 Enumerates the possible slider tick displays.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_SliderTickDisplay
Public Enumeration GH_SliderTickDisplay
Members
Member name | Value | Description
None | 0 |  No slider ticks are drawn.
Simple | 1 |  Slider ticks are drawn as single lines.
Etched | 2 |  Slider ticks are drawn as etched lines.
See Also
Reference
Grasshopper.GUI.Base Namespace