Grasshopper SDK
GH_Component.IsPreviewCapable Property
 If a single parameter is PreviewCapable, so is the component. Override this property if you need special Preview flags.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool IsPreviewCapable { get; }
Public Overridable ReadOnly Property IsPreviewCapable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Component.IsPreviewCapable"]
Implements
IGH_PreviewObject.IsPreviewCapable
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace