Grasshopper SDK
GH_Point.SetReferenceParams Method
 Sets both param values of the point reference
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void SetReferenceParams(
	double u,
	double v
)
Public Sub SetReferenceParams (
	u As Double,
	v As Double
)
Parameters
u
Type: System.Double
The new u parameter
v
Type: System.Double
The new v parameter
Remarks
If there is no reference data, this function will create a new instance.
See Also
Reference
GH_Point Class
Grasshopper.Kernel.Types Namespace