Grasshopper SDK
GH_Convert.ToVector3d_Primary Method
 Performs a direct cast from On3dVector or GH_Vector. Data is not quaranteed to be duplicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToVector3d_Primary(
	Object data,
	ref Vector3d rc
)
Public Shared Function ToVector3d_Primary (
	data As Object,
	ByRef rc As Vector3d
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Vector3d
Return Value
Type: Boolean
An On3dVector instance if successful, or Nothing on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace