Grasshopper SDK
GH_IndexRange.Split Method
 Split a range into two using an integer index.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static int Split(
	GH_IndexRange range,
	GH_IndexRange splitter,
	out GH_IndexRange result0,
	out GH_IndexRange result1
)
Public Shared Function Split (
	range As GH_IndexRange,
	splitter As GH_IndexRange,
	<OutAttribute> ByRef result0 As GH_IndexRange,
	<OutAttribute> ByRef result1 As GH_IndexRange
) As Integer
Parameters
range
Type: Grasshopper.Kernel.Data.GH_IndexRange
Range to split.
splitter
Type: Grasshopper.Kernel.Data.GH_IndexRange
Range to split with.
result0
Type: Grasshopper.Kernel.Data.GH_IndexRange
First split result if successful, or an invalid range if not.
result1
Type: Grasshopper.Kernel.Data.GH_IndexRange
Second split result if successful, or an invalid range if not.
Return Value
Type: Int32
The number of valid split results.
See Also
Reference
GH_IndexRange Structure
Grasshopper.Kernel.Data Namespace