Grasshopper SDK
GH_PageSettings.ShadowSize Property
 Gets or sets the size of the page shadow.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ShadowSize { get; set; }
Public Property ShadowSize As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_PageSettings.ShadowSize"]
See Also
Reference
GH_PageSettings Class
Grasshopper.GUI.Theme Namespace