Grasshopper SDK
GH_Attributes<T>.TooltipEnabled Property
 Gets the tooltip enabled value. If False, no further tooltip functions will be called.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool TooltipEnabled { get; }
Public Overridable ReadOnly Property TooltipEnabled As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Attributes`1.TooltipEnabled"]
Implements
IGH_TooltipAwareObject.TooltipEnabled
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace