Grasshopper SDK
GH_Format.Create Method (IGH_Content, GH_Style)
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Format Create(
	IGH_Content content,
	GH_Style style
)
Public Shared Function Create (
	content As IGH_Content,
	style As GH_Style
) As GH_Format
Parameters
content
Type: Grasshopper.Documentation.IGH_Content
style
Type: Grasshopper.Documentation.GH_Style
Return Value
Type: GH_Format
See Also
Reference
GH_Format Class
Create Overload
Grasshopper.Documentation Namespace