Grasshopper SDK
GH_Viewport.ComputeProjection Method
 Forces a recomputation of all cached data.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ComputeProjection()
Public Sub ComputeProjection
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace