Grasshopper SDK
GH_Param<T>.IsPrincipal Property
 Gets whether this parameter is a principal parameter. Principal parameters are maintained by components and are not part of the IGH_Param interface.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PrincipalState IsPrincipal { get; }
Public ReadOnly Property IsPrincipal As GH_PrincipalState
	Get
Property Value
Type: GH_PrincipalState
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.IsPrincipal"]
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace