Grasshopper SDK
GH_PreviewWireArgs.Thickness Property
 Gets the thickness in which wires ought to be drawn.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int Thickness { get; }
Public ReadOnly Property Thickness As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewWireArgs.Thickness"]
See Also
Reference
GH_PreviewWireArgs Class
Grasshopper.Kernel Namespace