Grasshopper SDK
ITransform.Name Property
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Name { get; }
ReadOnly Property Name As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Transforms.ITransform.Name"]
See Also
Reference
ITransform Interface
Grasshopper.Kernel.Types.Transforms Namespace