Grasshopper SDK
GH_RhinoScriptInterface.EnableSolver Method
 Enables the Grasshopper Solver. If the Solver is enabled, expired components and parameter will be recomputed.
Namespace: Grasshopper.Plugin
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void EnableSolver()
Public Sub EnableSolver
Examples
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
  Dim GH
  Set GH = Rhino.GetPlugInObject("Grasshopper")
  Call GH.EnableSolver()
  Set GH = Nothing
End Sub
See Also
Reference
GH_RhinoScriptInterface Class
Grasshopper.Plugin Namespace