Grasshopper SDK
GH_GraphicsUtil.RenderCenteredText Method
 Render a bit of text centered on a point.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderCenteredText(
	Graphics g,
	string text,
	Font font,
	Color color,
	PointF center
)
Public Shared Sub RenderCenteredText (
	g As Graphics,
	text As String,
	font As Font,
	color As Color,
	center As PointF
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
text
Type: System.String
Text to draw.
font
Type: System.Drawing.Font
Font to use.
color
Type: System.Drawing.Color
Text color.
center
Type: System.Drawing.PointF
Center point.
See Also
Reference
GH_GraphicsUtil Class
Grasshopper.GUI Namespace