Grasshopper SDK
GH_ValueProxy<T>.ToString Method
 Performs a default ToString operation on the local value. If the value is Nothing, an empty String is returned.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
Implements
IGH_ValueProxy.ToString()
Remarks
Implementors: override this function if you need custom formatting logic.
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace