Grasshopper SDK
GH_PathOffset.OffsetPath Method (GH_Path, Int32, IGH_Structure, GH_Path, Int32)
 Offset a path + index value with wrapping and bounds checking.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool OffsetPath(
	GH_Path path,
	int index,
	IGH_Structure tree,
	out GH_Path relativePath,
	out int relativeIndex
)
Public Function OffsetPath (
	path As GH_Path,
	index As Integer,
	tree As IGH_Structure,
	<OutAttribute> ByRef relativePath As GH_Path,
	<OutAttribute> ByRef relativeIndex As Integer
) As Boolean
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to offset.
index
Type: System.Int32
Item to offset.
tree
Type: Grasshopper.Kernel.Data.IGH_Structure
Structure context for offset.
relativePath
Type: Grasshopper.Kernel.Data.GH_Path
Offsetted path.
relativeIndex
Type: System.Int32
Offsetted index.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_PathOffset Class
OffsetPath Overload
Grasshopper.Kernel.Data Namespace