Grasshopper SDK
IGH_Structure.DataDescription Method
 Gets a description of the data contained in this structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string DataDescription(
	bool includeIndices,
	bool includePaths
)
Function DataDescription (
	includeIndices As Boolean,
	includePaths As Boolean
) As String
Parameters
includeIndices
Type: System.Boolean
If true, every data item will be prefixed by its index.
includePaths
Type: System.Boolean
If true, every branch of data will be preceded by the path.
Return Value
Type: String
A string describing the data.
See Also
Reference
IGH_Structure Interface
Grasshopper.Kernel.Data Namespace