Grasshopper SDK
GH_MemoryBitmap.Colour Method (Int32, Int32, Color)
 Sets the colour at the given pixel coordinates.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Colour(
	int x,
	int y,
	Color col
)
Public Sub Colour (
	x As Integer,
	y As Integer,
	col As Color
)
Parameters
x
Type: System.Int32
X coordinate (column) of pixel. Must be on image interior.
y
Type: System.Int32
Y coordinate (column) of pixel. Must be on image interior.
col
Type: System.Drawing.Color
Color to assign.
See Also
Reference
GH_MemoryBitmap Class
Colour Overload
Grasshopper.Kernel Namespace