Grasshopper SDK
IGH_FieldElement.IsCoincident Method
 Computes whether the point can be considered coincident with the element.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsCoincident(
	Point3d point,
	double tolerance
)
Function IsCoincident (
	point As Point3d,
	tolerance As Double
) As Boolean
Parameters
point
Type: Point3d
Point to test.
tolerance
Type: System.Double
Tolerance to use.
Return Value
Type: Boolean
True if the point is coincident within tolerance.
See Also
Reference
IGH_FieldElement Interface
Grasshopper.Kernel.Types Namespace