Grasshopper SDK
CentralSettings.PreviewMeshEdgesChanged Event
 Raised whenever the PreviewMeshEdges setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.PreviewMeshEdgesChangedEventHandler PreviewMeshEdgesChanged
Public Shared Event PreviewMeshEdgesChanged As CentralSettings.PreviewMeshEdgesChangedEventHandler
Value
Type: Grasshopper.CentralSettings.PreviewMeshEdgesChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace