Grasshopper SDK
GH_DocumentTree.FlatCollection Property
 Gets a flat collection of all documents. The most subsidiary documents are at the start of the collection.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IEnumerable<GH_Document> FlatCollection { get; }
Public ReadOnly Property FlatCollection As IEnumerable(Of GH_Document)
	Get
Property Value
Type: IEnumerable<GH_Document>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentTree.FlatCollection"]
See Also
Reference
GH_DocumentTree Class
Grasshopper.Kernel Namespace