Grasshopper SDK
GH_RelevantObjectData.CreateWireData Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateWireData()
Public Sub CreateWireData
See Also
Reference
GH_RelevantObjectData Class
Grasshopper.Kernel Namespace