Grasshopper SDK
GH_Slider.GripBottomColour Property
 Gets or sets the fill colour for the bottom edge of the slider grip.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color GripBottomColour { get; set; }
Public Property GripBottomColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.GripBottomColour"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace