Grasshopper SDK
GH_MeshingParameters.RhMesherSettings_Proxy Constructor
Initializes a new instance of the GH_MeshingParameters.RhMesherSettings_Proxy class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RhMesherSettings_Proxy(
	GH_MeshingParameters owner
)
Public Sub New (
	owner As GH_MeshingParameters
)
Parameters
owner
Type: Grasshopper.Kernel.Types.GH_MeshingParameters
See Also
Reference
GH_MeshingParameters.RhMesherSettings_Proxy Class
Grasshopper.Kernel.Types Namespace