Grasshopper SDK
GH_TypeLib.t_gh_vector Field
Grasshopper.Kernel.Types.GH_Vector
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Type t_gh_vector
Public Shared t_gh_vector As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace