Grasshopper SDK
GH_Document.Dispose Method
 When you discard documents you must call Dispose or the Viewport Display event handlers will not be disconnected.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace