Grasshopper SDK
GH_Canvas.GetCanvasScreenBuffer Method
 Get a bitmap that resembles the current state of the canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap GetCanvasScreenBuffer(
	GH_CanvasMode modeOverride
)
Public Function GetCanvasScreenBuffer (
	modeOverride As GH_CanvasMode
) As Bitmap
Parameters
modeOverride
Type: Grasshopper.GUI.Canvas.GH_CanvasMode
The mode to apply during the off-screen rendering.
Return Value
Type: Bitmap
A Format24bppRgb bitmap similar to the current canvas display.
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace