Grasshopper SDK
GH_PathOffset.PathOffset Property
 Gets access to the relative offsets for path indices.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<int> PathOffset { get; }
Public ReadOnly Property PathOffset As List(Of Integer)
	Get
Property Value
Type: List<Int32>
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_PathOffset.PathOffset"]
See Also
Reference
GH_PathOffset Class
Grasshopper.Kernel.Data Namespace