Grasshopper SDK
GH_FileWatcher.Path Property
 Gets the file or folder path currently being watched.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FileWatcher.Path"]
See Also
Reference
GH_FileWatcher Class
Grasshopper.Kernel Namespace