Grasshopper SDK
GH_DocumentIO.SaveAsDocumentDialog Method
 Display the Save As GH/GHX dialog.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string SaveAsDocumentDialog(
	string path = null
)
Public Function SaveAsDocumentDialog (
	Optional path As String = Nothing
) As String
Parameters
path (Optional)
Type: System.String
Optional default path.
Return Value
Type: String
FileName specified via the Save As dialog or null if the dialog was cancelled.
See Also
Reference
GH_DocumentIO Class
Grasshopper.Kernel Namespace