Grasshopper SDK
GH_TooltipDisplayEventArgs.Diagram Property
 Gets or sets the image that is displayed in the details section of the tooltip. This field is optional, but when it is defined, the Description property is ignored.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Bitmap Diagram { get; set; }
Public Property Diagram As Bitmap
	Get
	Set
Property Value
Type: Bitmap
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipDisplayEventArgs.Diagram"]
See Also
Reference
GH_TooltipDisplayEventArgs Class
Grasshopper.GUI Namespace