Grasshopper SDK
GH_ColourCube.Average Method (Color, Color)
 Compute the average of two colours.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Average(
	Color A,
	Color B
)
Public Function Average (
	A As Color,
	B As Color
) As Color
Parameters
A
Type: System.Drawing.Color
First colour for average.
B
Type: System.Drawing.Color
Second colour for average.
Return Value
Type: Color
The average of A and B.
See Also
Reference
GH_ColourCube Class
Average Overload
Grasshopper.GUI.Base Namespace