Grasshopper SDK
GH_Format.DefaultCulture Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static IFormatProvider DefaultCulture()
Public Shared Function DefaultCulture As IFormatProvider
Return Value
Type: IFormatProvider
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace