Grasshopper SDK
GH_ScriptVariant.m_value Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected Object m_value
Protected m_value As Object
Field Value
Type: Object
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace