Grasshopper SDK
GH_LinkedParamAttributes Class
 These Attributes are assigned to parameters that are part of a GH_Component.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_Attributes<IGH_Param>
 Grasshopper.Kernel.Attributes.GH_LinkedParamAttributes
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_LinkedParamAttributes : GH_Attributes<IGH_Param>
Public Class GH_LinkedParamAttributes
	Inherits GH_Attributes(Of IGH_Param)
The GH_LinkedParamAttributes type exposes the following members.
Constructors
Name | Description
GH_LinkedParamAttributes
Initializes a new instance of the GH_LinkedParamAttributes class
Top
Properties
Name | Description
HasInputGrip |  (Overrides GH_Attributes<T>.HasInputGrip.)
HasOutputGrip |  (Overrides GH_Attributes<T>.HasOutputGrip.)
Top
Methods
Name | Description
Layout |  (Overrides GH_Attributes<T>.Layout().)
Render |  (Overrides GH_Attributes<T>.Render(GH_Canvas, Graphics, GH_CanvasChannel).)
SetupTooltip |  (Overrides GH_Attributes<T>.SetupTooltip(PointF, GH_TooltipDisplayEventArgs).)
Top
See Also
Reference
Grasshopper.Kernel.Attributes Namespace