Grasshopper SDK
GH_GeometricGooWrapper.InternalGoo Property
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_GeometricGoo InternalGoo { get; }
Public ReadOnly Property InternalGoo As IGH_GeometricGoo
	Get
Property Value
Type: IGH_GeometricGoo
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_GeometricGooWrapper.InternalGoo"]
See Also
Reference
GH_GeometricGooWrapper Class
Grasshopper.Kernel.Types Namespace