Grasshopper SDK
GH_DigitScrollerBase.DecimalPlaces Property
 Gets or sets the number of decimal places available in this scroller. Unlike Radix, this property maintains the decimal position of the value represented by this scroller.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int DecimalPlaces { get; set; }
Public Property DecimalPlaces As Integer
	Get
	Set
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.DecimalPlaces"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace