Grasshopper SDK
IGH_TypeHint.HintID Property
 Unique ID for every type of Hint.
Namespace: Grasshopper.Kernel.Parameters
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
Guid HintID { get; }
ReadOnly Property HintID As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.Parameters.IGH_TypeHint.HintID"]
See Also
Reference
IGH_TypeHint Interface
Grasshopper.Kernel.Parameters Namespace