Grasshopper SDK
GH_Lexer.Item Property
 Gets the item string that was extracted from the mask. The default is "append"
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Item { get; }
Public ReadOnly Property Item As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Lexer.Item"]
See Also
Reference
GH_Lexer Class
Grasshopper.Kernel.Data Namespace