Grasshopper SDK
GH_ParserOperator.m_symbol Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public char m_symbol
Public m_symbol As Char
Field Value
Type: Char
See Also
Reference
GH_ParserOperator Class
Grasshopper.Kernel.Expressions Namespace