Grasshopper SDK
GH_CodeStringSegment.StringValue Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string StringValue { get; }
Public ReadOnly Property StringValue As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_CodeStringSegment.StringValue"]
See Also
Reference
GH_CodeStringSegment Class
Grasshopper.Kernel.Expressions Namespace