Grasshopper SDK
IGH_DocumentOwner.DocumentClosed Method
 This method will be called whenever the owner document was closed.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void DocumentClosed(
	GH_Document document
)
Sub DocumentClosed (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
the closed docment.
See Also
Reference
IGH_DocumentOwner Interface
Grasshopper.Kernel Namespace