Grasshopper SDK
GH_DocumentObject.Menu_AppendCustomItem Method (ToolStripDropDown, Control)
 Utility function for inserting exotic controls into dropdown menus.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool Menu_AppendCustomItem(
	ToolStripDropDown menu,
	Control control
)
Public Shared Function Menu_AppendCustomItem (
	menu As ToolStripDropDown,
	control As Control
) As Boolean
Parameters
menu
Type: System.Windows.Forms.ToolStripDropDown
Dropdown to add a control to.
control
Type: System.Windows.Forms.Control
Control to insert.
Return Value
Type: Boolean
See Also
Reference
GH_DocumentObject Class
Menu_AppendCustomItem Overload
Grasshopper.Kernel Namespace