Grasshopper SDK
IGH_Embeddable.PrepareForCancel Method
 This will be called prior to a Cancel operation.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void PrepareForCancel()
Sub PrepareForCancel
See Also
Reference
IGH_Embeddable Interface
Grasshopper.GUI Namespace