Grasshopper SDK
SliderSnapRange.IsSingleton Property
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsSingleton { get; }
Public ReadOnly Property IsSingleton As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.SliderSnapRange.IsSingleton"]
See Also
Reference
SliderSnapRange Structure
Grasshopper.GUI.Base Namespace