Grasshopper SDK
Complex.UnaryPlus Operator
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Complex operator +(
	Complex summand
)
Public Shared Operator + (
	summand As Complex
) As Complex
Parameters
summand
Type: Grasshopper.Kernel.Types.Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace