Grasshopper SDK
GH_Slider_Obsolete Constructor
Initializes a new instance of the GH_Slider_Obsolete class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Slider_Obsolete()
Public Sub New
See Also
Reference
GH_Slider_Obsolete Class
Grasshopper.GUI Namespace