Grasshopper SDK
GH_CanvasWireValidator Constructor
Initializes a new instance of the GH_CanvasWireValidator class
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_CanvasWireValidator()
Public Sub New
See Also
Reference
GH_CanvasWireValidator Class
Grasshopper.GUI.Canvas Namespace