Grasshopper SDK
GH_GeometricGoo<T> Class
 Abstract base implementation of IGH_GeometricGoo. If you implement IGH_GeometricGoo, use this for a booster.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<T>
 Grasshopper.Kernel.Types.GH_GeometricGoo<T>
 More...
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_GeometricGoo<T> : GH_Goo<T>,
	IGH_GeometricGoo
Public MustInherit Class GH_GeometricGoo(Of T)
	Inherits GH_Goo(Of T)
	Implements IGH_GeometricGoo
Type Parameters
T
The GH_GeometricGoo<T> type exposes the following members.
Constructors
Name | Description
GH_GeometricGoo<T>()
 Blank constructor, m_value will be set to default (null for reference types, zeroes for value types)
GH_GeometricGoo<T>(T)
 Data constructor, m_value will be set to internal_data.
Top
Properties
Name | Description
Boundingbox
 Gets the boundingbox for this geometry.
IsGeometryLoaded
 Gets a value indicating whether or not this geometry is currently loaded (assuming it is referenced). Not all IGH_GeometricGoo implementations support referenced geometry. The default is to always return True.
IsReferencedGeometry
 Gets a value indicating whether or not this geometry is referenced. Not all IGH_GeometricGoo implementations support referenced geometry.
IsValid
 Gets a value indicating whether or not the current value is valid.
 (Overrides GH_Goo<T>.IsValid.)
ReferenceID
 Gets or sets the Guid of the object that is referenced. Not all IGH_GeometricGoo implementations support referenced geometry. The default implementation is to always return Guid.Empty.
Value
 Gets or sets the value of this type. Note that if the type has a ReferenceID this value might get destroyed in the future.
 (Overrides GH_Goo<T>.Value.)
Top
Methods
Name | Description
CastFrom
 Attempt a cast from generic object.
 (Overrides GH_Goo<T>.CastFrom(Object).)
CastTo<Q>(Q)
 Attempt a cast to type T.
 (Overrides GH_Goo<T>.CastTo<Q>(Q).)
ClearCaches
 Clears all caches. Typically if the geometry is referenced, this will erase the local copy. If your T is a value-type, you must override this function and specifically unset the local value.
Duplicate
 Make a complete duplicate of this instance. No shallow copies.
 (Overrides GH_Goo<T>.Duplicate().)
DuplicateGeometry
 Make a complete duplicate of this geometry. No shallow copies.
EmitProxy
 Create a new proxy for this instance. Return Null if this class does not support proxies.
 (Overrides GH_Goo<T>.EmitProxy().)
GetBoundingBox
 Compute an aligned boundingbox.
LoadGeometry()
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry.
LoadGeometry(RhinoDoc)
 If the geometry is referenced and currently unloaded, forces loading of the geometry. Not all IGH_GeometricGoo implementations support referenced geometry. The default is to always return True.
Morph
 Morph the object or a deformable representation of the object.
Transform
 Transforms the object or a deformable representation of the object.
Top
Fields
Name | Description
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Goo<T>
 Grasshopper.Kernel.Types.GH_GeometricGoo<T>
 Grasshopper.Kernel.Types.GH_Arc
 Grasshopper.Kernel.Types.GH_Box
 Grasshopper.Kernel.Types.GH_Brep
 Grasshopper.Kernel.Types.GH_Circle
 Grasshopper.Kernel.Types.GH_Curve
 Grasshopper.Kernel.Types.GH_Line
 Grasshopper.Kernel.Types.GH_Mesh
 Grasshopper.Kernel.Types.GH_Plane
 Grasshopper.Kernel.Types.GH_Rectangle
 Grasshopper.Kernel.Types.GH_Surface