Grasshopper SDK
GH_UndoRecord.AddAction Method
 Append an undo action to this record. You should only do this prior to calling undo for the first time.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddAction(
	IGH_UndoAction action
)
Public Sub AddAction (
	action As IGH_UndoAction
)
Parameters
action
Type: Grasshopper.Kernel.Undo.IGH_UndoAction
Action to append.
See Also
Reference
GH_UndoRecord Class
Grasshopper.Kernel.Undo Namespace