Grasshopper SDK
GH_RotationalTuningData<T>.AddFrame Method
 Grow the tuning track by one point and compute the angle.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddFrame(
	PointF point
)
Public Sub AddFrame (
	point As PointF
)
Parameters
point
Type: System.Drawing.PointF
Point (in canvas coordinates) to record.
See Also
Reference
GH_RotationalTuningData<T> Class
Grasshopper.GUI Namespace