Grasshopper SDK
GH_Document.DefaultSelectedPreviewColourChangedEventHandler Delegate
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void DefaultSelectedPreviewColourChangedEventHandler(
	Color colour
)
Public Delegate Sub DefaultSelectedPreviewColourChangedEventHandler (
	colour As Color
)
Parameters
colour
Type: System.Drawing.Color
See Also
Reference
Grasshopper.Kernel Namespace