Grasshopper SDK
GH_Document.ExpireSolution Method
 Expire the entire solution. This will blank all objects.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ExpireSolution()
Public Sub ExpireSolution
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace