Grasshopper SDK
GH_Convert.ToMatrix Method
 Convert data into Rhino.Geometry.Matrix.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToMatrix(
	Object data,
	ref Matrix rc,
	GH_Conversion conversion_level
)
Public Shared Function ToMatrix (
	data As Object,
	ByRef rc As Matrix,
	conversion_level As GH_Conversion
) As Boolean
Parameters
data
Type: System.Object
Data to convert
rc
Type: Matrix
conversion_level
Type: Grasshopper.Kernel.GH_Conversion
Level of conversion.
Return Value
Type: Boolean
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace