Grasshopper SDK
GH_ZuiAction.Perform Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract void Perform()
Public MustOverride Sub Perform
Implements
IGH_ZuiAction.Perform()
See Also
Reference
GH_ZuiAction Class
Grasshopper.Kernel Namespace