Grasshopper SDK
GH_Material Fields
The GH_Material type exposes the following members.
Fields
Name | Description
_rdkMaterialId
Top
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace