Grasshopper SDK
GH_DocumentServer.DocumentRemoved Event
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_DocumentServer.DocumentRemovedEventHandler DocumentRemoved
Public Event DocumentRemoved As GH_DocumentServer.DocumentRemovedEventHandler
Value
Type: Grasshopper.Kernel.GH_DocumentServer.DocumentRemovedEventHandler
See Also
Reference
GH_DocumentServer Class
Grasshopper.Kernel Namespace