Grasshopper SDK
GH_Material.CreateStandardMaterial Method
 Creates a standard Grasshopper material from a colour.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static DisplayMaterial CreateStandardMaterial(
	Color colour
)
Public Shared Function CreateStandardMaterial (
	colour As Color
) As DisplayMaterial
Parameters
colour
Type: System.Drawing.Color
Base colour for material.
Return Value
Type: DisplayMaterial
See Also
Reference
GH_Material Class
Grasshopper.Kernel.Types Namespace