Grasshopper SDK
IGH_IndexRule.Evaluate Method
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_RuleResult Evaluate(
	int index
)
Function Evaluate (
	index As Integer
) As GH_RuleResult
Parameters
index
Type: System.Int32
Return Value
Type: GH_RuleResult
See Also
Reference
IGH_IndexRule Interface
Grasshopper.Kernel.Data Namespace