Grasshopper SDK
GH_TooltipDisplayEventArgs.Text Property
 Gets or sets the text of the tooltip. If you do not set the Text property, you must set the Title property or the tooltip will not be shown.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipDisplayEventArgs.Text"]
See Also
Reference
GH_TooltipDisplayEventArgs Class
Grasshopper.GUI Namespace