Grasshopper SDK
GH_FadeAnimation.FadeAlpha Property
 Gets the blend alpha byte for the current state. 0 means fully hidden, 255 means fully shown.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int FadeAlpha { get; }
Public ReadOnly Property FadeAlpha As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FadeAnimation.FadeAlpha"]
See Also
Reference
GH_FadeAnimation Class
Grasshopper.GUI Namespace