Grasshopper SDK
GH_Slider.FormatMask Property
 Gets or sets the string format mask to use for the display. Should contain at least one "{0}" element.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string FormatMask { get; set; }
Public Property FormatMask As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.FormatMask"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace