Grasshopper SDK
GH_DocumentEventServer Class
 RhinoCommon only event server.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_DocumentEventServer
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DocumentEventServer : IGH_DebugDescription
Public Class GH_DocumentEventServer
	Implements IGH_DebugDescription
The GH_DocumentEventServer type exposes the following members.
Constructors
Name | Description
GH_DocumentEventServer
 Create and register a new event server.
Top
Properties
Name | Description
Enabled
 Gets or sets the enabled state flag for this event watcher.
GuidTableRefCount
 Gets the number of stored ids in the Guid Table.
Top
Methods
Name | Description
AppendToDebugLog
ClearGuidTable
 Clear the entire ID table.
CreateGuidTable
 Create the entire ID table from scratch.
EnsureGuidTable
 Create the entire ID table if it doesn't exist yet.
Top
See Also
Reference
Grasshopper.Kernel Namespace