Grasshopper SDK
GH_Animator.InterpolateSingle Method
 Utility interpolation delegate for System.Single values.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static float InterpolateSingle(
	float A,
	float B,
	double factor
)
Public Shared Function InterpolateSingle (
	A As Single,
	B As Single,
	factor As Double
) As Single
Parameters
A
Type: System.Single
B
Type: System.Single
factor
Type: System.Double
Return Value
Type: Single
See Also
Reference
GH_Animator Class
Grasshopper.GUI Namespace