Grasshopper SDK
GH_CanvasObjectMouseDownEventArgs.Canvas Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Canvas Canvas { get; }
Public ReadOnly Property Canvas As GH_Canvas
	Get
Property Value
Type: GH_Canvas
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasObjectMouseDownEventArgs.Canvas"]
See Also
Reference
GH_CanvasObjectMouseDownEventArgs Class
Grasshopper.GUI Namespace