Grasshopper SDK
GH_Topic.SafeDescription Property
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ContentCollection this[
	GH_Audience level
] { get; }
Public ReadOnly Property SafeDescription (
	level As GH_Audience
) As GH_ContentCollection
	Get
Parameters
level
Type: Grasshopper.Documentation.GH_Audience
Property Value
Type: GH_ContentCollection
[Missing <value> documentation for "P:Grasshopper.Documentation.GH_Topic.SafeDescription(Grasshopper.Documentation.GH_Audience)"]
See Also
Reference
GH_Topic Class
Grasshopper.Documentation Namespace