Grasshopper SDK
Projection.ProjectionPlane Property
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Plane ProjectionPlane { get; set; }
Public Property ProjectionPlane As Plane
	Get
	Set
Property Value
Type: Plane
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Transforms.Projection.ProjectionPlane"]
See Also
Reference
Projection Class
Grasshopper.Kernel.Types.Transforms Namespace