Grasshopper SDK
GH_Interval2D.DuplicateInterval Method
 Create a duplicate of this interval.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Interval2D DuplicateInterval()
Public Function DuplicateInterval As GH_Interval2D
Return Value
Type: GH_Interval2D
See Also
Reference
GH_Interval2D Class
Grasshopper.Kernel.Types Namespace