Grasshopper SDK
GH_DigitNumber.Round Method
 Round the number by cancelling the offset in the proper direction.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Round()
Public Sub Round
See Also
Reference
GH_DigitNumber Class
Grasshopper.GUI.Base Namespace