Grasshopper SDK
GH_Slider.RailDarkColour Property
 Gets or sets the edge colour for the dark parts of the rail.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color RailDarkColour { get; set; }
Public Property RailDarkColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.GH_Slider.RailDarkColour"]
See Also
Reference
GH_Slider Class
Grasshopper.GUI Namespace