Grasshopper SDK
GH_RuleSequence Constructor
Initializes a new instance of the GH_RuleSequence class
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RuleSequence(
	IEnumerable<int> sequence,
	int limit,
	bool negate
)
Public Sub New (
	sequence As IEnumerable(Of Integer),
	limit As Integer,
	negate As Boolean
)
Parameters
sequence
Type: System.Collections.Generic.IEnumerable<Int32>
limit
Type: System.Int32
negate
Type: System.Boolean
See Also
Reference
GH_RuleSequence Class
Grasshopper.Kernel.Data Namespace