Grasshopper SDK
CentralSettings.ComponentCascadeMenus Property
 Gets or sets whether Grasshopper document solutions are wrapped in undo records.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ComponentCascadeMenus { get; set; }
Public Shared Property ComponentCascadeMenus As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.ComponentCascadeMenus"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace