Grasshopper SDK
GH_GeometricFont.Char0 Property
 Gets the default geometry for '0'. Caller is responsible for disposing the path.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GraphicsPath Char0 { get; }
Public Shared ReadOnly Property Char0 As GraphicsPath
	Get
Property Value
Type: GraphicsPath
[Missing <value> documentation for "P:Grasshopper.GUI.GH_GeometricFont.Char0"]
See Also
Reference
GH_GeometricFont Class
Grasshopper.GUI Namespace