Grasshopper SDK
GH_TypeLib.t_rc_arccurve Field
Rhino.Geometry.ArcCurve
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static Type t_rc_arccurve
Public Shared t_rc_arccurve As Type
Field Value
Type: Type
See Also
Reference
GH_TypeLib Class
Grasshopper.Kernel Namespace