Grasshopper SDK
GH_PersistentGeometryParam<T>.RegisterRemoteIDs Method
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void RegisterRemoteIDs(
	GH_GuidTable table
)
Public Overrides Sub RegisterRemoteIDs (
	table As GH_GuidTable
)
Parameters
table
Type: GH_GuidTable
See Also
Reference
GH_PersistentGeometryParam<T> Class
Grasshopper.Kernel Namespace