Grasshopper SDK
GH_Format.FormatTransformValidity Method
 If the transform is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatTransformValidity(
	Transform val,
	string identifier = "Transform"
)
Public Shared Function FormatTransformValidity (
	val As Transform,
	Optional identifier As String = "Transform"
) As String
Parameters
val
Type: Transform
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the transform is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace