Grasshopper SDK
GH_Viewport.Diagonal Property
 Gets the length of the diagonal of the viewport in canvas coordinates.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public float Diagonal { get; }
Public ReadOnly Property Diagonal As Single
	Get
Property Value
Type: Single
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Viewport.Diagonal"]
See Also
Reference
GH_Viewport Class
Grasshopper.GUI.Canvas Namespace