Grasshopper SDK
GH_Variant.Duplicate Method
 Duplicate this Variant. If the type of this Variant is [unknown] the contents are not guaranteed to be duplicated.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant Duplicate()
Public Function Duplicate As GH_Variant
Return Value
Type: GH_Variant
See Also
Reference
GH_Variant Class
Grasshopper.Kernel.Expressions Namespace