Grasshopper SDK
GH_IconPicker Constructor
Initializes a new instance of the GH_IconPicker class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_IconPicker()
Public Sub New
See Also
Reference
GH_IconPicker Class
Grasshopper.GUI Namespace