Grasshopper SDK
GH_DisplayExpiredEventArgs Class
 Arguments for display events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_DisplayExpiredEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_DisplayExpiredEventArgs : EventArgs
Public Class GH_DisplayExpiredEventArgs
	Inherits EventArgs
The GH_DisplayExpiredEventArgs type exposes the following members.
Constructors
Name | Description
GH_DisplayExpiredEventArgs
Initializes a new instance of the GH_DisplayExpiredEventArgs class
Top
Properties
Name | Description
ForceRedraw
Top
Fields
Name | Description
m_redraw
Top
See Also
Reference
Grasshopper.Kernel Namespace