Grasshopper SDK
GH_ComponentParamServer.ParameterNickNameChanged Event
 Raised whenever a parameter nickname change is accepted.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_ComponentParamServer.ParameterNickNameChangedEventHandler ParameterNickNameChanged
Public Event ParameterNickNameChanged As GH_ComponentParamServer.ParameterNickNameChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_ComponentParamServer.ParameterNickNameChangedEventHandler
See Also
Reference
GH_ComponentParamServer Class
Grasshopper.Kernel Namespace