Grasshopper SDK
GH_AsynchFileData Constructor (String, Boolean)
 Synchronous constructor.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_AsynchFileData(
	string location,
	bool includeThumbnail
)
Public Sub New (
	location As String,
	includeThumbnail As Boolean
)
Parameters
location
Type: System.String
Location of file
includeThumbnail
Type: System.Boolean
If true, thumbnail data will be loaded.
See Also
Reference
GH_AsynchFileData Class
GH_AsynchFileData Overload
Grasshopper.GUI Namespace