Grasshopper SDK
GH_Canvas.ModifiersChangedEventHandler Delegate
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void ModifiersChangedEventHandler(
	Object sender,
	EventArgs e
)
Public Delegate Sub ModifiersChangedEventHandler (
	sender As Object,
	e As EventArgs
)
Parameters
sender
Type: System.Object
e
Type: System.EventArgs
See Also
Reference
Grasshopper.GUI.Canvas Namespace