Grasshopper SDK
DataTree<T>.Branch Method (Int32)
 Gets the list of data which belongs to the branch path at the given index.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<T> Branch(
	int index
)
Public Function Branch (
	index As Integer
) As List(Of T)
Parameters
index
Type: System.Int32
Index of data to retrieve.
Return Value
Type: List<T>
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown if the index does not represent a valid path.
See Also
Reference
DataTree<T> Class
Branch Overload
Grasshopper Namespace