Grasshopper SDK
GH_PreviewWireArgs.Color Property
 Gets the color in which wires ought to be drawn.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Color { get; }
Public ReadOnly Property Color As Color
	Get
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewWireArgs.Color"]
See Also
Reference
GH_PreviewWireArgs Class
Grasshopper.Kernel Namespace