Grasshopper SDK
GH_FormShepard.UnregisterForm Method
 Remove a sheep from the flock.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void UnregisterForm(
	Form dialog
)
Public Sub UnregisterForm (
	dialog As Form
)
Parameters
dialog
Type: System.Windows.Forms.Form
Form to remove.
See Also
Reference
GH_FormShepard Class
Grasshopper.GUI Namespace