Grasshopper SDK
IGH_VarParamComponent.IsOutputVariable Property
 Gets a flag specifying whether or not the output can potentially contain variable parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool IsOutputVariable { get; }
ReadOnly Property IsOutputVariable As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_VarParamComponent.IsOutputVariable"]
Return Value
Type: Boolean
Return TRUE to enable variable parameter UI on the output side.
See Also
Reference
IGH_VarParamComponent Interface
Grasshopper.Kernel Namespace