Grasshopper SDK
GH_Variant Constructor (String)
 Create a new String variant.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant(
	string value
)
Public Sub New (
	value As String
)
Parameters
value
Type: System.String
Value of Variant.
See Also
Reference
GH_Variant Class
GH_Variant Overload
Grasshopper.Kernel.Expressions Namespace