Grasshopper SDK
DataTree<T>.Graft Method (GH_Path, Boolean)
 Graft a single path in the tree. "Grafting" means appending a new branch for every item in an existing branch.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Graft(
	GH_Path path,
	bool skip_nulls = false
)
Public Sub Graft (
	path As GH_Path,
	Optional skip_nulls As Boolean = false
)
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Path to graft.
skip_nulls (Optional)
Type: System.Boolean
If true, null items in the grafted path will not be included in the new tree.
See Also
Reference
DataTree<T> Class
Graft Overload
Grasshopper Namespace