Grasshopper SDK
GH_CanvasValidator.RemovedFromCanvas Method
 Override this method if you want to be informed when this validator gets removed from a canvas. But *always* call the base class method.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void RemovedFromCanvas(
	GH_Canvas canvas
)
Public Overridable Sub RemovedFromCanvas (
	canvas As GH_Canvas
)
Parameters
canvas
Type: Grasshopper.GUI.Canvas.GH_Canvas
Implements
IGH_CanvasValidator.RemovedFromCanvas(GH_Canvas)
See Also
Reference
GH_CanvasValidator Class
Grasshopper.GUI.Canvas Namespace