Grasshopper SDK
GH_AsynchFileData.StartPeriodicUpdate Method
 Starts periodic updating (from now), using typical periods depending on the physical location of the file. If you call this method you must call StopPeriodicUpdate() when done.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void StartPeriodicUpdate()
Public Sub StartPeriodicUpdate
See Also
Reference
GH_AsynchFileData Class
StartPeriodicUpdate Overload
Grasshopper.GUI Namespace