Grasshopper SDK
GH_LineCharge.DrawViewportWires Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void DrawViewportWires(
	GH_PreviewWireArgs args
)
Public Overrides Sub DrawViewportWires (
	args As GH_PreviewWireArgs
)
Parameters
args
Type: Grasshopper.Kernel.GH_PreviewWireArgs
See Also
Reference
GH_LineCharge Class
Grasshopper.Kernel.Types Namespace