Grasshopper SDK
GH_TooltipComponent Constructor
Initializes a new instance of the GH_TooltipComponent class
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_TooltipComponent()
Public Sub New
See Also
Reference
GH_TooltipComponent Class
Grasshopper.GUI Namespace