Grasshopper SDK
GH_GooProxy<T>.FromString Method
 If IsParsable(), then attempts to convert the string to a generic type value
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual bool FromString(
	string in
)
Public Overridable Function FromString (
	in As String
) As Boolean
Parameters
in
Type: System.String
The String to parse.
Return Value
Type: Boolean
True on success, false on failure. This method should not throw exceptions.
Implements
IGH_GooProxy.FromString(String)
See Also
Reference
GH_GooProxy<T> Class
Grasshopper.Kernel.Types Namespace