Grasshopper SDK
GH_CanvasWireValidator.WireMotionText Property
 Gets or sets the text to draw at the wire interior.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string WireMotionText { get; set; }
Public Property WireMotionText As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_CanvasWireValidator.WireMotionText"]
See Also
Reference
GH_CanvasWireValidator Class
Grasshopper.GUI.Canvas Namespace