Grasshopper SDK
GH_ScriptVariant.Boolean Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Boolean { get; }
Public ReadOnly Property Boolean As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ScriptVariant.Boolean"]
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace