Grasshopper SDK
GH_String Constructor
 Blank constructor
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_String()
Public Sub New
See Also
Reference
GH_String Class
GH_String Overload
Grasshopper.Kernel.Types Namespace