Grasshopper SDK
GH_DigitScrollerBase.MaximumValue Property
 Gets or sets the upper bound of the scroll value.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public decimal MaximumValue { get; set; }
Public Property MaximumValue As Decimal
	Get
	Set
Property Value
Type: Decimal
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.MaximumValue"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace