Grasshopper SDK
GH_GraphicsUtil.RenderCenteredIcon Method (Graphics, RectangleF, Image, Double)
 Draw an icon centered in a frame. This code is not zoom-aware, but it will perform consistent rounding (to avoid pixel-jitter when moving the frame across the screen). Icon will not be clipped to the frame.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RenderCenteredIcon(
	Graphics g,
	RectangleF frame,
	Image icon,
	double alpha
)
Public Shared Sub RenderCenteredIcon (
	g As Graphics,
	frame As RectangleF,
	icon As Image,
	alpha As Double
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to render with.
frame
Type: System.Drawing.RectangleF
Frame to center icon in.
icon
Type: System.Drawing.Image
Icon to render
alpha
Type: System.Double
Transparency factor.
See Also
Reference
GH_GraphicsUtil Class
RenderCenteredIcon Overload
Grasshopper.GUI Namespace