Grasshopper SDK
GH_ColourCube.Average Method (Color, Color, Color, Color)
 Compute the average of four colours.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Average(
	Color A,
	Color B,
	Color C,
	Color D
)
Public Function Average (
	A As Color,
	B As Color,
	C As Color,
	D As Color
) As Color
Parameters
A
Type: System.Drawing.Color
First colour for average.
B
Type: System.Drawing.Color
Second colour for average.
C
Type: System.Drawing.Color
Third colour for average.
D
Type: System.Drawing.Color
Fourth colour for average.
Return Value
Type: Color
The average of A, B, C and D.
See Also
Reference
GH_ColourCube Class
Average Overload
Grasshopper.GUI.Base Namespace