Grasshopper SDK
GH_Painter Constructor
 Constructor.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Painter(
	GH_Canvas owner
)
Public Sub New (
	owner As GH_Canvas
)
Parameters
owner
Type: Grasshopper.GUI.Canvas.GH_Canvas
Canvas that owns this painter object.
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace