Grasshopper SDK
GH_String Constructor (String)
Initializes a new instance of the GH_String class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_String(
	string str
)
Public Sub New (
	str As String
)
Parameters
str
Type: System.String
See Also
Reference
GH_String Class
GH_String Overload
Grasshopper.Kernel.Types Namespace