Grasshopper SDK
GH_Param<T>.DataMapping Property
 Gets or sets the data mapping of this Parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DataMapping DataMapping { get; set; }
Public Property DataMapping As GH_DataMapping
	Get
	Set
Property Value
Type: GH_DataMapping
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Param`1.DataMapping"]
Implements
IGH_Param.DataMapping
See Also
Reference
GH_Param<T> Class
Grasshopper.Kernel Namespace