Grasshopper SDK
CentralSettings.TooltipWiggleRadiusChanged Event
 Raised whenever the TooltipWiggleRadius setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.TooltipWiggleRadiusChangedEventHandler TooltipWiggleRadiusChanged
Public Shared Event TooltipWiggleRadiusChanged As CentralSettings.TooltipWiggleRadiusChangedEventHandler
Value
Type: Grasshopper.CentralSettings.TooltipWiggleRadiusChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace