Grasshopper SDK
GH_SettingsServer.GetValue Method (String, DateTime)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DateTime GetValue(
	string key,
	DateTime default
)
Public Function GetValue (
	key As String,
	default As DateTime
) As DateTime
Parameters
key
Type: System.String
default
Type: System.DateTime
Return Value
Type: DateTime
See Also
Reference
GH_SettingsServer Class
GetValue Overload
Grasshopper.Kernel Namespace