Grasshopper SDK
GH_ScriptVariant.Plane Property
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Plane Plane { get; }
Public ReadOnly Property Plane As Plane
	Get
Property Value
Type: Plane
[Missing <value> documentation for "P:Grasshopper.Kernel.Expressions.GH_ScriptVariant.Plane"]
See Also
Reference
GH_ScriptVariant Class
Grasshopper.Kernel.Expressions Namespace