Grasshopper SDK
GH_AttributesChangedEventArgs Class
 Event arguments passed during AttributesChanged events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_AttributesChangedEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_AttributesChangedEventArgs : EventArgs
Public Class GH_AttributesChangedEventArgs
	Inherits EventArgs
The GH_AttributesChangedEventArgs type exposes the following members.
Constructors
Name | Description
GH_AttributesChangedEventArgs
Initializes a new instance of the GH_AttributesChangedEventArgs class
Top
See Also
Reference
Grasshopper.Kernel Namespace