Grasshopper SDK
GH_PreviewUtil.AddPoint Method
 Add a point to the temporary Preview lists.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddPoint(
	Point3d point
)
Public Sub AddPoint (
	point As Point3d
)
Parameters
point
Type: Point3d
Point to add. Invalid points will be ignored.
See Also
Reference
GH_PreviewUtil Class
Grasshopper.Kernel Namespace