Grasshopper SDK
GH_SettingsServer.DatabaseName Property
 Gets the name of this settings database.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string DatabaseName { get; }
Public ReadOnly Property DatabaseName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_SettingsServer.DatabaseName"]
See Also
Reference
GH_SettingsServer Class
Grasshopper.Kernel Namespace