Grasshopper SDK
GH_Convert.ToColor_Primary Method
 Performs a direct cast from Drawing.Color, GH_Color and OnColor.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToColor_Primary(
	Object data,
	ref Color destination
)
Public Shared Function ToColor_Primary (
	data As Object,
	ByRef destination As Color
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.Drawing.Color
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace