Grasshopper SDK
GH_PreviewArgs.MeshingParameters Property
 Gets the meshing parameters to be used during meshing breps.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public MeshingParameters MeshingParameters { get; }
Public ReadOnly Property MeshingParameters As MeshingParameters
	Get
Property Value
Type: MeshingParameters
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewArgs.MeshingParameters"]
Implements
IGH_PreviewArgs.MeshingParameters
See Also
Reference
GH_PreviewArgs Class
Grasshopper.Kernel Namespace