Grasshopper SDK
GH_Lexer.PerformLexicalReplace<T> Method (GH_Lexer, GH_Lexer, DataTree<T>, DataTree<T>)
 Lexical Find..Replace operations.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void PerformLexicalReplace<T>(
	GH_Lexer source,
	GH_Lexer target,
	DataTree<T> tree_in,
	DataTree<T> tree_out
)
Public Shared Sub PerformLexicalReplace(Of T) (
	source As GH_Lexer,
	target As GH_Lexer,
	tree_in As DataTree(Of T),
	tree_out As DataTree(Of T)
)
Parameters
source
Type: Grasshopper.Kernel.Data.GH_Lexer
Search mask.
target
Type: Grasshopper.Kernel.Data.GH_Lexer
Replace pattern.
tree_in
Type: Grasshopper.DataTree<T>
Source data tree.
tree_out
Type: Grasshopper.DataTree<T>
Target data tree.
Type Parameters
T
Type of data in target tree.
See Also
Reference
GH_Lexer Class
PerformLexicalReplace Overload
Grasshopper.Kernel.Data Namespace