Grasshopper SDK
Orientation.TargetFrame Property
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Plane TargetFrame { get; set; }
Public Property TargetFrame As Plane
	Get
	Set
Property Value
Type: Plane
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.Transforms.Orientation.TargetFrame"]
See Also
Reference
Orientation Class
Grasshopper.Kernel.Types.Transforms Namespace