Grasshopper SDK
GH_Link.CreateGlossaryLink Method (String)
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Link CreateGlossaryLink(
	string text
)
Public Shared Function CreateGlossaryLink (
	text As String
) As GH_Link
Parameters
text
Type: System.String
Return Value
Type: GH_Link
See Also
Reference
GH_Link Class
CreateGlossaryLink Overload
Grasshopper.Documentation Namespace