Grasshopper SDK
GH_ColourPicker.ColourChanged Event
 Raised whenever the value of the slider is changed via GUI interaction.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_ColourPicker.ColourChangedEventHandler ColourChanged
Public Event ColourChanged As GH_ColourPicker.ColourChangedEventHandler
Value
Type: Grasshopper.GUI.GH_ColourPicker.ColourChangedEventHandler
See Also
Reference
GH_ColourPicker Class
Grasshopper.GUI Namespace