Grasshopper SDK
GH_PointCharge Constructor
Initializes a new instance of the GH_PointCharge class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PointCharge()
Public Sub New
See Also
Reference
GH_PointCharge Class
Grasshopper.Kernel.Types Namespace