Grasshopper SDK
Identity Constructor
Initializes a new instance of the Identity class
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Identity()
Public Sub New
See Also
Reference
Identity Class
Grasshopper.Kernel.Types.Transforms Namespace