Grasshopper SDK
GH_ExpressionParser Constructor
Initializes a new instance of the GH_ExpressionParser class
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ExpressionParser()
Public Sub New
See Also
Reference
GH_ExpressionParser Class
GH_ExpressionParser Overload
Grasshopper.Kernel.Expressions Namespace