Grasshopper SDK
GH_Format.FormatFilePath Method (String, Int32, Font)
 Format a filepath so that it doesn't exceed width. If the filepath filename is already longer than maxLength it will be returned intact.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatFilePath(
	string path,
	int maxWidth,
	Font font
)
Public Shared Function FormatFilePath (
	path As String,
	maxWidth As Integer,
	font As Font
) As String
Parameters
path
Type: System.String
Path to format.
maxWidth
Type: System.Int32
Maximum allowed width (in pixels)
font
Type: System.Drawing.Font
Font to use for measuring.
Return Value
Type: String
The formatted path.
See Also
Reference
GH_Format Class
FormatFilePath Overload
Grasshopper.Kernel Namespace