Grasshopper SDK
GH_Format.FormatBox Method (Box)
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatBox(
	Box data
)
Public Shared Function FormatBox (
	data As Box
) As String
Parameters
data
Type: Box
Return Value
Type: String
See Also
Reference
GH_Format Class
FormatBox Overload
Grasshopper.Kernel Namespace