Grasshopper SDK
GH_PaletteStyle.Edge Property
 Gets or sets the edge of this style.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color Edge { get; set; }
Public Property Edge As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_PaletteStyle.Edge"]
See Also
Reference
GH_PaletteStyle Class
Grasshopper.GUI.Canvas Namespace