Grasshopper SDK
GH_ColourPickerBase Constructor
 Create a new instance of the Colour Picker base control. This constructor assigns the default Colour space model and involves a call to the Grasshopper core settings server. You must call SetupColourPicker() prior to rendering this control on screen.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ColourPickerBase()
Public Sub New
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace