Grasshopper SDK
GH_UpgradeUtil Constructor
Initializes a new instance of the GH_UpgradeUtil class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UpgradeUtil()
Public Sub New
See Also
Reference
GH_UpgradeUtil Class
Grasshopper.Kernel Namespace