Grasshopper SDK
GH_GeometricGooWrapper Class
 Utility class for maintaining all kinds of IGH_GeometricGoo types.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_GeometricGooWrapper
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_GeometricGooWrapper : IGH_GeometricGoo
Public NotInheritable Class GH_GeometricGooWrapper
	Implements IGH_GeometricGoo
The GH_GeometricGooWrapper type exposes the following members.
Constructors
Name | Description
GH_GeometricGooWrapper()
Initializes a new instance of the GH_GeometricGooWrapper class
GH_GeometricGooWrapper(IGH_GeometricGoo)
Initializes a new instance of the GH_GeometricGooWrapper class
Top
Properties
Name | Description
Boundingbox
InternalGoo
IsGeometryLoaded
IsReferencedGeometry
IsValid
IsValidWhyNot
ReferenceID
TypeDescription
TypeName
Top
Methods
Name | Description
CastFrom
CastTo<T>
ClearCaches
Duplicate
DuplicateGeometry
EmitProxy
GetBoundingBox
LoadGeometry()
LoadGeometry(RhinoDoc)
Morph
Read
ScriptVariable
 This function will be called when the local IGH_Goo instance disapears into a user Script. This would be an excellent place to cast your IGH_Goo type to a simple data type.
ToString |  (Overrides Object.ToString().)
Transform
Write
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace