Grasshopper SDK
GH_DocumentObject.ExpirePreview Method
 Call this function when you suspect that the preview has expired for this object. This will cause the display cache to be eradicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void ExpirePreview(
	bool redraw
)
Public Overridable Sub ExpirePreview (
	redraw As Boolean
)
Parameters
redraw
Type: System.Boolean
Implements
IGH_DocumentObject.ExpirePreview(Boolean)
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace