Grasshopper SDK
GH_Painter.DrawBackground Method
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void DrawBackground(
	GH_Viewport viewport
)
Public Sub DrawBackground (
	viewport As GH_Viewport
)
Parameters
viewport
Type: Grasshopper.GUI.Canvas.GH_Viewport
See Also
Reference
GH_Painter Class
Grasshopper.GUI.Canvas Namespace