Grasshopper SDK
GH_RotationalTuningData<T>.Pivot Property
 Gets or sets the rotational pivot. You only need to set this if the pivot changes.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public PointF Pivot { get; set; }
Public Property Pivot As PointF
	Get
	Set
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.GUI.GH_RotationalTuningData`1.Pivot"]
See Also
Reference
GH_RotationalTuningData<T> Class
Grasshopper.GUI Namespace