Grasshopper SDK
GH_LoadingDemand Enumeration
 Enumerates all assembly loading behaviour demands.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_LoadingDemand
Public Enumeration GH_LoadingDemand
Members
Member name | Value | Description
None | -1 |  Indicates no valid loading behaviour. Do not use this value in the GH_GHALoadingAttribute constructor.
Default | 0 |  Use the application settings.
ForceCOFF | 1 |  Force this assembly to be loaded using COFF byte arrays.
ForceDirect | 2 |  Force this assembly to be loaded directly from the disk.
See Also
Reference
Grasshopper.Kernel Namespace