Grasshopper SDK
IGH_InstanceDescription.SubCategory Property
 Gets or sets the SubCategory in which this object belongs. If HasSubCategory() returns false, this field has no meaning.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string SubCategory { get; set; }
Property SubCategory As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_InstanceDescription.SubCategory"]
See Also
Reference
IGH_InstanceDescription Interface
Grasshopper.Kernel Namespace