Grasshopper SDK
GH_PersistentParam<T> Constructor (GH_InstanceDescription)
Initializes a new instance of the GH_PersistentParam<T> class
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected GH_PersistentParam(
	GH_InstanceDescription nTag
)
Protected Sub New (
	nTag As GH_InstanceDescription
)
Parameters
nTag
Type: Grasshopper.Kernel.GH_InstanceDescription
See Also
Reference
GH_PersistentParam<T> Class
GH_PersistentParam<T> Overload
Grasshopper.Kernel Namespace