Grasshopper SDK
IGH_UserPromptAware.PromptMenuSingleItem Method
 Create a menu item that will be inserted into the Parameter context menu for getting single values.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
ToolStripMenuItem PromptMenuSingleItem()
Function PromptMenuSingleItem As ToolStripMenuItem
Return Value
Type: ToolStripMenuItem
See Also
Reference
IGH_UserPromptAware Interface
Grasshopper.Kernel Namespace