Grasshopper SDK
SliderSnapRange Constructor (Decimal)
Initializes a new instance of the SliderSnapRange class
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public SliderSnapRange(
	decimal value
)
Public Sub New (
	value As Decimal
)
Parameters
value
Type: System.Decimal
See Also
Reference
SliderSnapRange Structure
SliderSnapRange Overload
Grasshopper.GUI.Base Namespace