Grasshopper SDK
GH_Grip.Type Property
 Gets whether the colour across this grip is smooth.
Namespace: Grasshopper.GUI.Gradient
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_GripType Type { get; }
Public ReadOnly Property Type As GH_GripType
	Get
Property Value
Type: GH_GripType
[Missing <value> documentation for "P:Grasshopper.GUI.Gradient.GH_Grip.Type"]
See Also
Reference
GH_Grip Class
Grasshopper.GUI.Gradient Namespace