Grasshopper SDK
GH_OperatorType Enumeration
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_OperatorType
Public Enumeration GH_OperatorType
Members
Member name | Value | Description
UnaryOnLeft | 0
UnaryOnRight | 1
Binary | 2
See Also
Reference
Grasshopper.Kernel.Expressions Namespace