Grasshopper SDK
GH_Point.ShowReferenceDialog Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public DialogResult ShowReferenceDialog()
Public Function ShowReferenceDialog As DialogResult
Return Value
Type: DialogResult
See Also
Reference
GH_Point Class
ShowReferenceDialog Overload
Grasshopper.Kernel.Types Namespace