Grasshopper SDK
GH_Component.GenerateParameterHelp Method (IGH_Param)
 Generate HTML string for a single parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected string GenerateParameterHelp(
	IGH_Param param
)
Protected Function GenerateParameterHelp (
	param As IGH_Param
) As String
Parameters
param
Type: Grasshopper.Kernel.IGH_Param
Return Value
Type: String
See Also
Reference
GH_Component Class
GenerateParameterHelp Overload
Grasshopper.Kernel Namespace