Grasshopper SDK
GH_DocumentEventServer.ClearGuidTable Method
 Clear the entire ID table.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void ClearGuidTable()
Public Sub ClearGuidTable
See Also
Reference
GH_DocumentEventServer Class
Grasshopper.Kernel Namespace