Grasshopper SDK
GH_Vector.GH_VectorProxy.FromString Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override bool FromString(
	string in
)
Public Overrides Function FromString (
	in As String
) As Boolean
Parameters
in
Type: System.String
Return Value
Type: Boolean
See Also
Reference
GH_Vector.GH_VectorProxy Class
Grasshopper.Kernel.Types Namespace