Grasshopper SDK
GH_Canvas.Document Property
 Gets or sets the document currently loaded in this canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document Document { get; set; }
Public Property Document As GH_Document
	Get
	Set
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.Document"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace