Grasshopper SDK
GH_DigitScrollerBase.MouseDown Method
 Respond to mouse-down events.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_DigitScrollerBase.GH_MouseAction MouseDown(
	MouseEventArgs args,
	PointF pt
)
Public Function MouseDown (
	args As MouseEventArgs,
	pt As PointF
) As GH_DigitScrollerBase.GH_MouseAction
Parameters
args
Type: System.Windows.Forms.MouseEventArgs
Mouse Event arguments.
pt
Type: System.Drawing.PointF
Mouse cursor position in floating point accuracy.
Return Value
Type: GH_DigitScrollerBase.GH_MouseAction
True if a Drag operation was started, false if the event went unnoticed.
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace