Grasshopper SDK
GH_SliderBase.Padding Property
 Gets or sets the padding around the slider border.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Padding Padding { get; set; }
Public Property Padding As Padding
	Get
	Set
Property Value
Type: Padding
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.Padding"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace