Grasshopper SDK
GH_GeometricGoo<T>.Duplicate Method
 Make a complete duplicate of this instance. No shallow copies.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override IGH_Goo Duplicate()
Public Overrides Function Duplicate As IGH_Goo
Return Value
Type: IGH_Goo
Remarks
Classes which implement this interface should also provide type specific Duplicate methods
See Also
Reference
GH_GeometricGoo<T> Class
Grasshopper.Kernel.Types Namespace