Grasshopper SDK
GH_Format.FormatComplexValidity Method
 If the complex number is invalid, return a string describing why.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static string FormatComplexValidity(
	Complex val,
	string identifier = "Complex"
)
Public Shared Function FormatComplexValidity (
	val As Complex,
	Optional identifier As String = "Complex"
) As String
Parameters
val
Type: Grasshopper.Kernel.Types.Complex
Value to format.
identifier (Optional)
Type: System.String
Name used to refer to the value in the format.
Return Value
Type: String
A string describing why the complex number is invalid or String.Empty if the value is not invalid.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace