Grasshopper SDK
GH_Attributes<T>.PerformLayout Method
 Recompute the layout for these attributes. This function is automatically called during Drawing operations, so you typically don't have to.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void PerformLayout()
Public Sub PerformLayout
Implements
IGH_Attributes.PerformLayout()
See Also
Reference
GH_Attributes<T> Class
Grasshopper.Kernel Namespace