Grasshopper SDK
Node3d<T>.NextNode Property
 Gets the logical neighbour to the right of this node. There is no spatial relationships between logical neighbours, this is purely an iteration aid.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Node3d<T> NextNode { get; }
Public ReadOnly Property NextNode As Node3d(Of T)
	Get
Property Value
Type: Node3d<T>
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NextNode"]
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace