Grasshopper SDK
GH_StateServer.Owner Property
 Gets the document that owns this server.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Document Owner { get; }
Public ReadOnly Property Owner As GH_Document
	Get
Property Value
Type: GH_Document
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_StateServer.Owner"]
See Also
Reference
GH_StateServer Class
Grasshopper.Kernel Namespace