Grasshopper SDK
GH_DocumentObject.AddedToDocument Method
 This method will be called when an object is added to a document. Override this method if you want to handle such events.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void AddedToDocument(
	GH_Document document
)
Public Overridable Sub AddedToDocument (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document that now owns this object.
Implements
IGH_DocumentObject.AddedToDocument(GH_Document)
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace