Grasshopper SDK
GH_Format.TreatAsCollection Method
 This method is used in Scripting components to determine whether a certain class was 'intended' as a collection or as a single piece of data .
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool TreatAsCollection(
	Object obj
)
Public Shared Function TreatAsCollection (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Object to test.
Return Value
Type: Boolean
True if we think the object was intended as a collection.
See Also
Reference
GH_Format Class
Grasshopper.Kernel Namespace