Grasshopper SDK
GH_RuntimeFile.TagAuthor Field
 String tag used to identify Author fields in documentation source files.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public const string TagAuthor = "AUTHOR"
Public Const TagAuthor As String = "AUTHOR"
Field Value
Type: String
See Also
Reference
GH_RuntimeFile Class
Grasshopper.Documentation Namespace