Grasshopper SDK
GH_GraphicsUtil.DentHorizontal Method (Graphics, Rectangle, Int32, Int32)
 Draws a horizontal dent. A horizontal dent had dark lines along the top and bottom edges.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void DentHorizontal(
	Graphics g,
	Rectangle box,
	int alphaEdge,
	int alphaFill
)
Public Shared Sub DentHorizontal (
	g As Graphics,
	box As Rectangle,
	alphaEdge As Integer,
	alphaFill As Integer
)
Parameters
g
Type: System.Drawing.Graphics
Graphics object to draw with.
box
Type: System.Drawing.Rectangle
Dimensions of the dent.
alphaEdge
Type: System.Int32
Transparency on the middle of the edges.
alphaFill
Type: System.Int32
Transparency on the middle of the fill.
See Also
Reference
GH_GraphicsUtil Class
DentHorizontal Overload
Grasshopper.GUI Namespace