Grasshopper SDK
GH_Matrix.DuplicateMatrix Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Matrix DuplicateMatrix()
Public Function DuplicateMatrix As GH_Matrix
Return Value
Type: GH_Matrix
See Also
Reference
GH_Matrix Class
Grasshopper.Kernel.Types Namespace