Grasshopper SDK
GH_MaterialPreviewControl.SelectedChanged Event
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_MaterialPreviewControl.SelectedChangedEventHandler SelectedChanged
Public Event SelectedChanged As GH_MaterialPreviewControl.SelectedChangedEventHandler
Value
Type: Grasshopper.GUI.GH_MaterialPreviewControl.SelectedChangedEventHandler
See Also
Reference
GH_MaterialPreviewControl Class
Grasshopper.GUI Namespace