Grasshopper SDK
GH_SettingsCategory.Parent Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Parent { get; }
Public ReadOnly Property Parent As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_SettingsCategory.Parent"]
Implements
IGH_SettingCategory.Parent
See Also
Reference
GH_SettingsCategory Class
Grasshopper.GUI Namespace