Grasshopper SDK
IGH_Param Interface
 Base interface for all Parameter types in Grasshopper. Do not implement this interface from scratch, derive from GH_Param or GH_PersistentParam instead.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_Param : IGH_ActiveObject
Public Interface IGH_Param
	Inherits IGH_ActiveObject
The IGH_Param type exposes the following members.
Properties
Name | Description
Access
 Gets or sets the Access level for this parameter.
DataMapping
 Gets or sets the data mapping of this Parameter.
DataType
 Gets the type of the current data state.
HasProxySources
 Gets a value indicating whether or not this parameter maintains proxy sources. Proxy sources are used during file IO, when actual sources might not be available yet. Once an IO operation has been completed there should be no more proxy sources.
Kind
 Gets the parameter kind. The kind is evaluated lazily and cached.
Optional
 Gets or sets whether or not this parameter is considered optional by the owner component. Empty, non-optional parameters prevent the component from being solved.
ProxySourceCount
 Gets the number of proxy sources for this parameter. Proxy sources are used during file IO, when actual sources might not be available yet. Once an IO operation has been completed there should be no more proxy sources.
Recipients
 Gets a list of all the recipients of this parameter. I.e. a recipient has this parameter as one of the sources. The Recipient list is maintained by the parameter, do not modify it yourself.
Reverse
 Gets or sets the data reverse modifier of this parameter.
Simplify
 Gets or sets the simplify modifier for this parameter.
SourceCount
 Gets the number of sources for this parameter.
Sources
 Gets a list of source parameters. Do not modify this list, if you wish to add or remove sources, use dedicated functions like AddSource() and RemoveSource instead.
StateTags
 Gets all the StateTags that are associated with this parameter. A state tag is a visual feedback icon that represents specific internal settings.
Type
 Gets the Framework Type descriptor for the stored Data.
TypeName
 Gets a human readable description of the data stored in this parameter.
VolatileData
 Gets the instance of the volatile data tree stored in this parameter.
VolatileDataCount
 Gets the total number of volatile data items stored in this parameter.
WireDisplay
 Gets or sets the wire display style for this parameter. Wire display only affects the wires connected to the parameter input.
Top
Methods
Name | Description
AddSource(IGH_Param)
 Append a new Source parameter to the end of the Sources list. Sources provide this parameter with data at runtime.
AddSource(IGH_Param, Int32)
 Insert a new Source parameter into the Sources list. Sources provide this parameter with data at runtime.
AddVolatileData
 Inserts an item of volatile data into the data structure.
AddVolatileDataList
 Inserts a list of items into the data structure.
AddVolatileDataTree
 Insert an entire data tree into this parameter.
ClearProxySources
 Remove all proxy sources without attempting to relink them.
CreateProxySources
 Convert all proper source parameters into proxy sources.
RelinkProxySources
 Attempt to replace all proxy sources with real sources. Proxy sources are used during file IO, when actual sources might not be available yet. Once an IO operation has been completed there should be no more proxy sources.
RemoveAllSources
 Remove all sources from this parameter.
RemoveEffects
 Remove all post-process effects.
RemoveSource(Guid)
 Remove the specified source from this parameter.
RemoveSource(IGH_Param)
 Remove the specified source from this parameter.
ReplaceSource(Guid, IGH_Param)
 Replace an existing source with a new one. If the old_source does not exist in this parameter, nothing happens.
ReplaceSource(IGH_Param, IGH_Param)
 Replace an existing source with a new one. If the old_source does not exist in this parameter, nothing happens.
Top
See Also
Reference
Grasshopper.Kernel Namespace