Grasshopper SDK
IGH_FileDropTarget.AcceptableFile Method
 Gets a value indicating whether or not the path can be handled by the local object.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
bool AcceptableFile(
	string path
)
Function AcceptableFile (
	path As String
) As Boolean
Parameters
path
Type: System.String
Path to file in question.
Return Value
Type: Boolean
True if the file can be handled, false if otherwise.
See Also
Reference
IGH_FileDropTarget Interface
Grasshopper.GUI Namespace