Grasshopper SDK
GH_GraphicsUtil.TransparencyMatrix Method (Int32)
 Create an image transparency matrix for a specific blending factor.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static ColorMatrix TransparencyMatrix(
	int alpha
)
Public Shared Function TransparencyMatrix (
	alpha As Integer
) As ColorMatrix
Parameters
alpha
Type: System.Int32
Alpha level of color matrix.
Return Value
Type: ColorMatrix
See Also
Reference
GH_GraphicsUtil Class
TransparencyMatrix Overload
Grasshopper.GUI Namespace