Grasshopper SDK
GH_Document.DuplicateDocument Method
 Attempt to duplicate a document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Document DuplicateDocument(
	GH_Document doc
)
Public Shared Function DuplicateDocument (
	doc As GH_Document
) As GH_Document
Parameters
doc
Type: Grasshopper.Kernel.GH_Document
Document to copy.
Return Value
Type: GH_Document
A document similar to the input on success, or nothing on failure.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace