Grasshopper SDK
GH_WindowsControlUtil.FixTextRenderingDefault Method (Control.ControlCollection)
 Recursively sets the UseCompatibleTextRendering value to False on each control.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void FixTextRenderingDefault(
	Control.ControlCollection iControls
)
Public Shared Sub FixTextRenderingDefault (
	iControls As Control.ControlCollection
)
Parameters
iControls
Type: System.Windows.Forms.Control.ControlCollection
Examples
 This example shows how to use this function to modify all the controls on a windows Form.
Dim frm As New MyVerySpecialForm()
Grasshopper.GUI.GH_WindowsControlUtil.FixTextRenderingDefault(frm.Controls)
frm.Show()
See Also
Reference
GH_WindowsControlUtil Class
FixTextRenderingDefault Overload
Grasshopper.GUI Namespace