Grasshopper SDK
GH_MemoryBitmap.Filter_Dullify Method
 Reduces contrast based on opacity. This filter pulls all colours towards dull grey, without wrecking drop-shadows.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Filter_Dullify()
Public Sub Filter_Dullify
See Also
Reference
GH_MemoryBitmap Class
Grasshopper.Kernel Namespace