Grasshopper SDK
GH_Convert.CultureTable Property
 Gets the cached culture table. Do not modify this dictionary unless you know what you are doing.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static SortedDictionary<CultureInfo, List<string>> CultureTable { get; }
Public Shared ReadOnly Property CultureTable As SortedDictionary(Of CultureInfo, List(Of String))
	Get
Property Value
Type: SortedDictionary<CultureInfo, List<String>>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Convert.CultureTable"]
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace