Grasshopper SDK
GH_UndoServer.UndoCount Property
 Number of undo records currently in the stack.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int UndoCount { get; }
Public ReadOnly Property UndoCount As Integer
	Get
Property Value
Type: Int32
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoServer.UndoCount"]
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace