Grasshopper SDK
IGH_DocumentObject.ExpirePreview Method
 Call this function when you suspect that the preview has expired for this object. This will cause the display cache to be eradicated.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void ExpirePreview(
	bool redraw
)
Sub ExpirePreview (
	redraw As Boolean
)
Parameters
redraw
Type: System.Boolean
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace