Grasshopper SDK
GH_Param<T>.RemoveSource Method (Guid)
 Remove the specified source from this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public virtual void RemoveSource(
	Guid source_id
)
Public Overridable Sub RemoveSource (
	source_id As Guid
)
Parameters
source_id
Type: System.Guid
InstanceID of source to remove.
Implements
IGH_Param.RemoveSource(Guid)
See Also
Reference
GH_Param<T> Class
RemoveSource Overload
Grasshopper.Kernel Namespace