Grasshopper SDK
GH_DocumentObject.ComponentGuid Property
 Returns a consistent ID for this object type. Every object must supply a unique and unchanging ID that is used to identify objects of the same type.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract Guid ComponentGuid { get; }
Public MustOverride ReadOnly Property ComponentGuid As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_DocumentObject.ComponentGuid"]
Implements
IGH_DocumentObject.ComponentGuid
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace