Grasshopper SDK
GH_RotationalTuningData<T>.Frame Property
 Gets the frame at the given index.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RotationalFrame this[
	int index
] { get; }
Public ReadOnly Default Property Frame (
	index As Integer
) As GH_RotationalFrame
	Get
Parameters
index
Type: System.Int32
Index of frame.
Property Value
Type: GH_RotationalFrame
[Missing <value> documentation for "P:Grasshopper.GUI.GH_RotationalTuningData`1.Frame(System.Int32)"]
See Also
Reference
GH_RotationalTuningData<T> Class
Grasshopper.GUI Namespace