Grasshopper SDK
GH_ClipboardType Enumeration
 Enumerates all possible clipboards for GH_DocumentIO operations.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_ClipboardType
Public Enumeration GH_ClipboardType
Members
Member name | Value | Description
System | 0 |  Identifies the Operating System clipboard shared amongst all applications.
Local | 1 |  Identifies the DocumentIO clipboard which is only accessible from within a single instance of GH_DocumentIO.
Global | 2 |  Identifies the DocumentIO clipboard which is accessible from all instances of GH_DocumentIO in this AppDomain.
See Also
Reference
Grasshopper.Kernel Namespace