Grasshopper SDK
GH_ObjectSettings.PanelColour Property
 Gets or sets the default fill colour for panel objects.
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Color PanelColour { get; set; }
Public Property PanelColour As Color
	Get
	Set
Property Value
Type: Color
[Missing <value> documentation for "P:Grasshopper.GUI.Theme.GH_ObjectSettings.PanelColour"]
See Also
Reference
GH_ObjectSettings Class
Grasshopper.GUI.Theme Namespace