Grasshopper SDK
IGH_Content Interface
 All parts that make up documentation content must implement this interface.
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public interface IGH_Content
Public Interface IGH_Content
See Also
Reference
Grasshopper.Documentation Namespace