Grasshopper SDK
GH_FormShepard.Sheep Property
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IEnumerable<Form> Sheep { get; }
Public ReadOnly Property Sheep As IEnumerable(Of Form)
	Get
Property Value
Type: IEnumerable<Form>
[Missing <value> documentation for "P:Grasshopper.GUI.GH_FormShepard.Sheep"]
See Also
Reference
GH_FormShepard Class
Grasshopper.GUI Namespace