Grasshopper SDK
GH_UndoServer.RedoGuids Property
 Gets a sorted list of all the redo Guids in this server.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Guid> RedoGuids { get; }
Public ReadOnly Property RedoGuids As List(Of Guid)
	Get
Property Value
Type: List<Guid>
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoServer.RedoGuids"]
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace