Grasshopper SDK
GH_Canvas.IsActiveWidget Property
 Gets a value indicating whether or not a widget is currently activated.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsActiveWidget { get; }
Public ReadOnly Property IsActiveWidget As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.IsActiveWidget"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace