Grasshopper SDK
GH_LineCharge Class
 Line charge implementation for IGH_Fields.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_FieldElement
 Grasshopper.Kernel.Types.GH_LineCharge
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_LineCharge : GH_FieldElement
Public Class GH_LineCharge
	Inherits GH_FieldElement
The GH_LineCharge type exposes the following members.
Constructors
Name | Description
GH_LineCharge
Initializes a new instance of the GH_LineCharge class
Top
Properties
Name | Description
BoundingBox |  (Overrides GH_FieldElement.BoundingBox.)
Charge
ElementGuid |  (Overrides GH_FieldElement.ElementGuid.)
Segment
Top
Methods
Name | Description
DrawViewportWires |  (Overrides GH_FieldElement.DrawViewportWires(GH_PreviewWireArgs).)
Duplicate |  (Overrides GH_FieldElement.Duplicate().)
Force |  (Overrides GH_FieldElement.Force(Point3d).)
IsCoincident |  (Overrides GH_FieldElement.IsCoincident(Point3d, Double).)
Read |  (Overrides GH_FieldElement.Read(GH_IReader).)
Write |  (Overrides GH_FieldElement.Write(GH_IWriter).)
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace