Grasshopper SDK
GH_ParserOperator.m_name Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string m_name
Public m_name As String
Field Value
Type: String
See Also
Reference
GH_ParserOperator Class
Grasshopper.Kernel.Expressions Namespace