Grasshopper SDK
GH_Author.IsEmpty Property
 Gets whether any of the fields have been assigned.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool IsEmpty { get; }
Public ReadOnly Property IsEmpty As Boolean
	Get
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Author.IsEmpty"]
Implements
IGH_Author.IsEmpty
See Also
Reference
GH_Author Class
Grasshopper.Kernel Namespace