Grasshopper SDK
GH_ComponentServer.EmitGraph Method
 Create a new instance of the IGH_Graph that matches the id. If no proxy can be matched to the id, a null reference will be returned.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_Graph EmitGraph(
	Guid id
)
Public Function EmitGraph (
	id As Guid
) As IGH_Graph
Parameters
id
Type: System.Guid
The graph type id to instantiate
Return Value
Type: IGH_Graph
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace