Grasshopper SDK
GH_UserObject.CreateDefaultPath Method
 Set the Path field for this user object to the default. The default file name is derived from the Description.Name field. This method also ensures the UserObject directory exists.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void CreateDefaultPath(
	bool avoid_conflict
)
Public Sub CreateDefaultPath (
	avoid_conflict As Boolean
)
Parameters
avoid_conflict
Type: System.Boolean
If true, a unique file path is assigned.
See Also
Reference
GH_UserObject Class
Grasshopper.Kernel Namespace