Grasshopper SDK
GH_QuickImageEditor.FrameCrop Property
 Gets or sets the cropping rectangle.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle FrameCrop { get; set; }
Public Property FrameCrop As Rectangle
	Get
	Set
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.GH_QuickImageEditor.FrameCrop"]
See Also
Reference
GH_QuickImageEditor Class
Grasshopper.GUI Namespace