Grasshopper SDK
GH_Variant Constructor (Boolean)
 Create a new Bool variant.
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Variant(
	bool value
)
Public Sub New (
	value As Boolean
)
Parameters
value
Type: System.Boolean
Value of Variant.
See Also
Reference
GH_Variant Class
GH_Variant Overload
Grasshopper.Kernel.Expressions Namespace