Grasshopper SDK
GH_ColourPickerBase.DrawBackground Property
 Gets or sets whether the background of the picker is drawn.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DrawBackground { get; set; }
Public Property DrawBackground As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.DrawBackground"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace