Grasshopper SDK
GH_Canvas.Document_ObjectsDeletedEventHandler Delegate
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public delegate void Document_ObjectsDeletedEventHandler(
	GH_Document sender,
	GH_DocObjectEventArgs e
)
Public Delegate Sub Document_ObjectsDeletedEventHandler (
	sender As GH_Document,
	e As GH_DocObjectEventArgs
)
Parameters
sender
Type: Grasshopper.Kernel.GH_Document
e
Type: Grasshopper.Kernel.GH_DocObjectEventArgs
See Also
Reference
Grasshopper.GUI.Canvas Namespace