Grasshopper SDK
GH_Animator.IntegerAnimator Method (Int32, Int32, Int32)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<int> IntegerAnimator(
	int A,
	int B,
	int duration
)
Public Shared Function IntegerAnimator (
	A As Integer,
	B As Integer,
	duration As Integer
) As GH_Animator(Of Integer)
Parameters
A
Type: System.Int32
B
Type: System.Int32
duration
Type: System.Int32
Return Value
Type: GH_Animator<Int32>
See Also
Reference
GH_Animator Class
IntegerAnimator Overload
Grasshopper.GUI Namespace