Grasshopper SDK
GH_ValueProxy<T> Class
 Represents the abstract base implementation of the IGH_ValueProxy interface.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_ValueProxy<T>
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract class GH_ValueProxy<T> : IGH_ValueProxy
Public MustInherit Class GH_ValueProxy(Of T)
	Implements IGH_ValueProxy
Type Parameters
T
The type of this implementation
The GH_ValueProxy<T> type exposes the following members.
Constructors
Name | Description
GH_ValueProxy<T>
 Default constructor for the base class. All derived classes must call this constructor.
Top
Properties
Name | Description
IsParsable
IsValid
ProxyName
ProxyType
ProxyValue
UserString
 Wraps the protected m_UserString field
Value
Top
Methods
Name | Description
Duplicate
Duplicate_T
FromString
 Performs the String->Value parsing. The default implementation always returns False.
MutateString
ToString
 Performs a default ToString operation on the local value. If the value is Nothing, an empty String is returned.
 (Overrides Object.ToString().)
Top
Fields
Name | Description
m_IsStringProxy
m_Name
m_UserString
m_Valid
m_Value
Top
See Also
Reference
Grasshopper.Kernel Namespace