Grasshopper SDK
GH_Document.ClusterInstanceCount Method
 Counts the number of instances of a specific cluster document ID.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public int ClusterInstanceCount(
	Guid id
)
Public Function ClusterInstanceCount (
	id As Guid
) As Integer
Parameters
id
Type: System.Guid
The cluster document id to search for.
Return Value
Type: Int32
The number of instances of a specific cluster.
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace