Grasshopper SDK
GH_PersistentParam<T>.Script_AddPersistentData Method
 Method used primarily for COM_Access code.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Script_AddPersistentData(
	List<Object> data
)
Public Sub Script_AddPersistentData (
	data As List(Of Object)
)
Parameters
data
Type: System.Collections.Generic.List<Object>
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace