Grasshopper SDK
GH_RuntimeMessage.Type Property
 Gets the type qualifier of the message.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_RuntimeMessageLevel Type { get; }
Public ReadOnly Property Type As GH_RuntimeMessageLevel
	Get
Property Value
Type: GH_RuntimeMessageLevel
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_RuntimeMessage.Type"]
See Also
Reference
GH_RuntimeMessage Class
Grasshopper.Kernel Namespace