Grasshopper SDK
Complex.SquareRoot Method
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Complex SquareRoot()
Public Function SquareRoot As Complex
Return Value
Type: Complex
See Also
Reference
Complex Structure
Grasshopper.Kernel.Types Namespace