Grasshopper SDK
GH_CodeStringSegment.m_String Field
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected string m_String
Protected m_String As String
Field Value
Type: String
See Also
Reference
GH_CodeStringSegment Class
Grasshopper.Kernel.Expressions Namespace