Grasshopper SDK
GH_ObjectChangedEventArgs.Type Property
 Gets the type of this event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ObjectEventType Type { get; }
Public ReadOnly Property Type As GH_ObjectEventType
	Get
Property Value
Type: GH_ObjectEventType
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ObjectChangedEventArgs.Type"]
See Also
Reference
GH_ObjectChangedEventArgs Class
Grasshopper.Kernel Namespace