Grasshopper SDK
GH_DocumentObject.DestroyIconCache Method
 Call this method to erase the existing icon cache. You must call this if you want to change the display icon of an object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected void DestroyIconCache()
Protected Sub DestroyIconCache
See Also
Reference
GH_DocumentObject Class
Grasshopper.Kernel Namespace