Grasshopper SDK
IGH_UndoAction.State Property
 Gets the current state of the undo action.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
GH_UndoState State { get; }
ReadOnly Property State As GH_UndoState
	Get
Property Value
Type: GH_UndoState
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.IGH_UndoAction.State"]
See Also
Reference
IGH_UndoAction Interface
Grasshopper.Kernel.Undo Namespace