Grasshopper SDK
GH_ComponentServer.LoadExternalFiles Method
 Attempt to parse all external files. This includes GHA libraries, GHUSER objects and GHCLUSTER files.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool LoadExternalFiles()
Public Function LoadExternalFiles As Boolean
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace