Grasshopper SDK
IGH_DocumentObject.AddedToDocument Method
 This method will be called when an object is added to a document.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
void AddedToDocument(
	GH_Document document
)
Sub AddedToDocument (
	document As GH_Document
)
Parameters
document
Type: Grasshopper.Kernel.GH_Document
Document that now owns this object.
See Also
Reference
IGH_DocumentObject Interface
Grasshopper.Kernel Namespace