Grasshopper SDK
GH_Canvas.Document_ObjectsAdded Event
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.Document_ObjectsAddedEventHandler Document_ObjectsAdded
Public Event Document_ObjectsAdded As GH_Canvas.Document_ObjectsAddedEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.Document_ObjectsAddedEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace