Grasshopper SDK
GH_DigitScrollerBase.Invalidated Event
 Raised whenever the display of this scroller is changed, but not the value.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_DigitScrollerBase.InvalidatedEventHandler Invalidated
Public Event Invalidated As GH_DigitScrollerBase.InvalidatedEventHandler
Value
Type: Grasshopper.GUI.Base.GH_DigitScrollerBase.InvalidatedEventHandler
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace