Grasshopper SDK
GH_SolutionExpiredEventArgs Class
 Arguments for solution events.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Grasshopper.Kernel.GH_SolutionExpiredEventArgs
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_SolutionExpiredEventArgs : EventArgs
Public Class GH_SolutionExpiredEventArgs
	Inherits EventArgs
The GH_SolutionExpiredEventArgs type exposes the following members.
Constructors
Name | Description
GH_SolutionExpiredEventArgs
Initializes a new instance of the GH_SolutionExpiredEventArgs class
Top
Properties
Name | Description
Recompute
Top
See Also
Reference
Grasshopper.Kernel Namespace