Grasshopper SDK
GH_Field Class
 Represents a field of forces.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Types.GH_Field
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_Field : IGH_Goo, IGH_PreviewData
Public Class GH_Field
	Implements IGH_Goo, IGH_PreviewData
The GH_Field type exposes the following members.
Constructors
Name | Description
GH_Field()
 Blank constructor.
GH_Field(GH_Field)
 Copy constructor.
Top
Properties
Name | Description
ClippingBox
Elements
 Gets the list of elements of this field.
IsValid
IsValidWhyNot
TypeDescription
TypeName
Top
Methods
Name | Description
CastFrom
CastTo<T>
CurvatureAt
DrawViewportMeshes
DrawViewportWires
Duplicate
EmitProxy
Read
ScriptVariable
SolveStep
 Move a point through the field.
SolveSteps
 Move a point through a succession of steps.
TensorAt
 Compute the field tensor at the given location as contributed by all the field elements.
ToString
Write
Top
See Also
Reference
Grasshopper.Kernel.Types Namespace