Grasshopper SDK
GH_Animator.DoubleAnimator Method (Double, Double)
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Animator<double> DoubleAnimator(
	double A,
	double B
)
Public Shared Function DoubleAnimator (
	A As Double,
	B As Double
) As GH_Animator(Of Double)
Parameters
A
Type: System.Double
B
Type: System.Double
Return Value
Type: GH_Animator<Double>
See Also
Reference
GH_Animator Class
DoubleAnimator Overload
Grasshopper.GUI Namespace