Grasshopper SDK
GH_StateTag.StateDescription Property
 Gets or sets the state description for this tag.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string StateDescription { get; set; }
Public Property StateDescription As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_StateTag.StateDescription"]
Implements
IGH_StateTag.StateDescription
See Also
Reference
GH_StateTag Class
Grasshopper.Kernel Namespace