Grasshopper SDK
GH_LonLatCoordinate.Longitude Property
 Gets or sets the longitude (in degrees) of the location.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public double Longitude { get; set; }
Public Property Longitude As Double
	Get
	Set
Property Value
Type: Double
[Missing <value> documentation for "P:Grasshopper.Kernel.Types.GH_LonLatCoordinate.Longitude"]
See Also
Reference
GH_LonLatCoordinate Class
Grasshopper.Kernel.Types Namespace