Grasshopper SDK
IGH_Param.VolatileData Property
 Gets the instance of the volatile data tree stored in this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_Structure VolatileData { get; }
ReadOnly Property VolatileData As IGH_Structure
	Get
Property Value
Type: IGH_Structure
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Param.VolatileData"]
See Also
Reference
IGH_Param Interface
Grasshopper.Kernel Namespace