Grasshopper SDK
GH_PanelEditorControl.PanelProperties Property
 Gets or sets the panel properties on display.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PanelProperties PanelProperties { get; set; }
Public Property PanelProperties As GH_PanelProperties
	Get
	Set
Property Value
Type: GH_PanelProperties
[Missing <value> documentation for "P:Grasshopper.GUI.GH_PanelEditorControl.PanelProperties"]
See Also
Reference
GH_PanelEditorControl Class
Grasshopper.GUI Namespace