Grasshopper SDK
GH_RuleRange Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_RuleRange
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_RuleRange : IGH_Rule
Public Class GH_RuleRange
	Implements IGH_Rule
The GH_RuleRange type exposes the following members.
Constructors
Name | Description
GH_RuleRange
Initializes a new instance of the GH_RuleRange class
Top
Properties
Name | Description
Kind
Notation
Top
Methods
Name | Description
Apply
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace