Grasshopper SDK
GH_ComponentServer.Upgraders Property
 Gets a list of all the upgraders that have been cached.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList<IGH_UpgradeObject> Upgraders { get; }
Public ReadOnly Property Upgraders As IList(Of IGH_UpgradeObject)
	Get
Property Value
Type: IList<IGH_UpgradeObject>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ComponentServer.Upgraders"]
See Also
Reference
GH_ComponentServer Class
Grasshopper.Kernel Namespace