Grasshopper SDK
GH_ValueProxy<T>.ProxyName Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string ProxyName { get; }
Public ReadOnly Property ProxyName As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ValueProxy`1.ProxyName"]
Implements
IGH_ValueProxy.ProxyName
See Also
Reference
GH_ValueProxy<T> Class
Grasshopper.Kernel Namespace