Grasshopper SDK
GH_PreviewArgs.Viewport Property
 Gets the Viewport in which the current preview is drawn.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PreviewArgs.Viewport"]
Implements
IGH_PreviewArgs.Viewport
See Also
Reference
GH_PreviewArgs Class
Grasshopper.Kernel Namespace