Grasshopper SDK
CentralSettings.PreviewPlaneRadiusChanged Event
 Raised whenever the PreviewPlaneRadius setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.PreviewPlaneRadiusChangedEventHandler PreviewPlaneRadiusChanged
Public Shared Event PreviewPlaneRadiusChanged As CentralSettings.PreviewPlaneRadiusChangedEventHandler
Value
Type: Grasshopper.CentralSettings.PreviewPlaneRadiusChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace