Grasshopper SDK
GH_Structure<T>.Insert Method
 Insert a data item into the specified branch in the structure. If the branch doesn't exist yet, it will be created.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void Insert(
	T data,
	GH_Path path,
	int index
)
Public Sub Insert (
	data As T,
	path As GH_Path,
	index As Integer
)
Parameters
data
Type: T
Data to insert.
path
Type: Grasshopper.Kernel.Data.GH_Path
Path of branch to insert into.
index
Type: System.Int32
Insertion index.
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace