Grasshopper SDK
IGH_Attributes.OutputGrip Property
 Gets the output grip location for these attributes. If HasOutputGrip equals False, this point is meaningless.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
PointF OutputGrip { get; }
ReadOnly Property OutputGrip As PointF
	Get
Property Value
Type: PointF
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_Attributes.OutputGrip"]
See Also
Reference
IGH_Attributes Interface
Grasshopper.Kernel Namespace