Grasshopper SDK
GH_Alias.Target Property
 Gets or sets the alias target.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid Target { get; set; }
Public Property Target As Guid
	Get
	Set
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Alias.Target"]
See Also
Reference
GH_Alias Class
Grasshopper.Kernel Namespace