Grasshopper SDK
GH_ComponentServer.RemoveCachedObject Method (Guid)
 Remove a cache entry from the object cache. This cannot be undone.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool RemoveCachedObject(
	Guid id
)
Public Function RemoveCachedObject (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
The id to remove.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_ComponentServer Class
RemoveCachedObject Overload
Grasshopper.Kernel Namespace