Grasshopper SDK
GH_DigitScroller.Suffix Property
 Gets or sets the prefix text
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public string Suffix { get; set; }
Public Property Suffix As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_DigitScroller.Suffix"]
See Also
Reference
GH_DigitScroller Class
Grasshopper.GUI Namespace