Grasshopper SDK
IGH_InstanceDescription.Description Property
 Gets or sets the description of the object. This field typically remains fixed during the lifetime of an object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
string Description { get; set; }
Property Description As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.IGH_InstanceDescription.Description"]
See Also
Reference
IGH_InstanceDescription Interface
Grasshopper.Kernel Namespace