Grasshopper SDK
GH_Canvas.DisplayVoronoiWarning Property
 Gets or sets whether the Voronoi Over-dose warning message is displayed. This property is set once at Grasshopper startup to True.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool DisplayVoronoiWarning { get; set; }
Public Shared Property DisplayVoronoiWarning As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Canvas.GH_Canvas.DisplayVoronoiWarning"]
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace