Grasshopper SDK
GH_PointRefData.EvCurve Method
 Evaluate this reference structure when applied to a curve
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point3d EvCurve(
	Curve c
)
Public Function EvCurve (
	c As Curve
) As Point3d
Parameters
c
Type: Curve
The curve to act on
Return Value
Type: Point3d
The point on the curve if successful, or Nothing
Remarks
Evaluation depends on the value of m_RefType
See Also
Reference
GH_PointRefData Class
Grasshopper.Kernel.Types Namespace