Grasshopper SDK
GH_Convert.ToDouble_Secondary Method
 Performs indirect casts from other data types into Doubles.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool ToDouble_Secondary(
	Object data,
	ref double destination
)
Public Shared Function ToDouble_Secondary (
	data As Object,
	ByRef destination As Double
) As Boolean
Parameters
data
Type: System.Object
Data to convert.
destination
Type: System.Double
Target for value assignment.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_Convert Class
Grasshopper.Kernel Namespace