Grasshopper SDK
GH_SliderBase.RailDisplay Property
 Gets or sets how the slider rail (or track) is drawn.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_SliderRailDisplay RailDisplay { get; set; }
Public Property RailDisplay As GH_SliderRailDisplay
	Get
	Set
Property Value
Type: GH_SliderRailDisplay
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_SliderBase.RailDisplay"]
See Also
Reference
GH_SliderBase Class
Grasshopper.GUI.Base Namespace