Grasshopper SDK
IGH_ObjectProxy.CreateInstance Method
 Create a new instance from the target object.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
IGH_DocumentObject CreateInstance()
Function CreateInstance As IGH_DocumentObject
Return Value
Type: IGH_DocumentObject
An IGH_DocumentObject instance on success or null on failure.
See Also
Reference
IGH_ObjectProxy Interface
Grasshopper.Kernel Namespace