Grasshopper SDK
GH_ColourCube.S3 Property
 Gets the fourth point in the shadow point list. This point is coincident with C7.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point S3 { get; }
Public ReadOnly Property S3 As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourCube.S3"]
See Also
Reference
GH_ColourCube Class
Grasshopper.GUI.Base Namespace