Grasshopper SDK
Orientation.ToMatrix Method
Namespace: Grasshopper.Kernel.Types.Transforms
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Transform ToMatrix()
Public Function ToMatrix As Transform
Return Value
Type: Transform
Implements
ITransform.ToMatrix()
See Also
Reference
Orientation Class
Grasshopper.Kernel.Types.Transforms Namespace