Grasshopper SDK
GH_PointRefData Constructor
Initializes a new instance of the GH_PointRefData class
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_PointRefData()
Public Sub New
See Also
Reference
GH_PointRefData Class
GH_PointRefData Overload
Grasshopper.Kernel.Types Namespace