Grasshopper SDK
GH_SelectionState Enumeration
 Enumerates the possible effects of a specific selection operation.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_SelectionState
Public Enumeration GH_SelectionState
Members
Member name | Value | Description
Changed | 0
Unchanged | 1
See Also
Reference
Grasshopper.Kernel Namespace