Grasshopper SDK
GH_DigitScrollerBase.DrawBackground Property
 Gets or sets whether the background is drawn in this control.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool DrawBackground { get; set; }
Public Property DrawBackground As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_DigitScrollerBase.DrawBackground"]
See Also
Reference
GH_DigitScrollerBase Class
Grasshopper.GUI.Base Namespace