Grasshopper SDK
GH_Component.ExpireDownStreamObjects Method
 Expire all objects that depend on any of the output parameters.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected override void ExpireDownStreamObjects()
Protected Overrides Sub ExpireDownStreamObjects
See Also
Reference
GH_Component Class
Grasshopper.Kernel Namespace