Grasshopper SDK
GH_GHALoadingEventArgs.Id Property
 Gets the Id of the GHA file.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_GHALoadingEventArgs.Id"]
See Also
Reference
GH_GHALoadingEventArgs Class
Grasshopper.Kernel Namespace