Grasshopper SDK
GH_CanvasMouseEvent.ControlLocation Property
 Gets the location of the cursor in control pixel coordinates.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Point ControlLocation { get; }
Public ReadOnly Property ControlLocation As Point
	Get
Property Value
Type: Point
[Missing <value> documentation for "P:Grasshopper.GUI.GH_CanvasMouseEvent.ControlLocation"]
See Also
Reference
GH_CanvasMouseEvent Class
Grasshopper.GUI Namespace