Grasshopper SDK
GH_Document.SolutionHistory Property
 Gets a list of the last 1000 solution timespans, from oldest to youngest.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<GH_SolutionSpan> SolutionHistory { get; }
Public ReadOnly Property SolutionHistory As List(Of GH_SolutionSpan)
	Get
Property Value
Type: List<GH_SolutionSpan>
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_Document.SolutionHistory"]
See Also
Reference
GH_Document Class
Grasshopper.Kernel Namespace