Grasshopper SDK
GH_RuleComplex Class
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.Data.GH_RuleComplex
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_RuleComplex : IGH_Rule
Public Class GH_RuleComplex
	Implements IGH_Rule
The GH_RuleComplex type exposes the following members.
Constructors
Name | Description
GH_RuleComplex
Initializes a new instance of the GH_RuleComplex class
Top
Properties
Name | Description
Kind
Notation
Top
Methods
Name | Description
Apply
Top
See Also
Reference
Grasshopper.Kernel.Data Namespace