Grasshopper SDK
GH_GraphicsUtil.SolveArc Method (PointF, PointF, SizeF, RectangleF, Single, Single)
 Create a GDI circular arc definition from start-point, end-point and tangent direction.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool SolveArc(
	PointF p0,
	PointF p1,
	SizeF dir,
	ref RectangleF box,
	ref float angle,
	ref float sweep
)
Public Shared Function SolveArc (
	p0 As PointF,
	p1 As PointF,
	dir As SizeF,
	ByRef box As RectangleF,
	ByRef angle As Single,
	ByRef sweep As Single
) As Boolean
Parameters
p0
Type: System.Drawing.PointF
Start point of arc.
p1
Type: System.Drawing.PointF
End point of arc.
dir
Type: System.Drawing.SizeF
Tangent direction at start of arc.
box
Type: System.Drawing.RectangleF
Bounding box of arc (out)
angle
Type: System.Single
Start angle of arc (out)
sweep
Type: System.Single
Sweep angle of arc (out)
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
GH_GraphicsUtil Class
SolveArc Overload
Grasshopper.GUI Namespace