Grasshopper SDK
CentralSettings.PreviewBumpZBuffer Property
 Gets or sets whether the Document preview bumps the Z-Buffer. Setting this value automatically causes a redraw of the Rhino viewports.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static bool PreviewBumpZBuffer { get; set; }
Public Shared Property PreviewBumpZBuffer As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.CentralSettings.PreviewBumpZBuffer"]
See Also
Reference
CentralSettings Class
Grasshopper Namespace