Grasshopper SDK
GH_ConnectivityDisparity Constructor
 Create a new instance of the Connectivity Disparity utility class.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_ConnectivityDisparity(
	GH_ConnectivityDiagram topset,
	GH_ConnectivityDiagram subset
)
Public Sub New (
	topset As GH_ConnectivityDiagram,
	subset As GH_ConnectivityDiagram
)
Parameters
topset
Type: Grasshopper.Kernel.GH_ConnectivityDiagram
Overarching connectivity diagram.
subset
Type: Grasshopper.Kernel.GH_ConnectivityDiagram
Partial connectivity diagram.
See Also
Reference
GH_ConnectivityDisparity Class
Grasshopper.Kernel Namespace