Grasshopper SDK
CentralSettings.RibbonDrawTabIconsChanged Event
 Raised whenever the RibbonDrawTabIcons setting changes.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event CentralSettings.RibbonDrawTabIconsChangedEventHandler RibbonDrawTabIconsChanged
Public Shared Event RibbonDrawTabIconsChanged As CentralSettings.RibbonDrawTabIconsChangedEventHandler
Value
Type: Grasshopper.CentralSettings.RibbonDrawTabIconsChangedEventHandler
See Also
Reference
CentralSettings Class
Grasshopper Namespace