Grasshopper SDK
GH_Canvas.CanvasPrePaintObjects Event
 Raised before object drawing starts.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public event GH_Canvas.CanvasPrePaintObjectsEventHandler CanvasPrePaintObjects
Public Event CanvasPrePaintObjects As GH_Canvas.CanvasPrePaintObjectsEventHandler
Value
Type: Grasshopper.GUI.Canvas.GH_Canvas.CanvasPrePaintObjectsEventHandler
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace