Grasshopper SDK
GH_ComponentServer Class
 Maintains proxies for all components, parameters and other object types as defined in all grasshopper assemblies.
Inheritance Hierarchy
System.Object
 Grasshopper.Kernel.GH_ComponentServer
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public sealed class GH_ComponentServer
Public NotInheritable Class GH_ComponentServer
The GH_ComponentServer type exposes the following members.
Constructors
Name | Description
GH_ComponentServer
Initializes a new instance of the GH_ComponentServer class
Top
Properties
Name | Description
Aliases
 Gets a list of all the defined aliases.
AllAddOns |  Obsolete.
 Gets a list of all the gha and ghuser files that will be loaded as Grasshopper add-ons.
CompleteRibbonLayout
 Gets the default component layout featuring all non-hidden components and parameters.
DiscardedProxies
 Returns the total number of IGH_DocumentObjects that were discarded during assembly parsing. This includes both skipped and replaced proxies.
GraphProxies
 Returns a list of all cached GH_GraphProxy instances.
Libraries
 Returns a list of Assembly Info objects describing all loaded assemblies.
LoadingExceptions
 Gets a list of all the exceptions that were recorded during the most recent loading sequence.
ObjectProxies
 Returns a list of all cached GH_ObjectProxy instances.
ObjectProxyNames
 Returns a specialized string collection of all component names.
TypeHints
 Gets a list of all IGH_TypeHint types in all loaded assemblies.
Upgraders
 Gets a list of all the upgraders that have been cached.
Top
Methods
Name | Description
AddAlias
 Add an alias to a target.
AddCategoryIcon
 Add an icon for a tab category. 16x16 images are required.
AddCategoryShortName
 Add an abbreviation for a tab category. 2~4 letter abbreviations are best.
AddCategorySymbolName
 Add a single char category description.
AliasTargets
 Get all the target Component IDs for a given alias.
Clear
 Clear all caches.
ClearStaleUserObjects
 Remove all user objects that no longer point to existing files.
CompareProxies
 Compare two object proxies. Names and exposures are taken into account.
CopyFileToAppropriateFolder
 Copy a GHA or GHUSER file into the appropriate Roaming Application Data folder. Of the file is already in the top-level roaming folder it will not be copied.
DestroyLoadingUI
 Destroy the loading UI (the banner and the progress bar).
EmitGraph
 Create a new instance of the IGH_Graph that matches the id. If no proxy can be matched to the id, a null reference will be returned.
EmitObject
 Create a new instance of the IGH_DocumentObject that matches the id. If no proxy can be matched to the id, a null reference will be returned.
EmitObjectIcon
 Get the icon that is associated with the given Object ID.
EmitObjectProxy
 Get the proxy that is associated with the given Object ID.
ExternalFiles
 Get lists of all the external files (GHA, GHUSER and GHCLUSTER) that will be loaded by Grasshopper. Note: this does not equal the files that may already have been loaded, just the files that we'll attempt to load if we were asked to load all plugins now. The list contains no duplicate file paths, but it may contain identical files which won't be filtered until actual loading.
FindAssembly
 Gets the assembly that corresponds to the given library ID.
FindAssemblyByObject(Guid)
 Gets the assembly that corresponds to the given library ID.
FindAssemblyByObject(IGH_DocumentObject)
 Gets the assembly that corresponds to the given library ID.
FindObjectByName
 Find an object by name. Obsolete and hidden objects are ignored. Only exact matches are included.
FindObjects(Guid)
 Find all the objects that are part of a certain library.
FindObjects(String[], Int32)
 Searches the list of cached object proxies for objects that might be implied by a search term.
FindUpgrader
 Find the upgrader that can convert from the given target.
GetAlias
 Gets the alias display string for a given object.
GetCategoryIcon
 Get the icon for a specific category. If the icon hasn't been defined, this method will return the default icon.
GetCategoryShortName
 Get the abbreviation (short name) for a specific category. If the short name hasn't been defined, this method will return the full name instead.
GetCategorySymbolName
 Get the single char representation for a specific category. If the char hasn't been defined, this method will return the first char of the full name instead.
IsGraphCached
 Tests the graph cache for an existing graph type ID.
IsObjectCached
 Tests the caches for an existing object type ID.
IsUpgrader
 Checks to see if at least one upgrader is defined for a collection of objects.
LoadAliases
 Load the Alias table from the settings directory. Only use this function if you suspect the alias table settings file has changed due to some external process.
LoadExternalFiles
 Attempt to parse all external files. This includes GHA libraries, GHUSER objects and GHCLUSTER files.
NewUserObject
 Create a new UserObject and write it to the Grasshopper User Object folder.
RemoveCachedGraph
 Remove a cache entry from the graph cache. This cannot be undone.
RemoveCachedObject(Guid)
 Remove a cache entry from the object cache. This cannot be undone.
RemoveCachedObject(String)
 Remove the user object (if any) that loads itself from a specified *.ghuser file.
SaveAliases
 Save the alias table to the settings directory. Use this function if you change the alias table while ignoring usual channels.
SetAlias
 Sets the aliases for a given target.
UpdateRibbonUI
 Forces an update of the Ribbon control on the Grasshopper main form.
Top
Events
Name | Description
GHAFileLoaded
 Raised whenever a GHA file has been successfully loaded.
Top
See Also
Reference
Grasshopper.Kernel Namespace