Grasshopper SDK
GH_StateTag.DrawCallback Delegate
 Drawing delegate.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected delegate void DrawCallback(
	Graphics graphics,
	double alpha
)
Protected Delegate Sub DrawCallback (
	graphics As Graphics,
	alpha As Double
)
Parameters
graphics
Type: System.Drawing.Graphics
Graphics object to draw with.
alpha
Type: System.Double
Floating point alpha blend (0~255).
See Also
Reference
Grasshopper.Kernel Namespace