Grasshopper SDK
GH_UndoServer Constructor
Initializes a new instance of the GH_UndoServer class
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_UndoServer(
	GH_Document nOwner
)
Public Sub New (
	nOwner As GH_Document
)
Parameters
nOwner
Type: Grasshopper.Kernel.GH_Document
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace