Grasshopper SDK
GH_Path.CullElement Method
 Removes the last index value from the path. If the path is already empty, nothing will happen.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Path CullElement()
Public Function CullElement As GH_Path
Return Value
Type: GH_Path
See Also
Reference
GH_Path Class
Grasshopper.Kernel.Data Namespace