Grasshopper SDK
GH_TooltipDisplayEventArgs.Region Property
 Gets or sets the active region (in control coordinates) for this tooltip. Once a tooltip is shown inside the region, the tooltip will 'stick' to the mouse for as long as the mouse remains within this region. By default the region is set to Rectangle.Empty, which indicates that region tracking is not used for this tooltip.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle Region { get; set; }
Public Property Region As Rectangle
	Get
	Set
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.GH_TooltipDisplayEventArgs.Region"]
See Also
Reference
GH_TooltipDisplayEventArgs Class
Grasshopper.GUI Namespace