Grasshopper SDK
GH_StateTag.Description Property
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public abstract string Description { get; }
Public MustOverride ReadOnly Property Description As String
	Get
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_StateTag.Description"]
Implements
IGH_StateTag.Description
See Also
Reference
GH_StateTag Class
Grasshopper.Kernel Namespace