Grasshopper SDK
GH_BackgroundSettings Class
Inheritance Hierarchy
System.Object
 Grasshopper.GUI.Theme.GH_BackgroundSettings
Namespace: Grasshopper.GUI.Theme
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public class GH_BackgroundSettings
Public Class GH_BackgroundSettings
The GH_BackgroundSettings type exposes the following members.
Properties
Name | Description
Colour1
 First background colour. Depending on the background style, this colour is used in different ways.
Colour2
 Second background colour. Depending on the background style, this colour is used in different ways.
Hatch
 Background hatch brush style. This property is only used if BackgroundStyle is set to GH_ThemeBackgroundStyle.Hatch.
Style
 Canvas monochromatic flag. If True, the canvas background is a solid colour.
Top
See Also
Reference
Grasshopper.GUI.Theme Namespace