Grasshopper SDK
GH_Structure<T>.AllData Method
 Gets an enumerator for all the data items in this structure.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IGH_StructureEnumerator AllData(
	bool skipNulls
)
Public Function AllData (
	skipNulls As Boolean
) As IGH_StructureEnumerator
Parameters
skipNulls
Type: System.Boolean
If True, null items will be skipped.
Return Value
Type: IGH_StructureEnumerator
Implements
IGH_Structure.AllData(Boolean)
See Also
Reference
GH_Structure<T> Class
Grasshopper.Kernel.Data Namespace