Grasshopper SDK
GH_Canvas.AddValidator Method
 Add a new drop validator to the canvas.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddValidator(
	IGH_CanvasValidator validator
)
Public Sub AddValidator (
	validator As IGH_CanvasValidator
)
Parameters
validator
Type: Grasshopper.GUI.Canvas.IGH_CanvasValidator
Validator to add.
See Also
Reference
GH_Canvas Class
Grasshopper.GUI.Canvas Namespace