Grasshopper SDK
Node3d<T>.ContentBoundingBox Property
 Returns the boundingbox of all items in this node. If this node does not contain any items, BoundingBox.Empty is returned.
Namespace: Grasshopper.Kernel.Geometry.SpatialTrees
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public BoundingBox ContentBoundingBox { get; }
Public ReadOnly Property ContentBoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
[Missing <value> documentation for "P:Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ContentBoundingBox"]
See Also
Reference
Node3d<T> Class
Grasshopper.Kernel.Geometry.SpatialTrees Namespace