Grasshopper SDK
GH_LineParserAction Enumeration
 Enumerates the possible actions a line parser can invoke.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public enum GH_LineParserAction
Public Enumeration GH_LineParserAction
Members
Member name | Value | Description
Include | 0 |  Include the return code of the parser function.
Ignore | 1 |  Ignore this line of text and move on to the next line.
Abort | 2 |  Ignore this line of text and don't parse all subsequent lines.
See Also
Reference
Grasshopper.Kernel Namespace