Grasshopper SDK
GH_UndoServer.UndoGuids Property
 Gets a sorted list of all the undo Guids in this server.
Namespace: Grasshopper.Kernel.Undo
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public List<Guid> UndoGuids { get; }
Public ReadOnly Property UndoGuids As List(Of Guid)
	Get
Property Value
Type: List<Guid>
[Missing <value> documentation for "P:Grasshopper.Kernel.Undo.GH_UndoServer.UndoGuids"]
See Also
Reference
GH_UndoServer Class
Grasshopper.Kernel.Undo Namespace