Grasshopper SDK
GH_Structure<T>.Branch Property (GH_Path)
 Gets a limited access pointer to the data list associated with a certain path.
Namespace: Grasshopper.Kernel.Data
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public IList this[
	GH_Path path
] { get; }
Public ReadOnly Property Branch (
	path As GH_Path
) As IList
	Get
Parameters
path
Type: Grasshopper.Kernel.Data.GH_Path
Data path to retrieve.
Property Value
Type: IList
[Missing <value> documentation for "P:Grasshopper.Kernel.Data.GH_Structure`1.Branch(Grasshopper.Kernel.Data.GH_Path)"]
Implements
IGH_Structure.Branch[GH_Path]
See Also
Reference
GH_Structure<T> Class
Branch Overload
Grasshopper.Kernel.Data Namespace