Grasshopper SDK
GH_AutoSaveSettings.SaveOnDataFlatteningChanged Event
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static event GH_AutoSaveSettings.SaveOnDataFlatteningChangedEventHandler SaveOnDataFlatteningChanged
Public Shared Event SaveOnDataFlatteningChanged As GH_AutoSaveSettings.SaveOnDataFlatteningChangedEventHandler
Value
Type: Grasshopper.Kernel.GH_AutoSaveSettings.SaveOnDataFlatteningChangedEventHandler
See Also
Reference
GH_AutoSaveSettings Class
Grasshopper.Kernel Namespace