Grasshopper SDK
GH_PersistentParam<T>.DataType Property
 Gets the type of data stored in this parameter.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override sealed GH_ParamData DataType { get; }
Public Overrides NotOverridable ReadOnly Property DataType As GH_ParamData
	Get
Property Value
Type: GH_ParamData
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_PersistentParam`1.DataType"]
See Also
Reference
GH_PersistentParam<T> Class
Grasshopper.Kernel Namespace