Grasshopper SDK
GH_FloatingParamAttributes.SetupTooltip Method
Namespace: Grasshopper.Kernel.Attributes
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public override void SetupTooltip(
	PointF point,
	GH_TooltipDisplayEventArgs e
)
Public Overrides Sub SetupTooltip (
	point As PointF,
	e As GH_TooltipDisplayEventArgs
)
Parameters
point
Type: System.Drawing.PointF
e
Type: Grasshopper.GUI.GH_TooltipDisplayEventArgs
See Also
Reference
GH_FloatingParamAttributes Class
Grasshopper.Kernel.Attributes Namespace