Grasshopper SDK
GH_FileWatcher.Active Property
 Gets or sets the active flag on this watcher.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public bool Active { get; set; }
Public Property Active As Boolean
	Get
	Set
Property Value
Type: Boolean
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_FileWatcher.Active"]
See Also
Reference
GH_FileWatcher Class
Grasshopper.Kernel Namespace