Grasshopper SDK
GH_ScriptVariant.ThrowOperatorException Method (String, GH_ScriptVariantType)
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
protected static void ThrowOperatorException(
	string op_name,
	GH_ScriptVariantType A
)
Protected Shared Sub ThrowOperatorException (
	op_name As String,
	A As GH_ScriptVariantType
)
Parameters
op_name
Type: System.String
A
Type: Grasshopper.Kernel.Expressions.GH_ScriptVariantType
See Also
Reference
GH_ScriptVariant Class
ThrowOperatorException Overload
Grasshopper.Kernel.Expressions Namespace