Grasshopper SDK
GH_ObjectChangedEventArgs.Tag Property
 Gets the tag for this event.
Namespace: Grasshopper.Kernel
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Object Tag { get; }
Public ReadOnly Property Tag As Object
	Get
Property Value
Type: Object
[Missing <value> documentation for "P:Grasshopper.Kernel.GH_ObjectChangedEventArgs.Tag"]
See Also
Reference
GH_ObjectChangedEventArgs Class
Grasshopper.Kernel Namespace