Grasshopper SDK
GH_ExpressionParser.AddVariableEx Method (String, IGH_Goo)
Namespace: Grasshopper.Kernel.Expressions
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public void AddVariableEx(
	string name,
	IGH_Goo val
)
Public Sub AddVariableEx (
	name As String,
	val As IGH_Goo
)
Parameters
name
Type: System.String
val
Type: Grasshopper.Kernel.Types.IGH_Goo
See Also
Reference
GH_ExpressionParser Class
AddVariableEx Overload
Grasshopper.Kernel.Expressions Namespace