Grasshopper SDK
GH_Link.CreateExternalLink Method (String, String)
Namespace: Grasshopper.Documentation
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_Link CreateExternalLink(
	string text,
	string url
)
Public Shared Function CreateExternalLink (
	text As String,
	url As String
) As GH_Link
Parameters
text
Type: System.String
url
Type: System.String
Return Value
Type: GH_Link
See Also
Reference
GH_Link Class
CreateExternalLink Overload
Grasshopper.Documentation Namespace