Grasshopper SDK
GH_ColourPickerBase.DropperPreviewBox Property
 Gets the rectangle in which the eye-dropped preview will be drawn.
Namespace: Grasshopper.GUI.Base
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public Rectangle DropperPreviewBox { get; }
Public ReadOnly Property DropperPreviewBox As Rectangle
	Get
Property Value
Type: Rectangle
[Missing <value> documentation for "P:Grasshopper.GUI.Base.GH_ColourPickerBase.DropperPreviewBox"]
See Also
Reference
GH_ColourPickerBase Class
Grasshopper.GUI.Base Namespace