Grasshopper SDK
GH_CapsuleRenderEngine.GetImpliedStyle Method (GH_Palette, Boolean, Boolean, Boolean)
 Static (Shared in VB) method for solving which palette style is implied by the properties.
Namespace: Grasshopper.GUI.Canvas
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static GH_PaletteStyle GetImpliedStyle(
	GH_Palette palette,
	bool selected,
	bool locked,
	bool hidden
)
Public Shared Function GetImpliedStyle (
	palette As GH_Palette,
	selected As Boolean,
	locked As Boolean,
	hidden As Boolean
) As GH_PaletteStyle
Parameters
palette
Type: Grasshopper.GUI.Canvas.GH_Palette
Palette hint.
selected
Type: System.Boolean
Specifies whether the selected flavour of a palette needs to be returned.
locked
Type: System.Boolean
If True, the returned palette style is always Locked.
hidden
Type: System.Boolean
If True, the returned palette style is always Hidden.
Return Value
Type: GH_PaletteStyle
See Also
Reference
GH_CapsuleRenderEngine Class
GetImpliedStyle Overload
Grasshopper.GUI.Canvas Namespace