Grasshopper SDK
Instances.RedrawAll Method
 Forces a redraw of both the active canvas and the Rhino viewports.
Namespace: Grasshopper
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public static void RedrawAll()
Public Shared Sub RedrawAll
See Also
Reference
Instances Class
Grasshopper Namespace