Grasshopper SDK
GH_Arc.DuplicateArc Method
 Create a duplicate of this arc.
Namespace: Grasshopper.Kernel.Types
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public GH_Arc DuplicateArc()
Public Function DuplicateArc As GH_Arc
Return Value
Type: GH_Arc
See Also
Reference
GH_Arc Class
Grasshopper.Kernel.Types Namespace