Grasshopper SDK
GH_Animator<T>.CurrentValue Method
 Gets the current animated value.
Namespace: Grasshopper.GUI
Assembly: Grasshopper (in Grasshopper.dll) Version: 6.0.16253.1000 (6.0.16253.01000)
Syntax
public T CurrentValue()
Public Function CurrentValue As T
Return Value
Type: T
See Also
Reference
GH_Animator<T> Class
Grasshopper.GUI Namespace