Grasshopper SDK
GH_DebugLogForm Methods
The GH_DebugLogForm type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
See Also
Reference
GH_DebugLogForm Class
Grasshopper.GUI Namespace