Grasshopper SDK
GH_MenuTextBox.TextChangedEventHandler Delegate
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public delegate void TextChangedEventHandler(
	GH_MenuTextBox sender,
	string text
)
Public Delegate Sub TextChangedEventHandler (
	sender As GH_MenuTextBox,
	text As String
)
Parameters
sender
Type: Grasshopper.GUI.GH_MenuTextBox
text
Type: System.String
See Also
Reference
Grasshopper.GUI Namespace