RhinoCommon SDK
Interpolator Constructor
 Constructs a new, empty Interpolator.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Interpolator()
Public Sub New
See Also
Reference
Interpolator Class
Interpolator Overload
Rhino.Geometry Namespace