RhinoCommon SDK
MeshingParameters Constructor
 Initializes a new instance with default values.
Initial values are same as Default.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MeshingParameters()
Public Sub New
See Also
Reference
MeshingParameters Class
MeshingParameters Overload
Rhino.Geometry Namespace