RhinoCommon SDK
CustomDisplay.Dispose Method
 Dispose this CustomDisplay instance. You must call this function in order to properly shut down the CustomDisplay.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace