RhinoCommon SDK
Layer.Default Method
 Sets layer to default settings.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Default()
Public Sub Default
See Also
Reference
Layer Class
Rhino.DocObjects Namespace