RhinoCommon SDK
Particle.Update Method
 Base class implementation does nothing.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void Update()
Public Overridable Sub Update
See Also
Reference
Particle Class
Rhino.Geometry Namespace