RhinoCommon SDK
Brep Constructor
Initializes a new empty brep
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Brep()
Public Sub New
See Also
Reference
Brep Class
Brep Overload
Rhino.Geometry Namespace