RhinoCommon SDK
RenderContentType.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentType.Finalize"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RenderContentType Class
Rhino.Render Namespace