RhinoCommon SDK
RefinementSettings Constructor
 Creates a default operation settings object.
Namespace: Rhino.Geometry.MeshRefinements
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RefinementSettings()
Public Sub New
See Also
Reference
RefinementSettings Class
Rhino.Geometry.MeshRefinements Namespace