RhinoCommon SDK
FieldDictionary.SetTag Method
 Sets an object that contains data to associate with the field.
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SetTag(
	string key,
	Object tag
)
Public Function SetTag (
	key As String,
	tag As Object
) As Boolean
Parameters
key
Type: System.String
Key name for the field to tag.
tag
Type: System.Object
Data to associate with the field.
Return Value
Type: Boolean
True if the field is found and the tag was set otherwise false is returned.
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace