RhinoCommon SDK
Vector2d.ToString Method
 Constructs a string representation of the current vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A string in the form X,Y.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace