RhinoCommon SDK
StackedDialogPage.OnDefaults Method
Called when stacked dialog Defaults button is pressed (see ShowDefaultsButton).
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void OnDefaults()
Public Overridable Sub OnDefaults
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace