RhinoCommon SDK
StackedDialogPage.RemovePage Method
 Remove this page from the dialog box
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void RemovePage()
Public Sub RemovePage
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace