RhinoCommon SDK
Text3d.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
Text3d Class
Rhino.Display Namespace