RhinoCommon SDK
AngularDimension Methods
The AngularDimension type exposes the following members.
Methods
Name | Description
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
Create(Guid, Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
Create(Guid, Plane, Vector3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetAngleDisplayText
GetDisplayLines
GetTextRectangle
Top
Extension Methods
Name | Description
SetDefaultContext
 injects into AnnotationBase a way to get to dimension styles without having a dependency in RhinoDoc
 (Defined by AnnotationExtensions.)
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace