RhinoCommon SDK
Color4f.B Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.B"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public float B { get; }
Public ReadOnly Property B As Single
	Get
Property Value
Type: Single
See Also
Reference
Color4f Structure
Rhino.Display Namespace