RhinoCommon SDK
RenderContentEventArgs.Reason Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentEventArgs.Reason"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderContentChangeReason Reason { get; }
Public ReadOnly Property Reason As RenderContentChangeReason
	Get
Property Value
Type: RenderContentChangeReason
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace