RhinoCommon SDK
ChangeQueue.ViewId Property
 Return view ID for a RhinoDoc based ChangeQueue
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid ViewId { get; }
Public ReadOnly Property ViewId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace