RhinoCommon SDK
ComponentIndex.Unset Property
 The unset value of component index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static ComponentIndex Unset { get; }
Public Shared ReadOnly Property Unset As ComponentIndex
	Get
Property Value
Type: ComponentIndex
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace