RhinoCommon SDK
Material.MeshIndex Property
 Get mesh index
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int MeshIndex { get; }
Public ReadOnly Property MeshIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Material Class
Rhino.Render.ChangeQueue Namespace