RhinoCommon SDK
Cylinder.Height1 Property
 Gets or sets the start height of the cylinder.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Height1 { get; set; }
Public Property Height1 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace