RhinoCommon SDK
LinetypeTable.Document Property
Document that owns this table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace