RhinoCommon SDK
BrepTrim.TrimType Property
Type of trim
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BrepTrimType TrimType { get; set; }
Public Property TrimType As BrepTrimType
	Get
	Set
Property Value
Type: BrepTrimType
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace