RhinoCommon SDK
Interval.Min Property
 Gets the smaller of T0 and T1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Min { get; }
Public ReadOnly Property Min As Double
	Get
Property Value
Type: Double
See Also
Reference
Interval Structure
Rhino.Geometry Namespace