RhinoCommon SDK
Circle.Plane Property
 Gets or sets the plane of the circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Circle Structure
Rhino.Geometry Namespace