RhinoCommon SDK
SimulatedTexture.Repeat Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.Repeat"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector2d Repeat { get; set; }
Public Property Repeat As Vector2d
	Get
	Set
Property Value
Type: Vector2d
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace