RhinoCommon SDK
NameHash Properties
The NameHash type exposes the following members.
Properties
Name | Description
MappedCodePoints
 Gets the length of ordinal minimum mapped unicode (UTF-32) code points.
ParentId
 Only useful if this participates in a tree structure, as with layers.
Sha1Hash
 Gets the 20-bytes long SHA-1 hash of ordinal minimum mapped unicode (UTF-32) code points.
Top
See Also
Reference
NameHash Class
Rhino.FileIO Namespace