RhinoCommon SDK
IDialogService Interface
[Missing <summary> documentation for "T:Rhino.UI.IDialogService"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IDialogService
Public Interface IDialogService
The IDialogService type exposes the following members.
Methods
Name | Description
ObjectToWindowHandle
ShowCheckListBox
ShowComboListBox
ShowEditBox
ShowListBox
ShowMultiListBox
ShowNumberBox
WrapAsIWin32Window
Top
See Also
Reference
Rhino.UI Namespace