RhinoCommon SDK
Layer Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Layer"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.Layer
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public sealed class Layer : ModelComponent,
	IEquatable<Layer>
<SerializableAttribute>
Public NotInheritable Class Layer
	Inherits ModelComponent
	Implements IEquatable(Of Layer)
The Layer type exposes the following members.
Constructors
Name | Description
Layer
Initializes a new instance of the Layer class
Top
Properties
Name | Description
Color
 Gets or sets the display color for this layer.
ComponentStatus
 Gets or sets the status of the layer.
 (Overrides ModelComponent.ComponentStatus.)
ComponentType
 Returns Layer.
 (Overrides ModelComponent.ComponentType.)
FullPath
 Gets the full path to this layer. The full path includes nesting information.
Id
 Gets or sets the ID of this layer object. You typically do not need to assign a custom ID.
 (Overrides ModelComponent.Id.)
IgesLevel
 Gets or sets the IGES level for this layer.
IsDeleted
 Gets a value indicating whether this layer has been deleted and is currently in the Undo buffer.
IsExpanded
 Gets or sets a value indicating whether this layer is expanded in the Rhino Layer dialog.
IsLocked
 Gets or sets a value indicating the locked state of this layer.
IsReference
 Gets a value indicting whether this layer is a referenced layer. Referenced layers are part of referenced documents.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
IsVisible
 Gets or sets the visibility of this layer.
LayerIndex |  Obsolete.
 Gets or sets the index of this layer.
LinetypeIndex
 Gets or sets the line-type index for this layer.
Name
Gets or sets the name of this layer.
 (Overrides ModelComponent.Name.)
ParentLayerId
 Gets the ID of the parent layer. Layers can be origanized in a hierarchical structure, in which case this returns the parent layer ID. If the layer has no parent, Guid.Empty will be returned.
PathSeparator
 The string "::" (colon,colon) is used to separate parent and child layer names.
PlotColor
 Gets or sets the plot color for this layer.
PlotWeight
 Gets or sets the thickness of the plotting pen in millimeters. A thickness of 0.0 indicates the "default" pen weight should be used.
RenderMaterial
 Gets or sets the RenderMaterial for objects on this layer that have MaterialSource() == MaterialFromLayer. A null result indicates that no RenderMaterial has been assigned and the material created by the default Material constructor or the RenderMaterialIndex should be used.
RenderMaterialIndex
 Gets or sets the index of render material for objects on this layer that have MaterialSource() == MaterialFromLayer. A material index of -1 indicates no material has been assigned and the material created by the default Material constructor should be used.
SortIndex
 Runtime index used to sort layers in layer dialog.
UserStringCount
 Gets the amount of user strings.
Top
Methods
Name | Description
CommitChanges |  Obsolete.
CopyAttributesFrom
 Copy typical attributes from another layer
Default
 Sets layer to default settings.
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Layer)
GetChildren
 Gets immediate children of this layer. Note that child layers may have their own children.
GetDefaultLayerProperties
 Constructs a layer with the current default properties. The default layer properties are:
color = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerColor
line style = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerLineStyle
material index = -1
iges level = -1
mode = NormalLayer
name = empty
layer index = 0 (ignored by AddLayer)
GetHashCode |  (Overrides Object.GetHashCode().)
GetLeafName(String)
 Get a layer name's "leaf" level name
GetLeafName(Layer)
 Get a layer name's "leaf" level name
GetParentName(String)
 Get a layer's "parent" path name
GetParentName(Layer)
 Get a layer's "parent" path name
GetPersistentLocking
 The persistent locking setting is used for layers that can be locked by a "parent" object. A common case is when a layer is a child layer (Layer.ParentI is not nil). In this case, when a parent layer is locked, then child layers are also locked. The persistent locking setting determines what happens when the parent is unlocked again.
GetPersistentVisibility
 The persistent visbility setting is used for layers whose visibilty can be changed by a "parent" object. A common case is when a layer is a child layer (ParentId is not nil). In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
IsChildOf(Guid)
IsChildOf(Int32)
IsChildOf(Layer)
IsParentOf(Guid)
IsParentOf(Int32)
IsParentOf(Layer)
IsValidName
 Determines if a given string is valid for a layer name.
SetPersistentLocking
 Set the persistent locking setting for this layer
SetPersistentVisibility
 Set the persistent visibility setting for this layer
SetUserString
 Attach a user string (key,value combination) to this geometry.
ToString |  (Overrides ModelComponent.ToString().)
UnsetPersistentLocking
 Remove any explicity persistent locking settings from this layer
UnsetPersistentVisibility
 Remove any explicit persistent visibility setting from this layer
Top
Operators
Name | Description
Equality
Inequality
Top
See Also
Reference
Rhino.DocObjects Namespace