RhinoCommon SDK
Field Class
 Generic data fields used to add publicly accessible properties to RenderContent.FieldDictionary. These should be created by calling a FieldDictaionary.Add() method on a Render content object. These are allocated after the RenderContent object's C++ object is created and added to the underlying C++ objects content dictionary, who ever allocates a field is responsible for deleting it so these objects clean up the C++ pointers when they are disposed of.
Inheritance Hierarchy
System.Object
 Rhino.Render.Fields.Field
 More...
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class Field
Public MustInherit Class Field
The Field type exposes the following members.
Constructors
Name | Description
Field
 Field constructor
Top
Properties
Name | Description
IsTextured
Key
 Field key value string set by constructor
Prompt
 Optional UI prompt string set by constructor
Tag
 Gets or sets an object that contains data to associate with the field.
Top
Methods
Name | Description
CreateCppPointer
 Create the RDK C++ field object and set its initial value, fields are added to a RenderContent.FieldDictionary in the RenderContent constructor before the RenderContent C++ pointer is created, the RenderContent C++ pointer is required when creating a field in order for the field to get added to the RenderContent C++ Field list so this method is called by RenderContent when it is safe to create the Field C++ pointers.
ValueAsBool
 Return field value as a bool.
ValueAsByteArray
 Return field as a byte array.
ValueAsColor4f
 Return field as a Rhino.Display.Color4f color value.
ValueAsDateTime
 Return field as a DateTime value.
ValueAsDouble
 Return field value as a double precision number.
ValueAsFloat
 Return field value as floating point number.
ValueAsGuid
 Return field value as Guid.
ValueAsInt
 Return field value as integer.
ValueAsObject
ValueAsPoint2d
 Return field as a Rhino.Geometry.Point2d color value.
ValueAsPoint3d
 Return field as a Rhino.Geometry.Point3d color value.
ValueAsPoint4d
 Return field as a Rhino.Geometry.Point4d color value.
ValueAsString
 Get field value as a string.
ValueAsTransform
 Return field as a Rhino.Geometry.Transform color value.
ValueAsVector2d
 Return field as a Rhino.Geometry.Vector2d color value.
ValueAsVector3d
 Return field as a Rhino.Geometry.Vector3d color value.
Top
See Also
Reference
Rhino.Render.Fields Namespace
Inheritance Hierarchy
System.Object
 Rhino.Render.Fields.Field
 Rhino.Render.Fields.BoolField
 Rhino.Render.Fields.ByteArrayField
 Rhino.Render.Fields.Color4fField
 Rhino.Render.Fields.DateTimeField
 Rhino.Render.Fields.DoubleField
 Rhino.Render.Fields.FloatField
 Rhino.Render.Fields.GuidField
 Rhino.Render.Fields.IntField
 Rhino.Render.Fields.Point2dField
 Rhino.Render.Fields.Point3dField
 Rhino.Render.Fields.Point4dField
 Rhino.Render.Fields.StringField
 Rhino.Render.Fields.TransformField
 Rhino.Render.Fields.Vector2dField
 Rhino.Render.Fields.Vector3dField