Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_ManagedFonts Class Reference
OpenNURBS
#include <opennurbs_internal_glyph.h>
 Public Member Functions
const ON_Font *  | GetFromAppleFontName (const wchar_t *apple_font_name, bool bCreateIfNotFound)
const ON_Font *  | GetFromFontCharacteristics (const ON_Font &font_characteristics, bool bCreateIfNotFound)
const ON_Font *  | GetFromSerialNumber (unsigned int managed_font_runtime_serial_number)
unsigned int  | GetList (ON_SimpleArray< const ON_Font * > &managed_fonts)
 Static Public Member Functions
static void  | GetFontMetrics (const ON_Font *font, ON_FontMetrics &font_unit_font_metrics)
static ON__UINT_PTR  | GetGlyphMetrics (const class ON_Font *font, ON__UINT32 unicode_code_point, class ON_TextBox &font_unit_glyph_box)
 Static Public Attributes
static ON_ManagedFonts  | List
List is the only instance of this class. More...
Member Function Documentation
◆ GetFontMetrics()
 static void ON_ManagedFonts::GetFontMetrics  |  ( |  const ON_Font *  |  font,
|  ON_FontMetrics &  |  font_unit_font_metrics
)
static
◆ GetFromAppleFontName()
 const ON_Font* ON_ManagedFonts::GetFromAppleFontName  |  ( |  const wchar_t *  |  apple_font_name,
|  bool  |  bCreateIfNotFound
)
◆ GetFromFontCharacteristics()
 const ON_Font* ON_ManagedFonts::GetFromFontCharacteristics  |  ( |  const ON_Font &  |  font_characteristics,
|  bool  |  bCreateIfNotFound
)
◆ GetFromSerialNumber()
 const ON_Font* ON_ManagedFonts::GetFromSerialNumber  |  ( |  unsigned int  |  managed_font_runtime_serial_number | )
◆ GetGlyphMetrics()
 static ON__UINT_PTR ON_ManagedFonts::GetGlyphMetrics  |  ( |  const class ON_Font *  |  font,
|  ON__UINT32  |  unicode_code_point,
|  class ON_TextBox &  |  font_unit_glyph_box
)
static
Returns: 0: failure >0: success font glyph id
◆ GetList()
 unsigned int ON_ManagedFonts::GetList  |  ( |  ON_SimpleArray< const ON_Font * > &  |  managed_fonts | )
Member Data Documentation
◆ List
 ON_ManagedFonts ON_ManagedFonts::List
static
List is the only instance of this class.