Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoPolylineOnMeshUserData Class Reference
Rhino
#include <rhinoSdkMeshUtilities.h>
 Inheritance diagram for CRhinoPolylineOnMeshUserData:
 Public Member Functions
CRhinoPolylineOnMeshUserData ()
CRhinoPolylineOnMeshUserData (const CRhinoPolylineOnMeshUserData &)
~CRhinoPolylineOnMeshUserData ()
bool  | Archive () const
bool  | GetDescription (ON_wString &)
CRhinoPolylineOnMeshUserData &  | operator= (const CRhinoPolylineOnMeshUserData &)
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Member Functions inherited from ON_UserData
ON_UserData ()
ON_UserData (const ON_UserData &)
~ON_UserData ()
virtual bool  | DeleteAfterRead (const class ON_BinaryArchive &archive, class ON_Object *parent_object) const
virtual bool  | DeleteAfterWrite (const class ON_BinaryArchive &archive, const class ON_Object *parent_object) const
void  | Dump (ON_TextLog &text_log) const override
bool  | IsUnknownUserData () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_UserData *  | Next () const
ON_UserData &  | operator= (const ON_UserData &)
ON_Object *  | Owner () const
Returns object that owns the user data. More...
unsigned int  | SizeOf () const override
virtual bool  | Transform (const ON_Xform &)
ON_UUID  | UserDataClassUuid () const
virtual bool  | WriteToArchive (const class ON_BinaryArchive &archive, const class ON_Object *parent_object) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
virtual ON::object_type  | ObjectType () const
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Public Attributes
UUID  | m_mesh_uuid
ON_SimpleArray< ON_MESH_POINT >  | m_P
see opennurbs_meshtree.h for details on ON_MESH_POINT More...
 Public Attributes inherited from ON_UserData
ON_UUID  | m_application_uuid
unsigned int  | m_userdata_copycount
ON_UUID  | m_userdata_uuid
ON_Xform  | m_userdata_xform
 Static Public Attributes
static GUID  | PolylineOnMeshUserData_uuid
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
Detailed Description
Definition at line 70 of file rhinoSdkMeshUtilities.h.
Constructor & Destructor Documentation
◆ CRhinoPolylineOnMeshUserData() [1/2]
 CRhinoPolylineOnMeshUserData::CRhinoPolylineOnMeshUserData  |  ( |   | )
◆ CRhinoPolylineOnMeshUserData() [2/2]
 CRhinoPolylineOnMeshUserData::CRhinoPolylineOnMeshUserData  |  ( |  const CRhinoPolylineOnMeshUserData &  |   | )
◆ ~CRhinoPolylineOnMeshUserData()
 CRhinoPolylineOnMeshUserData::~CRhinoPolylineOnMeshUserData  |  ( |   | )
Member Function Documentation
◆ Archive()
 bool CRhinoPolylineOnMeshUserData::Archive  |  ( |   | ) |   const
virtual
Description: If Archive() returns true, m_application_uuid is not nil, and the virtual Read() and Write() are functions are overridden, then this user data will be written to and read from 3dm archives.
Returns: true if user data should be saved in binary archives. false if the user data should not be saved in binary archives.
Remarks: The default implementation returns false. If you override ON_UserData::Archive so that it returns true, then your constructor must set m_application_uuid, you must override the virtual ON_Object::Read and ON_Object::Write functions and you must CAREFULLY TEST your code.
ON_UserData requires expert programming and testing skills.
If you need to know more details about the archive or parent object to determine if the userdata should be saved, then override WriteToArchive().
YOU SHOULD READ AND UNDERSTAND EVERY COMMENT IN THIS HEADER FILE IN BEFORE ATTEMPTING TO USE ON_UserData.
Reimplemented from ON_UserData.
◆ GetDescription()
 bool CRhinoPolylineOnMeshUserData::GetDescription  |  ( |  ON_wString &  |  description | )
virtual
Parameters: description - [out] description of user data shown in object properties dump. Returns: True if user data class is ready.
Reimplemented from ON_UserData.
◆ operator=()
 CRhinoPolylineOnMeshUserData& CRhinoPolylineOnMeshUserData::operator=  |  ( |  const CRhinoPolylineOnMeshUserData &  |   | )
◆ Read()
 bool CRhinoPolylineOnMeshUserData::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
virtual
Description: Low level archive writing tool used by ON_BinaryArchive::ReadObject(). Parameters: binary_archive - archive to read from Returns: Returns true if the read is successful. Remarks: Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ Write()
 bool CRhinoPolylineOnMeshUserData::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
virtual
Description: Low level archive writing tool used by ON_BinaryArchive::WriteObject(). Parameters: binary_archive - archive to write to Returns: Returns true if the write is successful. Remarks: Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
Member Data Documentation
◆ m_mesh_uuid
 UUID CRhinoPolylineOnMeshUserData::m_mesh_uuid
Definition at line 87 of file rhinoSdkMeshUtilities.h.
◆ m_P
 ON_SimpleArray<ON_MESH_POINT> CRhinoPolylineOnMeshUserData::m_P
see opennurbs_meshtree.h for details on ON_MESH_POINT
Definition at line 88 of file rhinoSdkMeshUtilities.h.
◆ PolylineOnMeshUserData_uuid
 GUID CRhinoPolylineOnMeshUserData::PolylineOnMeshUserData_uuid
static
Definition at line 75 of file rhinoSdkMeshUtilities.h.