Public Member Functions | Public Attributes | List of all members
CRhinoAppContextMenuSettings Class Reference
Rhino
 More...
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoAppContextMenuSettings ()=default
void  | LoadProfile (CRhinoProfileContext &pc)
bool  | operator!= (const CRhinoAppContextMenuSettings &) const
bool  | operator== (const CRhinoAppContextMenuSettings &) const
void  | SaveProfile (CRhinoProfileContext &) const
 Public Attributes
CRhinoStringDictionary  | m_grip_context_menu_items
CRhinoStringDictionary  | m_object_context_menu_items
CRhinoStringDictionary  | m_view_context_menu_items
Detailed Description
Definition at line 1460 of file rhinoSdkAppSettings.h.
Constructor & Destructor Documentation
◆ CRhinoAppContextMenuSettings()
 CRhinoAppContextMenuSettings::CRhinoAppContextMenuSettings  |  ( |   | )
default
Member Function Documentation
◆ LoadProfile()
 void CRhinoAppContextMenuSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
◆ operator!=()
 bool CRhinoAppContextMenuSettings::operator!=  |  ( |  const CRhinoAppContextMenuSettings &  |   | ) |   const
◆ operator==()
 bool CRhinoAppContextMenuSettings::operator==  |  ( |  const CRhinoAppContextMenuSettings &  |   | ) |   const
◆ SaveProfile()
 void CRhinoAppContextMenuSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
Member Data Documentation
◆ m_grip_context_menu_items
 CRhinoStringDictionary CRhinoAppContextMenuSettings::m_grip_context_menu_items
Definition at line 1472 of file rhinoSdkAppSettings.h.
◆ m_object_context_menu_items
 CRhinoStringDictionary CRhinoAppContextMenuSettings::m_object_context_menu_items
Definition at line 1471 of file rhinoSdkAppSettings.h.
◆ m_view_context_menu_items
 CRhinoStringDictionary CRhinoAppContextMenuSettings::m_view_context_menu_items
Definition at line 1473 of file rhinoSdkAppSettings.h.