Public Attributes | List of all members
ON_FaceNameKey Class Reference
OpenNURBS
#include <opennurbs_textiterator.h>
 Public Attributes
ON_wString  | m_facename
int  | m_rtf_font_index = -1
Member Data Documentation
◆ m_facename
 ON_wString ON_FaceNameKey::m_facename
◆ m_rtf_font_index
 int ON_FaceNameKey::m_rtf_font_index = -1