Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_FontFaceQuartet Class Reference
OpenNURBS
#include <opennurbs_font.h>
 Public Member Functions
ON_FontFaceQuartet ()=default
ON_FontFaceQuartet (const ON_FontFaceQuartet &)=default
ON_FontFaceQuartet (const wchar_t *quartet_name, const class ON_Font *regular, const class ON_Font *bold, const class ON_Font *italic, const class ON_Font *bold_italic)
~ON_FontFaceQuartet ()=default
const class ON_Font *  | BoldFace () const
const class ON_Font *  | BoldItalicFace () const
const ON_Font *  | ClosestFace (bool bPreferedBold, bool bPreferedItalic) const
void  | Dump (ON_TextLog &text_log) const
const ON_Font *  | Face (bool bBold, bool bItalic) const
unsigned int  | FaceCount () const
bool  | HasAllFaces () const
bool  | HasBoldFace () const
bool  | HasBoldItalicFace () const
bool  | HasItalicFace () const
bool  | HasRegularFace () const
bool  | IsEmpty () const
const class ON_Font *  | ItalicFace () const
ON_FontFaceQuartet &  | operator= (const ON_FontFaceQuartet &)=default
const ON_wString  | QuartetName () const
const class ON_Font *  | RegularFace () const
 Static Public Member Functions
static int  | CompareQuartetName (const ON_FontFaceQuartet *lhs, const ON_FontFaceQuartet *rhs)
 Static Public Attributes
static const ON_FontFaceQuartet  | Empty
Constructor & Destructor Documentation
◆ ON_FontFaceQuartet() [1/3]
 ON_FontFaceQuartet::ON_FontFaceQuartet  |  ( |   | )
default
◆ ~ON_FontFaceQuartet()
 ON_FontFaceQuartet::~ON_FontFaceQuartet  |  ( |   | )
default
◆ ON_FontFaceQuartet() [2/3]
 ON_FontFaceQuartet::ON_FontFaceQuartet  |  ( |  const ON_FontFaceQuartet &  |   | )
default
◆ ON_FontFaceQuartet() [3/3]
 ON_FontFaceQuartet::ON_FontFaceQuartet  |  ( |  const wchar_t *  |  quartet_name,
|  const class ON_Font *  |  regular,
|  const class ON_Font *  |  bold,
|  const class ON_Font *  |  italic,
|  const class ON_Font *  |  bold_italic
)
Member Function Documentation
◆ BoldFace()
 const class ON_Font* ON_FontFaceQuartet::BoldFace  |  ( |   | ) |   const
◆ BoldItalicFace()
 const class ON_Font* ON_FontFaceQuartet::BoldItalicFace  |  ( |   | ) |   const
◆ ClosestFace()
 const ON_Font* ON_FontFaceQuartet::ClosestFace  |  ( |  bool  |  bPreferedBold,
|  bool  |  bPreferedItalic
) |   |  const
◆ CompareQuartetName()
 static int ON_FontFaceQuartet::CompareQuartetName  |  ( |  const ON_FontFaceQuartet *  |  lhs,
|  const ON_FontFaceQuartet *  |  rhs
)
static
◆ Dump()
 void ON_FontFaceQuartet::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
◆ Face()
 const ON_Font* ON_FontFaceQuartet::Face  |  ( |  bool  |  bBold,
|  bool  |  bItalic
) |   |  const
◆ FaceCount()
 unsigned int ON_FontFaceQuartet::FaceCount  |  ( |   | ) |   const
Returns: 0,1,2,3 or 4
◆ HasAllFaces()
 bool ON_FontFaceQuartet::HasAllFaces  |  ( |   | ) |   const
◆ HasBoldFace()
 bool ON_FontFaceQuartet::HasBoldFace  |  ( |   | ) |   const
◆ HasBoldItalicFace()
 bool ON_FontFaceQuartet::HasBoldItalicFace  |  ( |   | ) |   const
◆ HasItalicFace()
 bool ON_FontFaceQuartet::HasItalicFace  |  ( |   | ) |   const
◆ HasRegularFace()
 bool ON_FontFaceQuartet::HasRegularFace  |  ( |   | ) |   const
◆ IsEmpty()
 bool ON_FontFaceQuartet::IsEmpty  |  ( |   | ) |   const
◆ ItalicFace()
 const class ON_Font* ON_FontFaceQuartet::ItalicFace  |  ( |   | ) |   const
◆ operator=()
 ON_FontFaceQuartet& ON_FontFaceQuartet::operator=  |  ( |  const ON_FontFaceQuartet &  |   | )
default
◆ QuartetName()
 const ON_wString ON_FontFaceQuartet::QuartetName  |  ( |   | ) |   const
◆ RegularFace()
 const class ON_Font* ON_FontFaceQuartet::RegularFace  |  ( |   | ) |   const
Member Data Documentation
◆ Empty
 const ON_FontFaceQuartet ON_FontFaceQuartet::Empty
static