RhinoCommon SDK
UndoRedo.UndoRedoChanged Event
 This event is raised when undo/redo occurs in rdk.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static event EventHandler<RenderPropertyChangedEvent> UndoRedoChanged
Public Shared Event UndoRedoChanged As EventHandler(Of RenderPropertyChangedEvent)
Value
Type: System.EventHandler<RenderPropertyChangedEvent>
See Also
Reference
UndoRedo Class
Rhino.Render Namespace