RhinoCommon SDK
RealtimeDisplayMode.HudTimePressed Event
 Listen tot his event if you want to handle a press press on the time component
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public event EventHandler HudTimePressed
Public Event HudTimePressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace