RhinoCommon SDK
File3dmTypeCodes.TCODE_SHOWGRID Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SHOWGRID"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SHOWGRID = 2181038087
Public Const TCODE_SHOWGRID As UInteger = 2181038087
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace