RhinoCommon SDK
File3dmTypeCodes.TCODE_SUMMARY Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SUMMARY"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SUMMARY = 33554451
Public Const TCODE_SUMMARY As UInteger = 33554451
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace