RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEW_VIEWPORT_USERDATA Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_VIEWPORT_USERDATA"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_VIEW_VIEWPORT_USERDATA = 536907067
Public Const TCODE_VIEW_VIEWPORT_USERDATA As UInteger = 536907067
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace