RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_GEOMETRY Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_GEOMETRY"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LEGACY_GEOMETRY = 65536
Public Const TCODE_LEGACY_GEOMETRY As UInteger = 65536
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace