RhinoCommon SDK
File3dmTypeCodes.TCODE_INTERFACE Field
0x02000000.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_INTERFACE = 33554432
Public Const TCODE_INTERFACE As UInteger = 33554432
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace