RhinoCommon SDK
File3dmTypeCodes.TCODE_BITMAP_TABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_BITMAP_TABLE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_BITMAP_TABLE = 268435478
Public Const TCODE_BITMAP_TABLE As UInteger = 268435478
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace