RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_PRTSTUFF Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_PRTSTUFF"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LEGACY_PRTSTUFF = 65794
Public Const TCODE_LEGACY_PRTSTUFF As UInteger = 65794
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace