RhinoCommon SDK
File3dmTypeCodes.TCODE_PROPERTIES_REVISIONHISTORY Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_PROPERTIES_REVISIONHISTORY"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_PROPERTIES_REVISIONHISTORY = 536903713
Public Const TCODE_PROPERTIES_REVISIONHISTORY As UInteger = 536903713
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace