RhinoCommon SDK
File3dmTypeCodes.TCODE_TRANSPARENCY Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_TRANSPARENCY"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_TRANSPARENCY = 2151677956
Public Const TCODE_TRANSPARENCY As UInteger = 2151677956
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace