RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_MODEL_URL Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_MODEL_URL"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SETTINGS_MODEL_URL = 536903985
Public Const TCODE_SETTINGS_MODEL_URL As UInteger = 536903985
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace