RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_FACSTUFF Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_FACSTUFF"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LEGACY_FACSTUFF = 65796
Public Const TCODE_LEGACY_FACSTUFF As UInteger = 65796
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace