RhinoCommon SDK
File3dmTypeCodes.TCODE_OBJECT_RECORD_HISTORY_HEADER Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBJECT_RECORD_HISTORY_HEADER"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_OBJECT_RECORD_HISTORY_HEADER = 33587317
Public Const TCODE_OBJECT_RECORD_HISTORY_HEADER As UInteger = 33587317
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace