RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_ASM Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_ASM"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LEGACY_ASM = 65537
Public Const TCODE_LEGACY_ASM As UInteger = 65537
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace