RhinoCommon SDK
DisplayMaterial Constructor
 Constructs a default material.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DisplayMaterial()
Public Sub New
See Also
Reference
DisplayMaterial Class
DisplayMaterial Overload
Rhino.Display Namespace