RhinoCommon SDK
RenderContent.FromXml Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RenderContent FromXml(
	string xml
)
Public Shared Function FromXml (
	xml As String
) As RenderContent
Parameters
xml
Type: System.String
[Missing <param name="xml"/> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String)"]
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.FromXml(System.String)"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace