RhinoCommon SDK
PickContext Constructor
Initializes a new instance of the PickContext class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PickContext()
Public Sub New
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace