RhinoCommon SDK
RdkSelectionNavigator.Clear Method
 Clear the navigator.
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace