RhinoCommon SDK
Text3d Constructor (String)
 Constructs a new instance of Text3d.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Text3d(
	string text
)
Public Sub New (
	text As String
)
Parameters
text
Type: System.String
Text string.
See Also
Reference
Text3d Class
Text3d Overload
Rhino.Display Namespace