RhinoCommon SDK
SnapShotsClient Constructor
 SnapShotsClient constructor
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SnapShotsClient()
Public Sub New
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace