RhinoCommon SDK
MetaData.Dispose Method
Releases all resources used by the MetaData
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
MetaData Class
Rhino.Render.DataSources Namespace