RhinoCommon SDK
Interval.ToString Method
 Returns a string representation of this Interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A string with T0,T1.
See Also
Reference
Interval Structure
Rhino.Geometry Namespace