RhinoCommon SDK
FileReadOptions Constructor
Initializes a new instance of the FileReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public FileReadOptions()
Public Sub New
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace