RhinoCommon SDK
GeometryBase.NonConstOperation Method
 Destroy cache handle
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void NonConstOperation()
Protected Overrides Sub NonConstOperation
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace