RhinoCommon SDK
FieldDictionary.TryGetTag Method
 Gets object that contains data associate with a field.
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool TryGetTag(
	string key,
	out Object tag
)
Public Function TryGetTag (
	key As String,
	<OutAttribute> ByRef tag As Object
) As Boolean
Parameters
key
Type: System.String
Key name of the field to get.
tag
Type: System.Object
Data associated with the field.
Return Value
Type: Boolean
 Returns true if the field is found and its tag was retrieved otherwise; returns false.
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace