RhinoCommon SDK
Decal.Dispose Method
Releases all resources used by the Decal
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
Decal Class
Dispose Overload
Rhino.Render Namespace