RhinoCommon SDK
CustomObjectGrips Constructor
Initializes a new instance of the CustomObjectGrips class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected CustomObjectGrips()
Protected Sub New
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace