RhinoCommon SDK
PreviewAppearance.ToMetaData Method
 Copy PreviewAppearance to MetaData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ToMetaData()
Public Sub ToMetaData
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace