RhinoCommon SDK
Field Constructor
 Field constructor
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected Field(
	RenderContent renderContent,
	IntPtr attachToPointer,
	string key,
	string prompt,
	Object initialValue,
	bool isTextured
)
Protected Sub New (
	renderContent As RenderContent,
	attachToPointer As IntPtr,
	key As String,
	prompt As String,
	initialValue As Object,
	isTextured As Boolean
)
Parameters
renderContent
Type: Rhino.Render.RenderContent
RenderContent whose Fields owns this field.
attachToPointer
Type: System.IntPtr
C++ pointer to attach to.
key
Type: System.String
Unique key for this field
prompt
Type: System.String
Display string used by the user interface
initialValue
Type: System.Object
 Initial value used to initialize the field after creating the C++ pointer.
isTextured
Type: System.Boolean
Determines whether auto-UIs will show the texture control set
See Also
Reference
Field Class
Rhino.Render.Fields Namespace