RhinoCommon SDK
MouseCallback Constructor
Initializes a new instance of the MouseCallback class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected MouseCallback()
Protected Sub New
See Also
Reference
MouseCallback Class
Rhino.UI Namespace