RhinoCommon SDK
Decal.CustomData Method
 Gets custom data associated with this decal - see Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public List<NamedValue> CustomData()
Public Function CustomData As List(Of NamedValue)
Return Value
Type: List<NamedValue>
The return value can be null if there is no data associated with this decal.
See Also
Reference
Decal Class
Rhino.Render Namespace