RhinoCommon SDK
DimensionStyle Constructor
 Create a new non-document controlled annotation style
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle()
Public Sub New
See Also
Reference
DimensionStyle Class
DimensionStyle Overload
Rhino.DocObjects Namespace