RhinoCommon SDK
Material.GetBitmapTexture Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.GetBitmapTexture"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Texture GetBitmapTexture()
Public Function GetBitmapTexture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.GetBitmapTexture"]
See Also
Reference
Material Class
Rhino.DocObjects Namespace