RhinoCommon SDK
File3dmWriteOptions Constructor
 Initializes properties to defaults.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public File3dmWriteOptions()
Public Sub New
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace