RhinoCommon SDK
RenderPrimitiveList.Dispose Method
Releases all resources used by the RenderPrimitiveList
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace