RhinoCommon SDK
UserDataListEnumerator.Dispose Method
 Implement Dispose(). NOP.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
UserDataListEnumerator Class
Rhino.DocObjects.Custom Namespace