RhinoCommon SDK
IntersectionEvent Constructor
Initializes a new instance of the IntersectionEvent class
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IntersectionEvent()
Public Sub New
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace