RhinoCommon SDK
GetTransform Constructor
Initializes a new instance of the GetTransform class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected GetTransform()
Protected Sub New
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace