RhinoCommon SDK
ReplayHistoryData.Dispose Method
Releases all resources used by the ReplayHistoryData
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace