RhinoCommon SDK
Circle.Reverse Method
 Reverse the orientation of the circle. Changes the domain from [a,b] to [-b,-a].
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Reverse()
Public Sub Reverse
See Also
Reference
Circle Structure
Rhino.Geometry Namespace