RhinoCommon SDK
Brep.CreateBooleanUnion Method (IEnumerable<Brep>, Double)
 Compute the Boolean Union of a set of Breps.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Brep[] CreateBooleanUnion(
	IEnumerable<Brep> breps,
	double tolerance
)
Public Shared Function CreateBooleanUnion (
	breps As IEnumerable(Of Brep),
	tolerance As Double
) As Brep()
Parameters
breps
Type: System.Collections.Generic.IEnumerable<Brep>
Breps to union.
tolerance
Type: System.Double
Tolerance to use for union operation.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
See Also
Reference
Brep Class
CreateBooleanUnion Overload
Rhino.Geometry Namespace