RhinoCommon SDK
Texture Constructor
 Initializes a new texture.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Texture()
Public Sub New
See Also
Reference
Texture Class
Texture Overload
Rhino.DocObjects Namespace