RhinoCommon SDK
LayerTable.FindNext Method (Int32, String, Boolean)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("ignoreDeletedLayers is no longer supported for research by name. Use the overload with notFoundReturnValue (-1 was the previous default).")]
public int FindNext(
	int index,
	string layerName,
	bool ignoreDeletedLayers
)
<ObsoleteAttribute("ignoreDeletedLayers is no longer supported for research by name. Use the overload with notFoundReturnValue (-1 was the previous default).")>
Public Function FindNext (
	index As Integer,
	layerName As String,
	ignoreDeletedLayers As Boolean
) As Integer
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
layerName
Type: System.String
[Missing <param name="layerName"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
ignoreDeletedLayers
Type: System.Boolean
[Missing <param name="ignoreDeletedLayers"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
See Also
Reference
LayerTable Class
FindNext Overload
Rhino.DocObjects.Tables Namespace