RhinoCommon SDK
CustomRenderMeshProvider Constructor
 Default constructor
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected CustomRenderMeshProvider()
Protected Sub New
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace