RhinoCommon SDK
AreaMassProperties.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
AreaMassProperties Class
Dispose Overload
Rhino.Geometry Namespace