RhinoCommon SDK
SimulatedTexture Constructor
Initializes a new instance of the SimulatedTexture class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SimulatedTexture()
Public Sub New
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace