RhinoCommon SDK
Plane.Clone Method
 Returns a deep of this instance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Plane Clone()
Public Function Clone As Plane
Return Value
Type: Plane
A plane with the same values as this item.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace