RhinoCommon SDK
Vector3d.GetHashCode Method
 Computes the hash code for the current vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique number that represents the components of this vector.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace