RhinoCommon SDK
PointCloud.ClearNormals Method
 Destroys the normal vector information in this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ClearNormals()
Public Sub ClearNormals
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace