RhinoCommon SDK
StatusBar.ClearMessagePane Method
 Removes the message from the message pane.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void ClearMessagePane()
Public Shared Sub ClearMessagePane
See Also
Reference
StatusBar Class
Rhino.UI Namespace