RhinoCommon SDK
RhinoSettings.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.Finalize"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace