RhinoCommon SDK
LinetypeTable.Find Method (String, Boolean)
Note: This API is now obsolete.
Obsolete. Use the other overload.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("ignoreDeletedLinetypes is now ignored. Items are removed permanenently now. Remove the second method argument.")]
public int Find(
	string name,
	bool ignoreDeletedLinetypes
)
<ObsoleteAttribute("ignoreDeletedLinetypes is now ignored. Items are removed permanenently now. Remove the second method argument.")>
Public Function Find (
	name As String,
	ignoreDeletedLinetypes As Boolean
) As Integer
Parameters
name
Type: System.String
search ignores case.
ignoreDeletedLinetypes
Type: System.Boolean
If true, deleted linetypes are not checked.
Return Value
Type: Int32
 >=0 index of the linetype with the given name -1 no linetype has the given name.
See Also
Reference
LinetypeTable Class
Find Overload
Rhino.DocObjects.Tables Namespace