RhinoCommon SDK
Material.GetBumpTexture Method
 Gets the bump texture of this material.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Texture GetBumpTexture()
Public Function GetBumpTexture As Texture
Return Value
Type: Texture
A texture; or null if no bump texture has been added to this material.
See Also
Reference
Material Class
Rhino.DocObjects Namespace