RhinoCommon SDK
VisualAnalysisMode Constructor
Initializes a new instance of the VisualAnalysisMode class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected VisualAnalysisMode()
Protected Sub New
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace