RhinoCommon SDK
RenderMaterial Constructor
Initializes a new instance of the RenderMaterial class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected RenderMaterial()
Protected Sub New
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace