RhinoCommon SDK
RTree.Clear Method
 Removes all elements.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
RTree Class
Rhino.Geometry Namespace