RhinoCommon SDK
RenderTexture.IsImageBased Method
 Query if the texture is image based.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool IsImageBased()
Public Overridable Function IsImageBased As Boolean
Return Value
Type: Boolean
true if the texture is image-based.
See Also
Reference
RenderTexture Class
Rhino.Render Namespace