RhinoCommon SDK
FilePdf Methods
The FilePdf type exposes the following members.
Methods
Name | Description
AddPage
 Add a new page to this document
Create
 Create a new instance of a FilPdf class
Write(Stream)
 Write pdf to a stream
Write(String)
 Write pdf to a file
Top
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace