RhinoCommon SDK
Centermark Methods
The Centermark type exposes the following members.
Methods
Name | Description
Create
 Create a new centermark
Top
Extension Methods
Name | Description
SetDefaultContext
 injects into AnnotationBase a way to get to dimension styles without having a dependency in RhinoDoc
 (Defined by AnnotationExtensions.)
Top
See Also
Reference
Centermark Class
Rhino.Geometry Namespace