RhinoCommon SDK
IPanelsService Methods
The IPanelsService type exposes the following members.
Methods
Name | Description
ChangePanelIcon
ClosePanel
GetOpenPanelIds
GetPanel
IsPanelVisible
OpenPanel(Guid, Boolean)
OpenPanel(Guid, Guid, Boolean)
OpenPanelAsSibling
PanelDockBar
RegisterPanel
Top
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace