RhinoCommon SDK
IDialogService Methods
The IDialogService type exposes the following members.
Methods
Name | Description
ObjectToWindowHandle
ShowMultiListBox
WrapAsIWin32Window
Top
See Also
Reference
IDialogService Interface
Rhino.UI Namespace