RhinoCommon SDK
ObjectPropertiesPageEventArgs.IncludesObjectsType Method
Overload List
Name | Description
IncludesObjectsType<T>()
 Return true if any of the selected objects match the given type
IncludesObjectsType(ObjectType)
Top
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace