RhinoCommon SDK
Vector3f.ZAxis Property
 Gets the value of the vector with components 0,0,1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Vector3f ZAxis { get; }
Public Shared ReadOnly Property ZAxis As Vector3f
	Get
Property Value
Type: Vector3f
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace