RhinoCommon SDK
Material.Id Property
 Get the material ID (crc)
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public uint Id { get; }
Public ReadOnly Property Id As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
Material Class
Rhino.Render.ChangeQueue Namespace