RhinoCommon SDK
ViewportInfo.FrustumFar Property
 Gets the frustum far-cutting value.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FrustumFar { get; }
Public ReadOnly Property FrustumFar As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace