RhinoCommon SDK
City.Name Property
 Gets name of city.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
City Class
Rhino.Render Namespace