RhinoCommon SDK
BitmapEntry.IsReference Property
 Gets a value indicting whether this bitmap is a referenced bitmap. Referenced bitmaps are part of referenced documents.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsReference { get; }
Public ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BitmapEntry Class
Rhino.DocObjects Namespace