RhinoCommon SDK
Plane.WorldYZ Property
 plane coincident with the World YZ plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Plane WorldYZ { get; }
Public Shared ReadOnly Property WorldYZ As Plane
	Get
Property Value
Type: Plane
See Also
Reference
Plane Structure
Rhino.Geometry Namespace