RhinoCommon SDK
ImageFileEventArgs.EllapsedTime Property
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.EllapsedTime"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int EllapsedTime { get; }
Public ReadOnly Property EllapsedTime As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace