RhinoCommon SDK
Matrix.ColumnCount Property
 Gets the amount of columns.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int ColumnCount { get; }
Public ReadOnly Property ColumnCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Matrix Class
Rhino.Geometry Namespace