RhinoCommon SDK
Point3f.Y Property
 Gets or sets the Y (second) component of the vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public float Y { get; set; }
Public Property Y As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace