RhinoCommon SDK
Material.Name Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.Name"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string Name { get; set; }
Public Overrides Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Material Class
Rhino.DocObjects Namespace