RhinoCommon SDK
Color4f.Black Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.Black"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Color4f Black { get; }
Public Shared ReadOnly Property Black As Color4f
	Get
Property Value
Type: Color4f
See Also
Reference
Color4f Structure
Rhino.Display Namespace