RhinoCommon SDK
HiddenLineDrawingSegment.ParentCurve Property
 This curve is a subcurve of the returned HiddenLineDrawingFullCurve object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public HiddenLineDrawingObjectCurve ParentCurve { get; }
Public ReadOnly Property ParentCurve As HiddenLineDrawingObjectCurve
	Get
Property Value
Type: HiddenLineDrawingObjectCurve
See Also
Reference
HiddenLineDrawingSegment Class
Rhino.Geometry Namespace