RhinoCommon SDK
DetailViewObject.DetailGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DetailViewObject.DetailGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DetailView DetailGeometry { get; }
Public ReadOnly Property DetailGeometry As DetailView
	Get
Property Value
Type: DetailView
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace