RhinoCommon SDK
GetCylinder.Cap Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCylinder.Cap"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Cap { get; set; }
Public Property Cap As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCylinder Class
Rhino.Input.Custom Namespace