RhinoCommon SDK
BitmapTable.Count Property
Gets the number of bitmaps in the table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int Count { get; }
Public Overrides ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
IReadOnlyCollection<T>.Count
ICollection<T>.Count
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace