RhinoCommon SDK
Sun.DaylightSavingMinutes Property
Daylight saving minutes
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int DaylightSavingMinutes { get; set; }
Public Property DaylightSavingMinutes As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Sun Class
Rhino.Render Namespace