RhinoCommon SDK
RuiUpdateUi.MenuId Property
Id of the menu that owns this menu item
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid MenuId { get; }
Public ReadOnly Property MenuId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace