RhinoCommon SDK
Sphere.EquitorialPlane Property
Note: This API is now obsolete.
 Gets or sets the Equatorial plane for this sphere.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("This property has been replaced by Equ*A*torialPlane.")]
public Plane EquitorialPlane { get; set; }
<ObsoleteAttribute("This property has been replaced by Equ*A*torialPlane.")>
Public Property EquitorialPlane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace