RhinoCommon SDK
RhinoViewport.CameraY Property
Gets the "unit up" vector.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d CameraY { get; }
Public ReadOnly Property CameraY As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace