RhinoCommon SDK
TwoColorRenderTexture.SwapColors Property
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.SwapColors"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SwapColors { get; set; }
Public Property SwapColors As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace