RhinoCommon SDK
Command.Settings Property
 Gets the settings of the command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PersistentSettings Settings { get; }
Public ReadOnly Property Settings As PersistentSettings
	Get
Property Value
Type: PersistentSettings
See Also
Reference
Command Class
Rhino.Commands Namespace