RhinoCommon SDK
ICurrentEnvironment_Get.ForLighting Property
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment_Get.ForLighting"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
RenderEnvironment ForLighting { get; }
ReadOnly Property ForLighting As RenderEnvironment
	Get
Property Value
Type: RenderEnvironment
See Also
Reference
ICurrentEnvironment_Get Interface
Rhino.Render Namespace