RhinoCommon SDK
Point2d.Origin Property
 Gets a point at 0,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Point2d Origin { get; }
Public Shared ReadOnly Property Origin As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace