RhinoCommon SDK
CreatePreviewEventArgs.Reason Property
 Reason the preview is getting generated
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public CreatePreviewReason Reason { get; }
Public ReadOnly Property Reason As CreatePreviewReason
	Get
Property Value
Type: CreatePreviewReason
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace