RhinoCommon SDK
Point4d.W Property
 Gets or sets the W (fourth) coordinate -or weight- of this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double W { get; set; }
Public Property W As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace