RhinoCommon SDK
PointCloud.Count Property
 Gets the number of points in this pointcloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace