RhinoCommon SDK
Arc.AngleDomain Property
 Gets or sets the angle domain (in Radians) of this arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Interval AngleDomain { get; set; }
Public Property AngleDomain As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
Arc Structure
Rhino.Geometry Namespace