RhinoCommon SDK
City.Latitude Property
 Gets latitude of city.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Latitude { get; }
Public ReadOnly Property Latitude As Double
	Get
Property Value
Type: Double
See Also
Reference
City Class
Rhino.Render Namespace