RhinoCommon SDK
Quaternion.Zero Property
 Returns the dafault quaternion, where all coefficients are 0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Quaternion Zero { get; }
Public Shared ReadOnly Property Zero As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace