RhinoCommon SDK
FileWriteOptions.IncludeRenderMeshes Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.IncludeRenderMeshes"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IncludeRenderMeshes { get; set; }
Public Property IncludeRenderMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace