RhinoCommon SDK
Interval.IsIncreasing Property
 Returns true if T0 < T1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsIncreasing { get; }
Public ReadOnly Property IsIncreasing As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Interval Structure
Rhino.Geometry Namespace