RhinoCommon SDK
Material.MaterialIndex Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.MaterialIndex"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int MaterialIndex { get; }
Public ReadOnly Property MaterialIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Material Class
Rhino.DocObjects Namespace