RhinoCommon SDK
EarthAnchorPoint.ModelNorth Property
Earth directions in model coordinates.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d ModelNorth { get; set; }
Public Property ModelNorth As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace