RhinoCommon SDK
Sun.DaylightSaving Property
Daylight savings time
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool DaylightSaving { get; set; }
Public Property DaylightSaving As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Sun Class
Rhino.Render Namespace