RhinoCommon SDK
RuiUpdateUi.WindowsMenuItemId Property
Windows menu item ID
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public uint WindowsMenuItemId { get; }
Public ReadOnly Property WindowsMenuItemId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace