RhinoCommon SDK
Font.Bold Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Bold"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Bold { get; }
Public ReadOnly Property Bold As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Font Class
Rhino.DocObjects Namespace