RhinoCommon SDK
LinearDimension.ExtensionLine1End Property
 End of the first extension line.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d ExtensionLine1End { get; set; }
Public Property ExtensionLine1End As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace