RhinoCommon SDK
TwoColorRenderTexture.Texture2On Property
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.Texture2On"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Texture2On { get; set; }
Public Property Texture2On As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace