RhinoCommon SDK
RhinoObjectSelectionEventArgs.Selected Property
 Returns true if objects are being selected. Returns false if objects are being deseleced.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Selected { get; }
Public ReadOnly Property Selected As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace