RhinoCommon SDK
InstanceDefinition.UrlDescription Property
 The URL description displayed as a hyperlink in the Insert and Block UI
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string UrlDescription { get; }
Public ReadOnly Property UrlDescription As String
	Get
Property Value
Type: String
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace