RhinoCommon SDK
RuiUpdateUi.Text Property
Menu item text
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace