RhinoCommon SDK
Interval.IsSingleton Property
 Returns true if T0 == T1 != ON.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsSingleton { get; }
Public ReadOnly Property IsSingleton As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Interval Structure
Rhino.Geometry Namespace