RhinoCommon SDK
Linetype.SegmentCount Property
Number of segments in the pattern.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int SegmentCount { get; }
Public ReadOnly Property SegmentCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace