RhinoCommon SDK
TextDot.Point Property
 Gets or sets the position of the textdot.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Point { get; set; }
Public Property Point As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
TextDot Class
Rhino.Geometry Namespace