RhinoCommon SDK
ShutLiningCurveInfo.Profile Property
 >The profile type.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Profile { get; }
Public ReadOnly Property Profile As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace