RhinoCommon SDK
SimulatedTexture.Repeating Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.Repeating"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Repeating { get; set; }
Public Property Repeating As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace