RhinoCommon SDK
GetLine.GetLineMode Property
 Mode used
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GetLineMode GetLineMode { get; set; }
Public Property GetLineMode As GetLineMode
	Get
	Set
Property Value
Type: GetLineMode
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace