RhinoCommon SDK
Arc.StartAngleDegrees Property
 Gets or sets the start angle (in Radians) for this arc segment.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double StartAngleDegrees { get; set; }
Public Property StartAngleDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Arc Structure
Rhino.Geometry Namespace