RhinoCommon SDK
Circle.Center Property
 Gets or sets the center point of this circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Center { get; set; }
Public Property Center As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Circle Structure
Rhino.Geometry Namespace