RhinoCommon SDK
Color4fField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color4f Value { get; set; }
Public Property Value As Color4f
	Get
	Set
Property Value
Type: Color4f
See Also
Reference
Color4fField Class
Rhino.Render.Fields Namespace