RhinoCommon SDK
CreatePreviewEventArgs.SceneObject.Mesh Property
[Missing <summary> documentation for "P:Rhino.Render.CreatePreviewEventArgs.SceneObject.Mesh"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Mesh Mesh { get; }
Public ReadOnly Property Mesh As Mesh
	Get
Property Value
Type: Mesh
See Also
Reference
CreatePreviewEventArgs.SceneObject Class
Rhino.Render Namespace