RhinoCommon SDK
CreatePreviewEventArgs.Environment Property
 The environment that the previewed object is rendered in.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderEnvironment Environment { get; }
Public ReadOnly Property Environment As RenderEnvironment
	Get
Property Value
Type: RenderEnvironment
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace