RhinoCommon SDK
BrepEdge.Brep Property
 Gets the Brep that owns this edge.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace