RhinoCommon SDK
ClippingPlane.ViewIds Property
 Get list of View IDs this clipping plane is supposed to clip.
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public List<Guid> ViewIds { get; }
Public ReadOnly Property ViewIds As List(Of Guid)
	Get
Property Value
Type: List<Guid>
See Also
Reference
ClippingPlane Class
Rhino.Render.ChangeQueue Namespace