RhinoCommon SDK
Ray3d.Direction Property
 Gets the direction vector of this ray.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d Direction { get; }
Public ReadOnly Property Direction As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace