RhinoCommon SDK
Font.FaceName Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.FaceName"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string FaceName { get; }
Public ReadOnly Property FaceName As String
	Get
Property Value
Type: String
See Also
Reference
Font Class
Rhino.DocObjects Namespace