RhinoCommon SDK
PanelIds.ContextHelp Property
 Rhino context sensitive help panel.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid ContextHelp { get; }
Public Shared ReadOnly Property ContextHelp As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace