RhinoCommon SDK
DimStyleTable.BuiltInStyles Property
 Creates an array of default AnnotationStyle objects
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle[] BuiltInStyles { get; }
Public ReadOnly Property BuiltInStyles As DimensionStyle()
	Get
Property Value
Type: DimensionStyle[]
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace