RhinoCommon SDK
RuiUpdateUi.MenuHandle Property
Windows menu handle of menu that contains this item
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IntPtr MenuHandle { get; }
Public ReadOnly Property MenuHandle As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace