RhinoCommon SDK
BrepFace.Loops Property
 Loops in this face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BrepLoopList Loops { get; }
Public ReadOnly Property Loops As BrepLoopList
	Get
Property Value
Type: BrepLoopList
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace