RhinoCommon SDK
RenderPrimitiveList.RhinoObject Property
 The Rhino object associated with this list
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoObject RhinoObject { get; }
Public ReadOnly Property RhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace