RhinoCommon SDK
Transform.M31 Property
Gets or sets this[3,1].
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double M31 { get; set; }
Public Property M31 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform Structure
Rhino.Geometry Namespace