RhinoCommon SDK
ViewCapture Properties
The ViewCapture type exposes the following members.
Properties
Name | Description
DrawAxes
DrawGrid
DrawGridAxes
Height
Preview
RealtimeRenderPasses
ScaleScreenItems
TransparentBackground
Width
Top
See Also
Reference
ViewCapture Class
Rhino.Display Namespace