RhinoCommon SDK
RealtimeDisplayMode Properties
The RealtimeDisplayMode type exposes the following members.
Properties
Name | Description
LinearWorkflow
 Returns the LinearWorkflow data for this realitime display mode.
Top
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace