RhinoCommon SDK
RenderContentEventArgs Properties
The RenderContentEventArgs type exposes the following members.
Properties
Name | Description
Content
Document
Reason
Top
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace