RhinoCommon SDK
GetPointDrawEventArgs Class
 Arguments for drawing during point getting.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.DrawEventArgs
 Rhino.Input.Custom.GetPointDrawEventArgs
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class GetPointDrawEventArgs : DrawEventArgs
Public Class GetPointDrawEventArgs
	Inherits DrawEventArgs
The GetPointDrawEventArgs type exposes the following members.
Properties
Name | Description
CurrentPoint
Source
 GetPoint class that this draw event originated from.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Input.Custom Namespace