RhinoCommon SDK
UndoRedo Class
 This class contains the event for UndoRedoChanged that is fired from RDK .
Inheritance Hierarchy
System.Object
 Rhino.Render.UndoRedo
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static class UndoRedo
Public NotInheritable Class UndoRedo
The UndoRedo type exposes the following members.
Events
Name | Description
UndoRedoChanged
 This event is raised when undo/redo occurs in rdk.
Top
See Also
Reference
Rhino.Render Namespace