RhinoCommon SDK
TextVerticalAlignment Enumeration
 Vertical location of text attach point relative to text
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum TextVerticalAlignment
Public Enumeration TextVerticalAlignment
Members
Member name | Value | Description
Top | 0 |  Attach to top of first line
MiddleOfTop | 1 |  Attach to middle of first line
BottomOfTop | 2 |  Attach to bottom of first line
Middle | 3 |  Attach to middle of text block
MiddleOfBottom | 4 |  Attach to middle of bottom line
Bottom | 5 |  Attach to bottom of bottom line
BottomOfBoundingBox | 6 |  Attach below bottom of boundingbox
See Also
Reference
Rhino.DocObjects Namespace