RhinoCommon SDK
RenderContentCollection Class
[Missing <summary> documentation for "T:Rhino.Render.RenderContentCollection"]
Inheritance Hierarchy
System.Object
 System.Collections.Generic.List<RenderContent>
 Rhino.Render.RenderContentCollection
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class RenderContentCollection : List<RenderContent>
Public Class RenderContentCollection
	Inherits List(Of RenderContent)
The RenderContentCollection type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace