RhinoCommon SDK
Usage Enumeration
[Missing <summary> documentation for "T:Rhino.Render.DataSources.Usage"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum Usage
Public Enumeration Usage
Members
Member name | Value | Description
kBackground | 1
kReflection | 2
kSkylighting | 4
kAny | 7
See Also
Reference
Rhino.Render.DataSources Namespace