RhinoCommon SDK
GetPointMouseEventArgs Class
 Arguments for mouse information during point getting.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Input.Custom.GetPointMouseEventArgs
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class GetPointMouseEventArgs : EventArgs
Public Class GetPointMouseEventArgs
	Inherits EventArgs
The GetPointMouseEventArgs type exposes the following members.
Properties
Name | Description
ControlKeyDown
LeftButtonDown
MiddleButtonDown
Point
RightButtonDown
ShiftKeyDown
Source
Viewport
WindowPoint
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Input.Custom Namespace