RhinoCommon SDK
TextEntity Class
[Missing <summary> documentation for "T:Rhino.Geometry.TextEntity"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.TextEntity
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class TextEntity : AnnotationBase
<SerializableAttribute>
Public Class TextEntity
	Inherits AnnotationBase
The TextEntity type exposes the following members.
Constructors
Name | Description
TextEntity()
 Initializes a new instance of the TextEntity class.
TextEntity(SerializationInfo, StreamingContext)
 Protected constructor used in serialization
Top
Properties
Name | Description
Justification
 Gets or sets the justification of text in relation to its base point.
TextHorizontalAlignment
TextOrientation
TextVerticalAlignment
Top
Methods
Name | Description
Create
 Create Text geometry or null if input is invalid
CreateCurves
 Returns the outline curves.
CreateExtrusions
 Creates extrusions from the outline curves with specified height.
CreatePolySurfaces
 Creates breps from the outline curves with specified height.
CreateSurfaces
 Creates planar breps from the outline curves.
CreateWithRichText
 Create RichText geometry or null if input is invalid
Explode
 Explodes this text entity into an array of curves.
GetTextTransform
 Get the transform for this text object's text geometry
Transform(Transform, DimensionStyle)
 Transform the object by a 4x4 transform matrix and change text height override to accommodate scaling in the transform if necessary
Top
See Also
Reference
Rhino.Geometry Namespace