Grasshopper API
GH_YakDownloadForm.Dispose Method
Releases the unmanaged resources used by the GH_YakDownloadForm and optionally releases the managed resources
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
protected override void Dispose(
	bool disposing
)
Protected Overrides Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
GH_YakDownloadForm Class
Grasshopper.GUI Namespace