Grasshopper API
GH_YakDownloadFormEto.CenterFormOnWindow Method
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public void CenterFormOnWindow(
	Form parent,
	bool limitToScreen
)
Public Sub CenterFormOnWindow (
	parent As Form,
	limitToScreen As Boolean
)
Parameters
parent
Type: System.Windows.Forms.Form
limitToScreen
Type: System.Boolean
See Also
Reference
GH_YakDownloadFormEto Class
Grasshopper.GUI Namespace