Grasshopper SDK
ID Methods
The ID type exposes the following members.
Methods
Name | Description
ToString
 Gets a string representation for this ID.
 (Overrides ValueType.ToString().)
Top
See Also
Reference
ID Structure
GH_IO.Serialization Namespace