Grasshopper SDK
GH_VoronoiWarningForm Methods
The GH_VoronoiWarningForm type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
See Also
Reference
GH_VoronoiWarningForm Class
Grasshopper.GUI Namespace