Grasshopper SDK
GH_IconPicker Methods
The GH_IconPicker type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides ContainerControl.Dispose(Boolean).)
Top
See Also
Reference
GH_IconPicker Class
Grasshopper.GUI Namespace