Grasshopper SDK
GH_LoadProtectDialog Methods
The GH_LoadProtectDialog type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
SetAssemblyName
Top
See Also
Reference
GH_LoadProtectDialog Class
Grasshopper.GUI Namespace