Grasshopper SDK
CentralSettings Methods
The CentralSettings type exposes the following members.
Methods
Name | Description
GetLoadMechanism
 Gets what load mechanism has been specified for a certain plugin.
IsLoadProtected
 Gets whether a certain plugin is load protected.
SetLoadMechanism
 Sets the user defined load mechanism for a certain plugin.
SetLoadProtected
 Sets whether a certain plugin is load protected.
Top
See Also
Reference
CentralSettings Class
Grasshopper Namespace