Grasshopper API
GH_YakDownloadForm Methods
The GH_YakDownloadForm type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
See Also
Reference
GH_YakDownloadForm Class
Grasshopper.GUI Namespace