Grasshopper SDK
GH_QuickImageEditor Methods
The GH_QuickImageEditor type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
See Also
Reference
GH_QuickImageEditor Class
Grasshopper.GUI Namespace