Grasshopper SDK
GH_UnrecognizedObjectsForm Methods
The GH_UnrecognizedObjectsForm type exposes the following members.
Methods
Name | Description
Dispose |  (Overrides Form.Dispose(Boolean).)
Top
See Also
Reference
GH_UnrecognizedObjectsForm Class
Grasshopper.GUI Namespace