Grasshopper SDK
GH_FontScroller Methods
The GH_FontScroller type exposes the following members.
Methods
Name | Description
OnPaint |  (Overrides Control.OnPaint(PaintEventArgs).)
OnPaintBackground |  (Overrides ScrollableControl.OnPaintBackground(PaintEventArgs).)
Top
See Also
Reference
GH_FontScroller Class
Grasshopper.GUI Namespace