Grasshopper SDK
ChunkKeyedCollection Methods
The GH_Chunk.ChunkKeyedCollection type exposes the following members.
Methods
Name | Description
GetKeyForItem
 Get the ID for a given chunk.
 (Overrides KeyedCollection<TKey, TItem>.GetKeyForItem(TItem).)
TryGetValue
 Try and find the chunk that belongs to a given ID.
Top
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
GH_IO.Serialization Namespace