Grasshopper API
GH_YakDownloadFormEto Methods
The GH_YakDownloadFormEto type exposes the following members.
Methods
Name | Description
CenterFormOnWindow
Top
See Also
Reference
GH_YakDownloadFormEto Class
Grasshopper.GUI Namespace