Grasshopper SDK
GH_DocumentRenderMeshProvider.BoundingBox Method
Overload List
Name | Description
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean) |  (Overrides CustomRenderMeshProvider2.BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean).)
Top
See Also
Reference
GH_DocumentRenderMeshProvider Class
Grasshopper.Kernel Namespace