Grasshopper SDK
GH_GHXHarvester.HarvestBoundingBoxes Method
Overload List
Name | Description
HarvestBoundingBoxes(String)
 Harvest all attribute bounding boxes from a GHX/GH archive.
HarvestBoundingBoxes(GH_Archive)
 Harvest all attribute bounding boxes from a GHX/GH archive.
HarvestBoundingBoxes(GH_IReader)
 Harvest all attribute bounding boxes from a GHX/GH node.
Top
See Also
Reference
GH_GHXHarvester Class
Grasshopper.Kernel Namespace