Grasshopper SDK
GH_ExternalFileConflictDialog Properties
The GH_ExternalFileConflictDialog type exposes the following members.
Properties
Name | Description
FilePathA
FilePathB
LoadFileCode
Top
See Also
Reference
GH_ExternalFileConflictDialog Class
Grasshopper.GUI Namespace