Grasshopper SDK
GH_Chunk.ChunkKeyedCollection Class
 Represents a collection of chunks with associated IDs
Inheritance Hierarchy
System.Object
 System.Collections.ObjectModel.Collection<GH_Chunk>
 System.Collections.ObjectModel.KeyedCollection<ID, GH_Chunk>
 GH_IO.Serialization.GH_Chunk.ChunkKeyedCollection
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public class ChunkKeyedCollection : KeyedCollection<ID, GH_Chunk>
Public Class ChunkKeyedCollection
	Inherits KeyedCollection(Of ID, GH_Chunk)
The GH_Chunk.ChunkKeyedCollection type exposes the following members.
Methods
Name | Description
GetKeyForItem
 Get the ID for a given chunk.
 (Overrides KeyedCollection<TKey, TItem>.GetKeyForItem(TItem).)
TryGetValue
 Try and find the chunk that belongs to a given ID.
Top
See Also
Reference
GH_IO.Serialization Namespace