RhinoCommon SDK
File3dmTypeCodes.TCODE_DICTIONARY_ID Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DICTIONARY_ID"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_DICTIONARY_ID = 1073774609
Public Const TCODE_DICTIONARY_ID As UInteger = 1073774609
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace