RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_CRVSTUFF Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_CRVSTUFF"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_LEGACY_CRVSTUFF = 65800
Public Const TCODE_LEGACY_CRVSTUFF As UInteger = 65800
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace