RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_CURRENT_DIMSTYLE_INDEX Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_CURRENT_DIMSTYLE_INDEX"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_SETTINGS_CURRENT_DIMSTYLE_INDEX = 2684354867
Public Const TCODE_SETTINGS_CURRENT_DIMSTYLE_INDEX As UInteger = 2684354867
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace