RhinoCommon SDK
File3dmTypeCodes.TCODE_ANNOTATION_LEADER Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_ANNOTATION_LEADER"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_ANNOTATION_LEADER = 2097157
Public Const TCODE_ANNOTATION_LEADER As UInteger = 2097157
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace