RhinoCommon SDK
File3dmTypeCodes.TCODE_LINETYPE_RECORD Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LINETYPE_RECORD"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_LINETYPE_RECORD = 536903800
Public Const TCODE_LINETYPE_RECORD As UInteger = 536903800
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace