RhinoCommon SDK
File3dmTypeCodes.TCODE_ANGULAR_DIMENSION Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_ANGULAR_DIMENSION"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_ANGULAR_DIMENSION = 2097159
Public Const TCODE_ANGULAR_DIMENSION As UInteger = 2097159
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace