RhinoCommon SDK
File3dmTypeCodes.TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE = 536903717
Public Const TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE As UInteger = 536903717
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace