RhinoCommon SDK
File3dmTypeCodes.TCODE_DIMSTYLE_TABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DIMSTYLE_TABLE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_DIMSTYLE_TABLE = 268435488
Public Const TCODE_DIMSTYLE_TABLE As UInteger = 268435488
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace