RhinoCommon SDK
File3dmTypeCodes.TCODE_MATERIAL_TABLE Field
rendering materials.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_MATERIAL_TABLE = 268435472
Public Const TCODE_MATERIAL_TABLE As UInteger = 268435472
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace