RhinoCommon SDK
Linetype.Default Method
 Set linetype to default settings.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Default()
Public Sub Default
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace