RhinoCommon SDK
Curve Constructor
 Protected constructor for internal use.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected Curve()
Protected Sub New
See Also
Reference
Curve Class
Curve Overload
Rhino.Geometry Namespace