RhinoCommon SDK
Point2d.Subtraction Operator (Point2d, Point2d)
 Subtracts point2 from point1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector2d operator -(
	Point2d point1,
	Point2d point2
)
Public Shared Operator - (
	point1 As Point2d,
	point2 As Point2d
) As Vector2d
Parameters
point1
Type: Rhino.Geometry.Point2d
A point (minuend).
point2
Type: Rhino.Geometry.Point2d
A point (subtrahend).
Return Value
Type: Vector2d
A new vector that is point1 coordinatewise subtracted by point2.
See Also
Reference
Point2d Structure
Subtraction Overload
Rhino.Geometry Namespace