RhinoCommon SDK
Extrusion Constructor
 Initializes a new instance of the Extrusion class.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Extrusion()
Public Sub New
See Also
Reference
Extrusion Class
Extrusion Overload
Rhino.Geometry Namespace