RhinoCommon SDK
Point2d.Equality Operator
 Determines whether two Point2d have equal values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator ==(
	Point2d a,
	Point2d b
)
Public Shared Operator = (
	a As Point2d,
	b As Point2d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point2d
The first point.
b
Type: Rhino.Geometry.Point2d
The second point.
Return Value
Type: Boolean
true if the coordinates of the two points are exactly equal; otherwise false.
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace