RhinoCommon SDK
Point2d.Division Operator
 Divides a Point2d by a number.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point2d operator /(
	Point2d point,
	double t
)
Public Shared Operator / (
	point As Point2d,
	t As Double
) As Point2d
Parameters
point
Type: Rhino.Geometry.Point2d
A point.
t
Type: System.Double
A number.
Return Value
Type: Point2d
A new point that is coordinatewise divided by t.
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace