RhinoCommon SDK
RealtimeDisplayMode.HudUnlockButtonPressed Event
 Listen tot his event if you want to handle the unlock button control
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event EventHandler HudUnlockButtonPressed
Public Event HudUnlockButtonPressed As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace