RhinoCommon SDK
ImageFile.Saved Event
 Render image file saved, happens when a rendering completes. If a plug-in needs to save additional file information it should write it to the same folder as the Rhino render image file. Rhino will take care of deleting old data.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<ImageFileEventArgs> Saved
Public Shared Event Saved As EventHandler(Of ImageFileEventArgs)
Value
Type: System.EventHandler<ImageFileEventArgs>
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ImageFile Class
Rhino.Render Namespace