RhinoCommon SDK
RealtimeDisplayMode.MaxPassesChanged Event
 Listen to this if you want to handle changes in maximum pass count through the HUD.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event EventHandler<RealtimeDisplayMode.HudMaxPassesChangedEventArgs> MaxPassesChanged
Public Event MaxPassesChanged As EventHandler(Of RealtimeDisplayMode.HudMaxPassesChangedEventArgs)
Value
Type: System.EventHandler<RealtimeDisplayMode.HudMaxPassesChangedEventArgs>
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace