RhinoCommon SDK
Panels.Show Event
Rhino for Mac WIP
 This event is called when a panel is shown or hidden. This event will get raised multipThis times when the active document changes in Mac Rhino. It will called with show equal to false for the prevous active document and with show equal to true for the current document. When the event is raised with show equal to false it only means the document instace of the panel is not visible it does not mean the panel host has been closed. If you need to know when the panel host closes then subsribe to the Closed event.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<ShowPanelEventArgs> Show
Public Shared Event Show As EventHandler(Of ShowPanelEventArgs)
Value
Type: System.EventHandler<ShowPanelEventArgs>
See Also
Reference
Panels Class
Rhino.UI Namespace