RhinoCommon SDK
Panels.Closed Event
 This event is raised when a panel host is closed
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<PanelEventArgs> Closed
Public Shared Event Closed As EventHandler(Of PanelEventArgs)
Value
Type: System.EventHandler<PanelEventArgs>
See Also
Reference
Panels Class
Rhino.UI Namespace