RhinoCommon SDK
File3dmTypeCodes.TCODE_OPENNURBS_CLASS_END Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OPENNURBS_CLASS_END"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_OPENNURBS_CLASS_END = 2147647487
Public Const TCODE_OPENNURBS_CLASS_END As UInteger = 2147647487
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace