RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames.DisableLighting Field
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.DisableLighting"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const string DisableLighting = "disable-lighting"
Public Const DisableLighting As String = "disable-lighting"
Field Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace