RhinoCommon SDK
File3dmTypeCodes.TCODE_MAXIMIZED_VIEWPORT Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_MAXIMIZED_VIEWPORT"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_MAXIMIZED_VIEWPORT = 2181038097
Public Const TCODE_MAXIMIZED_VIEWPORT As UInteger = 2181038097
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace