RhinoCommon SDK
File3dmTypeCodes.TCODE_OLD_MESH_UV Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OLD_MESH_UV"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_OLD_MESH_UV = 1048595
Public Const TCODE_OLD_MESH_UV As UInteger = 1048595
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace