RhinoCommon SDK
File3dmTypeCodes.TCODE_NOTES Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_NOTES"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_NOTES = 33554447
Public Const TCODE_NOTES As UInteger = 33554447
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace