RhinoCommon SDK
File3dmTypeCodes.TCODE_DISPLAY Field
Rhino for Mac WIP
0x0040000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_DISPLAY = 4194304
Public Const TCODE_DISPLAY As UInteger = 4194304
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace