RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames.Reflectivity Field
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.Reflectivity"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const string Reflectivity = "reflectivity"
Public Const Reflectivity As String = "reflectivity"
Field Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace