RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames.Transparency Field
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.Transparency"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const string Transparency = "transparency"
Public Const Transparency As String = "transparency"
Field Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace