RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_MODEL_URL Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_MODEL_URL"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_SETTINGS_MODEL_URL = 536903985
Public Const TCODE_SETTINGS_MODEL_URL As UInteger = 536903985
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace