RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_FACSTUFF Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_FACSTUFF"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_LEGACY_FACSTUFF = 65796
Public Const TCODE_LEGACY_FACSTUFF As UInteger = 65796
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace