RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_CURRENT_FONT_INDEX Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_CURRENT_FONT_INDEX"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SETTINGS_CURRENT_FONT_INDEX = 2684354866
Public Const TCODE_SETTINGS_CURRENT_FONT_INDEX As UInteger = 2684354866
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace