RhinoCommon SDK
File3dmTypeCodes.TCODE_TEXT_BLOCK Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_TEXT_BLOCK"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_TEXT_BLOCK = 2097156
Public Const TCODE_TEXT_BLOCK As UInteger = 2097156
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace