RhinoCommon SDK
File3dmTypeCodes.TCODE_PROPERTIES_OPENNURBS_VERSION Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_PROPERTIES_OPENNURBS_VERSION"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_PROPERTIES_OPENNURBS_VERSION = 2684354598
Public Const TCODE_PROPERTIES_OPENNURBS_VERSION As UInteger = 2684354598
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace