RhinoCommon SDK
File3dmTypeCodes.TCODE_LIGHT_TABLE Field
rendering lights.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_LIGHT_TABLE = 268435474
Public Const TCODE_LIGHT_TABLE As UInteger = 268435474
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace