RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_NAMED_VIEW_LIST Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_NAMED_VIEW_LIST"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_SETTINGS_NAMED_VIEW_LIST = 536903734
Public Const TCODE_SETTINGS_NAMED_VIEW_LIST As UInteger = 536903734
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace