RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_ATTRIBUTES Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_ATTRIBUTES"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_SETTINGS_ATTRIBUTES = 536903988
Public Const TCODE_SETTINGS_ATTRIBUTES As UInteger = 536903988
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace