RhinoCommon SDK
File3dmTypeCodes.TCODE_OBSOLETE_LAYERSET_RECORD Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBSOLETE_LAYERSET_RECORD"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_OBSOLETE_LAYERSET_RECORD = 536903801
Public Const TCODE_OBSOLETE_LAYERSET_RECORD As UInteger = 536903801
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace