RhinoCommon SDK
File3dmTypeCodes.TCODE_CRC Field
Rhino for Mac WIP
0x8000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_CRC = 32768
Public Const TCODE_CRC As UInteger = 32768
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace