RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames.Ior Field
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.Ior"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const string Ior = "ior"
Public Const Ior As String = "ior"
Field Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace