RhinoCommon SDK
File3dmTypeCodes.TCODE_USER_TABLE_UUID Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_USER_TABLE_UUID"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_USER_TABLE_UUID = 536903808
Public Const TCODE_USER_TABLE_UUID As UInteger = 536903808
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace