RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_ANALYSISMESH Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_ANALYSISMESH"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_SETTINGS_ANALYSISMESH = 536903731
Public Const TCODE_SETTINGS_ANALYSISMESH As UInteger = 536903731
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace