RhinoCommon SDK
File3dmTypeCodes.TCODE_OBJECT_RECORD_ATTRIBUTES Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBJECT_RECORD_ATTRIBUTES"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_OBJECT_RECORD_ATTRIBUTES = 33587314
Public Const TCODE_OBJECT_RECORD_ATTRIBUTES As UInteger = 33587314
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace