RhinoCommon SDK
File3dmTypeCodes.TCODE_PROPERTIES_NOTES Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_PROPERTIES_NOTES"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_PROPERTIES_NOTES = 536903714
Public Const TCODE_PROPERTIES_NOTES As UInteger = 536903714
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace