RhinoCommon SDK
File3dmTypeCodes.TCODE_LAYER_OBSELETE_2 Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYER_OBSELETE_2"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_LAYER_OBSELETE_2 = 2151677972
Public Const TCODE_LAYER_OBSELETE_2 As UInteger = 2151677972
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace