RhinoCommon SDK
File3dmTypeCodes.TCODE_CURRENTLAYER Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_CURRENTLAYER"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_CURRENTLAYER = 2151677989
Public Const TCODE_CURRENTLAYER As UInteger = 2151677989
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace