RhinoCommon SDK
File3dmTypeCodes.TCODE_LAYERRENDERABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYERRENDERABLE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_LAYERRENDERABLE = 2151678002
Public Const TCODE_LAYERRENDERABLE As UInteger = 2151678002
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace