RhinoCommon SDK
File3dmTypeCodes.TCODE_RENDER_MATERIAL_ID Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RENDER_MATERIAL_ID"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_RENDER_MATERIAL_ID = 4194311
Public Const TCODE_RENDER_MATERIAL_ID As UInteger = 4194311
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace