RhinoCommon SDK
File3dmTypeCodes.TCODE_TRANSPARENCY Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_TRANSPARENCY"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_TRANSPARENCY = 2151677956
Public Const TCODE_TRANSPARENCY As UInteger = 2151677956
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace