RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEW_POSITION Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_POSITION"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_POSITION = 536906555
Public Const TCODE_VIEW_POSITION As UInteger = 536906555
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace