RhinoCommon SDK
File3dmTypeCodes.TCODE_HATCHPATTERN_RECORD Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_HATCHPATTERN_RECORD"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_HATCHPATTERN_RECORD = 536903799
Public Const TCODE_HATCHPATTERN_RECORD As UInteger = 536903799
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace