RhinoCommon SDK
File3dmTypeCodes.TCODE_TABLEREC Field
0x20000000.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_TABLEREC = 536870912
Public Const TCODE_TABLEREC As UInteger = 536870912
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace