RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEW_WALLPAPER Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_WALLPAPER"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_VIEW_WALLPAPER = 536905531
Public Const TCODE_VIEW_WALLPAPER As UInteger = 536905531
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace