RhinoCommon SDK
FileObjReadOptions.ReadOptions Field
 Rhino's FileReadOptions passed into ReadFile
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileReadOptions ReadOptions
Public ReadOptions As FileReadOptions
Field Value
Type: FileReadOptions
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace