RhinoCommon SDK
File3dmTypeCodes.TCODE_NAMED_CPLANE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_NAMED_CPLANE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_NAMED_CPLANE = 33554436
Public Const TCODE_NAMED_CPLANE As UInteger = 33554436
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace