RhinoCommon SDK
File3dmTypeCodes.TCODE_LAYER_OBSELETE_1 Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYER_OBSELETE_1"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_LAYER_OBSELETE_1 = 2151677971
Public Const TCODE_LAYER_OBSELETE_1 As UInteger = 2151677971
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace