RhinoCommon SDK
File3dmTypeCodes.TCODE_LINEAR_DIMENSION Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LINEAR_DIMENSION"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_LINEAR_DIMENSION = 2097158
Public Const TCODE_LINEAR_DIMENSION As UInteger = 2097158
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace