RhinoCommon SDK
File3dmTypeCodes.TCODE_RH_POINT Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RH_POINT"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_RH_POINT = 1048577
Public Const TCODE_RH_POINT As UInteger = 1048577
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace