RhinoCommon SDK
File3dmTypeCodes.TCODE_SNAPSIZE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SNAPSIZE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_SNAPSIZE = 33554444
Public Const TCODE_SNAPSIZE As UInteger = 33554444
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace