RhinoCommon SDK
File3dmTypeCodes.TCODE_SHOWWORLDAXES Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SHOWWORLDAXES"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_SHOWWORLDAXES = 2181038089
Public Const TCODE_SHOWWORLDAXES As UInteger = 2181038089
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace