RhinoCommon SDK
File3dmTypeCodes.TCODE_LAYERMATERIALINDEX Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYERMATERIALINDEX"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LAYERMATERIALINDEX = 2151678005
Public Const TCODE_LAYERMATERIALINDEX As UInteger = 2151678005
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace