RhinoCommon SDK
File3dmTypeCodes.TCODE_MESH_OBJECT Field
Rhino for Mac WIP
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_MESH_OBJECT"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_MESH_OBJECT = 1048597
Public Const TCODE_MESH_OBJECT As UInteger = 1048597
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace