RhinoCommon SDK
File3dmTypeCodes.TCODE_OBJECT_TABLE Field
Rhino for Mac WIP
geometry and annotation.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_OBJECT_TABLE = 268435475
Public Const TCODE_OBJECT_TABLE As UInteger = 268435475
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace