RhinoCommon SDK
File3dmTypeCodes.TCODE_RHINOIO_OBJECT_NURBS_CURVE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RHINOIO_OBJECT_NURBS_CURVE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_RHINOIO_OBJECT_NURBS_CURVE = 131080
Public Const TCODE_RHINOIO_OBJECT_NURBS_CURVE As UInteger = 131080
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace