RhinoCommon SDK
File3dmTypeCodes.TCODE_OLD_MESH_VERTEX_NORMALS Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OLD_MESH_VERTEX_NORMALS"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_OLD_MESH_VERTEX_NORMALS = 1048594
Public Const TCODE_OLD_MESH_VERTEX_NORMALS As UInteger = 1048594
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace