RhinoCommon SDK
Quaternion.Multiply Operator (Quaternion, Single)
Rhino for Mac WIP
 Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Quaternion operator *(
	Quaternion q,
	float x
)
Public Shared Operator * (
	q As Quaternion,
	x As Single
) As Quaternion
Parameters
q
Type: Rhino.Geometry.Quaternion
A quaternion.
x
Type: System.Single
A number.
Return Value
Type: Quaternion
A new quaternion.
See Also
Reference
Quaternion Structure
Multiply Overload
Rhino.Geometry Namespace