RhinoCommon SDK
CollapsibleSectionHolderImpl.Find Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionHolderImpl.Find(System.IntPtr)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ICollapsibleSectionHolder Find(
	IntPtr cpp
)
Public Shared Function Find (
	cpp As IntPtr
) As ICollapsibleSectionHolder
Parameters
cpp
Type: System.IntPtr
[Missing <param name="cpp"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionHolderImpl.Find(System.IntPtr)"]
Return Value
Type: ICollapsibleSectionHolder
[Missing <returns> documentation for "M:Rhino.UI.Controls.CollapsibleSectionHolderImpl.Find(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CollapsibleSectionHolderImpl Class
Rhino.UI.Controls Namespace