RhinoCommon SDK
Point3d.ToString Method
 Constructs the string representation for the current point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The point representation in the form X,Y,Z.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace