RhinoCommon SDK
RenderWindow.Dispose Method
Releases all resources used by the RenderWindow
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderWindow Class
Rhino.Render Namespace