RhinoCommon SDK
RhinoViewport.GetCameraFrame Method
 Gets the camera plane.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetCameraFrame(
	out Plane frame
)
Public Function GetCameraFrame (
	<OutAttribute> ByRef frame As Plane
) As Boolean
Parameters
frame
Type: Rhino.Geometry.Plane
A plane is assigned to this out parameter during the call, if the operation succeeded.
Return Value
Type: Boolean
true if current camera orientation is valid.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace