RhinoCommon SDK
Brep.MergeCoplanarFaces Method
 Merges adjacent coplanar faces into single faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MergeCoplanarFaces(
	double tolerance
)
Public Function MergeCoplanarFaces (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
3d tolerance for determining when edges are adjacent.
Return Value
Type: Boolean
true if faces were merged. false if no faces were merged.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Brep Class
Rhino.Geometry Namespace