RhinoCommon SDK
LightManagerSupport Constructor
 Default constructor
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected LightManagerSupport()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace