RhinoCommon SDK
DisplayBitmapDrawList Constructor
Initializes a new instance of the DisplayBitmapDrawList class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayBitmapDrawList()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace