RhinoCommon SDK
MouseCallback.OnEndMouseUp Method
 Called at the end of handling of a mouse up event in Rhino. All of the default Rhino mouse down functionality has already been executed unless a MouseCallback has set Cancel to true for the event args. You can tell if this is the case by inpecting the Cancel property in the event args parameter. Base class implementation of this function does nothing
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnEndMouseUp(
	MouseCallbackEventArgs e
)
Protected Overridable Sub OnEndMouseUp (
	e As MouseCallbackEventArgs
)
Parameters
e
Type: Rhino.UI.MouseCallbackEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.UI.MouseCallback.OnEndMouseUp(Rhino.UI.MouseCallbackEventArgs)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MouseCallback Class
Rhino.UI Namespace