RhinoCommon SDK
BrepRegionFaceSide.NonConstOperation Method
[Missing <summary> documentation for "M:Rhino.Geometry.BrepRegionFaceSide.NonConstOperation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void NonConstOperation()
Protected Overrides Sub NonConstOperation
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace