RhinoCommon SDK
Interop.CreateFromNativePointer Method
 Constructs a RhinoCommon Geometry class from a given ON_Geomety*. The ON_Geometry* must be declared on the heap and its lifetime becomes controlled by RhinoCommon.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static GeometryBase CreateFromNativePointer(
	IntPtr pGeometry
)
Public Shared Function CreateFromNativePointer (
	pGeometry As IntPtr
) As GeometryBase
Parameters
pGeometry
Type: System.IntPtr
ON_Geometry*
Return Value
Type: GeometryBase
The appropriate geometry class in RhinoCommon on success.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Interop Class
Rhino.Runtime Namespace