RhinoCommon SDK
HistoryRecord.SetVector3d Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetVector3d(System.Int32,Rhino.Geometry.Vector3d)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetVector3d(
	int id,
	Vector3d value
)
Public Function SetVector3d (
	id As Integer,
	value As Vector3d
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetVector3d(System.Int32,Rhino.Geometry.Vector3d)"]
value
Type: Rhino.Geometry.Vector3d
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetVector3d(System.Int32,Rhino.Geometry.Vector3d)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetVector3d(System.Int32,Rhino.Geometry.Vector3d)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace