RhinoCommon SDK
RhinoViewport.NextConstructionPlane Method
 Sets the construction plane to the plane that was active before the last call to PreviousConstructionPlane.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool NextConstructionPlane()
Public Function NextConstructionPlane As Boolean
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace