RhinoCommon SDK
AnnotationBase.SetUnderline Method
[Missing <summary> documentation for "M:Rhino.Geometry.AnnotationBase.SetUnderline(System.Boolean)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool SetUnderline(
	bool set_on
)
Public Overridable Function SetUnderline (
	set_on As Boolean
) As Boolean
Parameters
set_on
Type: System.Boolean
[Missing <param name="set_on"/> documentation for "M:Rhino.Geometry.AnnotationBase.SetUnderline(System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.SetUnderline(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace