RhinoCommon SDK
PreviewBackground.SetUpPreview Method
 SetUpPreview
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetUpPreview(
	IntPtr sceneServerPointer,
	Guid guid
)
Public Sub SetUpPreview (
	sceneServerPointer As IntPtr,
	guid As Guid
)
Parameters
sceneServerPointer
Type: System.IntPtr
[Missing <param name="sceneServerPointer"/> documentation for "M:Rhino.Render.PreviewBackground.SetUpPreview(System.IntPtr,System.Guid)"]
guid
Type: System.Guid
[Missing <param name="guid"/> documentation for "M:Rhino.Render.PreviewBackground.SetUpPreview(System.IntPtr,System.Guid)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PreviewBackground Class
Rhino.Render Namespace