RhinoCommon SDK
ThumbData Constructor
Initializes a new instance of the ThumbData class
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ThumbData()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace