RhinoCommon SDK
OptionColor.Dispose Method (Boolean)
Releases the unmanaged resources used by the OptionColor and optionally releases the managed resources
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void Dispose(
	bool disposing
)
Protected Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
OptionColor Class
Dispose Overload
Rhino.Input.Custom Namespace