RhinoCommon SDK
MeshNgonList.NgonHasHoles Method
 Determines whether a ngon has holes.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool NgonHasHoles(
	int index
)
Public Function NgonHasHoles (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
Ngon index.
Return Value
Type: Boolean
true for holes (or malformed ngon, see remarks), false for no holes.
Remarks
A slit, for example, will give an edge count that differs from outer edge count despite the lack of true "holes" ie. interior edges that are not shared by more than one face of the ngon in question.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace