RhinoCommon SDK
File3dmNamedConstructionPlanes.Add Method (String, Plane)
 Adds a named construction plane to the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add(
	string name,
	Plane plane
)
Public Function Add (
	name As String,
	plane As Plane
) As Integer
Parameters
name
Type: System.String
 The name of the named construction plane.
plane
Type: Rhino.Geometry.Plane
The plane value.
Return Value
Type: Int32
 0 based index of the named construction plane. -1 on failure.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
File3dmNamedConstructionPlanes Class
Add Overload
Rhino.FileIO Namespace