RhinoCommon SDK
RenderTexture.GetPreviewLocalMapping Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetPreviewLocalMapping"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetPreviewLocalMapping()
Public Function GetPreviewLocalMapping As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetPreviewLocalMapping"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderTexture Class
Rhino.Render Namespace