RhinoCommon SDK
WaitCursor.Dispose Method
Releases all resources used by the WaitCursor
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
WaitCursor Class
Rhino.UI Namespace