RhinoCommon SDK
Decal.Dispose Method (Boolean)
Releases the unmanaged resources used by the Decal and optionally releases the managed resources
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose(
	bool isDisposing
)
Public Sub Dispose (
	isDisposing As Boolean
)
Parameters
isDisposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Decal Class
Dispose Overload
Rhino.Render Namespace