RhinoCommon SDK
RhinoViewport.MouseTilt Method
 Tilts the camera view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MouseTilt(
	Point mousePreviousPoint,
	Point mouseCurrentPoint
)
Public Function MouseTilt (
	mousePreviousPoint As Point,
	mouseCurrentPoint As Point
) As Boolean
Parameters
mousePreviousPoint
Type: System.Drawing.Point
The mouse previous point.
mouseCurrentPoint
Type: System.Drawing.Point
The mouse current point.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.MouseTilt(System.Drawing.Point,System.Drawing.Point)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace