RhinoCommon SDK
BinaryArchiveReader.ReadSingle Method
 Reads a Single from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float ReadSingle()
Public Function ReadSingle As Single
Return Value
Type: Single
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace