RhinoCommon SDK
ObjectPropertiesPage.OnHelp Method
 Called when the F1 key or help button is pressed, override to display plug-in specific help for this page.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void OnHelp()
Public Overridable Sub OnHelp
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace