RhinoCommon SDK
DisplayPipeline.IsVisible Method (BoundingBox)
 Test a given box for visibility inside the view frustum under the current viewport and model transformation settings.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsVisible(
	BoundingBox bbox
)
Public Function IsVisible (
	bbox As BoundingBox
) As Boolean
Parameters
bbox
Type: Rhino.Geometry.BoundingBox
Box to test for visibility.
Return Value
Type: Boolean
true if at least some portion of the box is visible, false if not.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
IsVisible Overload
Rhino.Display Namespace