RhinoCommon SDK
ObjectAttributes.DeleteUserString Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.DeleteUserString(System.String)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DeleteUserString(
	string key
)
Public Function DeleteUserString (
	key As String
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.DeleteUserString(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.DeleteUserString(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace