RhinoCommon SDK
Mesh.SetCachedTextureCoordinates Method
 Set cached texture coordinates using the specified mapping.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetCachedTextureCoordinates(
	TextureMapping tm,
	ref Transform xf
)
Public Sub SetCachedTextureCoordinates (
	tm As TextureMapping,
	ByRef xf As Transform
)
Parameters
tm
Type: Rhino.Render.TextureMapping
[Missing <param name="tm"/> documentation for "M:Rhino.Geometry.Mesh.SetCachedTextureCoordinates(Rhino.Render.TextureMapping,Rhino.Geometry.Transform@)"]
xf
Type: Rhino.Geometry.Transform
[Missing <param name="xf"/> documentation for "M:Rhino.Geometry.Mesh.SetCachedTextureCoordinates(Rhino.Render.TextureMapping,Rhino.Geometry.Transform@)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Mesh Class
Rhino.Geometry Namespace