RhinoCommon SDK
MeshNgon.BoundaryVertexIndexList Method
 Get the outer boundary mesh vertex list of the ngon.
Vertices are sorted counterclockwise with respect to the direction of the face, although the degree by which vertex normals will respect this might vary.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint[] BoundaryVertexIndexList()
Public Function BoundaryVertexIndexList As UInteger()
Return Value
Type: UInt32[]
A list of mesh vertex indexes.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace
Rhino.Geometry.MeshNgon