RhinoCommon SDK
Field.ValueAsBool Method
 Return field value as a bool.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected bool ValueAsBool()
Protected Function ValueAsBool As Boolean
Return Value
Type: Boolean
Returns field value as a bool.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Field Class
Rhino.Render.Fields Namespace