RhinoCommon SDK
RenderWindow.OpenChannel Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.OpenChannel(Rhino.Render.RenderWindow.StandardChannels)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderWindow.Channel OpenChannel(
	RenderWindow.StandardChannels id
)
Public Function OpenChannel (
	id As RenderWindow.StandardChannels
) As RenderWindow.Channel
Parameters
id
Type: Rhino.Render.RenderWindow.StandardChannels
[Missing <param name="id"/> documentation for "M:Rhino.Render.RenderWindow.OpenChannel(Rhino.Render.RenderWindow.StandardChannels)"]
Return Value
Type: RenderWindow.Channel
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.OpenChannel(Rhino.Render.RenderWindow.StandardChannels)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
RenderWindow Class
Rhino.Render Namespace