RhinoCommon SDK
ObjectPropertiesPage.OnSizeParent Method
 Called when the parent containers client rectangle size has changed and the PageControl has been resized.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void OnSizeParent(
	int width,
	int height
)
Public Overridable Sub OnSizeParent (
	width As Integer,
	height As Integer
)
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.OnSizeParent(System.Int32,System.Int32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.OnSizeParent(System.Int32,System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace