RhinoCommon SDK
AnnotationBase.PlainTextToRtf Method
[Missing <summary> documentation for "M:Rhino.Geometry.AnnotationBase.PlainTextToRtf(System.String)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string PlainTextToRtf(
	string str
)
Public Shared Function PlainTextToRtf (
	str As String
) As String
Parameters
str
Type: System.String
[Missing <param name="str"/> documentation for "M:Rhino.Geometry.AnnotationBase.PlainTextToRtf(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.PlainTextToRtf(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace