RhinoCommon SDK
Unroller.AddFollowingGeometry Method (Point3d)
 Adds a point that should be unrolled along with the surface/brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddFollowingGeometry(
	Point3d point
)
Public Sub AddFollowingGeometry (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace