RhinoCommon SDK
Mesh.DuplicateMesh Method
Constructs a copy of this mesh. This is the same as Duplicate().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh DuplicateMesh()
Public Function DuplicateMesh As Mesh
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.DuplicateMesh"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Mesh Class
Rhino.Geometry Namespace