RhinoCommon SDK
ObjectPropertiesPageEventArgs Constructor
 Used by ObjectPropertiesPage to notify the page when updating, modifying or determining if the page should be included in the navigation bar
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectPropertiesPageEventArgs(
	ObjectPropertiesPage page
)
Public Sub New (
	page As ObjectPropertiesPage
)
Parameters
page
Type: Rhino.UI.ObjectPropertiesPage
 Page sending the message
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace