RhinoCommon SDK
NamedPositionTable.Name Method
Name of a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name(
	Guid id
)
Public Function Name (
	id As Guid
) As String
Parameters
id
Type: System.Guid
 Guid of the Named Position for which you want to retrieve the name.
Return Value
Type: String
 The name of the Named Position as a string.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace