RhinoCommon SDK
File3dmObjectTable.AddTextDot Method (TextDot, ObjectAttributes)
Adds a text dot object to Rhino.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddTextDot(
	TextDot dot,
	ObjectAttributes attributes
)
Public Function AddTextDot (
	dot As TextDot,
	attributes As ObjectAttributes
) As Guid
Parameters
dot
Type: Rhino.Geometry.TextDot
The text dot.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to link with curve.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmObjectTable Class
AddTextDot Overload
Rhino.FileIO Namespace