RhinoCommon SDK
RdkSelectionNavigator.Clear Method
 Clear the navigator.
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace