RhinoCommon SDK
ModelComponent.LockIndex Method
 Locks the component Index property.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void LockIndex()
Public Sub LockIndex
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace