RhinoCommon SDK
GetObject.SetPressEnterWhenDonePrompt Method
 The default prompt when EnablePressEnterWhenDonePrompt is enabled is "Press Enter when done". Use this function to specify a different string to be appended.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetPressEnterWhenDonePrompt(
	string prompt
)
Public Sub SetPressEnterWhenDonePrompt (
	prompt As String
)
Parameters
prompt
Type: System.String
The text that will be displayed just after the prompt, after the selection has been made.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace