RhinoCommon SDK
Matrix.SetDiagonal Method
 Sets diagonal value and zeros off all non-diagonal values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDiagonal(
	double d
)
Public Sub SetDiagonal (
	d As Double
)
Parameters
d
Type: System.Double
The new diagonal value.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Matrix Class
Rhino.Geometry Namespace