RhinoCommon SDK
Point3d Implicit Conversion (Point3f to Point3d)
 Converts a single-precision point in a double-precision point, without needing casting.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static implicit operator Point3d (
	Point3f point
)
Public Shared Widening Operator CType (
	point As Point3f
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3f
A point.
Return Value
Type: Point3d
The resulting point.
See Also
Reference
Point3d Structure
Implicit Overload
Rhino.Geometry Namespace