RhinoCommon SDK
ZBufferCapture.SetDisplayMode Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.SetDisplayMode(System.Guid)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDisplayMode(
	Guid modeId
)
Public Sub SetDisplayMode (
	modeId As Guid
)
Parameters
modeId
Type: System.Guid
[Missing <param name="modeId"/> documentation for "M:Rhino.Display.ZBufferCapture.SetDisplayMode(System.Guid)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace