RhinoCommon SDK
ManifestTable.GetModelComponentTypeFromGenericType<T> Method
 Returns the result of the ComponentType property of a ModelComponent.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ModelComponentType GetModelComponentTypeFromGenericType<T>()
where T : ModelComponent
Public Shared Function GetModelComponentTypeFromGenericType(Of T As ModelComponent) As ModelComponentType
Type Parameters
T
A model component type.
Return Value
Type: ModelComponentType
A ModelComponentType.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace