RhinoCommon SDK
Panels.OnClosePanel Method
Rhino for Mac WIP
 Call this method to raise the Closed event
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void OnClosePanel(
	Guid panelId,
	uint documentSerialNumber
)
Public Shared Sub OnClosePanel (
	panelId As Guid,
	documentSerialNumber As UInteger
)
Parameters
panelId
Type: System.Guid
Panel identifier.
documentSerialNumber
Type: System.UInt32
The document associated with the closed panel.
See Also
Reference
Panels Class
Rhino.UI Namespace