RhinoCommon SDK
TextureEvaluator.GetColor Method
 Get the color of the texture at a particular point in uvw space. May be called from within a rendering shade pipeline. note For ray differentials see Pharr Humphreys, "Physically Based Rendering", chapter 11.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual Color4f GetColor(
	Point3d uvw,
	Vector3d duvwdx,
	Vector3d duvwdy
)
Public Overridable Function GetColor (
	uvw As Point3d,
	duvwdx As Vector3d,
	duvwdy As Vector3d
) As Color4f
Parameters
uvw
Type: Rhino.Geometry.Point3d
is the point for which to evaluate the texture.
duvwdx
Type: Rhino.Geometry.Vector3d
duvwdx is a ray differential.
duvwdy
Type: Rhino.Geometry.Vector3d
duvwdy is a ray differential.
Return Value
Type: Color4f
The texture color at this point in UV space.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace