RhinoCommon SDK
ViewCapture.CaptureToBitmap Method (ViewCaptureSettings)
[Missing <summary> documentation for "M:Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.ViewCaptureSettings)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Bitmap CaptureToBitmap(
	ViewCaptureSettings settings
)
Public Shared Function CaptureToBitmap (
	settings As ViewCaptureSettings
) As Bitmap
Parameters
settings
Type: Rhino.Display.ViewCaptureSettings
[Missing <param name="settings"/> documentation for "M:Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.ViewCaptureSettings)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.ViewCaptureSettings)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewCapture Class
CaptureToBitmap Overload
Rhino.Display Namespace