RhinoCommon SDK
RenderSettings Constructor
 Initialize a new instance of the RenderSettings class.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderSettings()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderSettings Class
RenderSettings Overload
Rhino.Render Namespace