RhinoCommon SDK
CustomDisplay.Dispose Method
 Dispose this CustomDisplay instance. You must call this function in order to properly shut down the CustomDisplay.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace