RhinoCommon SDK
HistoryRecord.SetMesh Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetMesh(System.Int32,Rhino.Geometry.Mesh)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetMesh(
	int id,
	Mesh value
)
Public Function SetMesh (
	id As Integer,
	value As Mesh
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetMesh(System.Int32,Rhino.Geometry.Mesh)"]
value
Type: Rhino.Geometry.Mesh
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetMesh(System.Int32,Rhino.Geometry.Mesh)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetMesh(System.Int32,Rhino.Geometry.Mesh)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace