RhinoCommon SDK
Field.ValueAsVector3d Method
 Return field as a Rhino.Geometry.Vector3d color value.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Vector3d ValueAsVector3d()
Protected Function ValueAsVector3d As Vector3d
Return Value
Type: Vector3d
Return field as a Rhino.Geometry.Vector3d color value.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Field Class
Rhino.Render.Fields Namespace