RhinoCommon SDK
Curve.IsPlanar Method (Double)
Test a curve for planarity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPlanar(
	double tolerance
)
Public Function IsPlanar (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
Tolerance to use when checking.
Return Value
Type: Boolean
 true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Curve Class
IsPlanar Overload
Rhino.Geometry Namespace