RhinoCommon SDK
Vector3f.Inequality Operator
 Determines whether two vectors have different values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator !=(
	Vector3f a,
	Vector3f b
)
Public Shared Operator <> (
	a As Vector3f,
	b As Vector3f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector3f
The first vector.
b
Type: Rhino.Geometry.Vector3f
The second vector.
Return Value
Type: Boolean
true if the two vectors differ in any component; false otherwise.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace