RhinoCommon SDK
IRhRdkThumbnailList.SetCustomBitmapSize Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetCustomBitmapSize(System.Int32,System.Int32)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void SetCustomBitmapSize(
	int w,
	int h
)
Sub SetCustomBitmapSize (
	w As Integer,
	h As Integer
)
Parameters
w
Type: System.Int32
[Missing <param name="w"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetCustomBitmapSize(System.Int32,System.Int32)"]
h
Type: System.Int32
[Missing <param name="h"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetCustomBitmapSize(System.Int32,System.Int32)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace