RhinoCommon SDK
BrepEdge.TrimIndices Method
 Gets the indices of all trims associated with this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] TrimIndices()
Public Function TrimIndices As Integer()
Return Value
Type: Int32[]
Empty array on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace