RhinoCommon SDK
File3dmObjectTable.AddSphere Method (Sphere, ObjectAttributes)
 Adds a surface object to the document representing a sphere.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddSphere(
	Sphere sphere,
	ObjectAttributes attributes
)
Public Function AddSphere (
	sphere As Sphere,
	attributes As ObjectAttributes
) As Guid
Parameters
sphere
Type: Rhino.Geometry.Sphere
A sphere to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to link with the sphere.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmObjectTable Class
AddSphere Overload
Rhino.FileIO Namespace