RhinoCommon SDK
Mesh.RebuildNormals Method
 Removes mesh normals and reconstructs the face and vertex normals based on the orientation of the faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RebuildNormals()
Public Sub RebuildNormals
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Mesh Class
Rhino.Geometry Namespace