RhinoCommon SDK
LengthValue.Finalize Method
passively reclaim native allocated ON_LenghtValue*
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LengthValue Class
Rhino Namespace