RhinoCommon SDK
LayerTable.GetSelected Method
 Returns the indices of layers that are selected on the Layer user interface.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetSelected(
	out List<int> layerIndices
)
Public Function GetSelected (
	<OutAttribute> ByRef layerIndices As List(Of Integer)
) As Boolean
Parameters
layerIndices
Type: System.Collections.Generic.List<Int32>
The indices of selected layers.
Return Value
Type: Boolean
true if the layer user inteface is visible, false otherwise.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace