RhinoCommon SDK
ManifestTable.Clear Method
 Marks all items as deleted.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void Clear()
Public Overridable Sub Clear
Implements
ICollection<T>.Clear()
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace