RhinoCommon SDK
Mesh.GetMeshes Method
 Get a SimpleArrayMeshPointer containing all meshes for the related Mesh
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh[] GetMeshes()
Public Function GetMeshes As Mesh()
Return Value
Type: Mesh[]
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.Mesh.GetMeshes"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace