RhinoCommon SDK
HistoryRecord.SetBool Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetBool(System.Int32,System.Boolean)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetBool(
	int id,
	bool value
)
Public Function SetBool (
	id As Integer,
	value As Boolean
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetBool(System.Int32,System.Boolean)"]
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetBool(System.Int32,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetBool(System.Int32,System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace