RhinoCommon SDK
BoundingBox.ToString Method
 Constructs the string representation of this aligned boundingbox.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
Text.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace