RhinoCommon SDK
UserData.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
UserData Class
Dispose Overload
Rhino.DocObjects.Custom Namespace