RhinoCommon SDK
NamedPositionTable.Restore Method (Guid)
Restore a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Restore(
	Guid id
)
Public Function Restore (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
 Guid of the Named Position to restore.
Return Value
Type: Boolean
 True or False based on whether the Named Position was able to be restored.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NamedPositionTable Class
Restore Overload
Rhino.DocObjects.Tables Namespace