RhinoCommon SDK
EarthAnchorPoint Constructor
 Initializes a new instance of the EarthAnchorPoint class.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public EarthAnchorPoint()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace