RhinoCommon SDK
Line.DistanceTo Method
 Compute the shortest distance between this line segment and a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double DistanceTo(
	Point3d testPoint,
	bool limitToFiniteSegment
)
Public Function DistanceTo (
	testPoint As Point3d,
	limitToFiniteSegment As Boolean
) As Double
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point for distance computation.
limitToFiniteSegment
Type: System.Boolean
If true, the distance is limited to the finite line segment.
Return Value
Type: Double
The shortest distance between this line segment and testPoint.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Line Structure
Rhino.Geometry Namespace