RhinoCommon SDK
File3dmObject.Equals Method (File3dmObject)
 Verified that two File3dmObject items refer to the same object in a document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	File3dmObject other
)
Public Function Equals (
	other As File3dmObject
) As Boolean
Parameters
other
Type: Rhino.FileIO.File3dmObject
The other item to test.
Return Value
Type: Boolean
true is the two objects coincide.
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmObject Class
Equals Overload
Rhino.FileIO Namespace