RhinoCommon SDK
Layer.SetPerViewportPlotColor Method
 Sets the plot color for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetPerViewportPlotColor(
	Guid viewportId,
	Color color
)
Public Sub SetPerViewportPlotColor (
	viewportId As Guid,
	color As Color
)
Parameters
viewportId
Type: System.Guid
If not Guid.Empty, then the setting applies only to the viewport with the specified id.
color
Type: System.Drawing.Color
The plot color.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Layer Class
Rhino.DocObjects Namespace