RhinoCommon SDK
GumballAppearanceSettings Constructor
Initializes a new instance of the GumballAppearanceSettings class
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GumballAppearanceSettings()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace