RhinoCommon SDK
Point3f.Inequality Operator
Rhino for Mac WIP
 Determines whether two points have different values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator !=(
	Point3f a,
	Point3f b
)
Public Shared Operator <> (
	a As Point3f,
	b As Point3f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point3f
The first point.
b
Type: Rhino.Geometry.Point3f
The second point.
Return Value
Type: Boolean
true if the two points differ in any coordinate; false otherwise.
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace