RhinoCommon SDK
RenderMaterialTable.Add Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterialTable.Add(Rhino.Render.RenderMaterial)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Add(
	RenderMaterial c
)
Public Function Add (
	c As RenderMaterial
) As Boolean
Parameters
c
Type: Rhino.Render.RenderMaterial
[Missing <param name="c"/> documentation for "M:Rhino.Render.RenderMaterialTable.Add(Rhino.Render.RenderMaterial)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterialTable.Add(Rhino.Render.RenderMaterial)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
RenderMaterialTable Class
Rhino.Render Namespace