RhinoCommon SDK
LinearDimension.GetTextRectangle Method
[Missing <summary> documentation for "M:Rhino.Geometry.LinearDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetTextRectangle(
	out Point3d[] corners
)
Public Function GetTextRectangle (
	<OutAttribute> ByRef corners As Point3d()
) As Boolean
Parameters
corners
Type: Rhino.Geometry.Point3d[]
[Missing <param name="corners"/> documentation for "M:Rhino.Geometry.LinearDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.LinearDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace