RhinoCommon SDK
CustomGripObject.Dispose Method
Releases all resources used by the CustomGripObject
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomGripObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace