RhinoCommon SDK
MeshUnsafeLock.Release Method
 Releases the lock and updates the underlying unmanaged data structures.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Release()
Public Sub Release
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshUnsafeLock Class
Rhino.Geometry Namespace