RhinoCommon SDK
Brep.RemoveHoles Method
 Remove all inner loops, or holes, in a Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep RemoveHoles(
	double tolerance
)
Public Function RemoveHoles (
	tolerance As Double
) As Brep
Parameters
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
Return Value
Type: Brep
The Brep without holes if successful, null otherwise.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Brep Class
Rhino.Geometry Namespace