RhinoCommon SDK
Transform.Transpose Method
 Flip row/column values
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform Transpose()
Public Function Transpose As Transform
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.Geometry.Transform.Transpose"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Transform Structure
Rhino.Geometry Namespace