RhinoCommon SDK
Point2d.CompareTo Method
 Compares this Point2d with another Point2d.
Coordinates evaluation priority is first X, then Y.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CompareTo(
	Point2d other
)
Public Function CompareTo (
	other As Point2d
) As Integer
Parameters
other
Type: Rhino.Geometry.Point2d
The other Point2d to use in comparison.
Return Value
Type: Int32
 0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
+1: otherwise.
Implements
IComparable<T>.CompareTo(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace