RhinoCommon SDK
GetPolyline.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetPolyline Class
Dispose Overload
Rhino.Input.Custom Namespace