RhinoCommon SDK
Unroller.FollowingGeometryIndex Method (Curve)
 Given an unrolled curve, returns the index of the source, or following curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FollowingGeometryIndex(
	Curve curve
)
Public Function FollowingGeometryIndex (
	curve As Curve
) As Integer
Parameters
curve
Type: Rhino.Geometry.Curve
An unrolled curve returned by Unroller.PerformUnroll.
Return Value
Type: Int32
The index of the curve added by Unroller.AddFollowingGeometry if successful, otherwise -1.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Unroller Class
FollowingGeometryIndex Overload
Rhino.Geometry Namespace