RhinoCommon SDK
Surface.IsCylinder Method
 Determines if the surface is a portion of a cylinder within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCylinder()
Public Function IsCylinder As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a cylinder.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Surface Class
IsCylinder Overload
Rhino.Geometry Namespace