RhinoCommon SDK
Decal.Dispose Method
Releases all resources used by the Decal
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Decal Class
Dispose Overload
Rhino.Render Namespace