RhinoCommon SDK
RefinementSettings Constructor
 Creates a default operation settings object.
 Namespace: Rhino.Geometry.MeshRefinements
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RefinementSettings()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RefinementSettings Class
Rhino.Geometry.MeshRefinements Namespace