RhinoCommon SDK
RenderPrimitiveList.SetInstanceTransform Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPrimitiveList.SetInstanceTransform(System.Int32,Rhino.Geometry.Transform)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetInstanceTransform(
	int index,
	Transform xform
)
Public Sub SetInstanceTransform (
	index As Integer,
	xform As Transform
)
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Render.RenderPrimitiveList.SetInstanceTransform(System.Int32,Rhino.Geometry.Transform)"]
xform
Type: Rhino.Geometry.Transform
[Missing <param name="xform"/> documentation for "M:Rhino.Render.RenderPrimitiveList.SetInstanceTransform(System.Int32,Rhino.Geometry.Transform)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace