RhinoCommon SDK
Extrusion.GetPathPlane Method
 Gets the 3D plane perpendicular to the path at a normalized path parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane GetPathPlane(
	double s
)
Public Function GetPathPlane (
	s As Double
) As Plane
Parameters
s
Type: System.Double
 0.0 = starting profile 1.0 = ending profile.
Return Value
Type: Plane
A plane. The plane is Invalid on failure.
Remarks
 When no mitering is happening, GetPathPlane() and GetProfilePlane() return the same plane.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace