RhinoCommon SDK
ColorCMYK Constructor (Double, Double, Double)
 Initializes a new instance of ColorCMYK with custom channel values. The cyan, magenta and yellow values will be adjusted based on their combined darkness.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ColorCMYK(
	double cyan,
	double magenta,
	double yellow
)
Public Sub New (
	cyan As Double,
	magenta As Double,
	yellow As Double
)
Parameters
cyan
Type: System.Double
Cyan channel hint.
magenta
Type: System.Double
Magenta channel hint.
yellow
Type: System.Double
Yellow channel hint.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorCMYK Structure
ColorCMYK Overload
Rhino.Display Namespace