RhinoCommon SDK
DisplayPipeline.Draw3dText Method (Text3d, Color, Point3d)
 Draws 3d text using the Text3d plane with an adjusted origin.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Draw3dText(
	Text3d text,
	Color color,
	Point3d textPlaneOrigin
)
Public Sub Draw3dText (
	text As Text3d,
	color As Color,
	textPlaneOrigin As Point3d
)
Parameters
text
Type: Rhino.Display.Text3d
The string to draw.
color
Type: System.Drawing.Color
Text color.
textPlaneOrigin
Type: Rhino.Geometry.Point3d
The origin of the plane to draw.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
Draw3dText Overload
Rhino.Display Namespace