RhinoCommon SDK
File3dmObjectTable.AddPoint Method (Point3d, ObjectAttributes)
Adds a point object to the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddPoint(
	Point3d point,
	ObjectAttributes attributes
)
Public Function AddPoint (
	point As Point3d,
	attributes As ObjectAttributes
) As Guid
Parameters
point
Type: Rhino.Geometry.Point3d
A location for point.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to point.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmObjectTable Class
AddPoint Overload
Rhino.FileIO Namespace