RhinoCommon SDK
Utilities.SafeFrameEnabled Method
 Queries whether or not the Safe Frame is visible.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SafeFrameEnabled(
	RhinoDoc doc
)
Public Shared Function SafeFrameEnabled (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.Utilities.SafeFrameEnabled(Rhino.RhinoDoc)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.Utilities.SafeFrameEnabled(Rhino.RhinoDoc)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Utilities Class
Rhino.Render Namespace