RhinoCommon SDK
Transform.Shear Method
 Constructs a Shear transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Transform Shear(
	Plane plane,
	Vector3d x,
	Vector3d y,
	Vector3d z
)
Public Shared Function Shear (
	plane As Plane,
	x As Vector3d,
	y As Vector3d,
	z As Vector3d
) As Transform
Parameters
plane
Type: Rhino.Geometry.Plane
Base plane for shear.
x
Type: Rhino.Geometry.Vector3d
Shearing vector along plane x-axis.
y
Type: Rhino.Geometry.Vector3d
Shearing vector along plane y-axis.
z
Type: Rhino.Geometry.Vector3d
Shearing vector along plane z-axis.
Return Value
Type: Transform
A transformation matrix which shear geometry.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Transform Structure
Rhino.Geometry Namespace