RhinoCommon SDK
FileReference.Dispose Method
 Reclaims unmanaged resources used by this object.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileReference Class
Rhino.FileIO Namespace