RhinoCommon SDK
HistoryRecord.SetColor Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetColor(System.Int32,System.Drawing.Color)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetColor(
	int id,
	Color value
)
Public Function SetColor (
	id As Integer,
	value As Color
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetColor(System.Int32,System.Drawing.Color)"]
value
Type: System.Drawing.Color
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetColor(System.Int32,System.Drawing.Color)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetColor(System.Int32,System.Drawing.Color)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace