RhinoCommon SDK
FileWriteOptions Constructor
Initializes a new instance of the FileWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileWriteOptions()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace