RhinoCommon SDK
SupportOptions.PreferNativeRenderer Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.PreferNativeRenderer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool PreferNativeRenderer()
Public Shared Function PreferNativeRenderer As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.PreferNativeRenderer"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SupportOptions Class
Rhino.Render Namespace