RhinoCommon SDK
Surface.TryGetTorus Method (Torus)
Tests a surface to see if it is a portion of a torus within RhinoMath.ZeroTolerance and returns the torus.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetTorus(
	out Torus torus
)
Public Function TryGetTorus (
	<OutAttribute> ByRef torus As Torus
) As Boolean
Parameters
torus
Type: Rhino.Geometry.Torus
On success, the torus parameters are filled in.
Return Value
Type: Boolean
true if the surface is a portion of a torus.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Surface Class
TryGetTorus Overload
Rhino.Geometry Namespace