RhinoCommon SDK
ColorXYZ Implicit Conversion (ColorXYZ to Color)
Rhino for Mac WIP
 Implicitly converts a XYZ color into a .Net library color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static implicit operator Color (
	ColorXYZ xyz
)
Public Shared Widening Operator CType (
	xyz As ColorXYZ
) As Color
Parameters
xyz
Type: Rhino.Display.ColorXYZ
A XYZ color.
Return Value
Type: Color
A ARGB .Net library color.
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace