RhinoCommon SDK
Field.ValueAsDateTime Method
 Return field as a DateTime value.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected DateTime ValueAsDateTime()
Protected Function ValueAsDateTime As DateTime
Return Value
Type: DateTime
Return field as a DateTime value.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Field Class
Rhino.Render.Fields Namespace