RhinoCommon SDK
SHA1OpenNURBS.StringHash Method
 Computes the SHA1 hash of a string, converted to UTF8.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static byte[] StringHash(
	string input
)
Public Shared Function StringHash (
	input As String
) As Byte()
Parameters
input
Type: System.String
[Missing <param name="input"/> documentation for "M:Rhino.FileIO.SHA1OpenNURBS.StringHash(System.String)"]
Return Value
Type: Byte[]
A 20-byte long SHA1 hash.
Exceptions
Exception | Condition
ArgumentNullException | When input is null.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
SHA1OpenNURBS Class
Rhino.FileIO Namespace