RhinoCommon SDK
BitmapTable.ExportToFile Method
Writes a bitmap to a file.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExportToFile(
	int index,
	string path
)
Public Function ExportToFile (
	index As Integer,
	path As String
) As Boolean
Parameters
index
Type: System.Int32
The index of the bitmap to be written.
path
Type: System.String
 The full path, including file name and extension, name of the file to write.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace