RhinoCommon SDK
File3dmNamedConstructionPlanes.Delete Method (ConstructionPlane)
 Deletes a named construction plane from the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Delete(
	ConstructionPlane cplane
)
Public Function Delete (
	cplane As ConstructionPlane
) As Boolean
Parameters
cplane
Type: Rhino.DocObjects.ConstructionPlane
The construction plane to delete.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmNamedConstructionPlanes.Delete(Rhino.DocObjects.ConstructionPlane)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
File3dmNamedConstructionPlanes Class
Delete Overload
Rhino.FileIO Namespace