RhinoCommon SDK
HistoryRecord.SetGuid Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetGuid(System.Int32,System.Guid)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetGuid(
	int id,
	Guid value
)
Public Function SetGuid (
	id As Integer,
	value As Guid
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetGuid(System.Int32,System.Guid)"]
value
Type: System.Guid
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetGuid(System.Int32,System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetGuid(System.Int32,System.Guid)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace