RhinoCommon SDK
ClippingPlaneSurface.ViewportIds Method
 Returns Ids of viewports that this clipping plane is supposed to clip.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid[] ViewportIds()
Public Function ViewportIds As Guid()
Return Value
Type: Guid[]
An array of globally unique ideantifiers (Guids) to the viewports.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace