RhinoCommon SDK
BinaryArchiveReader.ReadBoundingBox Method
 Reads a BoundingBox from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox ReadBoundingBox()
Public Function ReadBoundingBox As BoundingBox
Return Value
Type: BoundingBox
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace