RhinoCommon SDK
BinaryArchiveReader.ReadGuid Method
 Reads a Guid from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ReadGuid()
Public Function ReadGuid As Guid
Return Value
Type: Guid
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace