RhinoCommon SDK
SimulatedEnvironment.Dispose Method
Releases all resources used by the SimulatedEnvironment
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
SimulatedEnvironment Class
Dispose Overload
Rhino.Render Namespace