RhinoCommon SDK
MeshNgonList.RemoveAt Method
 Removes an ngon from the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RemoveAt(
	int index
)
Public Sub RemoveAt (
	index As Integer
)
Parameters
index
Type: System.Int32
The index of the ngon.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace