RhinoCommon SDK
BinaryArchiveWriter.WriteRay3d Method
 Writes a Ray3d value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteRay3d(
	Ray3d value
)
Public Sub WriteRay3d (
	value As Ray3d
)
Parameters
value
Type: Rhino.Geometry.Ray3d
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace