RhinoCommon SDK
DimensionStyle.ClearFieldOverride Method
 Set the field as not overridden
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearFieldOverride(
	DimensionStyle.Field field
)
Public Sub ClearFieldOverride (
	field As DimensionStyle.Field
)
Parameters
field
Type: Rhino.DocObjects.DimensionStyle.Field
[Missing <param name="field"/> documentation for "M:Rhino.DocObjects.DimensionStyle.ClearFieldOverride(Rhino.DocObjects.DimensionStyle.Field)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace