RhinoCommon SDK
MeshTextureCoordinateList.Clear Method
 Clears the Texture Coordinate list on the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace