RhinoCommon SDK
SimulatedEnvironment.ProjectionFromString Method
[Missing <summary> documentation for "M:Rhino.Render.SimulatedEnvironment.ProjectionFromString(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static SimulatedEnvironment.BackgroundProjections ProjectionFromString(
	string projection
)
Public Shared Function ProjectionFromString (
	projection As String
) As SimulatedEnvironment.BackgroundProjections
Parameters
projection
Type: System.String
[Missing <param name="projection"/> documentation for "M:Rhino.Render.SimulatedEnvironment.ProjectionFromString(System.String)"]
Return Value
Type: SimulatedEnvironment.BackgroundProjections
[Missing <returns> documentation for "M:Rhino.Render.SimulatedEnvironment.ProjectionFromString(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace