RhinoCommon SDK
RenderTextureTable.Add Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTextureTable.Add(Rhino.Render.RenderTexture)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Add(
	RenderTexture c
)
Public Function Add (
	c As RenderTexture
) As Boolean
Parameters
c
Type: Rhino.Render.RenderTexture
[Missing <param name="c"/> documentation for "M:Rhino.Render.RenderTextureTable.Add(Rhino.Render.RenderTexture)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTextureTable.Add(Rhino.Render.RenderTexture)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderTextureTable Class
Rhino.Render Namespace