RhinoCommon SDK
PreviewAppearance.ToMetaData Method
 Copy PreviewAppearance to MetaData
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ToMetaData()
Public Sub ToMetaData
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace