RhinoCommon SDK
Vector3d Constructor (Vector3d)
 Initializes a new instance of a vector, copying the three components from a vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d(
	Vector3d vector
)
Public Sub New (
	vector As Vector3d
)
Parameters
vector
Type: Rhino.Geometry.Vector3d
A double-precision vector.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector3d Structure
Vector3d Overload
Rhino.Geometry Namespace