RhinoCommon SDK
File3dmObjectTable.AddMesh Method (Mesh, ObjectAttributes)
Adds a mesh object to Rhino.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddMesh(
	Mesh mesh,
	ObjectAttributes attributes
)
Public Function AddMesh (
	mesh As Mesh,
	attributes As ObjectAttributes
) As Guid
Parameters
mesh
Type: Rhino.Geometry.Mesh
A duplicate of this mesh is added to Rhino.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to link to the object.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmObjectTable Class
AddMesh Overload
Rhino.FileIO Namespace