RhinoCommon SDK
DisplayPipeline.DrawMarker Method (Point3d, Vector3d, Color)
 Draws an arrow marker as a view-aligned widget.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawMarker(
	Point3d tip,
	Vector3d direction,
	Color color
)
Public Sub DrawMarker (
	tip As Point3d,
	direction As Vector3d,
	color As Color
)
Parameters
tip
Type: Rhino.Geometry.Point3d
Location of arrow tip point.
direction
Type: Rhino.Geometry.Vector3d
Direction of arrow.
color
Type: System.Drawing.Color
Color of arrow widget.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
DrawMarker Overload
Rhino.Display Namespace