RhinoCommon SDK
ArcCurve Constructor
 Initializes a new ArcCurve instance.
Radius is set to 1, position to Origin and Domain to full span (circle).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ArcCurve()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace