RhinoCommon SDK
GetPoint.OnMouseDown Method
Default calls the MouseDown event.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMouseDown(
	GetPointMouseEventArgs e
)
Protected Overridable Sub OnMouseDown (
	e As GetPointMouseEventArgs
)
Parameters
e
Type: Rhino.Input.Custom.GetPointMouseEventArgs
Current argument for the event.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace