RhinoCommon SDK
SimulatedTexture.MetersToUnits Method (Double)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.SimulatedTexture.MetersToUnits(System.Double)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Obsolete, use version that requires a document")]
public double MetersToUnits(
	double units
)
<ObsoleteAttribute("Obsolete, use version that requires a document")>
Public Function MetersToUnits (
	units As Double
) As Double
Parameters
units
Type: System.Double
[Missing <param name="units"/> documentation for "M:Rhino.Render.SimulatedTexture.MetersToUnits(System.Double)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.SimulatedTexture.MetersToUnits(System.Double)"]
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
SimulatedTexture Class
MetersToUnits Overload
Rhino.Render Namespace