RhinoCommon SDK
TwoColorRenderTexture.AddAdditionalUISections Method
[Missing <summary> documentation for "M:Rhino.Render.TwoColorRenderTexture.AddAdditionalUISections"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected abstract void AddAdditionalUISections()
Protected MustOverride Sub AddAdditionalUISections
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace