RhinoCommon SDK
Arc.BoundingBox Method
 Computes the 3D axis aligned bounding box for this arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox BoundingBox()
Public Function BoundingBox As BoundingBox
Return Value
Type: BoundingBox
Bounding box of arc.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Arc Structure
Rhino.Geometry Namespace