RhinoCommon SDK
PointCloud.ClearColors Method
 Destroys the color information in this point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearColors()
Public Sub ClearColors
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace