RhinoCommon SDK
BrepEdge.ConcavityAt Method
 Determine the concavity of this edge at a specific parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Concavity ConcavityAt(
	double t,
	double tolerance
)
Public Function ConcavityAt (
	t As Double,
	tolerance As Double
) As Concavity
Parameters
t
Type: System.Double
Edge curve parameter.
tolerance
Type: System.Double
Angle tolerance for tangent faces.
Return Value
Type: Concavity
Concavity measure at parameter.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace