RhinoCommon SDK
OrdinateDimension Constructor
Initializes a new instance of the OrdinateDimension class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public OrdinateDimension()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
OrdinateDimension Class
OrdinateDimension Overload
Rhino.Geometry Namespace