RhinoCommon SDK
ObjectTable.Replace Method (Guid, Point)
Replaces one object with new point object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Replace(
	Guid objectId,
	Point point
)
Public Function Replace (
	objectId As Guid,
	point As Point
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
point
Type: Rhino.Geometry.Point
new point to be added. The point is copied.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace