RhinoCommon SDK
MeshNgonList.AddNgons Method
 Appends a list of ngons to the end of the mesh ngon list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] AddNgons(
	IEnumerable<MeshNgon> ngons
)
Public Function AddNgons (
	ngons As IEnumerable(Of MeshNgon)
) As Integer()
Parameters
ngons
Type: System.Collections.Generic.IEnumerable<MeshNgon>
Ngons to add.
Return Value
Type: Int32[]
Indices of the newly created ngons
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace