RhinoCommon SDK
VisualAnalysisMode Constructor
Initializes a new instance of the VisualAnalysisMode class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected VisualAnalysisMode()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace