RhinoCommon SDK
Intersection.MeshRay Method (Mesh, Ray3d)
Finds the first intersection of a ray with a mesh.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double MeshRay(
	Mesh mesh,
	Ray3d ray
)
Public Shared Function MeshRay (
	mesh As Mesh,
	ray As Ray3d
) As Double
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh to intersect.
ray
Type: Rhino.Geometry.Ray3d
A ray to be casted.
Return Value
Type: Double
 >= 0.0 parameter along ray if successful. < 0.0 if no intersection found.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Intersection Class
MeshRay Overload
Rhino.Geometry.Intersect Namespace