RhinoCommon SDK
SnapShotsClient.SnapshotRestored Method
 Called after all clients restored their data.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract void SnapshotRestored(
	RhinoDoc doc
)
Public MustOverride Sub SnapshotRestored (
	doc As RhinoDoc
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.SnapshotRestored(Rhino.RhinoDoc)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace