RhinoCommon SDK
CustomBrepObject.Finalize Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomBrepObject.Finalize"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomBrepObject Class
Rhino.DocObjects.Custom Namespace