RhinoCommon SDK
UserData.Read Method
Reads the content of this data from a stream archive.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool Read(
	BinaryArchiveReader archive
)
Protected Overridable Function Read (
	archive As BinaryArchiveReader
) As Boolean
Parameters
archive
Type: Rhino.FileIO.BinaryArchiveReader
An archive.
Return Value
Type: Boolean
true if the data was successfully written. The default implementation always returns false.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace