RhinoCommon SDK
UserDataList.Add Method
 If the userdata is already in a different UserDataList, it will be removed from that list and added to this list.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Add(
	UserData userdata
)
Public Function Add (
	userdata As UserData
) As Boolean
Parameters
userdata
Type: Rhino.DocObjects.Custom.UserData
Data element.
Return Value
Type: Boolean
Whether this operation succeeded.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace