RhinoCommon SDK
MeshNgonList.GetNgonBoundingBox Method (MeshNgon)
 Gets the bounding box of an ngon.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox GetNgonBoundingBox(
	MeshNgon ngon
)
Public Function GetNgonBoundingBox (
	ngon As MeshNgon
) As BoundingBox
Parameters
ngon
Type: Rhino.Geometry.MeshNgon
An ngon.
Return Value
Type: BoundingBox
A new bounding box, or Empty on error.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshNgonList Class
GetNgonBoundingBox Overload
Rhino.Geometry.Collections Namespace