RhinoCommon SDK
File3dmHatchPatternTable.FindName Method
 Finds a HatchPattern given its name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HatchPattern FindName(
	string name
)
Public Function FindName (
	name As String
) As HatchPattern
Parameters
name
Type: System.String
The name of the HatchPattern to be searched.
Return Value
Type: HatchPattern
An HatchPattern, or null on error.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmHatchPatternTable Class
Rhino.FileIO Namespace