RhinoCommon SDK
Matrix.Scale Method
 Modifies the current matrix by multiplying its values by a number.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Scale(
	double s
)
Public Sub Scale (
	s As Double
)
Parameters
s
Type: System.Double
A scale factor.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Matrix Class
Rhino.Geometry Namespace