RhinoCommon SDK
Field.ValueAsByteArray Method
 Return field as a byte array.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected byte[] ValueAsByteArray()
Protected Function ValueAsByteArray As Byte()
Return Value
Type: Byte[]
Return field as a byte array.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Field Class
Rhino.Render.Fields Namespace