RhinoCommon SDK
Point3d.Addition Operator (Point3d, Vector3f)
Rhino for Mac WIP
 Sums up a point and a vector, and returns a new point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d operator +(
	Point3d point,
	Vector3f vector
)
Public Shared Operator + (
	point As Point3d,
	vector As Vector3f
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
vector
Type: Rhino.Geometry.Vector3f
A vector.
Return Value
Type: Point3d
A new point that results from the addition of point and vector.
See Also
Reference
Point3d Structure
Addition Overload
Rhino.Geometry Namespace