RhinoCommon SDK
DisplayPipeline.DrawPointCloud Method (PointCloud, Single)
 Draws a point cloud.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawPointCloud(
	PointCloud cloud,
	float size
)
Public Sub DrawPointCloud (
	cloud As PointCloud,
	size As Single
)
Parameters
cloud
Type: Rhino.Geometry.PointCloud
Point cloud to draw, if the cloud has a color array, it will be used, otherwise the points will be black.
size
Type: System.Single
Size of points.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
DrawPointCloud Overload
Rhino.Display Namespace