RhinoCommon SDK
MaterialRefs.ContainsKey Method
 Determines whether this dictionary contains an MaterialRef with the specified plug-in id.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ContainsKey(
	Guid key
)
Public Function ContainsKey (
	key As Guid
) As Boolean
Parameters
key
Type: System.Guid
 The plug-in Id used to locate a MaterialRef in this dictionary.
Return Value
Type: Boolean
 true if this dictionary contains an element with the specified plug-in Id; otherwise, false.
Implements
IDictionary<TKey, TValue>.ContainsKey(TKey)
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace