RhinoCommon SDK
ImageFile.SupportsAlphaChannel Method
 Returns true if file at given path is an image file and that file format supports an alpha channel
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SupportsAlphaChannel(
	string filename
)
Public Shared Function SupportsAlphaChannel (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.FileIO.ImageFile.SupportsAlphaChannel(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.ImageFile.SupportsAlphaChannel(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ImageFile Class
Rhino.FileIO Namespace