RhinoCommon SDK
IPanelsService.GetPanel Method (Guid)
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Object GetPanel(
	Guid panelId
)
Function GetPanel (
	panelId As Guid
) As Object
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.GetPanel(System.Guid)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
See Also
Reference
IPanelsService Interface
GetPanel Overload
Rhino.UI Namespace