RhinoCommon SDK
MeshFace.Equality Operator
 Determines whether two MeshFace structures have equal values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator ==(
	MeshFace a,
	MeshFace b
)
Public Shared Operator = (
	a As MeshFace,
	b As MeshFace
) As Boolean
Parameters
a
Type: Rhino.Geometry.MeshFace
The first MeshFace.
b
Type: Rhino.Geometry.MeshFace
The second MeshFace.
Return Value
Type: Boolean
true if the indices of the two points are exactly equal; otherwise false.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace