RhinoCommon SDK
HatchPatternTable.FindNameHash Method
 Finds a HatchPattern given its name hash.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HatchPattern FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As HatchPattern
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the HatchPattern to be searched.
Return Value
Type: HatchPattern
An Linetype, or null on error.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace