RhinoCommon SDK
Mesh.FillHoles Method
 Attempts to determine "holes" in the mesh by chaining naked edges together. Then it triangulates the closed polygons adds the faces to the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool FillHoles()
Public Function FillHoles As Boolean
Return Value
Type: Boolean
true if successful, false otherwise.
Remarks
This function does not differentiate between inner and outer naked edges. If you need that, it would be better to use Mesh.FillHole.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Mesh Class
Rhino.Geometry Namespace