RhinoCommon SDK
Material.SetUserString Method
 Attach a user string (key,value combination) to this geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetUserString(
	string key,
	string value
)
Public Function SetUserString (
	key As String,
	value As String
) As Boolean
Parameters
key
Type: System.String
id used to retrieve this string.
value
Type: System.String
string associated with key.
Return Value
Type: Boolean
true on success.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Material Class
Rhino.DocObjects Namespace