RhinoCommon SDK
CurveIntersections.Finalize Method
 Destructor.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace