RhinoCommon SDK
MeshVertexStatusList.Contains Method
 Determines if some vertices are hidden or some are shown.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Contains(
	bool hidden
)
Public Function Contains (
	hidden As Boolean
) As Boolean
Parameters
hidden
Type: System.Boolean
The value to be checked. True means some vertex is hidden.
Return Value
Type: Boolean
True if the array contains the specified value.
Implements
ICollection<T>.Contains(T)
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
MeshVertexStatusList Class
Rhino.Geometry.Collections Namespace