RhinoCommon SDK
File3dmStringTable.Delete Method (String, String)
 Removes document strings from the 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Delete(
	string section,
	string entry
)
Public Sub Delete (
	section As String,
	entry As String
)
Parameters
section
Type: System.String
name of section to delete. If null, all sections will be deleted.
entry
Type: System.String
name of entry to delete. If null, all entries will be deleted for a given section.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
File3dmStringTable Class
Delete Overload
Rhino.FileIO Namespace