RhinoCommon SDK
RenderEnvironment Constructor
Initializes a new instance of the RenderEnvironment class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected RenderEnvironment()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace