RhinoCommon SDK
RenderWindow.ChannelId Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelId(Rhino.Render.RenderWindow.StandardChannels)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid ChannelId(
	RenderWindow.StandardChannels ch
)
Public Shared Function ChannelId (
	ch As RenderWindow.StandardChannels
) As Guid
Parameters
ch
Type: Rhino.Render.RenderWindow.StandardChannels
[Missing <param name="ch"/> documentation for "M:Rhino.Render.RenderWindow.ChannelId(Rhino.Render.RenderWindow.StandardChannels)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelId(Rhino.Render.RenderWindow.StandardChannels)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderWindow Class
Rhino.Render Namespace