RhinoCommon SDK
Layer.ToString Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.ToString"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.ToString"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Layer Class
Rhino.DocObjects Namespace