RhinoCommon SDK
BinaryArchiveReader.ReadSize Method
 Reads a Size from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Size ReadSize()
Public Function ReadSize As Size
Return Value
Type: Size
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace