RhinoCommon SDK
RenderWindow.SaveRenderImageAs Method (String, Boolean)
 Like RenderWindow.SaveRenderImageAs(string,Guid,bool), but with Guid set to Guid.Empty.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SaveRenderImageAs(
	string filename,
	bool saveAlpha
)
Public Sub SaveRenderImageAs (
	filename As String,
	saveAlpha As Boolean
)
Parameters
filename
Type: System.String
Filename of image file to be created
saveAlpha
Type: System.Boolean
True if alpha channel should be saved.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderWindow Class
SaveRenderImageAs Overload
Rhino.Render Namespace