RhinoCommon SDK
Matrix.SwapColumns Method
 Exchanges two columns.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SwapColumns(
	int columnA,
	int columnB
)
Public Function SwapColumns (
	columnA As Integer,
	columnB As Integer
) As Boolean
Parameters
columnA
Type: System.Int32
A first column.
columnB
Type: System.Int32
Another column.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
Matrix Class
Rhino.Geometry Namespace