RhinoCommon SDK
MaterialRefCreateParams Constructor
Initializes a new instance of the MaterialRefCreateParams class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MaterialRefCreateParams()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace