RhinoCommon SDK
Material.GetEnvironmentTexture Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.GetEnvironmentTexture"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture GetEnvironmentTexture()
Public Function GetEnvironmentTexture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.GetEnvironmentTexture"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Material Class
Rhino.DocObjects Namespace