RhinoCommon SDK
Brep.DuplicateEdgeCurves Method
 Duplicate all the edges of this Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] DuplicateEdgeCurves()
Public Function DuplicateEdgeCurves As Curve()
Return Value
Type: Curve[]
An array of edge curves.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Brep Class
DuplicateEdgeCurves Overload
Rhino.Geometry Namespace