RhinoCommon SDK
Point3d.Multiply Operator (Point3d, Double)
Rhino for Mac WIP
 Multiplies a Point3d by a number.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d operator *(
	Point3d point,
	double t
)
Public Shared Operator * (
	point As Point3d,
	t As Double
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
t
Type: System.Double
A number.
Return Value
Type: Point3d
A new point that is coordinatewise multiplied by t.
See Also
Reference
Point3d Structure
Multiply Overload
Rhino.Geometry Namespace