RhinoCommon SDK
ObjectPropertiesPage.GetSelectedObjects<T> Method
 Get selected objects of a given type
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T[] GetSelectedObjects<T>()
where T : RhinoObject
Public Function GetSelectedObjects(Of T As RhinoObject) As T()
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.GetSelectedObjects``1"]
Return Value
Type: T[]
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.GetSelectedObjects``1"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectPropertiesPage Class
GetSelectedObjects Overload
Rhino.UI Namespace