RhinoCommon SDK
ViewCapture Constructor
Initializes a new instance of the ViewCapture class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewCapture()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
ViewCapture Class
Rhino.Display Namespace