RhinoCommon SDK
File3dmLayerTable.FindName Method
 Finds a Layer given its name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Layer FindName(
	string name,
	Guid parentId
)
Public Function FindName (
	name As String,
	parentId As Guid
) As Layer
Parameters
name
Type: System.String
The name of the Layer to be searched.
parentId
Type: System.Guid
The id of the parent Layer to be searched.
Return Value
Type: Layer
A Layer, or null on error.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmLayerTable Class
Rhino.FileIO Namespace