RhinoCommon SDK
File3dmObjectTable.AddArc Method (Arc, ObjectAttributes)
Adds a curve object to the document representing an arc.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddArc(
	Arc arc,
	ObjectAttributes attributes
)
Public Function AddArc (
	arc As Arc,
	attributes As ObjectAttributes
) As Guid
Parameters
arc
Type: Rhino.Geometry.Arc
An arc to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to arc.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
File3dmObjectTable Class
AddArc Overload
Rhino.FileIO Namespace