RhinoCommon SDK
BinaryArchiveReader.ReadDictionary Method
 Reads a complete ArchivableDictionary from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ArchivableDictionary ReadDictionary()
Public Function ReadDictionary As ArchivableDictionary
Return Value
Type: ArchivableDictionary
The newly instantiated object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace