RhinoCommon SDK
Mesh.DestroyTree Method
 Destroys the mesh vertex access tree.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DestroyTree()
Public Sub DestroyTree
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Mesh Class
Rhino.Geometry Namespace