RhinoCommon SDK
ObjectAttributes.AddHideInDetailOverride Method
 Make this object hidden in a given detail
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AddHideInDetailOverride(
	Guid detailId
)
Public Function AddHideInDetailOverride (
	detailId As Guid
) As Boolean
Parameters
detailId
Type: System.Guid
[Missing <param name="detailId"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.AddHideInDetailOverride(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.AddHideInDetailOverride(System.Guid)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace