RhinoCommon SDK
GetCircle Constructor
Initializes a new instance of the GetCircle class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetCircle()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace