RhinoCommon SDK
BrepFace.RemoveHoles Method
 Remove all inner loops, or holes, from a Brep face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep RemoveHoles(
	double tolerance
)
Public Function RemoveHoles (
	tolerance As Double
) As Brep
Parameters
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.BrepFace.RemoveHoles(System.Double)"]
Return Value
Type: Brep
[Missing <returns> documentation for "M:Rhino.Geometry.BrepFace.RemoveHoles(System.Double)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace