RhinoCommon SDK
File3dmHatchPatternTable.FindNameHash Method
 Finds a HatchPattern given its name hash.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HatchPattern FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As HatchPattern
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the HatchPattern to be searched.
Return Value
Type: HatchPattern
An HatchPattern, or null on error.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmHatchPatternTable Class
Rhino.FileIO Namespace