RhinoCommon SDK
StackedDialogPage.OnDefaults Method
Called when stacked dialog Defaults button is pressed (see ShowDefaultsButton).
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void OnDefaults()
Public Overridable Sub OnDefaults
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace