RhinoCommon SDK
Layer.Equals Method (Layer)
[Missing <summary> documentation for "M:Rhino.DocObjects.Layer.Equals(Rhino.DocObjects.Layer)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	Layer other
)
Public Function Equals (
	other As Layer
) As Boolean
Parameters
other
Type: Rhino.DocObjects.Layer
[Missing <param name="other"/> documentation for "M:Rhino.DocObjects.Layer.Equals(Rhino.DocObjects.Layer)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.Equals(Rhino.DocObjects.Layer)"]
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Layer Class
Equals Overload
Rhino.DocObjects Namespace