RhinoCommon SDK
HiddenLineDrawingParameters Constructor
default constructor
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HiddenLineDrawingParameters()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace