RhinoCommon SDK
WorldMapDayNight.MapToLocation Method
[Missing <summary> documentation for "M:Rhino.Render.UI.WorldMapDayNight.MapToLocation(System.Drawing.Point)"]
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d MapToLocation(
	Point mapPoint
)
Public Function MapToLocation (
	mapPoint As Point
) As Point2d
Parameters
mapPoint
Type: System.Drawing.Point
[Missing <param name="mapPoint"/> documentation for "M:Rhino.Render.UI.WorldMapDayNight.MapToLocation(System.Drawing.Point)"]
Return Value
Type: Point2d
[Missing <returns> documentation for "M:Rhino.Render.UI.WorldMapDayNight.MapToLocation(System.Drawing.Point)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace