RhinoCommon SDK
ControlPoint Constructor (Double, Double, Double)
 Constructs a new world 3-D, or Euclidean, control point. The 4-D representation is (x, y, z, 1.0).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ControlPoint(
	double x,
	double y,
	double z
)
Public Sub New (
	x As Double,
	y As Double,
	z As Double
)
Parameters
x
Type: System.Double
X coordinate of the control point.
y
Type: System.Double
Y coordinate of the control point.
z
Type: System.Double
Z coordinate of the control pointt.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
ControlPoint Structure
ControlPoint Overload
Rhino.Geometry Namespace