RhinoCommon SDK
Arc.Trim Method
 Sets arc's angle domain (in radians) as a subdomain of the circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Trim(
	Interval domain
)
Public Function Trim (
	domain As Interval
) As Boolean
Parameters
domain
Type: Rhino.Geometry.Interval
 0 < domain[1] - domain[0] <= 2.0 * RhinoMath.Pi.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
Arc Structure
Rhino.Geometry Namespace