RhinoCommon SDK
Layer.GetParentName Method (String)
 Get a layer's "parent" path name
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string GetParentName(
	string fullPath
)
Public Shared Function GetParentName (
	fullPath As String
) As String
Parameters
fullPath
Type: System.String
[Missing <param name="fullPath"/> documentation for "M:Rhino.DocObjects.Layer.GetParentName(System.String)"]
Return Value
Type: String
 parent name or String.Empty
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Layer Class
GetParentName Overload
Rhino.DocObjects Namespace