RhinoCommon SDK
Brep.CreateFromTaperedExtrude Method (Curve, Double, Vector3d, Point3d, Double, ExtrudeCornerType)
 Extrude a curve to a taper making a brep (potentially more than 1)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Brep[] CreateFromTaperedExtrude(
	Curve curveToExtrude,
	double distance,
	Vector3d direction,
	Point3d basePoint,
	double draftAngleRadians,
	ExtrudeCornerType cornerType
)
Public Shared Function CreateFromTaperedExtrude (
	curveToExtrude As Curve,
	distance As Double,
	direction As Vector3d,
	basePoint As Point3d,
	draftAngleRadians As Double,
	cornerType As ExtrudeCornerType
) As Brep()
Parameters
curveToExtrude
Type: Rhino.Geometry.Curve
the curve to extrude
distance
Type: System.Double
the distance to extrude
direction
Type: Rhino.Geometry.Vector3d
the direction of the extrusion
basePoint
Type: Rhino.Geometry.Point3d
the basepoint of the extrusion
draftAngleRadians
Type: System.Double
angle of the extrusion
cornerType
Type: Rhino.Geometry.ExtrudeCornerType
[Missing <param name="cornerType"/> documentation for "M:Rhino.Geometry.Brep.CreateFromTaperedExtrude(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,System.Double,Rhino.Geometry.ExtrudeCornerType)"]
Return Value
Type: Brep[]
array of breps on success
Remarks
tolerances used are based on the active doc tolerance
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.2
See Also
Reference
Brep Class
CreateFromTaperedExtrude Overload
Rhino.Geometry Namespace