RhinoCommon SDK
NurbsCurvePointList.GetWeight Method
 Gets the weight of a control point at the given index. Note, if the curve is non-rational, the weight will be 1.0.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double GetWeight(
	int index
)
Public Function GetWeight (
	index As Integer
) As Double
Parameters
index
Type: System.Int32
Index of control point to get.
Return Value
Type: Double
The control point weight if successful, Rhino.Math.UnsetValue otherwise.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace