RhinoCommon SDK
DisplayBitmap.Load Method
 Load a DisplayBitmap from and image file on disk.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static DisplayBitmap Load(
	string path
)
Public Shared Function Load (
	path As String
) As DisplayBitmap
Parameters
path
Type: System.String
A location from which to load the file.
Return Value
Type: DisplayBitmap
The new display bitmap, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace