RhinoCommon SDK
CustomDisplay.Clear Method
 Clear the drawing lists.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace