RhinoCommon SDK
RhinoObject.OnDuplicate Method
 Called when this a new instance of this object is created and copied from an existing object
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnDuplicate(
	RhinoObject source
)
Protected Overridable Sub OnDuplicate (
	source As RhinoObject
)
Parameters
source
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="source"/> documentation for "M:Rhino.DocObjects.RhinoObject.OnDuplicate(Rhino.DocObjects.RhinoObject)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace