RhinoCommon SDK
Sun.SetPosition Method (Double, Double)
 Sets position of the Sun based on azimuth and altitude values. Using this function will also set sun to manual.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetPosition(
	double azimuthDegrees,
	double altitudeDegrees
)
Public Sub SetPosition (
	azimuthDegrees As Double,
	altitudeDegrees As Double
)
Parameters
azimuthDegrees
Type: System.Double
The azimuth sun angle in degrees.
altitudeDegrees
Type: System.Double
The altitude sun angle in degrees.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Sun Class
SetPosition Overload
Rhino.Render Namespace