RhinoCommon SDK
ObjectAttributes.RemoveHideInDetailOverride Method
 Remove hidden in detail flag for a specific detail
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RemoveHideInDetailOverride(
	Guid detailId
)
Public Function RemoveHideInDetailOverride (
	detailId As Guid
) As Boolean
Parameters
detailId
Type: System.Guid
[Missing <param name="detailId"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.RemoveHideInDetailOverride(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.RemoveHideInDetailOverride(System.Guid)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace