RhinoCommon SDK
RenderContent.FindChild Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.FindChild(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent FindChild(
	string childSlotName
)
Public Function FindChild (
	childSlotName As String
) As RenderContent
Parameters
childSlotName
Type: System.String
[Missing <param name="childSlotName"/> documentation for "M:Rhino.Render.RenderContent.FindChild(System.String)"]
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.FindChild(System.String)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderContent Class
Rhino.Render Namespace