RhinoCommon SDK
ObjectTable.FindByLayer Method (Layer)
 Finds all RhinoObjects that are in a given layer.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject[] FindByLayer(
	Layer layer
)
Public Function FindByLayer (
	layer As Layer
) As RhinoObject()
Parameters
layer
Type: Rhino.DocObjects.Layer
Layer to search.
Return Value
Type: RhinoObject[]
 Array of objects that belong to the specified group or null if no objects could be found.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
ObjectTable Class
FindByLayer Overload
Rhino.DocObjects.Tables Namespace