RhinoCommon SDK
Arc Constructor (Plane, Double, Double)
 Initializes a new arc from a base plane, a radius value and an angle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Arc(
	Plane plane,
	double radius,
	double angleRadians
)
Public Sub New (
	plane As Plane,
	radius As Double,
	angleRadians As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
The plane of the arc (arc center will be located at plane origin)
radius
Type: System.Double
Radius of arc.
angleRadians
Type: System.Double
Sweep angle of arc (in radians)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
Arc Structure
Arc Overload
Rhino.Geometry Namespace