RhinoCommon SDK
ObjectAttributes.RemoveDisplayModeOverride Method
 By default, objects are drawn using the display mode of the viewport that the object is being drawn in. Setting a specific display mode, instructs Rhino to always use that display mode, regardless of the viewport's mode. This function resets an object to use the viewport's display mode for all viewports.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RemoveDisplayModeOverride()
Public Sub RemoveDisplayModeOverride
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectAttributes Class
RemoveDisplayModeOverride Overload
Rhino.DocObjects Namespace