RhinoCommon SDK
SnapShotsClient.AnimationStart Method
 Called once at the start of an animation.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract void AnimationStart(
	RhinoDoc doc,
	int iFrames
)
Public MustOverride Sub AnimationStart (
	doc As RhinoDoc,
	iFrames As Integer
)
Parameters
doc
Type: Rhino.RhinoDoc
doc is the current document.
iFrames
Type: System.Int32
iFrames is the number of frames to be animated.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace