RhinoCommon SDK
Point2d.Subtraction Operator (Point2d, Vector2d)
 Subtracts a vector from a point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point2d operator -(
	Point2d point,
	Vector2d vector
)
Public Shared Operator - (
	point As Point2d,
	vector As Vector2d
) As Point2d
Parameters
point
Type: Rhino.Geometry.Point2d
A point.
vector
Type: Rhino.Geometry.Vector2d
A vector.
Return Value
Type: Point2d
A new point that is coordinatewise subtracted by vector.
See Also
Reference
Point2d Structure
Subtraction Overload
Rhino.Geometry Namespace