RhinoCommon SDK
PointCloud.GetNormals Method
 Copy all the normal vectors in this point cloud to an array.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d[] GetNormals()
Public Function GetNormals As Vector3d()
Return Value
Type: Vector3d[]
An array containing all the normals in this point cloud.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace