RhinoCommon SDK
Linetype Constructor
Initializes a new instance of the Linetype class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Linetype()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Linetype Class
Linetype Overload
Rhino.DocObjects Namespace