RhinoCommon SDK
RenderContentType.NewContentFromTypeId Method
 Create a new content specified by the Guid. This function can be used to create temporary content, as it calls ::RhRdkContentFactories().NewContentFromType().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RenderContent NewContentFromTypeId(
	Guid typeId
)
Public Shared Function NewContentFromTypeId (
	typeId As Guid
) As RenderContent
Parameters
typeId
Type: System.Guid
[Missing <param name="typeId"/> documentation for "M:Rhino.Render.RenderContentType.NewContentFromTypeId(System.Guid)"]
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.RenderContentType.NewContentFromTypeId(System.Guid)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
RenderContentType Class
Rhino.Render Namespace