RhinoCommon SDK
MeshFaceList.SetFace Method (Int32, MeshFace)
 Sets a face at a specific index of the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetFace(
	int index,
	MeshFace face
)
Public Function SetFace (
	index As Integer,
	face As MeshFace
) As Boolean
Parameters
index
Type: System.Int32
A position in the list.
face
Type: Rhino.Geometry.MeshFace
A face.
Return Value
Type: Boolean
true if the operation succeeded, otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
MeshFaceList Class
SetFace Overload
Rhino.Geometry.Collections Namespace