RhinoCommon SDK
ColorLCH.MakePositive Method
 Ensure the Chromaticity of this color is positive.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void MakePositive()
Public Sub MakePositive
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace