RhinoCommon SDK
ChangeQueue.Dispose Method
 Dispose our ChangeQueue
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ChangeQueue Class
Dispose Overload
Rhino.Render.ChangeQueue Namespace