RhinoCommon SDK
RhinoGet.GetPrintWindow Method
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetPrintWindow(Rhino.Display.ViewCaptureSettings@)"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Result GetPrintWindow(
	ref ViewCaptureSettings settings
)
Public Shared Function GetPrintWindow (
	ByRef settings As ViewCaptureSettings
) As Result
Parameters
settings
Type: Rhino.Display.ViewCaptureSettings
[Missing <param name="settings"/> documentation for "M:Rhino.Input.RhinoGet.GetPrintWindow(Rhino.Display.ViewCaptureSettings@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetPrintWindow(Rhino.Display.ViewCaptureSettings@)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
RhinoGet Class
Rhino.Input Namespace