RhinoCommon SDK
ChangeQueue.NotifyDynamicUpdatesAreAvailable Method
 Override this when you want to be notified dynamic updates are available
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void NotifyDynamicUpdatesAreAvailable()
Protected Overridable Sub NotifyDynamicUpdatesAreAvailable
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace