RhinoCommon SDK
CollapsibleSectionViewModel.Discard Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionViewModel.Discard(System.Guid)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Discard(
	Guid uuidDataType
)
Public Sub Discard (
	uuidDataType As Guid
)
Parameters
uuidDataType
Type: System.Guid
[Missing <param name="uuidDataType"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionViewModel.Discard(System.Guid)"]
Implements
IRdkViewModel.Discard(Guid)
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CollapsibleSectionViewModel Class
Rhino.UI.Controls Namespace