RhinoCommon SDK
LengthValue.Dispose Method
actively reclaim native allocated ON_LenghtValue*
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
LengthValue Class
Rhino Namespace