RhinoCommon SDK
Curve.CreateControlPointCurve Method (IEnumerable<Point3d>)
 Constructs a control-point of degree=3 (or less).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Curve CreateControlPointCurve(
	IEnumerable<Point3d> points
)
Public Shared Function CreateControlPointCurve (
	points As IEnumerable(Of Point3d)
) As Curve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Control points of curve.
Return Value
Type: Curve
[Missing <returns> documentation for "M:Rhino.Geometry.Curve.CreateControlPointCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Curve Class
CreateControlPointCurve Overload
Rhino.Geometry Namespace