RhinoCommon SDK
ObjectTable.AddEllipse Method (Ellipse, ObjectAttributes)
Adds a curve object to the document representing an ellipse.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddEllipse(
	Ellipse ellipse,
	ObjectAttributes attributes
)
Public Function AddEllipse (
	ellipse As Ellipse,
	attributes As ObjectAttributes
) As Guid
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
An ellipse value.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to ellipse.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectTable Class
AddEllipse Overload
Rhino.DocObjects.Tables Namespace