RhinoCommon SDK
MeshTopologyEdgeList.IsNgonInterior Method
 Returns true if the topological edge is an interior ngon edge
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsNgonInterior(
	int topologyEdgeIndex
)
Public Function IsNgonInterior (
	topologyEdgeIndex As Integer
) As Boolean
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge in TopologyEdges.
Return Value
Type: Boolean
true if mesh topology edge is an interior ngon edge.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace