RhinoCommon SDK
NamedPositionTable.Rename Method (String, String)
Rename a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Rename(
	string oldName,
	string name
)
Public Function Rename (
	oldName As String,
	name As String
) As Boolean
Parameters
oldName
Type: System.String
 Current name of the Named Position which you want to rename.
name
Type: System.String
 New name for the Named Position.
Return Value
Type: Boolean
 True or False depending on whether the Rename was successful. For example, this method might return False if you attempt to remane the Named Position with the currently assigned name.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
NamedPositionTable Class
Rename Overload
Rhino.DocObjects.Tables Namespace