RhinoCommon SDK
Transform.Multiply Operator (Transform, Vector3d)
 Multiplies a transformation by a vector and gets a new vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector3d operator *(
	Transform m,
	Vector3d v
)
Public Shared Operator * (
	m As Transform,
	v As Vector3d
) As Vector3d
Parameters
m
Type: Rhino.Geometry.Transform
A transformation.
v
Type: Rhino.Geometry.Vector3d
A vector.
Return Value
Type: Vector3d
The tranformed vector.
See Also
Reference
Transform Structure
Multiply Overload
Rhino.Geometry Namespace