RhinoCommon SDK
PreviewAppearance.SetRotationType Method
 SetRotationType
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetRotationType(
	IRhRdkPreviewSceneServer_eRotationType type
)
Public Sub SetRotationType (
	type As IRhRdkPreviewSceneServer_eRotationType
)
Parameters
type
Type: Rhino.Render.IRhRdkPreviewSceneServer_eRotationType
[Missing <param name="type"/> documentation for "M:Rhino.Render.PreviewAppearance.SetRotationType(Rhino.Render.IRhRdkPreviewSceneServer_eRotationType)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace