RhinoCommon SDK
Panels.OnShowPanel Method
Rhino for Mac WIP
 Call this method to raise the Show event
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void OnShowPanel(
	Guid panelId,
	uint documentSerialNumber,
	bool show
)
Public Shared Sub OnShowPanel (
	panelId As Guid,
	documentSerialNumber As UInteger,
	show As Boolean
)
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.Panels.OnShowPanel(System.Guid,System.UInt32,System.Boolean)"]
documentSerialNumber
Type: System.UInt32
The document associated with the shown/hidden panel.
show
Type: System.Boolean
[Missing <param name="show"/> documentation for "M:Rhino.UI.Panels.OnShowPanel(System.Guid,System.UInt32,System.Boolean)"]
See Also
Reference
Panels Class
Rhino.UI Namespace