RhinoCommon SDK
ObjectTable.AddCircle Method (Circle, ObjectAttributes)
Adds a curve object to the document representing a circle.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddCircle(
	Circle circle,
	ObjectAttributes attributes
)
Public Function AddCircle (
	circle As Circle,
	attributes As ObjectAttributes
) As Guid
Parameters
circle
Type: Rhino.Geometry.Circle
A circle value.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to circle.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectTable Class
AddCircle Overload
Rhino.DocObjects.Tables Namespace