RhinoCommon SDK
MeshVertexList.Show Method
 Shows the vertex at the given index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Show(
	int vertexIndex
)
Public Sub Show (
	vertexIndex As Integer
)
Parameters
vertexIndex
Type: System.Int32
Index of vertex to show.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace