RhinoCommon SDK
InstanceDefinitionTable.RefreshLinkedBlock Method
 Reload linked block definitions and update the Rhino display.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool RefreshLinkedBlock(
	InstanceDefinition definition
)
Public Function RefreshLinkedBlock (
	definition As InstanceDefinition
) As Boolean
Parameters
definition
Type: Rhino.DocObjects.InstanceDefinition
 Instance definition to reload.
Return Value
Type: Boolean
 Returns true if the linked file was successfully read and updated.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace