RhinoCommon SDK
BrepRegion.NonConstOperation Method
[Missing <summary> documentation for "M:Rhino.Geometry.BrepRegion.NonConstOperation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void NonConstOperation()
Protected Overrides Sub NonConstOperation
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace