RhinoCommon SDK
Dimension Constructor
Initializes a new instance of the Dimension class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Dimension()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Dimension Class
Dimension Overload
Rhino.Geometry Namespace