RhinoCommon SDK
DisplayConduit.ObjectCulling Method
The default implementation does nothing.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ObjectCulling(
	CullObjectEventArgs e
)
Protected Overridable Sub ObjectCulling (
	e As CullObjectEventArgs
)
Parameters
e
Type: Rhino.Display.CullObjectEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.Display.DisplayConduit.ObjectCulling(Rhino.Display.CullObjectEventArgs)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace