RhinoCommon SDK
ViewportInfo Constructor
 Initializes a new instance.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewportInfo()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewportInfo Class
ViewportInfo Overload
Rhino.DocObjects Namespace