RhinoCommon SDK
UndoRecord.Dispose Method (Boolean)
 UndoRecord Dispose
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
UndoRecord Class
Dispose Overload
Rhino.UI.Controls Namespace