RhinoCommon SDK
Interval.MakeIncreasing Method
 Ensures this Interval is either singleton or increasing.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void MakeIncreasing()
Public Sub MakeIncreasing
See Also
Reference
Interval Structure
Rhino.Geometry Namespace