RhinoCommon SDK
RhinoViewport.SetCameraLocations Method
 Set viewport camera location and target location. The camera direction vector is changed so that it is parallel to the vector from the camera location to the target location.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetCameraLocations(
	Point3d targetLocation,
	Point3d cameraLocation
)
Public Sub SetCameraLocations (
	targetLocation As Point3d,
	cameraLocation As Point3d
)
Parameters
targetLocation
Type: Rhino.Geometry.Point3d
new target location.
cameraLocation
Type: Rhino.Geometry.Point3d
new camera location.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace