RhinoCommon SDK
TextureEvaluator.Dispose Method
 For Dispose pattern
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TextureEvaluator Class
Dispose Overload
Rhino.Render Namespace