RhinoCommon SDK
Interval.CompareTo Method
 Compares this Interval with another interval.
The lower bound has first evaluation priority.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CompareTo(
	Interval other
)
Public Function CompareTo (
	other As Interval
) As Integer
Parameters
other
Type: Rhino.Geometry.Interval
The other Interval to compare with.
Return Value
Type: Int32
 0: if this is identical to other
-1: if this[0] < other[0]
+1: if this[0] > other[0]
-1: if this[0] == other[0] and this[1] < other[1]
+1: if this[0] == other[0] and this[1] > other[1]
.
Implements
IComparable<T>.CompareTo(T)
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Interval Structure
Rhino.Geometry Namespace