RhinoCommon SDK
Point3d Implicit Conversion (Point3d to ControlPoint)
Rhino for Mac WIP
 Converts a point in a control point, without needing casting.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static implicit operator ControlPoint (
	Point3d pt
)
Public Shared Widening Operator CType (
	pt As Point3d
) As ControlPoint
Parameters
pt
Type: Rhino.Geometry.Point3d
The point.
Return Value
Type: ControlPoint
The control point.
See Also
Reference
Point3d Structure
Implicit Overload
Rhino.Geometry Namespace