RhinoCommon SDK
ICollapsibleSectionHolder.IsSectionExpanded Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.IsSectionExpanded(Rhino.UI.Controls.ICollapsibleSection)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool IsSectionExpanded(
	ICollapsibleSection section
)
Function IsSectionExpanded (
	section As ICollapsibleSection
) As Boolean
Parameters
section
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="section"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.IsSectionExpanded(Rhino.UI.Controls.ICollapsibleSection)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.ICollapsibleSectionHolder.IsSectionExpanded(Rhino.UI.Controls.ICollapsibleSection)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace