RhinoCommon SDK
TransformCommand Constructor
Initializes a new instance of the TransformCommand class
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected TransformCommand()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
TransformCommand Class
Rhino.Commands Namespace