RhinoCommon SDK
Vector2f.LessThan Operator
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator <(
	Vector2f a,
	Vector2f b
)
Public Shared Operator < (
	a As Vector2f,
	b As Vector2f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector2f
First vector.
b
Type: Rhino.Geometry.Vector2f
Second vector.
Return Value
Type: Boolean
true if a.X is smaller than b.X, or a.X == b.X and a.Y is smaller than b.Y; otherwise, false.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace