RhinoCommon SDK
ChangeQueue.GetQueueView Method
 Get view known to the queue at the time of the Flush
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewInfo GetQueueView()
Public Function GetQueueView As ViewInfo
Return Value
Type: ViewInfo
ViewInfo
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace