RhinoCommon SDK
NamedValue Constructor
Initializes a new instance of the NamedValue class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NamedValue(
	string name,
	Object value
)
Public Sub New (
	name As String,
	value As Object
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Render.NamedValue.#ctor(System.String,System.Object)"]
value
Type: System.Object
[Missing <param name="value"/> documentation for "M:Rhino.Render.NamedValue.#ctor(System.String,System.Object)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NamedValue Class
Rhino.Render Namespace