RhinoCommon SDK
NurbsSurfaceKnotList.InsertKnot Method (Double, Int32)
 Inserts a knot and update control point locations. Does not change parameterization or locus of curve.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool InsertKnot(
	double value,
	int multiplicity
)
Public Function InsertKnot (
	value As Double,
	multiplicity As Integer
) As Boolean
Parameters
value
Type: System.Double
Knot value to insert.
multiplicity
Type: System.Int32
Multiplicity of knot to insert.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NurbsSurfaceKnotList Class
InsertKnot Overload
Rhino.Geometry.Collections Namespace