RhinoCommon SDK
ColorLCH Implicit Conversion (ColorLCH to Color)
Rhino for Mac WIP
 Implicitly converts a LCH color into a .Net library color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static implicit operator Color (
	ColorLCH lch
)
Public Shared Widening Operator CType (
	lch As ColorLCH
) As Color
Parameters
lch
Type: Rhino.Display.ColorLCH
A LCH color.
Return Value
Type: Color
A ARGB .Net library color.
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace