RhinoCommon SDK
BinaryArchiveReader.ReadSByte Method
 Reads a SByte from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sbyte ReadSByte()
Public Function ReadSByte As SByte
Return Value
Type: SByte
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace