RhinoCommon SDK
TextLog Constructor
 Creates a text log that stores all text in memory. Use ToString on this version of the TextLog to get the text that we written
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextLog()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TextLog Class
TextLog Overload
Rhino.FileIO Namespace