RhinoCommon SDK
MeshTopologyEdgeList.GetEdgesForFace Method (Int32)
 Gets indices of edges that surround a given face.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] GetEdgesForFace(
	int faceIndex
)
Public Function GetEdgesForFace (
	faceIndex As Integer
) As Integer()
Parameters
faceIndex
Type: System.Int32
A face index.
Return Value
Type: Int32[]
A new array of indices to the topological edges that are connected with the specified face.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
MeshTopologyEdgeList Class
GetEdgesForFace Overload
Rhino.Geometry.Collections Namespace