RhinoCommon SDK
Vector2d.CompareTo Method
 Compares this Vector2d with another Vector2d.
Components evaluation priority is first X, then Y.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CompareTo(
	Vector2d other
)
Public Function CompareTo (
	other As Vector2d
) As Integer
Parameters
other
Type: Rhino.Geometry.Vector2d
The other Vector2d to use in comparison.
Return Value
Type: Int32
 0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
+1: otherwise.
Implements
IComparable<T>.CompareTo(T)
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace