RhinoCommon SDK
SimulatedEnvironment Constructor
Initializes a new instance of the SimulatedEnvironment class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimulatedEnvironment()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace