RhinoCommon SDK
ColorHSL Implicit Conversion (ColorHSL to Color)
Rhino for Mac WIP
 Implicitly converts a ColorHSL in a .Net library color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static implicit operator Color (
	ColorHSL hsl
)
Public Shared Widening Operator CType (
	hsl As ColorHSL
) As Color
Parameters
hsl
Type: Rhino.Display.ColorHSL
A HSL color.
Return Value
Type: Color
A ARGB .Net library color.
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace