RhinoCommon SDK
AngularDimension.GetAngleDisplayText Method
[Missing <summary> documentation for "M:Rhino.Geometry.AngularDimension.GetAngleDisplayText(Rhino.DocObjects.DimensionStyle)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetAngleDisplayText(
	DimensionStyle style
)
Public Function GetAngleDisplayText (
	style As DimensionStyle
) As String
Parameters
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.AngularDimension.GetAngleDisplayText(Rhino.DocObjects.DimensionStyle)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Geometry.AngularDimension.GetAngleDisplayText(Rhino.DocObjects.DimensionStyle)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace