RhinoCommon SDK
NamedPositionTable.Rename Method (Guid, String)
Rename a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Rename(
	Guid id,
	string name
)
Public Function Rename (
	id As Guid,
	name As String
) As Boolean
Parameters
id
Type: System.Guid
 Guid of the Named Position which you want to rename.
name
Type: System.String
 New name for the Named Position.
Return Value
Type: Boolean
 True or False depending on whether the Rename was successful. For example, this method might return False if you attempt to remane the Named Position with the currently assigned name.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
NamedPositionTable Class
Rename Overload
Rhino.DocObjects.Tables Namespace