RhinoCommon SDK
MeshNgonList.GetNgon Method
 Returns the mesh ngon at the given index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshNgon GetNgon(
	int index
)
Public Function GetNgon (
	index As Integer
) As MeshNgon
Parameters
index
Type: System.Int32
Index of ngon to get. Must be larger than or equal to zero and smaller than the Ngon Count of the mesh.
Return Value
Type: MeshNgon
The mesh ngon at the given index. This ngon can be MeshNgon.Empty.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace