RhinoCommon SDK
ModelComponent.LockId Method
 Locks the component Id property.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void LockId()
Public Sub LockId
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace