RhinoCommon SDK
BinaryArchiveException Constructor
 Initializes a new instance of the BinaryArchiveException class.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BinaryArchiveException(
	string message
)
Public Sub New (
	message As String
)
Parameters
message
Type: System.String
The inner message to show to users.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveException Class
Rhino.FileIO Namespace