RhinoCommon SDK
Vector2d.Equality Operator
Rhino for Mac WIP
 Determines whether two vectors have equal values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator ==(
	Vector2d a,
	Vector2d b
)
Public Shared Operator = (
	a As Vector2d,
	b As Vector2d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector2d
The first vector.
b
Type: Rhino.Geometry.Vector2d
The second vector.
Return Value
Type: Boolean
true if components of the two vectors are pairwise equal; otherwise false.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace