RhinoCommon SDK
RhinoObject.IsSubObjectHighlighted Method
 Determines if a subobject is highlighted.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSubObjectHighlighted(
	ComponentIndex componentIndex
)
Public Function IsSubObjectHighlighted (
	componentIndex As ComponentIndex
) As Boolean
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
A subobject component index.
Return Value
Type: Boolean
true if the subobject is highlighted.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace