RhinoCommon SDK
NamedPositionTable.Id Method
Guid of a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id(
	string name
)
Public Function Id (
	name As String
) As Guid
Parameters
name
Type: System.String
 Name of the Named Position for which you want to retrieve the Guid.
Return Value
Type: Guid
 The Guid of the Named Position. If not found, an empty Guid is returned.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace