RhinoCommon SDK
CustomRenderMeshProvider2.BoundingBox Method (ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean)
[Missing <summary> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,Rhino.RhinoDoc,System.Guid,System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override BoundingBox BoundingBox(
	ViewportInfo vp,
	RhinoObject obj,
	RhinoDoc doc,
	Guid requestingPlugIn,
	bool preview
)
Public Overrides Function BoundingBox (
	vp As ViewportInfo,
	obj As RhinoObject,
	doc As RhinoDoc,
	requestingPlugIn As Guid,
	preview As Boolean
) As BoundingBox
Parameters
vp
Type: Rhino.DocObjects.ViewportInfo
[Missing <param name="vp"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,Rhino.RhinoDoc,System.Guid,System.Boolean)"]
obj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="obj"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,Rhino.RhinoDoc,System.Guid,System.Boolean)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,Rhino.RhinoDoc,System.Guid,System.Boolean)"]
requestingPlugIn
Type: System.Guid
[Missing <param name="requestingPlugIn"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,Rhino.RhinoDoc,System.Guid,System.Boolean)"]
preview
Type: System.Boolean
[Missing <param name="preview"/> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,Rhino.RhinoDoc,System.Guid,System.Boolean)"]
Return Value
Type: BoundingBox
[Missing <returns> documentation for "M:Rhino.Render.CustomRenderMeshProvider2.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,Rhino.RhinoDoc,System.Guid,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
CustomRenderMeshProvider2 Class
BoundingBox Overload
Rhino.Render Namespace