RhinoCommon SDK
Extrusion.WallEdge Method
 Gets one of the longitudinal curves along the beam or extrusion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve WallEdge(
	ComponentIndex ci
)
Public Function WallEdge (
	ci As ComponentIndex
) As Curve
Parameters
ci
Type: Rhino.Geometry.ComponentIndex
The index of this profile.
Return Value
Type: Curve
The profile.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace