RhinoCommon SDK
OptionDouble.Finalize Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.OptionDouble.Finalize"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
OptionDouble Class
Rhino.Input.Custom Namespace