RhinoCommon SDK
File3dmNamedConstructionPlanes.IndexOf Method
 Returns the index of a named construction plane.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int IndexOf(
	ConstructionPlane cplane
)
Public Function IndexOf (
	cplane As ConstructionPlane
) As Integer
Parameters
cplane
Type: Rhino.DocObjects.ConstructionPlane
The construction plane to be searched.
Return Value
Type: Int32
The index of the named construction plane, -1 if not found.
Implements
IList<T>.IndexOf(T)
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace