RhinoCommon SDK
Point2f.GreaterThan Operator
 Determines whether the first specified Point2f comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator >(
	Point2f a,
	Point2f b
)
Public Shared Operator > (
	a As Point2f,
	b As Point2f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point2f
First point.
b
Type: Rhino.Geometry.Point2f
Second point.
Return Value
Type: Boolean
true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y; otherwise, false.
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace