RhinoCommon SDK
File3dmStringTable.GetValue Method (String, String)
 Returns a string value given a section and entry.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetValue(
	string section,
	string entry
)
Public Function GetValue (
	section As String,
	entry As String
) As String
Parameters
section
Type: System.String
The section at which to get the value.
entry
Type: System.String
The entry to search for.
Return Value
Type: String
The string value if successful.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
File3dmStringTable Class
GetValue Overload
Rhino.FileIO Namespace