RhinoCommon SDK
Brep.CreateBooleanIntersection Method (IEnumerable<Brep>, IEnumerable<Brep>, Double, Boolean)
 Compute the Solid Intersection of two sets of Breps.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Brep[] CreateBooleanIntersection(
	IEnumerable<Brep> firstSet,
	IEnumerable<Brep> secondSet,
	double tolerance,
	bool manifoldOnly
)
Public Shared Function CreateBooleanIntersection (
	firstSet As IEnumerable(Of Brep),
	secondSet As IEnumerable(Of Brep),
	tolerance As Double,
	manifoldOnly As Boolean
) As Brep()
Parameters
firstSet
Type: System.Collections.Generic.IEnumerable<Brep>
First set of Breps.
secondSet
Type: System.Collections.Generic.IEnumerable<Brep>
Second set of Breps.
tolerance
Type: System.Double
Tolerance to use for intersection operation.
manifoldOnly
Type: System.Boolean
If true, non-manifold input breps are ignored.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
Remarks
The solid orientation of the breps make a difference when calling this function
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Brep Class
CreateBooleanIntersection Overload
Rhino.Geometry Namespace