RhinoCommon SDK
Particle Methods
Rhino for Mac WIP
The Particle type exposes the following members.
Methods
Name | Description
Update
 Base class implementation does nothing.
Top
See Also
Reference
Particle Class
Rhino.Geometry Namespace