RhinoCommon SDK
ColorHSV Methods
The ColorHSV type exposes the following members.
Methods
Name | Description
CreateFromCMYK
 Create the nearest HSV equivalent of a CMYK color.
CreateFromHSL
 Constructs the nearest CMYK equivalent of an HSV color.
CreateFromLAB
 Create the nearest HSV equivalent of a LAB color.
CreateFromLCH
 Create the nearest HSV equivalent of a LCH color.
CreateFromXYZ
 Create the nearest HSV equivalent of an XYZ color.
ToArgbColor
 Convert HSV color to an equivalent System.Drawing.Color.
Top
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace