RhinoCommon SDK
Light Methods
The Light type exposes the following members.
Methods
Name | Description
CreateSunLight(Sun)
 Constructs a light which simulates a Sun.
CreateSunLight(Double, Double, Double)
 Constructs a light that represents the Sun.
CreateSunLight(Double, DateTime, Double, Double)
 Constructs a light which simulates the Sun based on a given time and location on Earth.
In Rhino for Windows, this member is overridden by Dispose(Boolean).
GetAttenuation
 Gets the attenuation settings (ignored for "directional" and "ambient" lights).
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light.
GetSpotLightRadii
 Gets the spot light radii.
In Rhino for Windows, this member is overridden by NonConstOperation().
SetAttenuation
 Sets the attenuation settings (ignored for "directional" and "ambient" lights).
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light.
Top
See Also
Reference
Light Class
Rhino.Geometry Namespace