RhinoCommon SDK
PreviewAppearance Methods
The PreviewAppearance type exposes the following members.
Methods
Name | Description
Background
 Background
Dispose
 Dispose for previewappearance
Finalize
 Destructor for previewappearance
 (Overrides Object.Finalize().)
FromMetaData
 Copy data from MetaData to PreviewAppearance
Geometry
 Geometry
Lighting
 Lighting
RotationType
 RotationType
RotationX
 RotationX
RotationY
 RotationY
SetRotationType
 SetRotationType
SetRotationX
 SetRotationX
SetRotationY
 SetRotationY
SetSize
 SetSize
Size
 Size
ToMetaData
 Copy PreviewAppearance to MetaData
Top
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace