RhinoCommon SDK
PointObject Methods
Rhino for Mac WIP
The PointObject type exposes the following members.
Methods
Name | Description
DuplicatePointGeometry
Top
See Also
Reference
PointObject Class
Rhino.DocObjects Namespace