RhinoCommon SDK
ViewCaptureSettings Methods
The ViewCaptureSettings type exposes the following members.
Methods
Name | Description
Dispose
Actively reclaims unmanaged resources that this instance uses.
Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetMargins
 Get distances from the edge of the paper (MediaSize) to the CropRectangle in a defined unit system
GetOffset
SetLayout
SetMargins
 Set distances from the edge of the paper (MediaSize) to the CropRectange in a defined unit system
SetOffset
Top
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace