RhinoCommon SDK
RenderSourceView Methods
The RenderSourceView type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
GetViewInfo
 Get the ViewInfo as specified by the render source view settings.
Top
See Also
Reference
RenderSourceView Class
Rhino.Render Namespace