RhinoCommon SDK
Arc Operators
Rhino for Mac WIP
The Arc type exposes the following members.
Operators
Name | Description
Equality
 Determines whether two arcs have equal values.
Inequality
 Determines whether two arcs have different values.
Top
See Also
Reference
Arc Structure
Rhino.Geometry Namespace