RhinoCommon SDK
Vector2f Operators
The Vector2f type exposes the following members.
Operators
Name | Description
Equality
 Determines whether two vectors have equal values.
GreaterThan
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
GreaterThanOrEqual
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Inequality
 Determines whether two vectors have different values.
LessThan
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
LessThanOrEqual
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Top
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace