RhinoCommon SDK
Vector3f Operators
Rhino for Mac WIP
The Vector3f type exposes the following members.
Operators
Name | Description
Addition
 Sums up a point and a vector, and returns a new point.
Equality
 Determines whether two vectors have equal values.
GreaterThan
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
GreaterThanOrEqual
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
Inequality
 Determines whether two vectors have different values.
LessThan
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
LessThanOrEqual
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
Multiply(Single, Vector3f)
 Multiplies a vector by a number, having the effect of scaling it.
Multiply(Vector3f, Vector3f)
 Multiplies two vectors together, returning the dot product (or inner product). This differs from the cross product.
Multiply(Vector3f, Single)
 Multiplies a vector by a number, having the effect of scaling it.
Top
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace