RhinoCommon SDK
RenderContent.AddPersistentRenderContent Method
Overload List
Name | Description
AddPersistentRenderContent(RenderContent) |  Obsolete.
 Add a material, environment or texture to the internal RDK document lists as top level content. The content must have been returned from RenderContent::MakeCopy, NewContentFromType or a similar function that returns a non-document content.
AddPersistentRenderContent(RhinoDoc, RenderContent) |  Obsolete.
 Add a material, environment or texture to the internal RDK document lists as top level content. The content must have been returned from RenderContent::MakeCopy, NewContentFromType or a similar function that returns a non-document content.
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace