RhinoCommon SDK
NamedPositionTable.ObjectXform Method
Overload List
Name | Description
ObjectXform(Guid, RhinoObject, Transform)
Retrieve the Transform of a Rhino Object relate dto a Named Position.
ObjectXform(Guid, Guid, Transform)
Retrieve the Transform of a Rhino Object relate dto a Named Position.
Top
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace