RhinoCommon SDK
Material.SetBumpTexture Method
Rhino for Mac WIP
Overload List
Name | Description
SetBumpTexture(String)
SetBumpTexture(Texture)
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace