RhinoCommon SDK
DisplayMaterial.SetBitmapTexture Method
Rhino for Mac WIP
Overload List
Name | Description
SetBitmapTexture(String, Boolean)
SetBitmapTexture(Texture, Boolean)
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace