RhinoCommon SDK
Ray3d.Position Property
 Gets the starting position of this ray.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Position { get; }
Public ReadOnly Property Position As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace