RhinoCommon SDK
Extrusion.IsCappedAtBottom Property
 Gets a value indicating whether the surface that fills the bottom profile is existing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCappedAtBottom { get; }
Public ReadOnly Property IsCappedAtBottom As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace