RhinoCommon SDK
RuiUpdateUi.Enabled Property
Set to true to enable menu item or false to disable menu item
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace