RhinoCommon SDK
NurbsSurfaceKnotList.Item Property
 Gets or sets the knot vector value at the given index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Double
	Get
	Set
Parameters
index
Type: System.Int32
Index of knot to access.
Return Value
Type: Double
The knot value at [index]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace