RhinoCommon SDK
FileObjWriteOptions.CullUnnecessaryVertexesInNgons Property
 Setting to determine whether interior colinear vertexes are part of the ngon.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CullUnnecessaryVertexesInNgons { get; set; }
Public Property CullUnnecessaryVertexesInNgons As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
 Imagine a plane that has been split and then rejoined. If IncludeUnweldedEdgesInNgons is setr to true then you would get an ngon with 6 vertexes, the corners and one on each edge that was split. Setting this to true would remove those 2 vertexes from the interior of the edge. TODO This is not hooked up yet, Dale hasn't made this available yet. See RH-30673.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace