RhinoCommon SDK
RuiUpdateUi.MenuId Property
Id of the menu that owns this menu item
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid MenuId { get; }
Public ReadOnly Property MenuId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace