RhinoCommon SDK
RhinoTransformObjectsEventArgs.ObjectsWillBeCopied Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoTransformObjectsEventArgs.ObjectsWillBeCopied"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ObjectsWillBeCopied { get; }
Public ReadOnly Property ObjectsWillBeCopied As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace