RhinoCommon SDK
ExtrusionObject.ExtrusionGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ExtrusionObject.ExtrusionGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Extrusion ExtrusionGeometry { get; }
Public ReadOnly Property ExtrusionGeometry As Extrusion
	Get
Property Value
Type: Extrusion
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ExtrusionObject Class
Rhino.DocObjects Namespace