RhinoCommon SDK
PointCloudItem.Normal Property
 Gets or sets the normal vector for this point cloud item.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d Normal { get; set; }
Public Property Normal As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace