RhinoCommon SDK
File3dmSettings.PageRelativeTolerance Property
Gets or sets the page space relative tolerance.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PageRelativeTolerance { get; set; }
Public Property PageRelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace