RhinoCommon SDK
FileWriteOptions.WriteAsTemplate Property
 Write as template
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WriteAsTemplate { get; set; }
Public Property WriteAsTemplate As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace