RhinoCommon SDK
SurfaceCurvature.UVPoint Property
 Gets the UV location where the curvature was computed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d UVPoint { get; }
Public ReadOnly Property UVPoint As Point2d
	Get
Property Value
Type: Point2d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace