RhinoCommon SDK
CommonComponentTable<T>.Count Property
 Returns the count of all items, including deleted ones.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual int Count { get; }
Public Overridable ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
IReadOnlyCollection<T>.Count
ICollection<T>.Count
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CommonComponentTable<T> Class
Rhino.FileIO Namespace