RhinoCommon SDK
Texture.MappingChannelId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Texture.MappingChannelId"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MappingChannelId { get; }
Public ReadOnly Property MappingChannelId As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Texture Class
Rhino.DocObjects Namespace