RhinoCommon SDK
DrawForegroundEventArgs.DrawWorldAxes Property
[Missing <summary> documentation for "P:Rhino.Display.DrawForegroundEventArgs.DrawWorldAxes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawWorldAxes { get; set; }
Public Property DrawWorldAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DrawForegroundEventArgs Class
Rhino.Display Namespace