RhinoCommon SDK
File3dmWriteOptions.SaveUserData Property
 Include custom user data in the file. Default is true
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SaveUserData { get; set; }
Public Property SaveUserData As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace