RhinoCommon SDK
ParticleSystem.BoundingBox Property
[Missing <summary> documentation for "P:Rhino.Geometry.ParticleSystem.BoundingBox"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace