RhinoCommon SDK
DrawForegroundEventArgs.WorldAxesDrawn Property
[Missing <summary> documentation for "P:Rhino.Display.DrawForegroundEventArgs.WorldAxesDrawn"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WorldAxesDrawn { get; set; }
Public Property WorldAxesDrawn As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DrawForegroundEventArgs Class
Rhino.Display Namespace