RhinoCommon SDK
FileObjWriteOptions.UnderbarMaterialNames Property
 Enable/disable replacing white space with underbars in material names.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UnderbarMaterialNames { get; set; }
Public Property UnderbarMaterialNames As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace