RhinoCommon SDK
MeshVertexStatusList.Count Property
 Gets or sets the number of hidden vertices. For this to be a valid part of a mesh, this count should be the same as the one of mesh vertices.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; set; }
Public Property Count As Integer
	Get
	Set
Property Value
Type: Int32
Implements
IResizableList<T>.Count
ICollection<T>.Count
ICollection.Count
IReadOnlyCollection<T>.Count
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshVertexStatusList Class
Rhino.Geometry.Collections Namespace