RhinoCommon SDK
Vector3d.Unset Property
 Gets the value of the vector with each component set to RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3d Unset { get; }
Public Shared ReadOnly Property Unset As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace