RhinoCommon SDK
FileObjWriteOptions.UseRelativeIndexing Property
 Determines whether to use relative indexing. TRUE = use relative (negative) indexing FALSE = use absolute (positive) indexing
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseRelativeIndexing { get; set; }
Public Property UseRelativeIndexing As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
 This only has an impact on non-mesh output. There is also no interface in the OBJ export plugin so code executed when set to true has not been thoroughly tested. It has been there forever and migrated with each successive revision of OBJ export code.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace