RhinoCommon SDK
ICurrentEnvironment_Get.ForReflectionAndRefraction Property
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment_Get.ForReflectionAndRefraction"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
RenderEnvironment ForReflectionAndRefraction { get; }
ReadOnly Property ForReflectionAndRefraction As RenderEnvironment
	Get
Property Value
Type: RenderEnvironment
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ICurrentEnvironment_Get Interface
Rhino.Render Namespace