RhinoCommon SDK
DisplayPipeline.DpiScale Property
 Scale factor used for high resolution displays. When a monitor that this pipeline is drawing to is at a DPI of 96, this value is one. On high DPI monitors, this value will commonly be greater than one.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float DpiScale { get; }
Public ReadOnly Property DpiScale As Single
	Get
Property Value
Type: Single
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace