RhinoCommon SDK
Interval.IsValid Property
 Gets a value indicating whether or not this Interval is valid. Valid intervals must contain valid numbers.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Interval Structure
Rhino.Geometry Namespace