RhinoCommon SDK
BrepFace.FaceIndex Property
Index of face in Brep.Faces array.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FaceIndex { get; }
Public ReadOnly Property FaceIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace