RhinoCommon SDK
Arc.AngleDomain Property
 Gets or sets the angle domain (in Radians) of this arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval AngleDomain { get; set; }
Public Property AngleDomain As Interval
	Get
	Set
Property Value
Type: Interval
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Arc Structure
Rhino.Geometry Namespace