RhinoCommon SDK
ViewportInfo.FrustumCenter Property
 Gets the frustum center point.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d FrustumCenter { get; }
Public ReadOnly Property FrustumCenter As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace