RhinoCommon SDK
GroupTableEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.GroupTableEventArgs.Document"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace