RhinoCommon SDK
ControlPoint.Weight Property
 Gets or sets the weight of this control point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Weight { get; set; }
Public Property Weight As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace