RhinoCommon SDK
MeshDisplacementInfo.RefineSensitivity Property
Specifies how sensitive the divider for contrasts is on the displacement texture.
Specify 1 to split all mesh edges on each refine step.
Specify 0.99 to make even slight contrasts on the displacement texture cause edges to be split.
Specifying 0.01 only splits edges where heavy contrast exists.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double RefineSensitivity { get; set; }
Public Property RefineSensitivity As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace