RhinoCommon SDK
DrawEventArgs.Display Property
[Missing <summary> documentation for "P:Rhino.Display.DrawEventArgs.Display"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipeline Display { get; }
Public ReadOnly Property Display As DisplayPipeline
	Get
Property Value
Type: DisplayPipeline
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DrawEventArgs Class
Rhino.Display Namespace