RhinoCommon SDK
FileObjWriteOptions.EolType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjWriteOptions.EolType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileObjWriteOptions.AsciiEol EolType { get; set; }
Public Property EolType As FileObjWriteOptions.AsciiEol
	Get
	Set
Property Value
Type: FileObjWriteOptions.AsciiEol
Remarks
 Alias/Wavefront OBJ files are ASCII files. Generally they should have a LF (UNIX) as the end-of-line marker.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace