RhinoCommon SDK
ControlPoint.Unset Property
 Gets the predefined, unset control point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ControlPoint Unset { get; }
Public Shared ReadOnly Property Unset As ControlPoint
	Get
Property Value
Type: ControlPoint
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace