RhinoCommon SDK
File3dmPlugInDataTable.Count Property
 Gets the number of File3dmPlugInData in this table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace