RhinoCommon SDK
LinearWorkflow.PreProcessTextures Property
 Linear workflow active state
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool PreProcessTextures { get; set; }
Public Property PreProcessTextures As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace