RhinoCommon SDK
MeshDisplacementInfo.MappingTransform Property
 Texture mapping transform.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform MappingTransform { get; set; }
Public Property MappingTransform As Transform
	Get
	Set
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace