RhinoCommon SDK
Particle.ParentSystem Property
 Gets the parent particle system of this particle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ParticleSystem ParentSystem { get; }
Public ReadOnly Property ParentSystem As ParticleSystem
	Get
Property Value
Type: ParticleSystem
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Particle Class
Rhino.Geometry Namespace