RhinoCommon SDK
StringParserSettings.ParseSettingsRealNumber Property
 - The real number settings parse and optional unary + or unary - and then parse a number that can be integer, decimal, scientific e notation or pi.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static StringParserSettings ParseSettingsRealNumber { get; }
Public Shared ReadOnly Property ParseSettingsRealNumber As StringParserSettings
	Get
Property Value
Type: StringParserSettings
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace