RhinoCommon SDK
BoundingBox.Area Property
 Gets the area of this BoundingBox.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace