RhinoCommon SDK
RevSurface.Curve Property
 Gets the revolute curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve Curve { get; }
Public ReadOnly Property Curve As Curve
	Get
Property Value
Type: Curve
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace