RhinoCommon SDK
Light.Ambient Property
 Gets or sets the ambient color.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color Ambient { get; set; }
Public Property Ambient As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Light Class
Rhino.Geometry Namespace