RhinoCommon SDK
NurbsSurfaceKnotList.ClampedAtStart Property
Determines if a knot vector is clamped.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ClampedAtStart { get; }
Public ReadOnly Property ClampedAtStart As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace