RhinoCommon SDK
PanelEventArgs.Document Property
Rhino for Mac WIP
[Missing <summary> documentation for "P:Rhino.UI.PanelEventArgs.Document"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
PanelEventArgs Class
Rhino.UI Namespace