RhinoCommon SDK
PanelIds.Display Property
[Missing <summary> documentation for "P:Rhino.UI.PanelIds.Display"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Display { get; }
Public Shared ReadOnly Property Display As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PanelIds Class
Rhino.UI Namespace