RhinoCommon SDK
Brep.Edges Property
 Gets the brep edges list accessor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepEdgeList Edges { get; }
Public ReadOnly Property Edges As BrepEdgeList
	Get
Property Value
Type: BrepEdgeList
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Brep Class
Rhino.Geometry Namespace