RhinoCommon SDK
OpenFileDialog.Title Property
 Gets or sets the file dialog box title.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Title { get; set; }
Public Property Title As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace