RhinoCommon SDK
FileWriteOptions.IncludeBitmapTable Property
 The file written should include the bitmap table if your File Writing Plug-in supports it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludeBitmapTable { get; set; }
Public Property IncludeBitmapTable As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace