RhinoCommon SDK
Dimension.AltSuffix Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltSuffix"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string AltSuffix { get; set; }
Public Property AltSuffix As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Dimension Class
Rhino.Geometry Namespace