RhinoCommon SDK
UndoRedoEventArgs.IsBeginRedo Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsBeginRedo"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsBeginRedo { get; }
Public ReadOnly Property IsBeginRedo As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace