RhinoCommon SDK
DisplayBitmapDrawList.MaximumCachedSortLists Property
 Maximum number of cached sort order index lists stored on this class. Default is 10, but depending on the number of points in this list you may get better performance by setting this value to a certain percentage of the point count.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MaximumCachedSortLists { get; set; }
Public Property MaximumCachedSortLists As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace