RhinoCommon SDK
NurbsCurve.Points Property
 Gets access to the control points of this nurbs curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurvePointList Points { get; }
Public ReadOnly Property Points As NurbsCurvePointList
	Get
Property Value
Type: NurbsCurvePointList
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace