RhinoCommon SDK
MouseCallbackEventArgs.View Property
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.View"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoView View { get; }
Public ReadOnly Property View As RhinoView
	Get
Property Value
Type: RhinoView
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace