RhinoCommon SDK
TextLog.IndentSize Property
 0: one tab per indent. >0: number of spaces per indent
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int IndentSize { get; set; }
Public Property IndentSize As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TextLog Class
Rhino.FileIO Namespace