RhinoCommon SDK
Plane.Unset Property
 Gets a plane that contains Unset origin and axis vectors.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Plane Unset { get; }
Public Shared ReadOnly Property Unset As Plane
	Get
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Plane Structure
Rhino.Geometry Namespace