RhinoCommon SDK
FileObjWriteOptions.IncludeUnweldedEdgesInNgons Property
 Setting to determine whether unwelded edges are ignored in the creation of an ngon.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludeUnweldedEdgesInNgons { get; set; }
Public Property IncludeUnweldedEdgesInNgons As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
 Imagine a plane that has been split and then rejoined. This setting determines if you will get one or twon ngons in the output. TODO This is not hooked up yet, Dale hasn't made this available yet. See RH-30673.
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace