RhinoCommon SDK
Material.AmbientColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.AmbientColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color AmbientColor { get; set; }
Public Property AmbientColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Material Class
Rhino.DocObjects Namespace