RhinoCommon SDK
Vector3f.Z Property
 Gets or sets the Z (third) component of this vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float Z { get; set; }
Public Property Z As Single
	Get
	Set
Property Value
Type: Single
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace