RhinoCommon SDK
DisplayPipelineAttributes.ViewDisplayAttributes.VerticalViewportScale Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes.VerticalViewportScale"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double VerticalViewportScale { get; set; }
Public Property VerticalViewportScale As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace