RhinoCommon SDK
DisplayPipeline.ModelTransformIsIdentity Property
 Gets a value that indicates whether the Model Transform is an Identity transformation.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ModelTransformIsIdentity { get; }
Public ReadOnly Property ModelTransformIsIdentity As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace