RhinoCommon SDK
HiddenLineDrawingParameters.Flatten Property
 Flatten the computed geometry
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Flatten { get; set; }
Public Property Flatten As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace