RhinoCommon SDK
ColorHSL.H Property
 Gets or sets the hue channel value. Hue channels rotate between 0.0 and 1.0.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double H { get; set; }
Public Property H As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace