RhinoCommon SDK
UserData.Description Property
Descriptive name of the user data.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual string Description { get; }
Public Overridable ReadOnly Property Description As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace