RhinoCommon SDK
ToolbarFile.Path Property
Full path to this file on disk
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace