RhinoCommon SDK
MouseCursor.Location Property
 Retrieves the position of the mouse cursor, in screen coordinates
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point2d Location { get; }
Public Shared ReadOnly Property Location As Point2d
	Get
Property Value
Type: Point2d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
MouseCursor Class
Rhino.UI Namespace