RhinoCommon SDK
MostRecentCommandDescription.Macro Property
[Missing <summary> documentation for "P:Rhino.Commands.MostRecentCommandDescription.Macro"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Macro { get; set; }
Public Property Macro As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MostRecentCommandDescription Class
Rhino.Commands Namespace