RhinoCommon SDK
Sphere.EquitorialPlane Property
 Gets or sets the Equatorial plane for this sphere.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane EquitorialPlane { get; set; }
Public Property EquitorialPlane As Plane
	Get
	Set
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace