RhinoCommon SDK
RhinoObject.RuntimeSerialNumber Property
 Gets the objects runtime serial number.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint RuntimeSerialNumber { get; }
Public ReadOnly Property RuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace