RhinoCommon SDK
Material.MaxShine Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.MaxShine"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double MaxShine { get; }
Public Shared ReadOnly Property MaxShine As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Material Class
Rhino.DocObjects Namespace