RhinoCommon SDK
Arc.StartPoint Property
 Gets the start point of the arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d StartPoint { get; }
Public ReadOnly Property StartPoint As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Arc Structure
Rhino.Geometry Namespace