RhinoCommon SDK
CommandEventArgs.DocumentRuntimeSerialNumber Property
Rhino for Mac WIP
[Missing <summary> documentation for "P:Rhino.Commands.CommandEventArgs.DocumentRuntimeSerialNumber"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public uint DocumentRuntimeSerialNumber { get; }
Public ReadOnly Property DocumentRuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace