RhinoCommon SDK
DisplayPipeline.SupportsShading Property
 Gets whether or not this pipeline supports shaded meshes.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SupportsShading { get; }
Public ReadOnly Property SupportsShading As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace