RhinoCommon SDK
CurveIntersections.Item Property
 Gets the intersection event data at the given index.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntersectionEvent this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As IntersectionEvent
	Get
Parameters
index
Type: System.Int32
Index of intersection event to retrieve.
Property Value
Type: IntersectionEvent
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace