RhinoCommon SDK
RhinoViewport.IsValidFrustum Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.IsValidFrustum"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValidFrustum { get; }
Public ReadOnly Property IsValidFrustum As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace