RhinoCommon SDK
MaterialRefs.Keys Property
 Gets an ICollection containing the plug-in Id's in this dictionary.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ICollection<Guid> Keys { get; }
Public ReadOnly Property Keys As ICollection(Of Guid)
	Get
Property Value
Type: ICollection<Guid>
Implements
IDictionary<TKey, TValue>.Keys
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace