RhinoCommon SDK
File3dmSettings.PageAngleToleranceDegrees Property
Gets or sets the page space angle tolerance.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PageAngleToleranceDegrees { get; set; }
Public Property PageAngleToleranceDegrees As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace