RhinoCommon SDK
InstanceDefinition.UrlDescription Property
 The URL description displayed as a hyperlink in the Insert and Block UI
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string UrlDescription { get; }
Public ReadOnly Property UrlDescription As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace