RhinoCommon SDK
LinearDimension.Arrowhead2End Property
 Gets the arrow head end of the second extension line.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d Arrowhead2End { get; }
Public ReadOnly Property Arrowhead2End As Point2d
	Get
Property Value
Type: Point2d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace