RhinoCommon SDK
DisplayPipeline.IsPrinting Property
 Gets a value that indicates whether this pipeline is currently drawing for printing purposes.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPrinting { get; }
Public ReadOnly Property IsPrinting As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace