RhinoCommon SDK
DisplayPipeline.DepthMode Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.DepthMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DepthMode DepthMode { get; set; }
Public Property DepthMode As DepthMode
	Get
	Set
Property Value
Type: DepthMode
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace