RhinoCommon SDK
HistoryRecord.CopyOnReplaceObject Property
 When an object is replaced and the old object has a history record with this field set, the history record is copied and attached to the new object. That allows a descendant object to continue the history linkage after it is edited.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CopyOnReplaceObject { get; set; }
Public Property CopyOnReplaceObject As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace