RhinoCommon SDK
FileObjReadOptions.UseObjGroupsAs Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjReadOptions.UseObjGroupsAs"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileObjReadOptions.UseObjGsAs UseObjGroupsAs { get; set; }
Public Property UseObjGroupsAs As FileObjReadOptions.UseObjGsAs
	Get
	Set
Property Value
Type: FileObjReadOptions.UseObjGsAs
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace