RhinoCommon SDK
ColorLCH.C Property
 Gets or sets the Chroma channel. Chroma is defined from -1.0 to +1.0.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double C { get; set; }
Public Property C As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace