RhinoCommon SDK
InstanceDefinition.Id Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.Id"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace