RhinoCommon SDK
Vector3d.Item Property
 Gets or sets a vector component at the given index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Double
	Get
	Set
Parameters
index
Type: System.Int32
Index of vector component. Valid values are:
0 = X-component
1 = Y-component
2 = Z-component
 .
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace