RhinoCommon SDK
Cone.Height Property
 Gets or sets the height of the circular right cone.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Cone Structure
Rhino.Geometry Namespace