RhinoCommon SDK
Point4d.W Property
 Gets or sets the W (fourth) coordinate -or weight- of this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double W { get; set; }
Public Property W As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace