RhinoCommon SDK
Texture.FileReference Property
 Gets or sets a copy of the file reference that is used by this texture.
Remarks
After the get or the set method complete, you own the copy you received or passed in, and can Dispose() of it.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileReference FileReference { get; set; }
Public Property FileReference As FileReference
	Get
	Set
Property Value
Type: FileReference
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Texture Class
Rhino.DocObjects Namespace