RhinoCommon SDK
RhinoViewport.ScreenPortAspect Property
 screen port's width/height.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ScreenPortAspect { get; }
Public ReadOnly Property ScreenPortAspect As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace