RhinoCommon SDK
RhinoViewport.IsPerspectiveProjection Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.IsPerspectiveProjection"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPerspectiveProjection { get; }
Public ReadOnly Property IsPerspectiveProjection As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace