RhinoCommon SDK
Command.LastCommandId Property
 Gets the ID of the last commands.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid LastCommandId { get; }
Public Shared ReadOnly Property LastCommandId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Command Class
Rhino.Commands Namespace