RhinoCommon SDK
Vector2d.Unset Property
 Gets the value of the vector with components set as RhinoMath.UnsetValue,RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector2d Unset { get; }
Public Shared ReadOnly Property Unset As Vector2d
	Get
Property Value
Type: Vector2d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace