RhinoCommon SDK
TextDot.Point Property
 Gets or sets the position of the textdot.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Point { get; set; }
Public Property Point As Point3d
	Get
	Set
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TextDot Class
Rhino.Geometry Namespace