RhinoCommon SDK
SweepTwoRail.MaintainHeight Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepTwoRail.MaintainHeight"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MaintainHeight { get; set; }
Public Property MaintainHeight As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace