RhinoCommon SDK
GumballFrame.Plane Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballFrame.Plane"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GumballFrame Structure
Rhino.UI.Gumball Namespace