RhinoCommon SDK
ReduceMeshParameters.AllowDistortion Property
If true mesh appearance is not changed even if the target polygon count is not reached
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AllowDistortion { get; set; }
Public Property AllowDistortion As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace