RhinoCommon SDK
GumballPickResult Properties
Rhino for Mac WIP
The GumballPickResult type exposes the following members.
Properties
Name | Description
Mode
Top
See Also
Reference
GumballPickResult Class
Rhino.UI.Gumball Namespace