RhinoCommon SDK
GroupTableEventArgs Properties
The GroupTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
Top
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace