RhinoCommon SDK
ExtrusionObject Properties
Rhino for Mac WIP
The ExtrusionObject type exposes the following members.
Properties
Name | Description
ExtrusionGeometry
Top
See Also
Reference
ExtrusionObject Class
Rhino.DocObjects Namespace