RhinoCommon SDK
Skylight Properties
The Skylight type exposes the following members.
Properties
Name | Description
Enabled
 Return true if skylight is enabled
ShadowIntensity
 Get shadow intensity for skylight
UsesCustomEnvironment
 Return true if skylight uses custom environment
Top
See Also
Reference
Skylight Class
Rhino.Render.ChangeQueue Namespace