RhinoCommon SDK
GetTransform Properties
Rhino for Mac WIP
The GetTransform type exposes the following members.
Properties
Name | Description
HaveTransform
ObjectList
Transform
Top
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace