RhinoCommon SDK
ViewCaptureSettings Properties
The ViewCaptureSettings type exposes the following members.
Properties
Name | Description
CropRectangle
 Actual area of output rectangle that view capture is sent to.
DrawAxis
DrawBackground
DrawBackgroundBitmap
DrawClippingPlanes
DrawGrid
DrawLights
DrawLockedObjects
DrawMargins
DrawSelectedObjectsOnly
DrawWallpaper
IsValid
MediaSize
 Total size of the image or page in dots
OffsetAnchor
Resolution
 Capture "density" in dots per inch
Top
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace