RhinoCommon SDK
Font Properties
The Font type exposes the following members.
Properties
Name | Description
Bold
FaceName
Italic
PointSize
Strikeout
Style
Underlined
Weight
Top
See Also
Reference
Font Class
Rhino.DocObjects Namespace