RhinoCommon SDK
FileWriteOptions Properties
The FileWriteOptions type exposes the following members.
Properties
Name | Description
ApplyTransform
FileVersion
IncludeBitmapTable
 The file written should include the bitmap table if your File Writing Plug-in supports it.
IncludeHistory
 The file written should include history information if your File Writing Plug-In supports it.
IncludePreviewImage
 The file written should include a preview image if your File Writing Plug-in supports it.
IncludeRenderMeshes
 The file written should include the render meshes if your File Writing Plug-in supports it.
SuppressDialogBoxes
 If true, it means the command has been run with a '-', meaning you should not ask questions during writing. (no dialogs, no "getters", etc.)
WriteAsTemplate
 Write as template
WriteGeometryOnly
 If true, the file written should include only geometry File Writing Plug-in supports it.
WriteSelectedObjectsOnly
 If true, this command should export only the objects currently selected in the Rhino model.
WriteUserData
 If true, the file written should include User Data if your File Writing Plug-in supports it.
Xform
Top
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace