RhinoCommon SDK
BinaryArchiveFile Properties
Rhino for Mac WIP
The BinaryArchiveFile type exposes the following members.
Properties
Name | Description
Reader
Writer
Top
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace