RhinoCommon SDK
MeshObject Properties
Rhino for Mac WIP
The MeshObject type exposes the following members.
Properties
Name | Description
MeshGeometry
Top
See Also
Reference
MeshObject Class
Rhino.DocObjects Namespace