RhinoCommon SDK
CurveObject Properties
Rhino for Mac WIP
The CurveObject type exposes the following members.
Properties
Name | Description
CurveGeometry
Top
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace