RhinoCommon SDK
FileType Properties
Rhino for Mac WIP
The FileType type exposes the following members.
Properties
Name | Description
Description
Extension
Top
See Also
Reference
FileType Class
Rhino.FileIO Namespace