RhinoCommon SDK
OptionColor Properties
Rhino for Mac WIP
The OptionColor type exposes the following members.
Properties
Name | Description
CurrentValue
InitialValue
Top
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace