RhinoCommon SDK
RunMode Enumeration
 Provides enumerated constants for a command running mode. This is currently interactive or scripted.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum RunMode
Public Enumeration RunMode
Members
Member name | Value | Description
Interactive | 0 |  Can use dialogs for input. Must use message boxes to report serious error conditions.
Scripted | 1 |  All input must come from command line, GetPoint, GetObject, GetString, etc. Must use message boxes to report serious error conditions. Script mode gets used when a command is run with a hyphen (-) prefix.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Commands Namespace