RhinoCommon SDK
IRhRdkThumbnail Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IRhRdkThumbnail
Public Interface IRhRdkThumbnail
The IRhRdkThumbnail type exposes the following members.
Methods
Name | Description
Dib
GetDib
GetDisplayRect
Id
IsHot
IsSelected
Label
Top
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace