RhinoCommon SDK
DecalCreateParams Class
 Used by RhinoObject.AddDecal() to create and add a decal
Inheritance Hierarchy
System.Object
 Rhino.Render.DecalCreateParams
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DecalCreateParams
Public Class DecalCreateParams
The DecalCreateParams type exposes the following members.
Constructors
Name | Description
DecalCreateParams
Initializes a new instance of the DecalCreateParams class
Top
Properties
Name | Description
DecalMapping
DecalProjection
EndLatitude
EndLongitude
Height
MapToInside
MaxU
MaxV
MinU
MinV
Origin
Radius
StartLatitude
StartLongitude
TextureInstanceId
Transparency
VectorAcross
VectorUp
Top
Methods
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Render Namespace