RhinoCommon SDK
ExtrusionObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.ExtrusionObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.ExtrusionObject
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ExtrusionObject : RhinoObject
Public Class ExtrusionObject
	Inherits RhinoObject
The ExtrusionObject type exposes the following members.
Properties
Name | Description
ExtrusionGeometry
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
In Rhino for Windows 6.0 BETA, this member is inherited from .CommonObjectIsValid.
Top
Methods
Name | Description
DuplicateExtrusionGeometry
Top
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.DocObjects Namespace