RhinoCommon SDK
RhinoSettings Class
[Missing <summary> documentation for "T:Rhino.Render.DataSources.RhinoSettings"]
Inheritance Hierarchy
System.Object
 Rhino.Render.DataSources.RhinoSettings
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class RhinoSettings : IDisposable
Public NotInheritable Class RhinoSettings
	Implements IDisposable
The RhinoSettings type exposes the following members.
Constructors
Name | Description
RhinoSettings
Initializes a new instance of the RhinoSettings class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
ActiveView
Dispose
Releases all resources used by the RhinoSettings
Finalize |  (Overrides Object.Finalize().)
GetCustomRenderSizes
GetRenderSettings
SetRenderSettings
Top
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Render.DataSources Namespace