RhinoCommon SDK
Dimension.ForceText Enumeration
 Text forced Inside, Right or Left of extension lines, or moved to fit (Auto).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ForceText
Public Enumeration ForceText
Members
Member name | Value | Description
Auto | 0
Inside | 1
Right | 2
Left | 3
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Rhino.Geometry Namespace