RhinoCommon SDK
PanelEventArgs Class
 Panels.Show event arguments
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.UI.PanelEventArgs
 Rhino.UI.ShowPanelEventArgs
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class PanelEventArgs : EventArgs
Public Class PanelEventArgs
	Inherits EventArgs
The PanelEventArgs type exposes the following members.
Constructors
Name | Description
PanelEventArgs
Initializes a new instance of the PanelEventArgs class
Top
Properties
Name | Description
Document
DocumentSerialNumber
PanelId
 Class Id for panel being shown or hidden
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace