RhinoCommon SDK
ContentUuids Class
 Content Guids of RenderContent provided by the RDK SDK. These Guids can be used to check against RenderContent.TypeId.
Inheritance Hierarchy
System.Object
 Rhino.Render.ContentUuids
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class ContentUuids
Public NotInheritable Class ContentUuids
The ContentUuids type exposes the following members.
Properties
Name | Description
AdvancedDotTextureType
BasicEnvironmentCCI
BasicEnvironmentType
BasicMaterialCCI
BasicMaterialType
BitmapTextureType
BlendMaterialCCI
BlendMaterialType
BlendTextureType
CompositeMaterialCCI
CompositeMaterialType
CrossHatchBumpTexture
CubeMapTextureType
DefaultEnvironmentInstance
DefaultMaterialInstance
DotBumpTexture
ExposureTextureType
EXRTextureType
FBmTextureType
GemMaterialType
GlassMaterialType
GradientTextureType
GraniteTextureType
GridTextureType
GritBumpTexture
HatchBumpTexture
HDRTextureType
LeatherBumpTexture
MarbleTextureType
MaskTextureType
MetalMaterialType
NoiseTextureType
PaintMaterialType
PerlinMarbleTextureType
PerturbingTextureType
PictureMaterialType
PlasterMaterialType
PlasticMaterialType
ProjectionChangerTextureType
RealtimeDisplayMaterialType
ResampleTextureType
SimpleBitmapTextureType
SingleColorTextureType
SpeckleBumpTexture
StuccoTextureType
Texture2DCheckerTextureType
Texture3DCheckerTextureType
TextureAdjustmentTextureType
TileTextureType
TurbulenceTextureType
WavesTextureType
WoodBumpTexture
WoodTextureType
Top
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Rhino.Render Namespace