RhinoCommon SDK
RenderMaterial.PreviewGeometryType Enumeration
 Geometry that appears in preview panes
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum PreviewGeometryType
Public Enumeration PreviewGeometryType
Members
Member name | Value | Description
Cone | 2
Cube | 1
Plane | 5
Pyramid | 3
Sphere | 0
Torus | 4
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Rhino.Render Namespace