RhinoCommon SDK
Environment Class
 ChangeQueue environment
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.Environment
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Environment
Public Class Environment
The Environment type exposes the following members.
Methods
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Render.ChangeQueue Namespace