RhinoCommon SDK
FilePdf Class
 Support for PDF file format
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FilePdf
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class FilePdf
Public MustInherit Class FilePdf
The FilePdf type exposes the following members.
Constructors
Name | Description
FilePdf
Initializes a new instance of the FilePdf class
Top
Methods
Name | Description
AddPage
 Add a new page to this document
Create
 Create a new instance of a FilePdf class
FirePreWriteEvent
 Called by the framework to fire a PreWrite event
PdfDocumentImplementation
 Get actual implementation of PdfDocument class
Write(Stream)
 Write pdf to a stream
Write(String)
 Write pdf to a file
Top
Events
Name | Description
PreWrite
 Fired immediately before a Pdf is written
Top
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.FileIO Namespace