RhinoCommon SDK
FileObjWriteOptions.ObjObjectNames Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileObjWriteOptions.ObjObjectNames"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ObjObjectNames
Public Enumeration ObjObjectNames
Members
Member name | Value | Description
NoObjects | 0 |  Object names are not exported
ObjectAsGroup | 1 |  Rhino Object names are exported as OBJ groups
ObjectAsObject | 2 |  Rhino Object names are exported as OBJ objects
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Rhino.FileIO Namespace