RhinoCommon SDK
File3dmLayerTable Class
 Provides access to layers in the 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<Layer>
 Rhino.FileIO.File3dmCommonComponentTable<Layer>
 Rhino.FileIO.File3dmLayerTable
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class File3dmLayerTable : File3dmCommonComponentTable<Layer>,
	IList<Layer>, ICollection<Layer>, IEnumerable<Layer>,
	IEnumerable
Public Class File3dmLayerTable
	Inherits File3dmCommonComponentTable(Of Layer)
	Implements IList(Of Layer), ICollection(Of Layer),
	IEnumerable(Of Layer), IEnumerable
The File3dmLayerTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns Layer.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
Methods
Name | Description
FindIndex
 Retrieves a Layer object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds a Layer given its name.
FindNameHash
 Finds a Layer given its name hash.
Top
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.FileIO Namespace