RhinoCommon SDK
IRhRdkThumbnailList_Modes Enumeration
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Modes"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum IRhRdkThumbnailList_Modes
Public Enumeration IRhRdkThumbnailList_Modes
Members
Member name | Value | Description
Grid | 0 | Big thumbnails like Explorer icon mode (default).
List | 1 | Small thumbnails and info on right like Explorer report mode.
Tree | 2 | Tree view mode.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace