RhinoCommon SDK
RenderContentEventArgs Class
[Missing <summary> documentation for "T:Rhino.Render.RenderContentEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RenderContentEventArgs
 Rhino.Render.RenderContentChangedEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderContentEventArgs : EventArgs
Public Class RenderContentEventArgs
	Inherits EventArgs
The RenderContentEventArgs type exposes the following members.
Properties
Name | Description
Content
Document
Reason
Top
Methods
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Render Namespace