RhinoCommon SDK
FileObjWriteOptions.ObjGroupNames Enumeration
[Missing <summary> documentation for "T:Rhino.FileIO.FileObjWriteOptions.ObjGroupNames"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ObjGroupNames
Public Enumeration ObjGroupNames
Members
Member name | Value | Description
NoGroups | 0 |  Neither layer or group names are exported as OBJ groups
LayerAsGroup | 1 |  Rhino layer names are exported as OBJ groups
GroupAsGroup | 2 |  Rhino group names are exported as OBJ groups
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Rhino.FileIO Namespace