RhinoCommon SDK
BlendType Enumeration
 Blend types used for creating filleted Brep edges
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum BlendType
Public Enumeration BlendType
Members
Member name | Value | Description
Chamfer | 0 |  Creates a ruled surface between brep edges with varying chamfer distances.
Fillet | 1 |  Creates a tangent surface between brep edges with varying radius values.
Blend | 2 |  Creates a curvature-continuous blend surface between brep edges with varying radius values.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Geometry Namespace