RhinoCommon SDK
MappingChannelCollection Class
 MappingChannels for a Mesh
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.MappingChannelCollection
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MappingChannelCollection
Public Class MappingChannelCollection
The MappingChannelCollection type exposes the following members.
Properties
Name | Description
Channels
 Enumerate all available channels in this mapping
Count
 Get count of MappingChannels in this collection
Item
 Get MappingChannel on index
Top
Methods
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Rhino.Render.ChangeQueue Namespace