RhinoCommon SDK
SceneServerDataUsage Enumeration
 SceneServerData Usage (Synchronous or Asynchronous)
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SceneServerDataUsage
Public Enumeration SceneServerDataUsage
Members
Member name | Value | Description
Synchronous | 0
Asynchronous | 1
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Render Namespace