RhinoCommon SDK
RenderContentKindList Class
[Missing <summary> documentation for "T:Rhino.Render.RenderContentKindList"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderContentKindList
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class RenderContentKindList : IDisposable
Public NotInheritable Class RenderContentKindList
	Implements IDisposable
The RenderContentKindList type exposes the following members.
Constructors
Name | Description
RenderContentKindList
Initializes a new instance of the RenderContentKindList class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Count
Dispose
Releases all resources used by the RenderContentKindList
Finalize |  (Overrides Object.Finalize().)
SingleKind
Top
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Rhino.Render Namespace