RhinoCommon SDK
TextureEnvironmentMappingMode Enumeration
[Missing <summary> documentation for "T:Rhino.Render.TextureEnvironmentMappingMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextureEnvironmentMappingMode
Public Enumeration TextureEnvironmentMappingMode
Members
Member name | Value | Description
Automatic | 0
Spherical | 1
EnvironmentMap | 2
Box | 3
LightProbe | 5
Cube | 6
VerticalCrossCube | 7
HorizontalCrossCube | 8
Hemispherical | 9
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Render Namespace