RhinoCommon SDK
ConicSectionType Enumeration
 Defines enumerated values for types of conic sections.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ConicSectionType
Public Enumeration ConicSectionType
Members
Member name | Value | Description
Unknown | 0 |  The curve shape is unknown.
Circle | 1 |  The curve has the shape of a circle.
Ellipse | 2 |  The curve has the shape of an ellipse.
Hyperbola | 3 |  The curve has the shape of a hyperbola.
Parabola | 4 |  The curve has the shape of a parabola.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Geometry Namespace