RhinoCommon SDK
DimStyleTableEventType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.DimStyleTableEventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum DimStyleTableEventType
Public Enumeration DimStyleTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3 |  name, color, etc., change
Sorted | 4 |  doc.m_dimstyle_table.Sort() potentially changed sort order
Current | 5 |  current dim style change
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.DocObjects.Tables Namespace