RhinoCommon SDK
RdkViewModel.DataChanged Event
Rhino WIP for Windows
[Missing <summary> documentation for "E:Rhino.UI.Controls.RdkViewModel.DataChanged"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public event EventHandler<EventArgs> DataChanged
Public Event DataChanged As EventHandler(Of EventArgs)
Value
Type: System.EventHandler<EventArgs>
See Also
Reference
RdkViewModel Class
Rhino.UI.Controls Namespace