RhinoCommon SDK
RealtimeDisplayMode.OnInitFramebuffer Event
Rhino WIP for Windows
[Missing <summary> documentation for "E:Rhino.Render.RealtimeDisplayMode.OnInitFramebuffer"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public event EventHandler<RealtimeDisplayMode.InitFramebufferEventArgs> OnInitFramebuffer
Public Event OnInitFramebuffer As EventHandler(Of RealtimeDisplayMode.InitFramebufferEventArgs)
Value
Type: System.EventHandler<RealtimeDisplayMode.InitFramebufferEventArgs>
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace