RhinoCommon SDK
Command.EndCommand Event
Rhino WIP for Windows
 Called immediately after command.RunCommand().
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static event EventHandler<CommandEventArgs> EndCommand
Public Shared Event EndCommand As EventHandler(Of CommandEventArgs)
Value
Type: System.EventHandler<CommandEventArgs>
See Also
Reference
Command Class
Rhino.Commands Namespace