RhinoCommon SDK
RenderContent.ContentReplaced Event
Rhino WIP for Windows
 Used to monitor render content replacing in the document.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static event EventHandler<RenderContentEventArgs> ContentReplaced
Public Shared Event ContentReplaced As EventHandler(Of RenderContentEventArgs)
Value
Type: System.EventHandler<RenderContentEventArgs>
See Also
Reference
RenderContent Class
Rhino.Render Namespace