RhinoCommon SDK
Command.BeginCommand Event
Rhino WIP for Windows
 Called just before command.RunCommand().
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static event EventHandler<CommandEventArgs> BeginCommand
Public Shared Event BeginCommand As EventHandler(Of CommandEventArgs)
Value
Type: System.EventHandler<CommandEventArgs>
See Also
Reference
Command Class
Rhino.Commands Namespace