RhinoCommon SDK
RenderContent Events
Rhino WIP for Windows
The RenderContent type exposes the following members.
Events
Name | Description
ContentAdded
 Used to monitor render content addition to the document.
ContentChanged
 Used to monitor render content modifications.
ContentDeleted
 Used to monitor render content deletion from the document.
ContentDeleting
 Used to monitor render content deletion from the document.
ContentFieldChanged
 This event is raised when a field value is modified.
ContentRenamed
 Used to monitor render content renaming in the document.
ContentReplaced
 Used to monitor render content replacing in the document.
ContentReplacing
 Used to monitor render content replacing in the document.
ContentUpdatePreview
 Used to monitor render content preview updates.
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace