RhinoCommon SDK
GroundPlane Events
Rhino WIP for Windows
The GroundPlane type exposes the following members.
Events
Name | Description
Changed
 This event is raised when a GroundPlane property value is changed.
Top
See Also
Reference
GroundPlane Class
Rhino.Render Namespace