RhinoCommon SDK
ThumbData Events
Rhino WIP for Windows
The ThumbData type exposes the following members.
Events
Name | Description
PropertyChanged
Top
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace