RhinoCommon SDK
File3dmTypeCodes.TCODE_HIDE_TRACE Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_HIDE_TRACE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_HIDE_TRACE = 33554446
Public Const TCODE_HIDE_TRACE As UInteger = 33554446
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace