RhinoCommon SDK
File3dmTypeCodes.TCODE_DIMSTYLE_RECORD Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DIMSTYLE_RECORD"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_DIMSTYLE_RECORD = 536903797
Public Const TCODE_DIMSTYLE_RECORD As UInteger = 536903797
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace