RhinoCommon SDK
File3dmTypeCodes.TCODE_TEXT_BLOCK Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_TEXT_BLOCK"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_TEXT_BLOCK = 2097156
Public Const TCODE_TEXT_BLOCK As UInteger = 2097156
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace