RhinoCommon SDK
File3dmTypeCodes.TCODE_HATCHPATTERN_RECORD Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_HATCHPATTERN_RECORD"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_HATCHPATTERN_RECORD = 536903799
Public Const TCODE_HATCHPATTERN_RECORD As UInteger = 536903799
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace