RhinoCommon SDK
File3dmTypeCodes.TCODE_MATERIAL_RECORD Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_MATERIAL_RECORD"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_MATERIAL_RECORD = 536903744
Public Const TCODE_MATERIAL_RECORD As UInteger = 536903744
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace