RhinoCommon SDK
File3dmTypeCodes.TCODE_PROPERTIES_NOTES Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_PROPERTIES_NOTES"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_PROPERTIES_NOTES = 536903714
Public Const TCODE_PROPERTIES_NOTES As UInteger = 536903714
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace