RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEWPORT_POSITION Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEWPORT_POSITION"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_VIEWPORT_POSITION = 33554442
Public Const TCODE_VIEWPORT_POSITION As UInteger = 33554442
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace