RhinoCommon SDK
File3dmTypeCodes.TCODE_RHINOIO_OBJECT_DATA Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RHINOIO_OBJECT_DATA"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_RHINOIO_OBJECT_DATA = 196606
Public Const TCODE_RHINOIO_OBJECT_DATA As UInteger = 196606
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace