RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEW_POSITION Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_POSITION"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_VIEW_POSITION = 536906555
Public Const TCODE_VIEW_POSITION As UInteger = 536906555
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace