RhinoCommon SDK
File3dmTypeCodes.TCODE_SHORT Field
Rhino WIP for Windows
0x80000000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SHORT = 2147483648
Public Const TCODE_SHORT As UInteger = 2147483648
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace