RhinoCommon SDK
File3dmTypeCodes.TCODE_CRC Field
Rhino WIP for Windows
0x8000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_CRC = 32768
Public Const TCODE_CRC As UInteger = 32768
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace