RhinoCommon SDK
File3dmTypeCodes.TCODE_TABLEREC Field
0x20000000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_TABLEREC = 536870912
Public Const TCODE_TABLEREC As UInteger = 536870912
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace