RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames.Transparency Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.Transparency"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const string Transparency = "transparency"
Public Const Transparency As String = "transparency"
Field Value
Type: String
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace