RhinoCommon SDK
File3dmTypeCodes.TCODE_LINEAR_DIMENSION Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LINEAR_DIMENSION"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LINEAR_DIMENSION = 2097158
Public Const TCODE_LINEAR_DIMENSION As UInteger = 2097158
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace