RhinoCommon SDK
File3dmTypeCodes.TCODE_SHOWGRIDAXES Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SHOWGRIDAXES"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SHOWGRIDAXES = 2181038088
Public Const TCODE_SHOWGRIDAXES As UInteger = 2181038088
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace