RhinoCommon SDK
File3dmTypeCodes.TCODE_FONT_TABLE Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_FONT_TABLE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_FONT_TABLE = 268435481
Public Const TCODE_FONT_TABLE As UInteger = 268435481
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace