RhinoCommon SDK
File3dmTypeCodes.TCODE_LAYERINDEX Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYERINDEX"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LAYERINDEX = 2151678004
Public Const TCODE_LAYERINDEX As UInteger = 2151678004
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace