RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_RENDER Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_RENDER"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SETTINGS_RENDER = 536903741
Public Const TCODE_SETTINGS_RENDER As UInteger = 536903741
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace