RhinoCommon SDK
File3dmTypeCodes.TCODE_SNAPSIZE Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SNAPSIZE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SNAPSIZE = 33554444
Public Const TCODE_SNAPSIZE As UInteger = 33554444
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace