RhinoCommon SDK
File3dmTypeCodes.TCODE_OLD_FULLMESH Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OLD_FULLMESH"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_OLD_FULLMESH = 1048596
Public Const TCODE_OLD_FULLMESH As UInteger = 1048596
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace