RhinoCommon SDK
File3dmTypeCodes.TCODE_NAMED_CPLANE Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_NAMED_CPLANE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_NAMED_CPLANE = 33554436
Public Const TCODE_NAMED_CPLANE As UInteger = 33554436
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace