RhinoCommon SDK
File3dmTypeCodes.TCODE_LAYERSNAPABLE Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYERSNAPABLE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LAYERSNAPABLE = 2151678001
Public Const TCODE_LAYERSNAPABLE As UInteger = 2151678001
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace