RhinoCommon SDK
File3dmTypeCodes.TCODE_OBJECT_RECORD_HISTORY Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBJECT_RECORD_HISTORY"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_OBJECT_RECORD_HISTORY = 33587316
Public Const TCODE_OBJECT_RECORD_HISTORY As UInteger = 33587316
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace