RhinoCommon SDK
File3dmTypeCodes.TCODE_HISTORYRECORD_TABLE Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_HISTORYRECORD_TABLE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_HISTORYRECORD_TABLE = 268435494
Public Const TCODE_HISTORYRECORD_TABLE As UInteger = 268435494
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace