RhinoCommon SDK
File3dmTypeCodes.TCODE_LINETYPE_RECORD Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LINETYPE_RECORD"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LINETYPE_RECORD = 536903800
Public Const TCODE_LINETYPE_RECORD As UInteger = 536903800
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace