RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_ANALYSISMESH Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_ANALYSISMESH"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SETTINGS_ANALYSISMESH = 536903731
Public Const TCODE_SETTINGS_ANALYSISMESH As UInteger = 536903731
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace