RhinoCommon SDK
File3dmTypeCodes.TCODE_USER Field
Rhino WIP for Windows
0x40000000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_USER = 1073741824
Public Const TCODE_USER As UInteger = 1073741824
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace