RhinoCommon SDK
File3dmTypeCodes.TCODE_UNIT_AND_TOLERANCES Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_UNIT_AND_TOLERANCES"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_UNIT_AND_TOLERANCES = 33554448
Public Const TCODE_UNIT_AND_TOLERANCES As UInteger = 33554448
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace