RhinoCommon SDK
File3dmTypeCodes.TCODE_RHINOIO_OBJECT_NURBS_SURFACE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RHINOIO_OBJECT_NURBS_SURFACE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_RHINOIO_OBJECT_NURBS_SURFACE = 131081
Public Const TCODE_RHINOIO_OBJECT_NURBS_SURFACE As UInteger = 131081
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace