RhinoCommon SDK
File3dmTypeCodes.TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE = 536903717
Public Const TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE As UInteger = 536903717
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace