RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames.FlamingoLibrary Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.FlamingoLibrary"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const string FlamingoLibrary = "flamingo-library"
Public Const FlamingoLibrary As String = "flamingo-library"
Field Value
Type: String
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace