RhinoCommon SDK
File3dmTypeCodes.TCODE_ANNOTATION_SETTINGS Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_ANNOTATION_SETTINGS"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_ANNOTATION_SETTINGS = 2097153
Public Const TCODE_ANNOTATION_SETTINGS As UInteger = 2097153
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace