RhinoCommon SDK
File3dmTypeCodes.TCODE_LAYERSTATE Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYERSTATE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LAYERSTATE = 2151678003
Public Const TCODE_LAYERSTATE As UInteger = 2151678003
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace