RhinoCommon SDK
File3dmTypeCodes.TCODE_PROPERTIES_APPLICATION Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_PROPERTIES_APPLICATION"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_PROPERTIES_APPLICATION = 536903716
Public Const TCODE_PROPERTIES_APPLICATION As UInteger = 536903716
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace