RhinoCommon SDK
File3dmTypeCodes.TCODE_LIGHT_RECORD_ATTRIBUTES_USERDATA Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LIGHT_RECORD_ATTRIBUTES_USERDATA"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LIGHT_RECORD_ATTRIBUTES_USERDATA = 33554530
Public Const TCODE_LIGHT_RECORD_ATTRIBUTES_USERDATA As UInteger = 33554530
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace