RhinoCommon SDK
File3dmTypeCodes.TCODE_BUMPMAP Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_BUMPMAP"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_BUMPMAP = 4194307
Public Const TCODE_BUMPMAP As UInteger = 4194307
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace