RhinoCommon SDK
File3dmTypeCodes.TCODE_DISPLAY Field
0x0040000.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_DISPLAY = 4194304
Public Const TCODE_DISPLAY As UInteger = 4194304
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace