RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEW_TRACEIMAGE Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_TRACEIMAGE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_VIEW_TRACEIMAGE = 536905275
Public Const TCODE_VIEW_TRACEIMAGE As UInteger = 536905275
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace