RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_TRM Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_TRM"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LEGACY_TRM = 65542
Public Const TCODE_LEGACY_TRM As UInteger = 65542
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace