RhinoCommon SDK
File3dmTypeCodes.TCODE_DISP_AM_RESOLUTION Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DISP_AM_RESOLUTION"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_DISP_AM_RESOLUTION = 2151677957
Public Const TCODE_DISP_AM_RESOLUTION As UInteger = 2151677957
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace