RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames.Specular Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.Specular"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const string Specular = "specular"
Public Const Specular As String = "specular"
Field Value
Type: String
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace