RhinoCommon SDK
File3dmTypeCodes.TCODE_ANGULAR_DIMENSION Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_ANGULAR_DIMENSION"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_ANGULAR_DIMENSION = 2097159
Public Const TCODE_ANGULAR_DIMENSION As UInteger = 2097159
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace