RhinoCommon SDK
File3dmTypeCodes.TCODE_TABLE Field
Rhino WIP for Windows
0x10000000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_TABLE = 268435456
Public Const TCODE_TABLE As UInteger = 268435456
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace