RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_CURRENT_WIRE_DENSITY Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_CURRENT_WIRE_DENSITY"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SETTINGS_CURRENT_WIRE_DENSITY = 2684354620
Public Const TCODE_SETTINGS_CURRENT_WIRE_DENSITY As UInteger = 2684354620
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace