RhinoCommon SDK
File3dmTypeCodes.TCODE_TEXTUREMAP Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_TEXTUREMAP"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_TEXTUREMAP = 4194306
Public Const TCODE_TEXTUREMAP As UInteger = 4194306
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace