RhinoCommon SDK
FileObjReadOptions.ReadOptions Field
Rhino WIP for Windows
 Rhino's FileReadOptions passed into ReadFile
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public FileReadOptions ReadOptions
Public ReadOptions As FileReadOptions
Field Value
Type: FileReadOptions
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace