RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_CURRENT_MATERIAL_INDEX Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_CURRENT_MATERIAL_INDEX"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SETTINGS_CURRENT_MATERIAL_INDEX = 536903737
Public Const TCODE_SETTINGS_CURRENT_MATERIAL_INDEX As UInteger = 536903737
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace