RhinoCommon SDK
File3dmTypeCodes.TCODE_OBJECT_RECORD Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBJECT_RECORD"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_OBJECT_RECORD = 536903792
Public Const TCODE_OBJECT_RECORD As UInteger = 536903792
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace