RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_CURRENT_FONT_INDEX Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_CURRENT_FONT_INDEX"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SETTINGS_CURRENT_FONT_INDEX = 2684354866
Public Const TCODE_SETTINGS_CURRENT_FONT_INDEX As UInteger = 2684354866
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace