RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEW_VIEWPORT Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_VIEWPORT"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_VIEW_VIEWPORT = 536904251
Public Const TCODE_VIEW_VIEWPORT As UInteger = 536904251
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace