RhinoCommon SDK
File3dmTypeCodes.TCODE_DICTIONARY Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DICTIONARY"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_DICTIONARY = 1073774608
Public Const TCODE_DICTIONARY As UInteger = 1073774608
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace