RhinoCommon SDK
File3dmTypeCodes.TCODE_ANNOTATION_LEADER Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_ANNOTATION_LEADER"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_ANNOTATION_LEADER = 2097157
Public Const TCODE_ANNOTATION_LEADER As UInteger = 2097157
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace