RhinoCommon SDK
File3dmTypeCodes.TCODE_GEOMETRY Field
Rhino WIP for Windows
0x0010000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_GEOMETRY = 1048576
Public Const TCODE_GEOMETRY As UInteger = 1048576
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace