RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames.Shine Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.Shine"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const string Shine = "shine"
Public Const Shine As String = "shine"
Field Value
Type: String
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace