RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_PRT Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_PRT"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LEGACY_PRT = 65538
Public Const TCODE_LEGACY_PRT As UInteger = 65538
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace