RhinoCommon SDK
File3dmTypeCodes.TCODE_OBJECT_TABLE Field
Rhino WIP for Windows
geometry and annotation.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_OBJECT_TABLE = 268435475
Public Const TCODE_OBJECT_TABLE As UInteger = 268435475
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace