RhinoCommon SDK
File3dmTypeCodes.TCODE_LIGHT_RECORD_ATTRIBUTES Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LIGHT_RECORD_ATTRIBUTES"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LIGHT_RECORD_ATTRIBUTES = 33587297
Public Const TCODE_LIGHT_RECORD_ATTRIBUTES As UInteger = 33587297
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace