RhinoCommon SDK
FileObjWriteOptions.WriteOptions Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.FileObjWriteOptions.WriteOptions"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public FileWriteOptions WriteOptions
Public WriteOptions As FileWriteOptions
Field Value
Type: FileWriteOptions
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace