RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_SPLSTUFF Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_SPLSTUFF"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_LEGACY_SPLSTUFF = 65801
Public Const TCODE_LEGACY_SPLSTUFF As UInteger = 65801
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace