RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS__NEVER__USE__THIS Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS__NEVER__USE__THIS"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SETTINGS__NEVER__USE__THIS = 536903742
Public Const TCODE_SETTINGS__NEVER__USE__THIS As UInteger = 536903742
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace