RhinoCommon SDK
File3dmTypeCodes.TCODE_DICTIONARY_ENTRY Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DICTIONARY_ENTRY"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_DICTIONARY_ENTRY = 1073774610
Public Const TCODE_DICTIONARY_ENTRY As UInteger = 1073774610
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace