RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames.ReflectivityColor Field
Rhino WIP for Windows
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.ReflectivityColor"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const string ReflectivityColor = "reflectivity-color"
Public Const ReflectivityColor As String = "reflectivity-color"
Field Value
Type: String
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace