RhinoCommon SDK
SubDFacePtr Fields
Rhino WIP for Windows
The SubDFacePtr type exposes the following members.
Fields
Name | Description
Default
Top
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace