RhinoCommon SDK
GumballObject Constructor
Initializes a new instance of the GumballObject class
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GumballObject()
Public Sub New
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace