RhinoCommon SDK
Field.ValueAsPoint2d Method
Rhino WIP for Windows
 Return field as a Rhino.Geometry.Point2d color value.
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected Point2d ValueAsPoint2d()
Protected Function ValueAsPoint2d As Point2d
Return Value
Type: Point2d
Return field as a Rhino.Geometry.Point2d color value.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace