RhinoCommon SDK
IPanelsService.ClosePanel Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.ClosePanel(System.Guid)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void ClosePanel(
	Guid panelId
)
Sub ClosePanel (
	panelId As Guid
)
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.ClosePanel(System.Guid)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace