RhinoCommon SDK
V6Dimension Constructor
Rhino WIP for Windows
Initializes a new instance of the V6Dimension class
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected V6Dimension()
Protected Sub New
See Also
Reference
V6Dimension Class
V6Dimension Overload
Rhino.Geometry Namespace