RhinoCommon SDK
AnnotationText.GetAnnotationStyle Method
Rhino WIP for Windows
 Get this text's dimstyle
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle GetAnnotationStyle(
	RhinoDoc doc
)
Public Function GetAnnotationStyle (
	doc As RhinoDoc
) As DimensionStyle
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Geometry.AnnotationText.GetAnnotationStyle(Rhino.RhinoDoc)"]
Return Value
Type: DimensionStyle
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationText.GetAnnotationStyle(Rhino.RhinoDoc)"]
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace