RhinoCommon SDK
Decals.Clear Method
[Missing <summary> documentation for "M:Rhino.Render.Decals.Clear"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
Decals Class
Rhino.Render Namespace