RhinoCommon SDK
UserDictionary Constructor
Initializes a new instance of the UserDictionary class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public UserDictionary()
Public Sub New
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace