RhinoCommon SDK
ThumbArray.Finalize Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.ThumbArray.Finalize"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
ThumbArray Class
Rhino.Render Namespace