RhinoCommon SDK
RealtimeDisplayMode.LastRenderedPass Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.LastRenderedPass"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual int LastRenderedPass()
Public Overridable Function LastRenderedPass As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.LastRenderedPass"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace