RhinoCommon SDK
Decal.Create Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.Decal.Create(Rhino.Render.DecalCreateParams)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Decal Create(
	DecalCreateParams createParams
)
Public Shared Function Create (
	createParams As DecalCreateParams
) As Decal
Parameters
createParams
Type: Rhino.Render.DecalCreateParams
[Missing <param name="createParams"/> documentation for "M:Rhino.Render.Decal.Create(Rhino.Render.DecalCreateParams)"]
Return Value
Type: Decal
[Missing <returns> documentation for "M:Rhino.Render.Decal.Create(Rhino.Render.DecalCreateParams)"]
See Also
Reference
Decal Class
Rhino.Render Namespace