RhinoCommon SDK
SerializationOptions Constructor
 Initializes a new instance of the SerializationOptions class.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SerializationOptions()
Public Sub New
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace