RhinoCommon SDK
WaitCursor Constructor
Initializes a new instance of the WaitCursor class
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public WaitCursor()
Public Sub New
See Also
Reference
WaitCursor Class
Rhino.UI Namespace