RhinoCommon SDK
Matrix.SetDiagonal Method
Rhino WIP for Windows
 Sets diagonal value and zeros off all non-diagonal values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetDiagonal(
	double d
)
Public Sub SetDiagonal (
	d As Double
)
Parameters
d
Type: System.Double
The new diagonal value.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace