RhinoCommon SDK
BinaryArchiveReader.ReadString Method
Rhino WIP for Windows
 Reads a String from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string ReadString()
Public Function ReadString As String
Return Value
Type: String
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace