RhinoCommon SDK
PreviewBackground.SetEnvironmentInstanceId Method
Rhino WIP for Windows
 SetEnvironmentInstanceId
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetEnvironmentInstanceId(
	Guid guid
)
Public Sub SetEnvironmentInstanceId (
	guid As Guid
)
Parameters
guid
Type: System.Guid
[Missing <param name="guid"/> documentation for "M:Rhino.Render.PreviewBackground.SetEnvironmentInstanceId(System.Guid)"]
See Also
Reference
PreviewBackground Class
Rhino.Render Namespace