RhinoCommon SDK
RenderMaterial.SimulateMaterial Method (Boolean)
Rhino WIP for Windows
 Override this function to provide a Rhino.DocObjects.Material definition for this material to be used by other rendering engines including the display.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual Material SimulateMaterial(
	bool isForDataOnly
)
Public Overridable Function SimulateMaterial (
	isForDataOnly As Boolean
) As Material
Parameters
isForDataOnly
Type: System.Boolean
Called when only asking for a hash - don't write any textures to the disk - just provide the filenames they will get.
Return Value
Type: Material
The simulation of the render material
See Also
Reference
RenderMaterial Class
SimulateMaterial Overload
Rhino.Render Namespace