RhinoCommon SDK
Field.ValueAsDateTime Method
Rhino WIP for Windows
 Return field as a DateTime value.
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected DateTime ValueAsDateTime()
Protected Function ValueAsDateTime As DateTime
Return Value
Type: DateTime
Return field as a DateTime value.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace