RhinoCommon SDK
MenuTaskOriginFactory.SetInstaceIdArray Method
Rhino WIP for Windows
 Set the InstanceIdArray: Array of selected items Guids
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetInstaceIdArray(
	IntPtr pInstanceArray
)
Public Sub SetInstaceIdArray (
	pInstanceArray As IntPtr
)
Parameters
pInstanceArray
Type: System.IntPtr
The InstanceIdArray
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace