RhinoCommon SDK
MenuTaskCollection.Find Method
 Find a specific menutask in the collection
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MenuTask Find(
	Guid uuid
)
Public Function Find (
	uuid As Guid
) As MenuTask
Parameters
uuid
Type: System.Guid
The task guid to be found
Return Value
Type: MenuTask
Returns the task with guid uuid
See Also
Reference
MenuTaskCollection Class
Rhino.Render Namespace