RhinoCommon SDK
RealtimeDisplayMode.GetRealtimeViewport Method (IntPtr, Boolean)
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr,System.Boolean)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RealtimeDisplayMode GetRealtimeViewport(
	IntPtr realtimeViewport,
	bool create
)
Public Shared Function GetRealtimeViewport (
	realtimeViewport As IntPtr,
	create As Boolean
) As RealtimeDisplayMode
Parameters
realtimeViewport
Type: System.IntPtr
[Missing <param name="realtimeViewport"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr,System.Boolean)"]
create
Type: System.Boolean
[Missing <param name="create"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr,System.Boolean)"]
Return Value
Type: RealtimeDisplayMode
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr,System.Boolean)"]
See Also
Reference
RealtimeDisplayMode Class
GetRealtimeViewport Overload
Rhino.Render Namespace