RhinoCommon SDK
ModelComponent.LockId Method
 Locks the component Id property.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void LockId()
Public Sub LockId
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace