RhinoCommon SDK
CurveBlend.SetDerLength Method
Rhino WIP for Windows
 Set the length of a derivative of the blend curve
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetDerLength(
	int end,
	int idx,
	double length
)
Public Sub SetDerLength (
	end As Integer,
	idx As Integer,
	length As Double
)
Parameters
end
Type: System.Int32
Which end of the blend
idx
Type: System.Int32
Which derivative
length
Type: System.Double
New length
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace