RhinoCommon SDK
City.CityAt Method
Rhino WIP for Windows
 Returns city at given index.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static City CityAt(
	int index
)
Public Shared Function CityAt (
	index As Integer
) As City
Parameters
index
Type: System.Int32
index.
Return Value
Type: City
City at index.
See Also
Reference
City Class
Rhino.Render Namespace