RhinoCommon SDK
Arc.BoundingBox Method
Rhino WIP for Windows
 Computes the 3D axis aligned bounding box for this arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BoundingBox BoundingBox()
Public Function BoundingBox As BoundingBox
Return Value
Type: BoundingBox
Bounding box of arc.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace