RhinoCommon SDK
FactoryBase.Register Method
Rhino WIP for Windows
 Call this function during startup of current assembly to load classes with factory creation support are registed
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Type[] Register()
Public Shared Function Register As Type()
Return Value
Type: Type[]
[Missing <returns> documentation for "M:Rhino.UI.Controls.FactoryBase.Register"]
See Also
Reference
FactoryBase Class
Register Overload
Rhino.UI.Controls Namespace