RhinoCommon SDK
RenderEndEventArgs Constructor
Initializes a new instance of the RenderEndEventArgs class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderEndEventArgs()
Public Sub New
See Also
Reference
RenderEndEventArgs Class
Rhino.Render Namespace