RhinoCommon SDK
BinaryArchiveReader.ReadMeshingParameters Method
Rhino WIP for Windows
 Reads a MeshingParameters from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MeshingParameters ReadMeshingParameters()
Public Function ReadMeshingParameters As MeshingParameters
Return Value
Type: MeshingParameters
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace