RhinoCommon SDK
MeshVertexColorList.GetEnumerator Method
Rhino WIP for Windows
 Gets an enumerator that yields all colors in this collection.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerator<Color> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Color)
Return Value
Type: IEnumerator<Color>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace