RhinoCommon SDK
SupportOptions.SetCheckSupportFilesBeforeRendering Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetCheckSupportFilesBeforeRendering(System.Boolean)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void SetCheckSupportFilesBeforeRendering(
	bool b
)
Public Shared Sub SetCheckSupportFilesBeforeRendering (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetCheckSupportFilesBeforeRendering(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace