RhinoCommon SDK
TimeZone.TimeZoneAt Method
Rhino WIP for Windows
 Returns a time zone at given index.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static TimeZone TimeZoneAt(
	int index
)
Public Shared Function TimeZoneAt (
	index As Integer
) As TimeZone
Parameters
index
Type: System.Int32
index.
Return Value
Type: TimeZone
Time zone at index.
See Also
Reference
TimeZone Class
Rhino.Render Namespace