RhinoCommon SDK
BinaryArchiveReader.ReadInterval Method
Rhino WIP for Windows
 Reads a Interval from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Interval ReadInterval()
Public Function ReadInterval As Interval
Return Value
Type: Interval
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace