RhinoCommon SDK
CurveBlend.GetFlip Method
Rhino WIP for Windows
 true: Reverse blend curvev direction
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool GetFlip(
	int end
)
Public Function GetFlip (
	end As Integer
) As Boolean
Parameters
end
Type: System.Int32
[Missing <param name="end"/> documentation for "M:Rhino.Geometry.CurveBlend.GetFlip(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.CurveBlend.GetFlip(System.Int32)"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace