RhinoCommon SDK
IRhRdkBreadcrumbCtrl.SetBorderColor Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkBreadcrumbCtrl.SetBorderColor(System.Drawing.Color)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void SetBorderColor(
	Color c
)
Sub SetBorderColor (
	c As Color
)
Parameters
c
Type: System.Drawing.Color
[Missing <param name="c"/> documentation for "M:Rhino.UI.Controls.IRhRdkBreadcrumbCtrl.SetBorderColor(System.Drawing.Color)"]
See Also
Reference
IRhRdkBreadcrumbCtrl Interface
Rhino.UI.Controls Namespace