RhinoCommon SDK
ContentEditingContext.SetSelection Method
Rhino WIP for Windows
 Set Selection
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetSelection(
	ContentArray collection
)
Public Sub SetSelection (
	collection As ContentArray
)
Parameters
collection
Type: Rhino.Render.ContentArray
[Missing <param name="collection"/> documentation for "M:Rhino.Render.ContentEditingContext.SetSelection(Rhino.Render.ContentArray)"]
See Also
Reference
ContentEditingContext Class
Rhino.Render Namespace