RhinoCommon SDK
SupportOptions.LibrariesInitialLocation Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.LibrariesInitialLocation"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static SupportOptions.RdkInitialLocation LibrariesInitialLocation()
Public Shared Function LibrariesInitialLocation As SupportOptions.RdkInitialLocation
Return Value
Type: SupportOptions.RdkInitialLocation
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.LibrariesInitialLocation"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace