RhinoCommon SDK
MenuTask.RenderEngineId Method
Rhino WIP for Windows
 Returns the render engine Guid of the menutask
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid RenderEngineId()
Public Function RenderEngineId As Guid
Return Value
Type: Guid
Returns the render engine Guid of the menutask
See Also
Reference
MenuTask Class
Rhino.Render Namespace