RhinoCommon SDK
DisplayPipeline.DrawText Method (AnnotationText, Color, Double)
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.AnnotationText,System.Drawing.Color,System.Double)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void DrawText(
	AnnotationText text,
	Color color,
	double scale
)
Public Sub DrawText (
	text As AnnotationText,
	color As Color,
	scale As Double
)
Parameters
text
Type: Rhino.Geometry.AnnotationText
[Missing <param name="text"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.AnnotationText,System.Drawing.Color,System.Double)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.AnnotationText,System.Drawing.Color,System.Double)"]
scale
Type: System.Double
[Missing <param name="scale"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.AnnotationText,System.Drawing.Color,System.Double)"]
See Also
Reference
DisplayPipeline Class
DrawText Overload
Rhino.Display Namespace