RhinoCommon SDK
Brep.CullUnusedFaces Method
Rhino WIP for Windows
Culls faces with m_face_index == -1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool CullUnusedFaces()
Public Function CullUnusedFaces As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace