RhinoCommon SDK
IRhRdkBreadcrumbCtrl.GrayTextColor Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkBreadcrumbCtrl.GrayTextColor"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
Color GrayTextColor()
Function GrayTextColor As Color
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkBreadcrumbCtrl.GrayTextColor"]
See Also
Reference
IRhRdkBreadcrumbCtrl Interface
Rhino.UI.Controls Namespace