RhinoCommon SDK
ContentCollection.Clear Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.ContentCollection.Clear(Rhino.Render.ContentArray)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear(
	ContentArray content
)
Public Sub Clear (
	content As ContentArray
)
Parameters
content
Type: Rhino.Render.ContentArray
[Missing <param name="content"/> documentation for "M:Rhino.Render.ContentCollection.Clear(Rhino.Render.ContentArray)"]
See Also
Reference
ContentCollection Class
Rhino.Render Namespace