RhinoCommon SDK
Curve.ToNurbsCurve Method
Rhino WIP for Windows
 Constructs a NURBS curve representation of this curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
NURBS representation of the curve on success, null on failure.
See Also
Reference
Curve Class
ToNurbsCurve Overload
Rhino.Geometry Namespace