RhinoCommon SDK
Mesh.OnSwitchToNonConst Method
Rhino WIP for Windows
 Performs some memory cleanup if necessary
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void OnSwitchToNonConst()
Protected Overrides Sub OnSwitchToNonConst
See Also
Reference
Mesh Class
Rhino.Geometry Namespace