RhinoCommon SDK
TransformCommand Constructor
Initializes a new instance of the TransformCommand class
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected TransformCommand()
Protected Sub New
See Also
Reference
TransformCommand Class
Rhino.Commands Namespace