RhinoCommon SDK
BinaryArchiveReader.AtEnd Method
Rhino WIP for Windows
 true if at end of a file
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool AtEnd()
Public Function AtEnd As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveReader.AtEnd"]
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace