RhinoCommon SDK
MenuTask.Id Method
 Returns the Guid of the menutask
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id()
Public Function Id As Guid
Return Value
Type: Guid
Returns the Guid of the menutask
See Also
Reference
MenuTask Class
Rhino.Render Namespace