RhinoCommon SDK
ZBufferCapture.GrayscaleDib Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.GrayscaleDib"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Bitmap GrayscaleDib()
Public Function GrayscaleDib As Bitmap
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.GrayscaleDib"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace