RhinoCommon SDK
CurveBlend.GetEndType Method
Rhino WIP for Windows
 Get type of target at this end
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public CurveBlend.BlendType GetEndType(
	int end
)
Public Function GetEndType (
	end As Integer
) As CurveBlend.BlendType
Parameters
end
Type: System.Int32
Which end of the blend
Return Value
Type: CurveBlend.BlendType
[Missing <returns> documentation for "M:Rhino.Geometry.CurveBlend.GetEndType(System.Int32)"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace