RhinoCommon SDK
ComponentStatus.Equals Method (Object)
Rhino WIP for Windows
 Determines if an object and this are equal.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
An object.
Return Value
Type: Boolean
true if equal in value. false otherwise
See Also
Reference
ComponentStatus Structure
Equals Overload
Rhino.Geometry Namespace