RhinoCommon SDK
V6OrdinateDimension Constructor
Rhino WIP for Windows
Initializes a new instance of the V6OrdinateDimension class
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6OrdinateDimension()
Public Sub New
See Also
Reference
V6OrdinateDimension Class
V6OrdinateDimension Overload
Rhino.Geometry Namespace