RhinoCommon SDK
GetBaseClass.ClearDefault Method
Rhino WIP for Windows
 Clears any defaults set using SetDefaultPoint, SetDefaultNumber, SetDefaultString, or SetCommandPromptDefault.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ClearDefault()
Public Sub ClearDefault
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace