RhinoCommon SDK
GetOption Constructor
Rhino WIP for Windows
Initializes a new instance of the GetOption class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GetOption()
Public Sub New
See Also
Reference
GetOption Class
Rhino.Input.Custom Namespace