RhinoCommon SDK
OptionDouble.Dispose Method
Releases all resources used by the OptionDouble
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
OptionDouble Class
Dispose Overload
Rhino.Input.Custom Namespace