RhinoCommon SDK
ICommonComponentTable<T>.FindId Method
Rhino WIP for Windows
 Retrieves an object based on ID.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
T FindId(
	Guid id
)
Function FindId (
	id As Guid
) As T
Parameters
id
Type: System.Guid
The id to search for.
Return Value
Type: T
A model component, or null if none was found.
See Also
Reference
ICommonComponentTable<T> Interface
Rhino.FileIO Namespace