RhinoCommon SDK
BrepVertex.EdgeIndices Method
Rhino WIP for Windows
 Gets the indices of all edges associated with this vertex.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int[] EdgeIndices()
Public Function EdgeIndices As Integer()
Return Value
Type: Int32[]
Empty array on failure.
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace