RhinoCommon SDK
GroundPlane Constructor
 Create an utility object not associated with any document
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GroundPlane()
Public Sub New
See Also
Reference
GroundPlane Class
GroundPlane Overload
Rhino.Render Namespace