RhinoCommon SDK
GroupTable.Find Method (String, Boolean)
Note: This API is now obsolete.
Finds a group with a given name.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Use the overload without the ignoreDeletedGroups input. Note that the new method might return UnsetIntIndex.")]
public int Find(
	string groupName,
	bool ignoreDeletedGroups
)
<ObsoleteAttribute("Use the overload without the ignoreDeletedGroups input. Note that the new method might return UnsetIntIndex.")>
Public Function Find (
	groupName As String,
	ignoreDeletedGroups As Boolean
) As Integer
Parameters
groupName
Type: System.String
 Name of group to search for. Ignores case.
ignoreDeletedGroups
Type: System.Boolean
 This parameter is ignored. Deleted groups are never searched.
Return Value
Type: Int32
 >=0 index of the group with the given name. -1 no group found with the given name.
See Also
Reference
GroupTable Class
Find Overload
Rhino.DocObjects.Tables Namespace