RhinoCommon SDK
BrepObject.DuplicateBrepGeometry Method
Rhino WIP for Windows
 Constructs a new deep copy of the brep geometry.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Brep DuplicateBrepGeometry()
Public Function DuplicateBrepGeometry As Brep
Return Value
Type: Brep
The copy of the geometry.
See Also
Reference
BrepObject Class
Rhino.DocObjects Namespace