RhinoCommon SDK
CurveBlend.SetReset Method
 Set whether blend dericvative lengths are reset to default lengths
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetReset(
	int end,
	bool reset
)
Public Sub SetReset (
	end As Integer,
	reset As Boolean
)
Parameters
end
Type: System.Int32
Which end
reset
Type: System.Boolean
Reset or not
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace