RhinoCommon SDK
BoundingBox.GetEdges Method
Rhino WIP for Windows
 Gets an array of the 12 edges of this box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Line[] GetEdges()
Public Function GetEdges As Line()
Return Value
Type: Line[]
If the boundingbox IsValid, the 12 edges; otherwise, null.
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace