RhinoCommon SDK
MeshVertexList.Show Method
Rhino WIP for Windows
 Shows the vertex at the given index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Show(
	int vertexIndex
)
Public Sub Show (
	vertexIndex As Integer
)
Parameters
vertexIndex
Type: System.Int32
Index of vertex to show.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace