RhinoCommon SDK
GeometryBase.Translate Method (Vector3d)
Rhino WIP for Windows
Translates the object along the specified vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Translate(
	Vector3d translationVector
)
Public Function Translate (
	translationVector As Vector3d
) As Boolean
Parameters
translationVector
Type: Rhino.Geometry.Vector3d
A moving vector.
Return Value
Type: Boolean
true if geometry successfully translated.
See Also
Reference
GeometryBase Class
Translate Overload
Rhino.Geometry Namespace