RhinoCommon SDK
Quaternion.Unitize Method
Rhino WIP for Windows
 Scales the quaternion's coordinates so that a*a + b*b + c*c + d*d = 1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Unitize()
Public Function Unitize As Boolean
Return Value
Type: Boolean
 true if successful. false if the quaternion is zero and cannot be unitized.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace