RhinoCommon SDK
IRhRdkContentThumbnailList.SetSearchPattern Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnailList.SetSearchPattern(System.String)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void SetSearchPattern(
	string w
)
Sub SetSearchPattern (
	w As String
)
Parameters
w
Type: System.String
[Missing <param name="w"/> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnailList.SetSearchPattern(System.String)"]
See Also
Reference
IRhRdkContentThumbnailList Interface
Rhino.UI.Controls Namespace