RhinoCommon SDK
MenuTask.SubMenu Method
 Returns the SubMenu value of the task
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubMenus SubMenu()
Public Function SubMenu As SubMenus
Return Value
Type: SubMenus
 Returns SubMenu value
See Also
Reference
MenuTask Class
Rhino.Render Namespace