RhinoCommon SDK
Vector2d.UnaryNegation Operator
Rhino WIP for Windows
 Computes the opposite vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Vector2d operator -(
	Vector2d vector
)
Public Shared Operator - (
	vector As Vector2d
) As Vector2d
Parameters
vector
Type: Rhino.Geometry.Vector2d
A vector to negate.
Return Value
Type: Vector2d
A new vector where all components were multiplied by -1.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace