RhinoCommon SDK
Layer.UnsetPersistentLocking Method
Rhino WIP for Windows
 Remove any explicity persistent locking settings from this layer
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void UnsetPersistentLocking()
Public Sub UnsetPersistentLocking
See Also
Reference
Layer Class
Rhino.DocObjects Namespace