RhinoCommon SDK
Mesh.Id Method
Rhino WIP for Windows
 Get the Object Guid this mesh is for.
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id()
Public Function Id As Guid
Return Value
Type: Guid
Guid of parent object.
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace