RhinoCommon SDK
BinaryArchiveWriter.WriteDouble Method
Rhino WIP for Windows
 Writes a Double value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void WriteDouble(
	double value
)
Public Sub WriteDouble (
	value As Double
)
Parameters
value
Type: System.Double
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace