RhinoCommon SDK
Polyline Constructor (Int32)
Rhino WIP for Windows
 Initializes a new empty polyline with an initial capacity.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Polyline(
	int initialCapacity
)
Public Sub New (
	initialCapacity As Integer
)
Parameters
initialCapacity
Type: System.Int32
Number of vertices this polyline can contain without resizing.
See Also
Reference
Polyline Class
Polyline Overload
Rhino.Geometry Namespace