RhinoCommon SDK
V6OrdinateDimensionObject.DuplicateDimOrdinateGeometry Method
Rhino WIP for Windows
 Constructs a deep (full) copy of the OrdinateDimension geometry.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6OrdinateDimension DuplicateDimOrdinateGeometry()
Public Function DuplicateDimOrdinateGeometry As V6OrdinateDimension
Return Value
Type: V6OrdinateDimension
 A copy of the internal V6LinearDimension geometry.
See Also
Reference
V6OrdinateDimensionObject Class
Rhino.DocObjects Namespace