RhinoCommon SDK
StatusBar.HideProgressMeter Method
Rhino WIP for Windows
 Ends, or hides, Rhino's status bar progress meter.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void HideProgressMeter()
Public Shared Sub HideProgressMeter
See Also
Reference
StatusBar Class
Rhino.UI Namespace