RhinoCommon SDK
Plane.GetHashCode Method
Rhino WIP for Windows
 Gets a non-unique hashing code for this entity.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A particular number for a specific instance of plane.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace