RhinoCommon SDK
Dithering Constructor
 Create an utility object not associated with any document
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Dithering()
Public Sub New
See Also
Reference
Dithering Class
Dithering Overload
Rhino.Render Namespace