RhinoCommon SDK
PickContext.Dispose Method
Rhino WIP for Windows
Releases all resources used by the PickContext
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PickContext Class
Dispose Overload
Rhino.Input.Custom Namespace