RhinoCommon SDK
Mesh Constructor (SerializationInfo, StreamingContext)
Rhino WIP for Windows
 Protected constructor for internal use.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected Mesh(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
Serialization data.
context
Type: System.Runtime.Serialization.StreamingContext
Serialization stream.
See Also
Reference
Mesh Class
Mesh Overload
Rhino.Geometry Namespace