RhinoCommon SDK
CurveBlend.SetEndType Method
Rhino WIP for Windows
 Set type of target at this end
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetEndType(
	int end,
	CurveBlend.EndType type
)
Public Sub SetEndType (
	end As Integer,
	type As CurveBlend.EndType
)
Parameters
end
Type: System.Int32
Which end of the blend
type
Type: Rhino.Geometry.CurveBlend.EndType
Curve or surface blend
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace