RhinoCommon SDK
RdkBreadCrumbViewModel.ThumbDataElementViewModelPropertyChanged Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.RdkBreadCrumbViewModel.ThumbDataElementViewModelPropertyChanged(System.Object,System.ComponentModel.PropertyChangedEventArgs)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ThumbDataElementViewModelPropertyChanged(
	Object sender,
	PropertyChangedEventArgs e
)
Public Sub ThumbDataElementViewModelPropertyChanged (
	sender As Object,
	e As PropertyChangedEventArgs
)
Parameters
sender
Type: System.Object
[Missing <param name="sender"/> documentation for "M:Rhino.UI.Controls.RdkBreadCrumbViewModel.ThumbDataElementViewModelPropertyChanged(System.Object,System.ComponentModel.PropertyChangedEventArgs)"]
e
Type: System.ComponentModel.PropertyChangedEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.UI.Controls.RdkBreadCrumbViewModel.ThumbDataElementViewModelPropertyChanged(System.Object,System.ComponentModel.PropertyChangedEventArgs)"]
See Also
Reference
RdkBreadCrumbViewModel Class
Rhino.UI.Controls Namespace