RhinoCommon SDK
MenuTask.MenuOrder Method
Rhino WIP for Windows
 Return the order of the menutask
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int MenuOrder(
	MenuTaskOrigin origin
)
Public Function MenuOrder (
	origin As MenuTaskOrigin
) As Integer
Parameters
origin
Type: Rhino.Render.MenuTaskOrigin
The menutask origin.
Return Value
Type: Int32
Return the order of the menutask, 0 = first item, 1 = second item and so on
See Also
Reference
MenuTask Class
Rhino.Render Namespace