RhinoCommon SDK
ManifestTable.Clear Method
Rhino WIP for Windows
 Marks all items as deleted.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void Clear()
Public Overridable Sub Clear
Implements
ICollection<T>.Clear()
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace