RhinoCommon SDK
LayerTable.GetEnumerator Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LayerTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override IEnumerator<Layer> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of Layer)
Return Value
Type: IEnumerator<Layer>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LayerTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
IEnumerable<T>.GetEnumerator()
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace