RhinoCommon SDK
BinaryArchiveWriter.WritePoint3d Method
Rhino WIP for Windows
 Writes a Point3d value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void WritePoint3d(
	Point3d value
)
Public Sub WritePoint3d (
	value As Point3d
)
Parameters
value
Type: Rhino.Geometry.Point3d
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace