RhinoCommon SDK
Interval Constructor (Double, Double)
Rhino WIP for Windows
 Initializes a new instance of the Rhino.Geometry.Interval class.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Interval(
	double t0,
	double t1
)
Public Sub New (
	t0 As Double,
	t1 As Double
)
Parameters
t0
Type: System.Double
The first value.
t1
Type: System.Double
The second value.
See Also
Reference
Interval Structure
Interval Overload
Rhino.Geometry Namespace