RhinoCommon SDK
RenderContent.OnAddUserInterfaceSections Method
Rhino WIP for Windows
 Override to provide UI sections to display in the editor.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void OnAddUserInterfaceSections()
Protected Overridable Sub OnAddUserInterfaceSections
See Also
Reference
RenderContent Class
Rhino.Render Namespace