RhinoCommon SDK
DisplayPipeline.EnableLighting Method
Rhino WIP for Windows
 Enable or disable the Lighting logic of the engine.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void EnableLighting(
	bool enable
)
Public Sub EnableLighting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable Lighting, false to disable.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace