RhinoCommon SDK
CustomBrepObject.Dispose Method
Rhino WIP for Windows
 Releases unmanaged resources.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
CustomBrepObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace