RhinoCommon SDK
RealtimeDisplayMode.IsFrameBufferAvailable Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.IsFrameBufferAvailable(Rhino.DocObjects.ViewInfo)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool IsFrameBufferAvailable(
	ViewInfo view
)
Public Overridable Function IsFrameBufferAvailable (
	view As ViewInfo
) As Boolean
Parameters
view
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="view"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.IsFrameBufferAvailable(Rhino.DocObjects.ViewInfo)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.IsFrameBufferAvailable(Rhino.DocObjects.ViewInfo)"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace