RhinoCommon SDK
LayerTable.Delete Method (Layer)
Rhino WIP for Windows
Deletes layer.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override bool Delete(
	Layer layer
)
Public Overrides Function Delete (
	layer As Layer
) As Boolean
Parameters
layer
Type: Rhino.DocObjects.Layer
 Layer to be deleted.
Return Value
Type: Boolean
 true if successful. false if layerIndex is out of range or the the layer cannot be deleted because it is the current layer or because it layer contains active geometry.
See Also
Reference
LayerTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace