RhinoCommon SDK
CurveBlend.SetFlip Method
 Set flip tangent flag on one end of the blend
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetFlip(
	int end,
	bool flip
)
Public Sub SetFlip (
	end As Integer,
	flip As Boolean
)
Parameters
end
Type: System.Int32
Which end
flip
Type: System.Boolean
flip or not
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace