RhinoCommon SDK
V6RadialDimension.GetTextRectangle Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Geometry.V6RadialDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool GetTextRectangle(
	out Point3d[] corners
)
Public Function GetTextRectangle (
	<OutAttribute> ByRef corners As Point3d()
) As Boolean
Parameters
corners
Type: Rhino.Geometry.Point3d[]
[Missing <param name="corners"/> documentation for "M:Rhino.Geometry.V6RadialDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.V6RadialDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)"]
See Also
Reference
V6RadialDimension Class
Rhino.Geometry Namespace