RhinoCommon SDK
MenuTask.UserExecute Method
 Called to execute the function associated with the menutask
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public UserExecuteResult UserExecute(
	MenuTaskOrigin origin
)
Public Function UserExecute (
	origin As MenuTaskOrigin
) As UserExecuteResult
Parameters
origin
Type: Rhino.Render.MenuTaskOrigin
The menutask origin.
Return Value
Type: UserExecuteResult
 Returns UserExecuteResult values { kSuccess, kFailure, kCancel };
See Also
Reference
MenuTask Class
Rhino.Render Namespace