RhinoCommon SDK
DisplayPipeline.DrawAnnotationArrowhead Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotationArrowhead(Rhino.Geometry.AnnotationArrowhead,Rhino.Geometry.Transform,System.Drawing.Color)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void DrawAnnotationArrowhead(
	AnnotationArrowhead arrowhead,
	Transform xform,
	Color color
)
Public Sub DrawAnnotationArrowhead (
	arrowhead As AnnotationArrowhead,
	xform As Transform,
	color As Color
)
Parameters
arrowhead
Type: Rhino.Geometry.AnnotationArrowhead
[Missing <param name="arrowhead"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotationArrowhead(Rhino.Geometry.AnnotationArrowhead,Rhino.Geometry.Transform,System.Drawing.Color)"]
xform
Type: Rhino.Geometry.Transform
[Missing <param name="xform"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotationArrowhead(Rhino.Geometry.AnnotationArrowhead,Rhino.Geometry.Transform,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawAnnotationArrowhead(Rhino.Geometry.AnnotationArrowhead,Rhino.Geometry.Transform,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace