RhinoCommon SDK
V6OrdinateDimension.GetTextTransform Method
 Get the transform for this text object's text geometry
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform GetTextTransform(
	DimensionStyle style,
	double textscale,
	Vector3d camX,
	Vector3d camY,
	bool draw_forward
)
Public Function GetTextTransform (
	style As DimensionStyle,
	textscale As Double,
	camX As Vector3d,
	camY As Vector3d,
	draw_forward As Boolean
) As Transform
Parameters
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.V6OrdinateDimension.GetTextTransform(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)"]
textscale
Type: System.Double
[Missing <param name="textscale"/> documentation for "M:Rhino.Geometry.V6OrdinateDimension.GetTextTransform(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)"]
camX
Type: Rhino.Geometry.Vector3d
[Missing <param name="camX"/> documentation for "M:Rhino.Geometry.V6OrdinateDimension.GetTextTransform(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)"]
camY
Type: Rhino.Geometry.Vector3d
[Missing <param name="camY"/> documentation for "M:Rhino.Geometry.V6OrdinateDimension.GetTextTransform(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)"]
draw_forward
Type: System.Boolean
[Missing <param name="draw_forward"/> documentation for "M:Rhino.Geometry.V6OrdinateDimension.GetTextTransform(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)"]
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.Geometry.V6OrdinateDimension.GetTextTransform(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)"]
See Also
Reference
V6OrdinateDimension Class
Rhino.Geometry Namespace