RhinoCommon SDK
MenuTask.Dispose Method
 MenuTask dispose
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
MenuTask Class
Rhino.Render Namespace