RhinoCommon SDK
CurveBlend.GetBlendBezier Method
 Get the blend curve bezier as a NurbsCurve
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve GetBlendBezier()
Public Function GetBlendBezier As Curve
Return Value
Type: Curve
[Missing <returns> documentation for "M:Rhino.Geometry.CurveBlend.GetBlendBezier"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace