RhinoCommon SDK
RLeader.SetTextString Method
Rhino WIP for Windows
 Sets the text string for this leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetTextString(
	string rtf_text,
	DimensionStyle dimstyle
)
Public Sub SetTextString (
	rtf_text As String,
	dimstyle As DimensionStyle
)
Parameters
rtf_text
Type: System.String
[Missing <param name="rtf_text"/> documentation for "M:Rhino.Geometry.RLeader.SetTextString(System.String,Rhino.DocObjects.DimensionStyle)"]
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.RLeader.SetTextString(System.String,Rhino.DocObjects.DimensionStyle)"]
See Also
Reference
RLeader Class
Rhino.Geometry Namespace