RhinoCommon SDK
MeshVertexList.GetEnumerator Method
Rhino WIP for Windows
 Gets an enumerator that yields all mesh vertices (points) in this collection.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerator<Point3f> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Point3f)
Return Value
Type: IEnumerator<Point3f>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace