RhinoCommon SDK
PreviewAppearance.Dispose Method
Rhino WIP for Windows
 Dispose for previewappearance
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace