RhinoCommon SDK
RenderPipeline.OnRenderBegin Method
Rhino WIP for Windows
 Called by the framework when it is time to start rendering, the render window will be created at this point and it is safe to start
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected abstract bool OnRenderBegin()
Protected MustOverride Function OnRenderBegin As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.OnRenderBegin"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace