RhinoCommon SDK
ContentArray Constructor
Rhino WIP for Windows
Initializes a new instance of the ContentArray class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ContentArray()
Public Sub New
See Also
Reference
ContentArray Class
Rhino.Render Namespace