RhinoCommon SDK
BinaryArchiveWriter.WriteGeometry Method
Rhino WIP for Windows
 Writes a GeometryBase value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void WriteGeometry(
	GeometryBase value
)
Public Sub WriteGeometry (
	value As GeometryBase
)
Parameters
value
Type: Rhino.Geometry.GeometryBase
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace