RhinoCommon SDK
FileWriteOptions Constructor
Rhino WIP for Windows
Initializes a new instance of the FileWriteOptions class
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public FileWriteOptions()
Public Sub New
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace