RhinoCommon SDK
CurveBlend.CalcBlend Method
Rhino WIP for Windows
 Calculate the shape of the blend and make a curve to represent it
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool CalcBlend()
Public Function CalcBlend As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.CurveBlend.CalcBlend"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace