RhinoCommon SDK
ColorLCH.MakePositive Method
 Ensure the Chromaticity of this color is positive.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void MakePositive()
Public Sub MakePositive
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace