RhinoCommon SDK
BinaryArchiveReader.ReadVector3f Method
Rhino WIP for Windows
 Reads a Vector3f from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3f ReadVector3f()
Public Function ReadVector3f As Vector3f
Return Value
Type: Vector3f
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace