RhinoCommon SDK
DisplayBitmap Constructor
Rhino WIP for Windows
 Constructs a DisplayBitmap from an existing bitmap.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DisplayBitmap(
	Bitmap bitmap
)
Public Sub New (
	bitmap As Bitmap
)
Parameters
bitmap
Type: System.Drawing.Bitmap
The original bitmap.
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace