RhinoCommon SDK
RenderTexture.IsHdrCapable Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.IsHdrCapable"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsHdrCapable()
Public Function IsHdrCapable As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.IsHdrCapable"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace