RhinoCommon SDK
ObjectPropertiesPage.RunScript Method
Rhino WIP for Windows
 This method is called when scripting the Rhino Properties command and choosing this page.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual Result RunScript(
	RhinoDoc doc,
	RhinoObject[] objectList
)
Public Overridable Function RunScript (
	doc As RhinoDoc,
	objectList As RhinoObject()
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
Active RhinoDoc
objectList
Type: Rhino.DocObjects.RhinoObject[]
 List of objects selected by the Properties command.
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.RunScript(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject[])"]
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace