RhinoCommon SDK
MostRecentCommandDescription Constructor
Rhino WIP for Windows
Initializes a new instance of the MostRecentCommandDescription class
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MostRecentCommandDescription()
Public Sub New
See Also
Reference
MostRecentCommandDescription Class
Rhino.Commands Namespace