RhinoCommon SDK
GetCone.Dispose Method
Rhino WIP for Windows
 Actively reclaims unmanaged resources that this instance uses.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
GetCone Class
Dispose Overload
Rhino.Input.Custom Namespace