RhinoCommon SDK
Vector2d.GetHashCode Method
Rhino WIP for Windows
 Provides a hashing value for the present vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique number based on vector components.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace