RhinoCommon SDK
MenuTaskOriginFactory.NewButtonTaskOrigin Method
 Returns the menu task origin for new button
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MenuTaskOrigin NewButtonTaskOrigin(
	string wskind
)
Public Function NewButtonTaskOrigin (
	wskind As String
) As MenuTaskOrigin
Parameters
wskind
Type: System.String
[Missing <param name="wskind"/> documentation for "M:Rhino.Render.MenuTaskOriginFactory.NewButtonTaskOrigin(System.String)"]
Return Value
Type: MenuTaskOrigin
[Missing <returns> documentation for "M:Rhino.Render.MenuTaskOriginFactory.NewButtonTaskOrigin(System.String)"]
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace