RhinoCommon SDK
NameHash.CreateFilePathHash Method
Rhino WIP for Windows
 Creates a new NameHash, representing the name of a file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static NameHash CreateFilePathHash(
	string path
)
Public Shared Function CreateFilePathHash (
	path As String
) As NameHash
Parameters
path
Type: System.String
A path. This can be null and can refer to a nonexisting path.
Return Value
Type: NameHash
[Missing <returns> documentation for "M:Rhino.FileIO.NameHash.CreateFilePathHash(System.String)"]
See Also
Reference
NameHash Class
Rhino.FileIO Namespace