RhinoCommon SDK
BinaryArchiveReader.ReadRectangleF Method
Rhino WIP for Windows
 Reads a RectangleF from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RectangleF ReadRectangleF()
Public Function ReadRectangleF As RectangleF
Return Value
Type: RectangleF
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace