RhinoCommon SDK
CustomRenderContentAttribute Constructor
Initializes a new instance of the CustomRenderContentAttribute class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public CustomRenderContentAttribute(
	string renderEngineGuid = "",
	bool imageBased = false,
	string category = "General",
	bool is_elevated = false,
	bool is_built_in = false
)
Public Sub New (
	Optional renderEngineGuid As String = "",
	Optional imageBased As Boolean = false,
	Optional category As String = "General",
	Optional is_elevated As Boolean = false,
	Optional is_built_in As Boolean = false
)
Parameters
renderEngineGuid (Optional)
Type: System.String
[Missing <param name="renderEngineGuid"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean)"]
imageBased (Optional)
Type: System.Boolean
[Missing <param name="imageBased"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean)"]
category (Optional)
Type: System.String
[Missing <param name="category"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean)"]
is_elevated (Optional)
Type: System.Boolean
[Missing <param name="is_elevated"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean)"]
is_built_in (Optional)
Type: System.Boolean
[Missing <param name="is_built_in"/> documentation for "M:Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean)"]
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace