RhinoCommon SDK
GetCone Constructor
Initializes a new instance of the GetCone class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GetCone()
Public Sub New
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace