RhinoCommon SDK
IRhRdkContentThumbnailList.PropagateSelectedAppearance Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnailList.PropagateSelectedAppearance"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
bool PropagateSelectedAppearance()
Function PropagateSelectedAppearance As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnailList.PropagateSelectedAppearance"]
See Also
Reference
IRhRdkContentThumbnailList Interface
Rhino.UI.Controls Namespace