RhinoCommon SDK
CurveBlend.SetContinuity Method
Rhino WIP for Windows
 0: position, 1: tangency, 2: curvature, 3: g3, 4: g4
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetContinuity(
	int end,
	int continuity
)
Public Sub SetContinuity (
	end As Integer,
	continuity As Integer
)
Parameters
end
Type: System.Int32
[Missing <param name="end"/> documentation for "M:Rhino.Geometry.CurveBlend.SetContinuity(System.Int32,System.Int32)"]
continuity
Type: System.Int32
[Missing <param name="continuity"/> documentation for "M:Rhino.Geometry.CurveBlend.SetContinuity(System.Int32,System.Int32)"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace