RhinoCommon SDK
MaterialTable.Add Method
Rhino WIP for Windows
 Adds a new material to the table based on the default material.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Add()
Public Function Add As Integer
Return Value
Type: Int32
The position of the new material in the table.
See Also
Reference
MaterialTable Class
Add Overload
Rhino.DocObjects.Tables Namespace