RhinoCommon SDK
SweepOneRail.SetToRoadlikeTop Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.SetToRoadlikeTop"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetToRoadlikeTop()
Public Sub SetToRoadlikeTop
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace