RhinoCommon SDK
ObjectAttributes Constructor
Rhino WIP for Windows
Initializes a new instance of the ObjectAttributes class
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ObjectAttributes()
Public Sub New
See Also
Reference
ObjectAttributes Class
ObjectAttributes Overload
Rhino.DocObjects Namespace