RhinoCommon SDK
Point4d Constructor (Point3d)
Rhino WIP for Windows
 Initializes a new instance of the Point4d class from the coordinates of a point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point4d(
	Point3d point
)
Public Sub New (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
.
See Also
Reference
Point4d Structure
Point4d Overload
Rhino.Geometry Namespace