RhinoCommon SDK
LengthValue.Finalize Method
passively reclaim native allocated ON_LenghtValue*
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
LengthValue Class
Rhino Namespace