RhinoCommon SDK
ThumbnailListImpl Constructor
Initializes a new instance of the ThumbnailListImpl class
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ThumbnailListImpl(
	IThumbnailList client
)
Public Sub New (
	client As IThumbnailList
)
Parameters
client
Type: Rhino.UI.Controls.IThumbnailList
[Missing <param name="client"/> documentation for "M:Rhino.UI.Controls.ThumbnailListImpl.#ctor(Rhino.UI.Controls.IThumbnailList)"]
See Also
Reference
ThumbnailListImpl Class
Rhino.UI.Controls Namespace