RhinoCommon SDK
InstanceDefinitionGeometry Constructor
Rhino WIP for Windows
 Initializes a new block definition.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public InstanceDefinitionGeometry()
Public Sub New
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace