RhinoCommon SDK
PreviewLighting.SetUpPreview Method
Rhino WIP for Windows
 SetUpPreview
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetUpPreview(
	IntPtr sceneServerPointer
)
Public Sub SetUpPreview (
	sceneServerPointer As IntPtr
)
Parameters
sceneServerPointer
Type: System.IntPtr
[Missing <param name="sceneServerPointer"/> documentation for "M:Rhino.Render.PreviewLighting.SetUpPreview(System.IntPtr)"]
See Also
Reference
PreviewLighting Class
Rhino.Render Namespace