RhinoCommon SDK
Field.ValueAsFloat Method
Rhino WIP for Windows
 Return field value as floating point number.
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected float ValueAsFloat()
Protected Function ValueAsFloat As Single
Return Value
Type: Single
Return the field value as an floating point number.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace