RhinoCommon SDK
OptionToggle.Dispose Method
Rhino WIP for Windows
Releases all resources used by the OptionToggle
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
OptionToggle Class
Dispose Overload
Rhino.Input.Custom Namespace