RhinoCommon SDK
ObjectTable.AddV6LinearDimension Method (V6LinearDimension)
 Adds a linear dimension object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddV6LinearDimension(
	V6LinearDimension dimlinear
)
Public Function AddV6LinearDimension (
	dimlinear As V6LinearDimension
) As Guid
Parameters
dimlinear
Type: Rhino.Geometry.V6LinearDimension
 Dimension object to add.
Return Value
Type: Guid
 The Id of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddV6LinearDimension Overload
Rhino.DocObjects.Tables Namespace