RhinoCommon SDK
MeshVertexList.Clear Method
 Clears the Vertex list on the mesh.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
IList.Clear()
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace