RhinoCommon SDK
MenuTaskCollection.Count Method
 The number of menutasks in collection
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count()
Public Function Count As Integer
Return Value
Type: Int32
Returns the number of menutasks in collection
See Also
Reference
MenuTaskCollection Class
Rhino.Render Namespace