RhinoCommon SDK
ParticleSystem.Clear Method
Rhino WIP for Windows
 Remove all Particles from this system.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void Clear()
Public Overridable Sub Clear
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace