RhinoCommon SDK
Curve.DuplicateSegments Method
Rhino WIP for Windows
 Polylines will be exploded into line segments. ExplodeCurves will return the curves in topological order.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve[] DuplicateSegments()
Public Function DuplicateSegments As Curve()
Return Value
Type: Curve[]
 An array of all the segments that make up this curve.
See Also
Reference
Curve Class
Rhino.Geometry Namespace