RhinoCommon SDK
RenderTexture.IsLinear Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.IsLinear"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool IsLinear()
Public Overridable Function IsLinear As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.IsLinear"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace