RhinoCommon SDK
SupportOptions.MaxPreviewSeconds Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.MaxPreviewSeconds"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static int MaxPreviewSeconds()
Public Shared Function MaxPreviewSeconds As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.MaxPreviewSeconds"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace