RhinoCommon SDK
RdkViewModel Constructor
Initializes a new instance of the RdkViewModel class
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RdkViewModel()
Public Sub New
See Also
Reference
RdkViewModel Class
Rhino.UI.Controls Namespace