RhinoCommon SDK
Vector3f.UnaryNegation Operator
Rhino WIP for Windows
 Computes the opposite vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Vector3f operator -(
	Vector3f vector
)
Public Shared Operator - (
	vector As Vector3f
) As Vector3f
Parameters
vector
Type: Rhino.Geometry.Vector3f
A vector to negate.
Return Value
Type: Vector3f
A new vector where all components were multiplied by -1.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace