RhinoCommon SDK
BinaryArchiveReader.ReadVector2d Method
Rhino WIP for Windows
 Reads a Vector2d from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector2d ReadVector2d()
Public Function ReadVector2d As Vector2d
Return Value
Type: Vector2d
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace