RhinoCommon SDK
EarthAnchorPoint Constructor
Rhino WIP for Windows
 Initializes a new instance of the EarthAnchorPoint class.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public EarthAnchorPoint()
Public Sub New
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace