RhinoCommon SDK
MeshNgonList.GetNgonCenter Method (MeshNgon)
Rhino WIP for Windows
 Gets the center point of an ngon.
This the avarage of the corner points.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d GetNgonCenter(
	MeshNgon ngon
)
Public Function GetNgonCenter (
	ngon As MeshNgon
) As Point3d
Parameters
ngon
Type: Rhino.Geometry.MeshNgon
An ngon.
Return Value
Type: Point3d
The center point.
See Also
Reference
MeshNgonList Class
GetNgonCenter Overload
Rhino.Geometry.Collections Namespace