RhinoCommon SDK
MeshTextureCoordinateList.Clear Method
 Clears the Texture Coordinate list on the mesh.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
IList.Clear()
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace