RhinoCommon SDK
BinaryArchiveWriter.WriteUtf8String Method
Rhino WIP for Windows
 Writes a String value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void WriteUtf8String(
	string value
)
Public Sub WriteUtf8String (
	value As String
)
Parameters
value
Type: System.String
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace