RhinoCommon SDK
WorldMapDayNight Constructor
Initializes a new instance of the WorldMapDayNight class
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public WorldMapDayNight()
Public Sub New
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace