RhinoCommon SDK
SpaceMorph Constructor
Rhino WIP for Windows
Initializes a new instance of the SpaceMorph class
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected SpaceMorph()
Protected Sub New
See Also
Reference
SpaceMorph Class
Rhino.Geometry Namespace