RhinoCommon SDK
UiWriteBracket Constructor
Initializes a new instance of the UiWriteBracket class
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public UiWriteBracket(
	RdkViewModel vm
)
Public Sub New (
	vm As RdkViewModel
)
Parameters
vm
Type: Rhino.UI.Controls.RdkViewModel
[Missing <param name="vm"/> documentation for "M:Rhino.UI.Controls.UiWriteBracket.#ctor(Rhino.UI.Controls.RdkViewModel)"]
See Also
Reference
UiWriteBracket Class
Rhino.UI.Controls Namespace