RhinoCommon SDK
RdkViewModel.UndoHelper.Dispose Method (Boolean)
Rhino WIP for Windows
Releases the unmanaged resources used by the RdkViewModel.UndoHelper and optionally releases the managed resources
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
RdkViewModel.UndoHelper Class
Dispose Overload
Rhino.UI.Controls Namespace