RhinoCommon SDK
Surface.ToBrep Method
Rhino WIP for Windows
 Converts the surface into a Brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
A Brep with a similar shape like this surface or null.
See Also
Reference
Surface Class
Rhino.Geometry Namespace