RhinoCommon SDK
ObjectTable.GetObjectsByType<T> Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerable<T> GetObjectsByType<T>()
where T : RhinoObject
Public Function GetObjectsByType(Of T As RhinoObject) As IEnumerable(Of T)
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1"]
Return Value
Type: IEnumerable<T>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1"]
See Also
Reference
ObjectTable Class
GetObjectsByType Overload
Rhino.DocObjects.Tables Namespace