RhinoCommon SDK
ZBufferCapture.MinZ Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.MinZ"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public float MinZ()
Public Function MinZ As Single
Return Value
Type: Single
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.MinZ"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace