RhinoCommon SDK
LayerTable.Find Method (Guid, Boolean)
Note: This API is now obsolete.
Finds a layer with a matching ID.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("notFoundReturnValue should be specified. Add a third argument, its previous value was -1 but consider RhinoMath.UnsetIntIndex.")]
public int Find(
	Guid layerId,
	bool ignoreDeletedLayers
)
<ObsoleteAttribute("notFoundReturnValue should be specified. Add a third argument, its previous value was -1 but consider RhinoMath.UnsetIntIndex.")>
Public Function Find (
	layerId As Guid,
	ignoreDeletedLayers As Boolean
) As Integer
Parameters
layerId
Type: System.Guid
A valid layer ID.
ignoreDeletedLayers
Type: System.Boolean
If true, deleted layers are not checked.
Return Value
Type: Int32
 >=0 index of the layer with the given name -1 no layer has the given name.
See Also
Reference
LayerTable Class
Find Overload
Rhino.DocObjects.Tables Namespace