RhinoCommon SDK
ViewportInfo.UnlockCamera Method
 Unlocks the camera vectors and location.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void UnlockCamera()
Public Sub UnlockCamera
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace