RhinoCommon SDK
FilePdf Constructor
Initializes a new instance of the FilePdf class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected FilePdf()
Protected Sub New
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace