RhinoCommon SDK
Vector3d.Unitize Method
Rhino WIP for Windows
 Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Unitize()
Public Function Unitize As Boolean
Return Value
Type: Boolean
true on success or false on failure.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace