RhinoCommon SDK
Brep.CreateBooleanIntersection Method (Brep, Brep, Double, Boolean)
Rhino WIP for Windows
 Compute the Solid Intersection of two Breps.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Brep[] CreateBooleanIntersection(
	Brep firstBrep,
	Brep secondBrep,
	double tolerance,
	bool manifoldOnly
)
Public Shared Function CreateBooleanIntersection (
	firstBrep As Brep,
	secondBrep As Brep,
	tolerance As Double,
	manifoldOnly As Boolean
) As Brep()
Parameters
firstBrep
Type: Rhino.Geometry.Brep
First Brep for boolean intersection.
secondBrep
Type: Rhino.Geometry.Brep
Second Brep for boolean intersection.
tolerance
Type: System.Double
Tolerance to use for intersection operation.
manifoldOnly
Type: System.Boolean
If true, non-manifold input breps are ignored.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
Remarks
The solid orientation of the breps make a difference when calling this function
See Also
Reference
Brep Class
CreateBooleanIntersection Overload
Rhino.Geometry Namespace