RhinoCommon SDK
LayerTable.FindNext Method (Int32, String)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Layer FindNext(
	int index,
	string layerName
)
Public Function FindNext (
	index As Integer,
	layerName As String
) As Layer
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String)"]
layerName
Type: System.String
[Missing <param name="layerName"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String)"]
Return Value
Type: Layer
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String)"]
See Also
Reference
LayerTable Class
FindNext Overload
Rhino.DocObjects.Tables Namespace