RhinoCommon SDK
UserData Constructor
Rhino WIP for Windows
Initializes a new instance of the UserData class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected UserData()
Protected Sub New
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace