RhinoCommon SDK
GumballObject.Finalize Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.Finalize"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace