RhinoCommon SDK
CreatePreviewEventArgs.SkipInitialisation Method
Rhino WIP for Windows
 Call this if you don't want the argument to handle data initialisation. This is for use with the ChangeQueue
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SkipInitialisation()
Public Sub SkipInitialisation
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace