RhinoCommon SDK
ObjectTable.AddRichText Method (AnnotationText)
 Adds a rich text object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddRichText(
	AnnotationText richText
)
Public Function AddRichText (
	richText As AnnotationText
) As Guid
Parameters
richText
Type: Rhino.Geometry.AnnotationText
 Rich text object to add.
Return Value
Type: Guid
 The Id of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddRichText Overload
Rhino.DocObjects.Tables Namespace