RhinoCommon SDK
Arc.PointAt Method
Rhino WIP for Windows
 Gets the point at the given arc parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d PointAt(
	double t
)
Public Function PointAt (
	t As Double
) As Point3d
Parameters
t
Type: System.Double
Arc parameter to evaluate.
Return Value
Type: Point3d
The point at the given parameter.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace