RhinoCommon SDK
CurveBlend.GetEdgeAngle Method
 Rotation from perp to edge for surface blends
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double GetEdgeAngle(
	int end
)
Public Function GetEdgeAngle (
	end As Integer
) As Double
Parameters
end
Type: System.Int32
[Missing <param name="end"/> documentation for "M:Rhino.Geometry.CurveBlend.GetEdgeAngle(System.Int32)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Geometry.CurveBlend.GetEdgeAngle(System.Int32)"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace