RhinoCommon SDK
StringParserSettings.Dispose Method
Rhino WIP for Windows
Releases all resources used by the StringParserSettings
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
StringParserSettings Class
Dispose Overload
Rhino.Input Namespace