RhinoCommon SDK
Vector2d.Divide Method
Rhino WIP for Windows
 Divides a Vector2d by a number, having the effect of shrinking it.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Vector2d Divide(
	Vector2d vector,
	double t
)
Public Shared Function Divide (
	vector As Vector2d,
	t As Double
) As Vector2d
Parameters
vector
Type: Rhino.Geometry.Vector2d
A vector.
t
Type: System.Double
A number.
Return Value
Type: Vector2d
A new vector that is componentwise divided by t.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace