RhinoCommon SDK
RenderTexture.GetWrapType Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetWrapType"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual TextureWrapType GetWrapType()
Public Overridable Function GetWrapType As TextureWrapType
Return Value
Type: TextureWrapType
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetWrapType"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace