RhinoCommon SDK
FilePdf.FirePreWriteEvent Method
 Called by the framework to fire a PreWrite event
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected void FirePreWriteEvent()
Protected Sub FirePreWriteEvent
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace