RhinoCommon SDK
RenderWindow.Channel.Dispose Method
Releases all resources used by the RenderWindow.Channel
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderWindow.Channel Class
Dispose Overload
Rhino.Render Namespace