RhinoCommon SDK
CurveBlend.SetTargetTrim Method
Rhino WIP for Windows
 Set the target trim for one end of a blend
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetTargetTrim(
	int end,
	BrepTrim trim
)
Public Sub SetTargetTrim (
	end As Integer,
	trim As BrepTrim
)
Parameters
end
Type: System.Int32
Which end
trim
Type: Rhino.Geometry.BrepTrim
The target trim
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace