RhinoCommon SDK
ContentEditingContext Constructor
Rhino WIP for Windows
 Constructor for ContentEditingContext
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ContentEditingContext(
	IntPtr pCec
)
Public Sub New (
	pCec As IntPtr
)
Parameters
pCec
Type: System.IntPtr
[Missing <param name="pCec"/> documentation for "M:Rhino.Render.ContentEditingContext.#ctor(System.IntPtr)"]
See Also
Reference
ContentEditingContext Class
Rhino.Render Namespace