RhinoCommon SDK
MenuTask.IsEnabled Method
Rhino WIP for Windows
 Returns true if the menutask item is enabled and false if the menutask item is disabled
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsEnabled(
	MenuTaskOrigin origin
)
Public Function IsEnabled (
	origin As MenuTaskOrigin
) As Boolean
Parameters
origin
Type: Rhino.Render.MenuTaskOrigin
The menutask origin.
Return Value
Type: Boolean
Returns true if the menutask item is enabled and false if the menutask item is disabled
See Also
Reference
MenuTask Class
Rhino.Render Namespace