RhinoCommon SDK
V6LinearDimension Constructor
Rhino WIP for Windows
Initializes a new instance of the V6LinearDimension class
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6LinearDimension()
Public Sub New
See Also
Reference
V6LinearDimension Class
V6LinearDimension Overload
Rhino.Geometry Namespace