RhinoCommon SDK
Transform.Transpose Method
Rhino WIP for Windows
 Flip row/column values
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform Transpose()
Public Function Transpose As Transform
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.Geometry.Transform.Transpose"]
See Also
Reference
Transform Structure
Rhino.Geometry Namespace