RhinoCommon SDK
BreadCrumbViewModelFactory.Get Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.UI.Controls.BreadCrumbViewModelFactory.Get(System.Guid)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override IntPtr Get(
	Guid id
)
Public Overrides Function Get (
	id As Guid
) As IntPtr
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.UI.Controls.BreadCrumbViewModelFactory.Get(System.Guid)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.Controls.BreadCrumbViewModelFactory.Get(System.Guid)"]
See Also
Reference
BreadCrumbViewModelFactory Class
Rhino.UI.Controls Namespace