RhinoCommon SDK
LayerTable.Add Method
Rhino WIP for Windows
 Adds a new layer with default definition to the layer table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Add()
Public Function Add As Integer
Return Value
Type: Int32
index of new layer.
See Also
Reference
LayerTable Class
Add Overload
Rhino.DocObjects.Tables Namespace