RhinoCommon SDK
RLeader.Create Method
Rhino WIP for Windows
 Creates a RLeader geometry object
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RLeader Create(
	string richTextString,
	Plane plane,
	DimensionStyle style,
	Point3d[] points,
	Guid dimstyle_id
)
Public Shared Function Create (
	richTextString As String,
	plane As Plane,
	style As DimensionStyle,
	points As Point3d(),
	dimstyle_id As Guid
) As RLeader
Parameters
richTextString
Type: System.String
[Missing <param name="richTextString"/> documentation for "M:Rhino.Geometry.RLeader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[],System.Guid)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.RLeader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[],System.Guid)"]
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.RLeader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[],System.Guid)"]
points
Type: Rhino.Geometry.Point3d[]
[Missing <param name="points"/> documentation for "M:Rhino.Geometry.RLeader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[],System.Guid)"]
dimstyle_id
Type: System.Guid
[Missing <param name="dimstyle_id"/> documentation for "M:Rhino.Geometry.RLeader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[],System.Guid)"]
Return Value
Type: RLeader
[Missing <returns> documentation for "M:Rhino.Geometry.RLeader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[],System.Guid)"]
See Also
Reference
RLeader Class
Rhino.Geometry Namespace