RhinoCommon SDK
File3dmViewTable.Clear Method
Rhino WIP for Windows
 Removes all items from the table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace