RhinoCommon SDK
CustomMeshObject Constructor
Rhino WIP for Windows
Initializes a new instance of the CustomMeshObject class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected CustomMeshObject()
Protected Sub New
See Also
Reference
CustomMeshObject Class
CustomMeshObject Overload
Rhino.DocObjects.Custom Namespace