RhinoCommon SDK
MeshNgon.ToString Method
Rhino WIP for Windows
 Returns a string representation for this MeshNgon. This is to provide a meaningful visualization of this structure and is subject to change in newer releases.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The string representation.
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace