RhinoCommon SDK
Decals.GetEnumerator Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.Decals.GetEnumerator"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerator<Decal> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Decal)
Return Value
Type: IEnumerator<Decal>
[Missing <returns> documentation for "M:Rhino.Render.Decals.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
Decals Class
Rhino.Render Namespace