RhinoCommon SDK
Brep.RemoveHoles Method
 Remove all inner loops, or holes, in a Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Brep RemoveHoles(
	double tolerance
)
Public Function RemoveHoles (
	tolerance As Double
) As Brep
Parameters
tolerance
Type: System.Double
The tolerance. When in doubt, use the document's model absolute tolerance.
Return Value
Type: Brep
The Brep without holes if successful, null otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace