RhinoCommon SDK
IRhRdkBreadcrumbCtrl.SetTopHotColor Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkBreadcrumbCtrl.SetTopHotColor(System.Drawing.Color)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void SetTopHotColor(
	Color c
)
Sub SetTopHotColor (
	c As Color
)
Parameters
c
Type: System.Drawing.Color
[Missing <param name="c"/> documentation for "M:Rhino.UI.Controls.IRhRdkBreadcrumbCtrl.SetTopHotColor(System.Drawing.Color)"]
See Also
Reference
IRhRdkBreadcrumbCtrl Interface
Rhino.UI.Controls Namespace