RhinoCommon SDK
BoundingBox Constructor (IEnumerable<Point3d>)
 Constructs a boundingbox from a collection of points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BoundingBox(
	IEnumerable<Point3d> points
)
Public Sub New (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to include in the boundingbox.
See Also
Reference
BoundingBox Structure
BoundingBox Overload
Rhino.Geometry Namespace