RhinoCommon SDK
GripObject.Move Method (Point3d)
Rhino WIP for Windows
 Moves the grip to a new location.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Move(
	Point3d newLocation
)
Public Sub Move (
	newLocation As Point3d
)
Parameters
newLocation
Type: Rhino.Geometry.Point3d
 New location for grip.
See Also
Reference
GripObject Class
Move Overload
Rhino.DocObjects Namespace