RhinoCommon SDK
RhinoObject.GetHighlightedSubObjects Method
Rhino WIP for Windows
 Gets a list of all highlighted subobjects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ComponentIndex[] GetHighlightedSubObjects()
Public Function GetHighlightedSubObjects As ComponentIndex()
Return Value
Type: ComponentIndex[]
An array of all highlighted subobjects; or null is there are none.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace