RhinoCommon SDK
Vector3f.ToString Method
 Constructs the string representation of the current vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The vector representation in the form X,Y,Z.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace