RhinoCommon SDK
TextureEvaluator.GetColor Method
[Missing <summary> documentation for "M:Rhino.Render.TextureEvaluator.GetColor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual Color4f GetColor(
	Point3d uvw,
	Vector3d duvwdx,
	Vector3d duvwdy
)
Public Overridable Function GetColor (
	uvw As Point3d,
	duvwdx As Vector3d,
	duvwdy As Vector3d
) As Color4f
Parameters
uvw
Type: Rhino.Geometry.Point3d
[Missing <param name="uvw"/> documentation for "M:Rhino.Render.TextureEvaluator.GetColor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)"]
duvwdx
Type: Rhino.Geometry.Vector3d
[Missing <param name="duvwdx"/> documentation for "M:Rhino.Render.TextureEvaluator.GetColor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)"]
duvwdy
Type: Rhino.Geometry.Vector3d
[Missing <param name="duvwdy"/> documentation for "M:Rhino.Render.TextureEvaluator.GetColor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)"]
Return Value
Type: Color4f
[Missing <returns> documentation for "M:Rhino.Render.TextureEvaluator.GetColor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)"]
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace