RhinoCommon SDK
ThumbArray Constructor
Initializes a new instance of the ThumbArray class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ThumbArray(
	IntPtr pThumbArray
)
Public Sub New (
	pThumbArray As IntPtr
)
Parameters
pThumbArray
Type: System.IntPtr
[Missing <param name="pThumbArray"/> documentation for "M:Rhino.Render.ThumbArray.#ctor(System.IntPtr)"]
See Also
Reference
ThumbArray Class
Rhino.Render Namespace