RhinoCommon SDK
Arc.ToNurbsCurve Method (Int32, Int32)
Rhino WIP for Windows
 Create a uniform non-ratonal cubic NURBS approximation of an arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public NurbsCurve ToNurbsCurve(
	int degree,
	int cvCount
)
Public Function ToNurbsCurve (
	degree As Integer,
	cvCount As Integer
) As NurbsCurve
Parameters
degree
Type: System.Int32
>=1
cvCount
Type: System.Int32
cv count >=5
Return Value
Type: NurbsCurve
NURBS curve approximation of an arc on success
See Also
Reference
Arc Structure
ToNurbsCurve Overload
Rhino.Geometry Namespace