RhinoCommon SDK
GumballAppearanceSettings Constructor
Rhino WIP for Windows
Initializes a new instance of the GumballAppearanceSettings class
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GumballAppearanceSettings()
Public Sub New
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace