RhinoCommon SDK
ObjectAttributes.Duplicate Method
Rhino WIP for Windows
 Constructs a copy of this ObjectAttributes instance.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ObjectAttributes Duplicate()
Public Function Duplicate As ObjectAttributes
Return Value
Type: ObjectAttributes
A new instance on success, or null on failure.
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace