RhinoCommon SDK
CurveBlend.GetReset Method
Rhino WIP for Windows
 Reset blend derivatives to default lengths
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool GetReset(
	int end
)
Public Function GetReset (
	end As Integer
) As Boolean
Parameters
end
Type: System.Int32
[Missing <param name="end"/> documentation for "M:Rhino.Geometry.CurveBlend.GetReset(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.CurveBlend.GetReset(System.Int32)"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace