RhinoCommon SDK
MeshFaceList.GetEnumerator Method
Rhino WIP for Windows
 Gets an enumerator that yields all faces in this collection.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerator<MeshFace> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of MeshFace)
Return Value
Type: IEnumerator<MeshFace>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace