RhinoCommon SDK
Interval.Grow Method
Rhino WIP for Windows
 Grows the Interval to include the given number.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Grow(
	double value
)
Public Sub Grow (
	value As Double
)
Parameters
value
Type: System.Double
Number to include in this interval.
See Also
Reference
Interval Structure
Rhino.Geometry Namespace