RhinoCommon SDK
IRhRdkBreadcrumbCtrl.SetTextColor Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkBreadcrumbCtrl.SetTextColor(System.Drawing.Color)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void SetTextColor(
	Color c
)
Sub SetTextColor (
	c As Color
)
Parameters
c
Type: System.Drawing.Color
[Missing <param name="c"/> documentation for "M:Rhino.UI.Controls.IRhRdkBreadcrumbCtrl.SetTextColor(System.Drawing.Color)"]
See Also
Reference
IRhRdkBreadcrumbCtrl Interface
Rhino.UI.Controls Namespace