RhinoCommon SDK
BinaryArchiveReader.ReadStringArray Method
Rhino WIP for Windows
 Reads an array of String from the archive.
An array is returned even if the input was another enumerable type.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string[] ReadStringArray()
Public Function ReadStringArray As String()
Return Value
Type: String[]
The array that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace