RhinoCommon SDK
RhinoObject.GetGrips Method
Rhino WIP for Windows
 Returns grips for this object If grips are enabled. If grips are not enabled, returns null.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GripObject[] GetGrips()
Public Function GetGrips As GripObject()
Return Value
Type: GripObject[]
An array of grip objects; or null if there are no grips.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace