RhinoCommon SDK
CustomRenderMeshProvider.BuildCustomMeshes Method
 Build custom render mesh(es).
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract bool BuildCustomMeshes(
	ViewportInfo vp,
	RhinoDoc doc,
	RenderPrimitiveList objMeshes,
	Guid requestingPlugIn,
	bool meshType
)
Public MustOverride Function BuildCustomMeshes (
	vp As ViewportInfo,
	doc As RhinoDoc,
	objMeshes As RenderPrimitiveList,
	requestingPlugIn As Guid,
	meshType As Boolean
) As Boolean
Parameters
vp
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
doc
Type: Rhino.RhinoDoc
The Rhino document of interest. This can be null in the case where document meshes (not associated with any object) are being requested.
objMeshes
Type: Rhino.Render.RenderPrimitiveList
The meshes class to populate with custom meshes.
requestingPlugIn
Type: System.Guid
UUID of the RDK plug-in requesting the meshes.
meshType
Type: System.Boolean
Type of mesh to build.
Return Value
Type: Boolean
true if operation was successful.
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace