RhinoCommon SDK
RenderContentType Constructor
Rhino WIP for Windows
Initializes a new instance of the RenderContentType class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderContentType(
	Guid typeId
)
Public Sub New (
	typeId As Guid
)
Parameters
typeId
Type: System.Guid
[Missing <param name="typeId"/> documentation for "M:Rhino.Render.RenderContentType.#ctor(System.Guid)"]
See Also
Reference
RenderContentType Class
Rhino.Render Namespace