RhinoCommon SDK
Surface Constructor
 Protected constructor for internal use.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected Surface()
Protected Sub New
See Also
Reference
Surface Class
Surface Overload
Rhino.Geometry Namespace