RhinoCommon SDK
GetBaseClass.Point2d Method
Rhino WIP for Windows
 Returns location in view of point in selected in GetPoint::Get() or GetPoint::Get2dPoint(). (0,0) = upper left corner of window.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point Point2d()
Public Function Point2d As Point
Return Value
Type: Point
The location.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace