RhinoCommon SDK
ObjRef.TextEntity Method
Rhino WIP for Windows
 Gets the text entity if the referenced geometry is one.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextEntity TextEntity()
Public Function TextEntity As TextEntity
Return Value
Type: TextEntity
A text entity; or null if the referenced object is not a text entity, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace