RhinoCommon SDK
MaterialRefs.Clear Method
 Removes all items from this dictionary.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace