RhinoCommon SDK
GripObject.Move Method (Transform)
Rhino WIP for Windows
 Moves the grip to a new location.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Move(
	Transform xform
)
Public Sub Move (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
 Transformation appliead to the OriginalLocation point.
See Also
Reference
GripObject Class
Move Overload
Rhino.DocObjects Namespace