RhinoCommon SDK
MeshFace.Flip Method
Rhino WIP for Windows
 Reverses the orientation of the face by swapping corners. The first corner is always maintained.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MeshFace Flip()
Public Function Flip As MeshFace
Return Value
Type: MeshFace
[Missing <returns> documentation for "M:Rhino.Geometry.MeshFace.Flip"]
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace