RhinoCommon SDK
DisplayEngine Constructor
Rhino WIP for Windows
Initializes a new instance of the DisplayEngine class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected DisplayEngine()
Protected Sub New
See Also
Reference
DisplayEngine Class
Rhino.Display Namespace