RhinoCommon SDK
PolyCurve.SegmentCurve Method
Rhino WIP for Windows
 Gets the segment curve at the given index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve SegmentCurve(
	int index
)
Public Function SegmentCurve (
	index As Integer
) As Curve
Parameters
index
Type: System.Int32
Index of segment to retrieve.
Return Value
Type: Curve
The segment at the given index or null on failure.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace