RhinoCommon SDK
BinaryArchiveReader.ReadUShort Method
Rhino WIP for Windows
 Reads a UInt16 from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ushort ReadUShort()
Public Function ReadUShort As UShort
Return Value
Type: UInt16
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace