RhinoCommon SDK
ObjectPropertiesPage.InitializeControls Method
Rhino WIP for Windows
 Called on the active page after the selected objects list has changed to notify the page to initialize its content to reflect the new object list.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void InitializeControls(
	RhinoObject rhObj
)
Public Overridable Sub InitializeControls (
	rhObj As RhinoObject
)
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhObj"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.InitializeControls(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace