RhinoCommon SDK
SporphSpaceMorph Constructor (Surface, Surface)
Rhino WIP for Windows
 Constructs a sporph space morph.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SporphSpaceMorph(
	Surface surface0,
	Surface surface1
)
Public Sub New (
	surface0 As Surface,
	surface1 As Surface
)
Parameters
surface0
Type: Rhino.Geometry.Surface
Base surface.
surface1
Type: Rhino.Geometry.Surface
Target surface.
See Also
Reference
SporphSpaceMorph Class
SporphSpaceMorph Overload
Rhino.Geometry.Morphs Namespace