RhinoCommon SDK
ContentUndoBlocker Constructor
Rhino WIP for Windows
 Constructs a ContentUndoBlocker object inside a using block to block undo when modifying a RenderContent while a ContentUndoHelper is active. Alternatively - create the ContentUndoBlocker and explicitly call Dispose when you are done.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ContentUndoBlocker()
Public Sub New
See Also
Reference
ContentUndoBlocker Class
Rhino.Render Namespace