RhinoCommon SDK
BinaryArchiveWriter.WriteVector3f Method
Rhino WIP for Windows
 Writes a Vector3f value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void WriteVector3f(
	Vector3f value
)
Public Sub WriteVector3f (
	value As Vector3f
)
Parameters
value
Type: Rhino.Geometry.Vector3f
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace