RhinoCommon SDK
TextureEvaluator.Initialize Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.TextureEvaluator.Initialize"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool Initialize()
Public Overridable Function Initialize As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.TextureEvaluator.Initialize"]
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace