RhinoCommon SDK
DecalCreateParams Constructor
Initializes a new instance of the DecalCreateParams class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DecalCreateParams()
Public Sub New
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace