RhinoCommon SDK
ViewportInfo Constructor (ViewportInfo)
Rhino WIP for Windows
 Initializes a new instance by copying values from another instance.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ViewportInfo(
	ViewportInfo other
)
Public Sub New (
	other As ViewportInfo
)
Parameters
other
Type: Rhino.DocObjects.ViewportInfo
The other viewport info.
See Also
Reference
ViewportInfo Class
ViewportInfo Overload
Rhino.DocObjects Namespace