RhinoCommon SDK
MeshFaceNormalList.Destroy Method
Rhino WIP for Windows
 Releases all memory allocated to store face normals. The list capacity will be 0 after this call.
Subsequent calls can add new items.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Destroy()
Public Sub Destroy
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace