RhinoCommon SDK
Point3dList.Transform Method
Rhino WIP for Windows
 Applies a transform to all the points in the list.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Transform(
	Transform xform
)
Public Sub Transform (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
Transform to apply.
See Also
Reference
Point3dList Class
Rhino.Collections Namespace