RhinoCommon SDK
BrepEdge.TrimIndices Method
Rhino WIP for Windows
 Gets the indices of all trims associated with this edge.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int[] TrimIndices()
Public Function TrimIndices As Integer()
Return Value
Type: Int32[]
Empty array on failure.
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace