RhinoCommon SDK
MeshNgonList.GetNgonCenter Method (Int32)
Rhino WIP for Windows
 Gets the center point of an ngon.
This the avarage of the corner points.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d GetNgonCenter(
	int index
)
Public Function GetNgonCenter (
	index As Integer
) As Point3d
Parameters
index
Type: System.Int32
A ngon index.
Return Value
Type: Point3d
The center point.
See Also
Reference
MeshNgonList Class
GetNgonCenter Overload
Rhino.Geometry.Collections Namespace