RhinoCommon SDK
DimStyleTable.Find Method (String, Boolean)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle Find(
	string name,
	bool ignoreDeleted
)
Public Function Find (
	name As String,
	ignoreDeleted As Boolean
) As DimensionStyle
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
ignoreDeleted
Type: System.Boolean
[Missing <param name="ignoreDeleted"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
Return Value
Type: DimensionStyle
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
See Also
Reference
DimStyleTable Class
Find Overload
Rhino.DocObjects.Tables Namespace