RhinoCommon SDK
ChangeQueue.NotifyEndUpdates Method
Rhino WIP for Windows
 Override this when you want to be notified when change notifications have ended.
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void NotifyEndUpdates()
Protected Overridable Sub NotifyEndUpdates
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace