RhinoCommon SDK
GetInteger Constructor
Rhino WIP for Windows
Initializes a new instance of the GetInteger class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GetInteger()
Public Sub New
See Also
Reference
GetInteger Class
Rhino.Input.Custom Namespace