RhinoCommon SDK
StatusBar.SetPointPane Method
Rhino WIP for Windows
 Sets the point pane to a point value.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void SetPointPane(
	Point3d point
)
Public Shared Sub SetPointPane (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
The point value.
See Also
Reference
StatusBar Class
Rhino.UI Namespace