RhinoCommon SDK
CurveBlend.SetCurveParameter Method
Rhino WIP for Windows
 Set parameter on underlying curve
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetCurveParameter(
	int end,
	double curve_t
)
Public Sub SetCurveParameter (
	end As Integer,
	curve_t As Double
)
Parameters
end
Type: System.Int32
Which end
curve_t
Type: System.Double
The parameter
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace