RhinoCommon SDK
CustomRenderMeshProvider.BoundingBox Method
 Returns a bounding box for the custom render meshes for the given object.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual BoundingBox BoundingBox(
	ViewportInfo vp,
	RhinoObject obj,
	RhinoDoc doc,
	Guid requestingPlugIn,
	bool preview
)
Public Overridable Function BoundingBox (
	vp As ViewportInfo,
	obj As RhinoObject,
	doc As RhinoDoc,
	requestingPlugIn As Guid,
	preview As Boolean
) As BoundingBox
Parameters
vp
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
obj
Type: Rhino.DocObjects.RhinoObject
The Rhino object of interest. This can be null in the case where document meshes (not associated with any object) are being requested.
doc
Type: Rhino.RhinoDoc
The Rhino document of interest.
requestingPlugIn
Type: System.Guid
UUID of the RDK plug-in requesting the meshes.
preview
Type: System.Boolean
Type of mesh to build.
Return Value
Type: BoundingBox
A bounding box value.
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace