RhinoCommon SDK
ParticleSystem.Remove Method
Rhino WIP for Windows
 Removes a single particle from this system.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void Remove(
	Particle particle
)
Public Overridable Sub Remove (
	particle As Particle
)
Parameters
particle
Type: Rhino.Geometry.Particle
The particle to be removed.
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace