RhinoCommon SDK
MeshNgonList.AddNgon Method
Rhino WIP for Windows
 Appends a new ngon to the end of the mesh ngon list.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int AddNgon(
	MeshNgon ngon
)
Public Function AddNgon (
	ngon As MeshNgon
) As Integer
Parameters
ngon
Type: Rhino.Geometry.MeshNgon
Ngon to add.
Return Value
Type: Int32
The index of the newly added ngon.
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace