RhinoCommon SDK
GetPoint.GetSnapPoints Method
 Gets current snap points.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d[] GetSnapPoints()
Public Function GetSnapPoints As Point3d()
Return Value
Type: Point3d[]
An array of points.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace