RhinoCommon SDK
RdkThumbnaillistViewModel Constructor
Initializes a new instance of the RdkThumbnaillistViewModel class
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RdkThumbnaillistViewModel()
Public Sub New
See Also
Reference
RdkThumbnaillistViewModel Class
Rhino.UI.Controls Namespace