RhinoCommon SDK
BinaryArchiveReader.ReadGuid Method
Rhino WIP for Windows
 Reads a Guid from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid ReadGuid()
Public Function ReadGuid As Guid
Return Value
Type: Guid
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace