RhinoCommon SDK
CustomCurveObject.Finalize Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomCurveObject.Finalize"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
CustomCurveObject Class
Rhino.DocObjects.Custom Namespace