RhinoCommon SDK
OpenFileDialog.ShowDialog Method
Rhino WIP for Windows
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.UI.OpenFileDialog.ShowDialog"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Use ShowOpenDialog")]
public DialogResult ShowDialog()
<ObsoleteAttribute("Use ShowOpenDialog")>
Public Function ShowDialog As DialogResult
Return Value
Type: DialogResult
[Missing <returns> documentation for "M:Rhino.UI.OpenFileDialog.ShowDialog"]
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace