RhinoCommon SDK
CurveBlend.SetEdgeAngle Method
Rotation from perp to edge for surface blends
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetEdgeAngle(
	int end,
	double angle
)
Public Sub SetEdgeAngle (
	end As Integer,
	angle As Double
)
Parameters
end
Type: System.Int32
[Missing <param name="end"/> documentation for "M:Rhino.Geometry.CurveBlend.SetEdgeAngle(System.Int32,System.Double)"]
angle
Type: System.Double
[Missing <param name="angle"/> documentation for "M:Rhino.Geometry.CurveBlend.SetEdgeAngle(System.Int32,System.Double)"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace