RhinoCommon SDK
SupportOptions.TextureSize Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.TextureSize"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static int TextureSize()
Public Shared Function TextureSize As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.TextureSize"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace