RhinoCommon SDK
SupportOptions.SetLibrariesInitialLocationCustomFolder Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetLibrariesInitialLocationCustomFolder(System.String)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void SetLibrariesInitialLocationCustomFolder(
	string path
)
Public Shared Sub SetLibrariesInitialLocationCustomFolder (
	path As String
)
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Render.SupportOptions.SetLibrariesInitialLocationCustomFolder(System.String)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace