RhinoCommon SDK
Command Constructor
 Default protected constructor. It only allows instantiation through subclassing.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected Command()
Protected Sub New
See Also
Reference
Command Class
Rhino.Commands Namespace