RhinoCommon SDK
PolyCurve Constructor
Rhino WIP for Windows
 Initializes a new, empty polycurve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PolyCurve()
Public Sub New
See Also
Reference
PolyCurve Class
PolyCurve Overload
Rhino.Geometry Namespace