RhinoCommon SDK
RenderPrimitive.Finalize Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.RenderPrimitive.Finalize"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace