RhinoCommon SDK
BrepLoopList.GetEnumerator Method
Rhino WIP for Windows
 Gets an enumerator that visits all edges.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerator<BrepLoop> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepLoop)
Return Value
Type: IEnumerator<BrepLoop>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepLoopList Class
Rhino.Geometry.Collections Namespace