RhinoCommon SDK
PreviewAppearance.Size Method
 Size
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Size()
Public Function Size As Double
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.Size"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace