RhinoCommon SDK
Transform.GetHashCode Method
Rhino WIP for Windows
 Gets a non-unique hashing code for this transform.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A number that can be used to hash this transform in a dictionary.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace