RhinoCommon SDK
ScaleValue.Finalize Method
Rhino WIP for Windows
passively reclaim native allocated ON_ScaleValue*
Namespace: Rhino
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
ScaleValue Class
Rhino Namespace