RhinoCommon SDK
Surface.IsTorus Method
Rhino WIP for Windows
Determines if the surface is a portion of a torus within RhinoMath.ZeroTolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsTorus()
Public Function IsTorus As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a torus.
See Also
Reference
Surface Class
IsTorus Overload
Rhino.Geometry Namespace