RhinoCommon SDK
ViewCapture Constructor
Initializes a new instance of the ViewCapture class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ViewCapture()
Public Sub New
See Also
Reference
ViewCapture Class
Rhino.Display Namespace