RhinoCommon SDK
PointCloud.ClearColors Method
Rhino WIP for Windows
 Destroys the color information in this point cloud.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ClearColors()
Public Sub ClearColors
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace