RhinoCommon SDK
EarthAnchorPoint.EarthLocationIsSet Method
 Checks if the earth location is set or not.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool EarthLocationIsSet()
Public Function EarthLocationIsSet As Boolean
Return Value
Type: Boolean
Bool value, true if set else false
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace