RhinoCommon SDK
V6LinearDimension.GetDisplayLines Method
[Missing <summary> documentation for "M:Rhino.Geometry.V6LinearDimension.GetDisplayLines(Rhino.DocObjects.DimensionStyle,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.Line}@)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool GetDisplayLines(
	DimensionStyle style,
	double scale,
	out IEnumerable<Line> lines
)
Public Function GetDisplayLines (
	style As DimensionStyle,
	scale As Double,
	<OutAttribute> ByRef lines As IEnumerable(Of Line)
) As Boolean
Parameters
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.V6LinearDimension.GetDisplayLines(Rhino.DocObjects.DimensionStyle,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.Line}@)"]
scale
Type: System.Double
[Missing <param name="scale"/> documentation for "M:Rhino.Geometry.V6LinearDimension.GetDisplayLines(Rhino.DocObjects.DimensionStyle,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.Line}@)"]
lines
Type: System.Collections.Generic.IEnumerable<Line>
[Missing <param name="lines"/> documentation for "M:Rhino.Geometry.V6LinearDimension.GetDisplayLines(Rhino.DocObjects.DimensionStyle,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.Line}@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.V6LinearDimension.GetDisplayLines(Rhino.DocObjects.DimensionStyle,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.Line}@)"]
See Also
Reference
V6LinearDimension Class
Rhino.Geometry Namespace