RhinoCommon SDK
Ray3d Constructor
Rhino WIP for Windows
 Initializes a new Ray3d instance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Ray3d(
	Point3d position,
	Vector3d direction
)
Public Sub New (
	position As Point3d,
	direction As Vector3d
)
Parameters
position
Type: Rhino.Geometry.Point3d
The position.
direction
Type: Rhino.Geometry.Vector3d
The direction.
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace