RhinoCommon SDK
Point Constructor (Point3d)
Rhino WIP for Windows
 Initializes a new point instance with a location.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point(
	Point3d location
)
Public Sub New (
	location As Point3d
)
Parameters
location
Type: Rhino.Geometry.Point3d
A position in 3D space.
See Also
Reference
Point Class
Point Overload
Rhino.Geometry Namespace