RhinoCommon SDK
AsyncRenderContext.Dispose Method
Rhino WIP for Windows
Releases all resources used by the AsyncRenderContext
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
AsyncRenderContext Class
Dispose Overload
Rhino.Render Namespace