RhinoCommon SDK
RealtimeDisplayMode.CreateWorld Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.CreateWorld(Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.Display.DisplayPipelineAttributes)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void CreateWorld(
	RhinoDoc doc,
	ViewInfo viewInfo,
	DisplayPipelineAttributes displayPipelineAttributes
)
Public Overridable Sub CreateWorld (
	doc As RhinoDoc,
	viewInfo As ViewInfo,
	displayPipelineAttributes As DisplayPipelineAttributes
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.CreateWorld(Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.Display.DisplayPipelineAttributes)"]
viewInfo
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="viewInfo"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.CreateWorld(Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.Display.DisplayPipelineAttributes)"]
displayPipelineAttributes
Type: Rhino.Display.DisplayPipelineAttributes
[Missing <param name="displayPipelineAttributes"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.CreateWorld(Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.Display.DisplayPipelineAttributes)"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace