RhinoCommon SDK
MenuTask.IsForTopLevelContent Method
 Return true if the menutask is associated with the toplevel content and false if not
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsForTopLevelContent()
Public Function IsForTopLevelContent As Boolean
Return Value
Type: Boolean
Return true if the menutask is associated with the toplevel content and false if not
See Also
Reference
MenuTask Class
Rhino.Render Namespace