RhinoCommon SDK
RenderTexture.GetRepeat Method
Rhino WIP for Windows
 Get repeat value across UVW space. If the projection type is WCS or other type specified in model units, then this is the repeat across 1 meter of the model.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual Vector3d GetRepeat()
Public Overridable Function GetRepeat As Vector3d
Return Value
Type: Vector3d
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetRepeat"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace