RhinoCommon SDK
File3dm.Dump Method
Rhino WIP for Windows
Prepares a text dump of the entire model.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Dump()
Public Function Dump As String
Return Value
Type: String
The text dump.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace