RhinoCommon SDK
Circle.Translate Method
Rhino WIP for Windows
 Moves the circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Translate(
	Vector3d delta
)
Public Function Translate (
	delta As Vector3d
) As Boolean
Parameters
delta
Type: Rhino.Geometry.Vector3d
Translation vector.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace