RhinoCommon SDK
Vector3d Constructor (Vector3f)
Rhino WIP for Windows
 Initializes a new instance of a vector, copying the three components from a single-precision vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d(
	Vector3f vector
)
Public Sub New (
	vector As Vector3f
)
Parameters
vector
Type: Rhino.Geometry.Vector3f
A single-precision vector.
See Also
Reference
Vector3d Structure
Vector3d Overload
Rhino.Geometry Namespace