RhinoCommon SDK
RenderPrimitiveList.ConvertMeshesToTriangles Method
Rhino WIP for Windows
 Convert mesh quad faces to triangle faces.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ConvertMeshesToTriangles()
Public Sub ConvertMeshesToTriangles
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace