RhinoCommon SDK
MeshNgonList.GetNgonBoundary Method
Rhino WIP for Windows
 Get a list of vertices that form the boundary of a face set. This is often use to get n-gon boundaries.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int[] GetNgonBoundary(
	IEnumerable<int> ngonFaceIndexList
)
Public Function GetNgonBoundary (
	ngonFaceIndexList As IEnumerable(Of Integer)
) As Integer()
Parameters
ngonFaceIndexList
Type: System.Collections.Generic.IEnumerable<Int32>
List of mesh face indices.
Return Value
Type: Int32[]
List of mesh vertex indices that form the boundary of the face set.
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace