RhinoCommon SDK
RdkViewModel.NewUndoRecord.Finalize Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.RdkViewModel.NewUndoRecord.Finalize"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RdkViewModel.NewUndoRecord Class
Rhino.UI.Controls Namespace