RhinoCommon SDK
Material Constructor
Rhino WIP for Windows
Initializes a new instance of the Material class
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Material()
Public Sub New
See Also
Reference
Material Class
Rhino.DocObjects Namespace