RhinoCommon SDK
RealtimeDisplayMode.HudShowStatusText Method
 Override to show status text in HUD. By default disabled.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool HudShowStatusText()
Public Overridable Function HudShowStatusText As Boolean
Return Value
Type: Boolean
Return true to show status text in HUD
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace