RhinoCommon SDK
File3dmObject.Equals Method (Object)
Rhino WIP for Windows
 Verified that two objects refer to the same object in a document.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The other item to test.
Return Value
Type: Boolean
true is the two objects coincide.
See Also
Reference
File3dmObject Class
Equals Overload
Rhino.FileIO Namespace