RhinoCommon SDK
DisplayPipeline.PopModelTransform Method
Rhino WIP for Windows
 Pop a model transformation off the engine's model transform stack.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void PopModelTransform()
Public Sub PopModelTransform
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace