RhinoCommon SDK
VolumeMassProperties.Finalize Method
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace