RhinoCommon SDK
RdkViewModel.UndoHelper Constructor
Rhino WIP for Windows
Initializes a new instance of the RdkViewModel.UndoHelper class
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public UndoHelper(
	RhinoDoc doc,
	string description
)
Public Sub New (
	doc As RhinoDoc,
	description As String
)
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.UI.Controls.RdkViewModel.UndoHelper.#ctor(Rhino.RhinoDoc,System.String)"]
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.UI.Controls.RdkViewModel.UndoHelper.#ctor(Rhino.RhinoDoc,System.String)"]
See Also
Reference
RdkViewModel.UndoHelper Class
Rhino.UI.Controls Namespace