RhinoCommon SDK
RhinoViewport Constructor
Initializes a new instance of the RhinoViewport class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoViewport()
Public Sub New
See Also
Reference
RhinoViewport Class
RhinoViewport Overload
Rhino.Display Namespace