RhinoCommon SDK
EarthAnchorPoint.Finalize Method
Rhino WIP for Windows
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace