RhinoCommon SDK
File3dmPlugInDataTable.Dump Method
Rhino WIP for Windows
Prepares a text dump of table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Dump()
Public Function Dump As String
Return Value
Type: String
A string containing the dump.
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace