RhinoCommon SDK
Linetype Constructor
Initializes a new instance of the Linetype class
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Linetype()
Public Sub New
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace