RhinoCommon SDK
RdkViewModel.NewUndoRecord Constructor
Initializes a new instance of the RdkViewModel.NewUndoRecord class
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public NewUndoRecord(
	string description,
	RdkViewModel viewModel
)
Public Sub New (
	description As String,
	viewModel As RdkViewModel
)
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.UI.Controls.RdkViewModel.NewUndoRecord.#ctor(System.String,Rhino.UI.Controls.RdkViewModel)"]
viewModel
Type: Rhino.UI.Controls.RdkViewModel
[Missing <param name="viewModel"/> documentation for "M:Rhino.UI.Controls.RdkViewModel.NewUndoRecord.#ctor(System.String,Rhino.UI.Controls.RdkViewModel)"]
See Also
Reference
RdkViewModel.NewUndoRecord Class
Rhino.UI.Controls Namespace