RhinoCommon SDK
Brep.CullUnused3dCurves Method
Rhino WIP for Windows
Culls 2d curves not referenced by a trim.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool CullUnused3dCurves()
Public Function CullUnused3dCurves As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace