RhinoCommon SDK
Extrusion.WallEdge Method
Rhino WIP for Windows
 Gets one of the longitudinal curves along the beam or extrusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve WallEdge(
	ComponentIndex ci
)
Public Function WallEdge (
	ci As ComponentIndex
) As Curve
Parameters
ci
Type: Rhino.Geometry.ComponentIndex
The index of this profile.
Return Value
Type: Curve
The profile.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace