RhinoCommon SDK
CurveBlend.GetTargetCurve Method
 Get the blend target curve
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve GetTargetCurve(
	int end
)
Public Function GetTargetCurve (
	end As Integer
) As Curve
Parameters
end
Type: System.Int32
Which end
Return Value
Type: Curve
The target curve
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace