RhinoCommon SDK
SupportOptions.LabelFormatUtc Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.LabelFormatUtc"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static int LabelFormatUtc()
Public Shared Function LabelFormatUtc As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.LabelFormatUtc"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace