RhinoCommon SDK
RenderPipeline.RenderSceneWithNoMeshes Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.RenderSceneWithNoMeshes"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual bool RenderSceneWithNoMeshes()
Protected Overridable Function RenderSceneWithNoMeshes As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.RenderSceneWithNoMeshes"]
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace