RhinoCommon SDK
RdkBreadCrumbViewModel.SelectThumbData Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.RdkBreadCrumbViewModel.SelectThumbData(System.Guid)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SelectThumbData(
	Guid id
)
Public Sub SelectThumbData (
	id As Guid
)
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.UI.Controls.RdkBreadCrumbViewModel.SelectThumbData(System.Guid)"]
See Also
Reference
RdkBreadCrumbViewModel Class
Rhino.UI.Controls Namespace