RhinoCommon SDK
PreviewJobSignature Constructor (Int32, Int32, UInt32)
Rhino WIP for Windows
Initializes a new instance of the PreviewJobSignature class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PreviewJobSignature(
	int width,
	int height,
	uint sig
)
Public Sub New (
	width As Integer,
	height As Integer,
	sig As UInteger
)
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.Render.PreviewJobSignature.#ctor(System.Int32,System.Int32,System.UInt32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.Render.PreviewJobSignature.#ctor(System.Int32,System.Int32,System.UInt32)"]
sig
Type: System.UInt32
[Missing <param name="sig"/> documentation for "M:Rhino.Render.PreviewJobSignature.#ctor(System.Int32,System.Int32,System.UInt32)"]
See Also
Reference
PreviewJobSignature Class
PreviewJobSignature Overload
Rhino.Render Namespace