RhinoCommon SDK
SupportOptions.SetLabelFormatLoc Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetLabelFormatLoc(System.Int32)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void SetLabelFormatLoc(
	int value
)
Public Shared Sub SetLabelFormatLoc (
	value As Integer
)
Parameters
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.Render.SupportOptions.SetLabelFormatLoc(System.Int32)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace