RhinoCommon SDK
PointCloud.Merge Method
Rhino WIP for Windows
 Copies the point values of another pointcloud into this one.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Merge(
	PointCloud other
)
Public Sub Merge (
	other As PointCloud
)
Parameters
other
Type: Rhino.Geometry.PointCloud
PointCloud to merge with this one.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace