RhinoCommon SDK
IRhRdkContentThumbnailList.ContentFromThumbId Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnailList.ContentFromThumbId(System.Guid@)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
RenderContent ContentFromThumbId(
	ref Guid uuidThumb
)
Function ContentFromThumbId (
	ByRef uuidThumb As Guid
) As RenderContent
Parameters
uuidThumb
Type: System.Guid
[Missing <param name="uuidThumb"/> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnailList.ContentFromThumbId(System.Guid@)"]
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnailList.ContentFromThumbId(System.Guid@)"]
See Also
Reference
IRhRdkContentThumbnailList Interface
Rhino.UI.Controls Namespace