RhinoCommon SDK
RenderPlugInList Constructor
Rhino WIP for Windows
Initializes a new instance of the RenderPlugInList class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderPlugInList()
Public Sub New
See Also
Reference
RenderPlugInList Class
Rhino.Render Namespace