RhinoCommon SDK
ContentCollection.Remove Method
[Missing <summary> documentation for "M:Rhino.Render.ContentCollection.Remove(Rhino.Render.ContentArray)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Remove(
	ContentArray content
)
Public Sub Remove (
	content As ContentArray
)
Parameters
content
Type: Rhino.Render.ContentArray
[Missing <param name="content"/> documentation for "M:Rhino.Render.ContentCollection.Remove(Rhino.Render.ContentArray)"]
See Also
Reference
ContentCollection Class
Rhino.Render Namespace