RhinoCommon SDK
ScaleValue.Dispose Method
Rhino WIP for Windows
actively reclaim native allocated ON_SacleValue*
Namespace: Rhino
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ScaleValue Class
Rhino Namespace