RhinoCommon SDK
CurveBlend.SetPickParameter Method
Rhino WIP for Windows
 Set pick parameter for one end of a blend
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetPickParameter(
	int end,
	double pick_t
)
Public Sub SetPickParameter (
	end As Integer,
	pick_t As Double
)
Parameters
end
Type: System.Int32
Which end
pick_t
Type: System.Double
Pick parameter
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace