RhinoCommon SDK
RenderTexture.SetDisplayInViewport Method (Boolean)
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.SetDisplayInViewport(System.Boolean)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetDisplayInViewport(
	bool value
)
Public Sub SetDisplayInViewport (
	value As Boolean
)
Parameters
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.Render.RenderTexture.SetDisplayInViewport(System.Boolean)"]
See Also
Reference
RenderTexture Class
SetDisplayInViewport Overload
Rhino.Render Namespace