RhinoCommon SDK
RhinoObject.HasTextureMapping Method
Rhino WIP for Windows
 Returns true if this object has a texture mapping form any source (pluginId)
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool HasTextureMapping()
Public Function HasTextureMapping As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.HasTextureMapping"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace