RhinoCommon SDK
FileObj Constructor
Rhino WIP for Windows
Initializes a new instance of the FileObj class
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public FileObj()
Public Sub New
See Also
Reference
FileObj Class
Rhino.FileIO Namespace