RhinoCommon SDK
ObjectPropertiesPage.OnHelp Method
Rhino WIP for Windows
 Called when the F1 key or help button is pressed, override to display plug-in specific help for this page.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void OnHelp()
Public Overridable Sub OnHelp
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace