RhinoCommon SDK
Vector3d Constructor (Vector3d)
Rhino WIP for Windows
 Initializes a new instance of a vector, copying the three components from a vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d(
	Vector3d vector
)
Public Sub New (
	vector As Vector3d
)
Parameters
vector
Type: Rhino.Geometry.Vector3d
A double-precision vector.
See Also
Reference
Vector3d Structure
Vector3d Overload
Rhino.Geometry Namespace