RhinoCommon SDK
GetArc.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
GetArc Class
Dispose Overload
Rhino.Input.Custom Namespace