RhinoCommon SDK
CurveIntersections.Dispose Method
Rhino WIP for Windows
 Actively reclaims unmanaged resources that this instance uses.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
CurveIntersections Class
Dispose Overload
Rhino.Geometry.Intersect Namespace