RhinoCommon SDK
V6Dimension Constructor (SerializationInfo, StreamingContext)
Initializes a new instance of the V6Dimension class
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected V6Dimension(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
[Missing <param name="info"/> documentation for "M:Rhino.Geometry.V6Dimension.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
context
Type: System.Runtime.Serialization.StreamingContext
[Missing <param name="context"/> documentation for "M:Rhino.Geometry.V6Dimension.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
See Also
Reference
V6Dimension Class
V6Dimension Overload
Rhino.Geometry Namespace