RhinoCommon SDK
RhinoGet.GetRectangleWithCounts Method
Rhino WIP for Windows
 Gets a 3d rectangle with prompts for counts in X and Y directions.
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Result GetRectangleWithCounts(
	string variety,
	int xMin,
	ref int xCount,
	int yMin,
	ref int yCount,
	out Point3d[] corners
)
Public Shared Function GetRectangleWithCounts (
	variety As String,
	xMin As Integer,
	ByRef xCount As Integer,
	yMin As Integer,
	ByRef yCount As Integer,
	<OutAttribute> ByRef corners As Point3d()
) As Result
Parameters
variety
Type: System.String
Use "Point" for a point grid, "Face" for a meshplane, "Widget" for a rectangle with widget count prompts, etc.
xMin
Type: System.Int32
Minimum value allowed for count in the x direction.
xCount
Type: System.Int32
Count in the x direction.
yMin
Type: System.Int32
Minimum value allowed for count in the y direction.
yCount
Type: System.Int32
Count in the y direction.
corners
Type: Rhino.Geometry.Point3d[]
corners of the rectangle in counter-clockwise order.
Return Value
Type: Result
Commands.Result.Success if successful.
See Also
Reference
RhinoGet Class
Rhino.Input Namespace