RhinoCommon SDK
Surface.Domain Method
Rhino WIP for Windows
Gets the domain in a direction.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Interval Domain(
	int direction
)
Public Function Domain (
	direction As Integer
) As Interval
Parameters
direction
Type: System.Int32
0 gets first parameter, 1 gets second parameter.
Return Value
Type: Interval
An interval value.
See Also
Reference
Surface Class
Rhino.Geometry Namespace