RhinoCommon SDK
Vector3f.Division Operator (Vector3f, Single)
Rhino WIP for Windows
 Divides a Vector3f by a number, having the effect of shrinking it, t times.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Vector3f operator /(
	Vector3f vector,
	float t
)
Public Shared Operator / (
	vector As Vector3f,
	t As Single
) As Vector3f
Parameters
vector
Type: Rhino.Geometry.Vector3f
A vector.
t
Type: System.Single
A number.
Return Value
Type: Vector3f
A new vector that is componentwise divided by t.
See Also
Reference
Vector3f Structure
Division Overload
Rhino.Geometry Namespace