RhinoCommon SDK
ObjectTable.AddRLeader Method (RLeader)
Rhino WIP for Windows
 Adds a Leader object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddRLeader(
	RLeader rleader
)
Public Function AddRLeader (
	rleader As RLeader
) As Guid
Parameters
rleader
Type: Rhino.Geometry.RLeader
The leader object.
Return Value
Type: Guid
The Guid of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddRLeader Overload
Rhino.DocObjects.Tables Namespace