RhinoCommon SDK
File3dm.Polish Method
Rhino WIP for Windows
Note: This API is now obsolete.
 This function is only kept for forward assembly compatibility.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Polish and Audit functionality no longer exist.")]
public void Polish()
<ObsoleteAttribute("Polish and Audit functionality no longer exist.")>
Public Sub Polish
See Also
Reference
File3dm Class
Rhino.FileIO Namespace