RhinoCommon SDK
PointCloudObject.DuplicatePointCloudGeometry Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.DocObjects.PointCloudObject.DuplicatePointCloudGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PointCloud DuplicatePointCloudGeometry()
Public Function DuplicatePointCloudGeometry As PointCloud
Return Value
Type: PointCloud
[Missing <returns> documentation for "M:Rhino.DocObjects.PointCloudObject.DuplicatePointCloudGeometry"]
See Also
Reference
PointCloudObject Class
Rhino.DocObjects Namespace