RhinoCommon SDK
ZBufferCapture.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ZBufferCapture Class
Dispose Overload
Rhino.Display Namespace