RhinoCommon SDK
V6AngularDimension Constructor
Initializes a new instance of the V6AngularDimension class
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6AngularDimension()
Public Sub New
See Also
Reference
V6AngularDimension Class
V6AngularDimension Overload
Rhino.Geometry Namespace