RhinoCommon SDK
TwoColorRenderTexture Constructor
Rhino WIP for Windows
Initializes a new instance of the TwoColorRenderTexture class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected TwoColorRenderTexture()
Protected Sub New
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace