RhinoCommon SDK
Polyline Constructor
Rhino WIP for Windows
 Initializes a new empty polyline.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Polyline()
Public Sub New
See Also
Reference
Polyline Class
Polyline Overload
Rhino.Geometry Namespace