RhinoCommon SDK
Particle Constructor
Rhino WIP for Windows
 Initializes a new instance of the Particle class.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Particle()
Public Sub New
See Also
Reference
Particle Class
Rhino.Geometry Namespace