RhinoCommon SDK
Brep.SetTolerancesBoxesAndFlags Method
Rhino WIP for Windows
 Set tolerances and flags in a Brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetTolerancesBoxesAndFlags()
Public Sub SetTolerancesBoxesAndFlags
See Also
Reference
Brep Class
SetTolerancesBoxesAndFlags Overload
Rhino.Geometry Namespace