RhinoCommon SDK
ContentEditingContext.Finalize Method
Rhino WIP for Windows
 Destructor for ContentEditingContext
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
ContentEditingContext Class
Rhino.Render Namespace