RhinoCommon SDK
RhinoViewport.SetConstructionPlane Method (ConstructionPlane)
Rhino WIP for Windows
 Sets the construction plane to cplane.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetConstructionPlane(
	ConstructionPlane cplane
)
Public Sub SetConstructionPlane (
	cplane As ConstructionPlane
)
Parameters
cplane
Type: Rhino.DocObjects.ConstructionPlane
The constuction plane to set.
See Also
Reference
RhinoViewport Class
SetConstructionPlane Overload
Rhino.Display Namespace