RhinoCommon SDK
RenderSettings Constructor
Rhino WIP for Windows
 Initializes a new instance of the RenderSettings class.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderSettings()
Public Sub New
See Also
Reference
RenderSettings Class
RenderSettings Overload
Rhino.Render Namespace