RhinoCommon SDK
Vector2d.Addition Operator
 Sums up two vectors.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Vector2d operator +(
	Vector2d vector1,
	Vector2d vector2
)
Public Shared Operator + (
	vector1 As Vector2d,
	vector2 As Vector2d
) As Vector2d
Parameters
vector1
Type: Rhino.Geometry.Vector2d
A vector.
vector2
Type: Rhino.Geometry.Vector2d
A second vector.
Return Value
Type: Vector2d
A new vector that results from the componentwise addition of the two vectors.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace