RhinoCommon SDK
Line.ToString Method
Rhino WIP for Windows
 Contructs the string representation of this line, in the form "From,To".
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A text string.
See Also
Reference
Line Structure
Rhino.Geometry Namespace