RhinoCommon SDK
ContentCollection.SetKind Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.ContentCollection.SetKind(System.String)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetKind(
	string kind
)
Public Sub SetKind (
	kind As String
)
Parameters
kind
Type: System.String
[Missing <param name="kind"/> documentation for "M:Rhino.Render.ContentCollection.SetKind(System.String)"]
See Also
Reference
ContentCollection Class
Rhino.Render Namespace