RhinoCommon SDK
Point2f.ToString Method
 Constructs the string representation for the current point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The point representation in the form X,Y.
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace