RhinoCommon SDK
LineCurve Constructor
Rhino WIP for Windows
 Initializes a new instance of the LineCurve class.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public LineCurve()
Public Sub New
See Also
Reference
LineCurve Class
LineCurve Overload
Rhino.Geometry Namespace