RhinoCommon SDK
Point3f Explicit Conversion (Point3d to Point3f)
Rhino WIP for Windows
 Converts a double-precision point in a single-precision point. Needs explicit casting to help retain precision.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static explicit operator Point3f (
	Point3d point
)
Public Shared Narrowing Operator CType (
	point As Point3d
) As Point3f
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Point3f
The resulting point.
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace