RhinoCommon SDK
MenuTask Constructor
 MenuTask constructor
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MenuTask(
	IntPtr pTask
)
Public Sub New (
	pTask As IntPtr
)
Parameters
pTask
Type: System.IntPtr
[Missing <param name="pTask"/> documentation for "M:Rhino.Render.MenuTask.#ctor(System.IntPtr)"]
See Also
Reference
MenuTask Class
Rhino.Render Namespace