RhinoCommon SDK
EarthAnchorPoint.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
EarthAnchorPoint Class
Dispose Overload
Rhino.DocObjects Namespace