RhinoCommon SDK
File3dmObjectTable.GetEnumerator Method
 Gets the enumerator that visits any File3dmObject in this table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override IEnumerator<File3dmObject> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of File3dmObject)
Return Value
Type: IEnumerator<File3dmObject>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
IEnumerable<T>.GetEnumerator()
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace