RhinoCommon SDK
MaterialRef.Dispose Method
Rhino WIP for Windows
Releases all resources used by the MaterialRef
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace