RhinoCommon SDK
BrepFaceList.StandardizeFaceSurfaces Method
Rhino WIP for Windows
Standardize all faces in the brep.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void StandardizeFaceSurfaces()
Public Sub StandardizeFaceSurfaces
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace