RhinoCommon SDK
ThumbArray.Dispose Method
Releases all resources used by the ThumbArray
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ThumbArray Class
Rhino.Render Namespace