RhinoCommon SDK
RenderEnvironment Constructor
Rhino WIP for Windows
Initializes a new instance of the RenderEnvironment class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected RenderEnvironment()
Protected Sub New
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace