RhinoCommon SDK
Material.Default Method
Rhino WIP for Windows
 Set material to default settings.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Default()
Public Sub Default
See Also
Reference
Material Class
Rhino.DocObjects Namespace