RhinoCommon SDK
ChangeQueue.NotifyDynamicUpdatesAreAvailable Method
Rhino WIP for Windows
 Override this when you want to be notified dynamic updates are available
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void NotifyDynamicUpdatesAreAvailable()
Protected Overridable Sub NotifyDynamicUpdatesAreAvailable
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace