RhinoCommon SDK
ChangeQueue.Dispose Method
Rhino WIP for Windows
 Dispose our ChangeQueue
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ChangeQueue Class
Dispose Overload
Rhino.Render.ChangeQueue Namespace