RhinoCommon SDK
MeshVertexColorList.Clear Method
Rhino WIP for Windows
 Clears the vertex color list on the mesh.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
IList.Clear()
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace