RhinoCommon SDK
CurveBlend.GetPickParameter Method
Rhino WIP for Windows
 Pick parameter on the target
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double GetPickParameter(
	int end
)
Public Function GetPickParameter (
	end As Integer
) As Double
Parameters
end
Type: System.Int32
[Missing <param name="end"/> documentation for "M:Rhino.Geometry.CurveBlend.GetPickParameter(System.Int32)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Geometry.CurveBlend.GetPickParameter(System.Int32)"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace