RhinoCommon SDK
DevelopableSrf Constructor
Initializes a new instance of the DevelopableSrf class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DevelopableSrf()
Public Sub New
See Also
Reference
DevelopableSrf Class
Rhino.Geometry Namespace