RhinoCommon SDK
StackedDialogPage.MakeActivePage Method
 Make this page the active, visible page
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void MakeActivePage()
Public Sub MakeActivePage
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace