RhinoCommon SDK
Polyline.GetSegments Method
Rhino WIP for Windows
 Constructs an array of line segments that make up the entire polyline.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Line[] GetSegments()
Public Function GetSegments As Line()
Return Value
Type: Line[]
An array of line segments or null if the polyline contains fewer than 2 points.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace