RhinoCommon SDK
CurveBlend.GetDerLength Method
 Get the length of a derivative of the blend curve
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double GetDerLength(
	int end,
	int idx
)
Public Function GetDerLength (
	end As Integer,
	idx As Integer
) As Double
Parameters
end
Type: System.Int32
Which end of the blend
idx
Type: System.Int32
Which derivative
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Geometry.CurveBlend.GetDerLength(System.Int32,System.Int32)"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace