RhinoCommon SDK
AnnotationText.SetTextString Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Geometry.AnnotationText.SetTextString(System.String,Rhino.DocObjects.DimensionStyle)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetTextString(
	string rtfText,
	DimensionStyle dimstyle
)
Public Sub SetTextString (
	rtfText As String,
	dimstyle As DimensionStyle
)
Parameters
rtfText
Type: System.String
[Missing <param name="rtfText"/> documentation for "M:Rhino.Geometry.AnnotationText.SetTextString(System.String,Rhino.DocObjects.DimensionStyle)"]
dimstyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimstyle"/> documentation for "M:Rhino.Geometry.AnnotationText.SetTextString(System.String,Rhino.DocObjects.DimensionStyle)"]
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace