RhinoCommon SDK
IThumbnailList.ParentSet Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IThumbnailList.ParentSet"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void ParentSet()
Sub ParentSet
See Also
Reference
IThumbnailList Interface
Rhino.UI.Controls Namespace