RhinoCommon SDK
RdkUndoRecord Constructor
Rhino WIP for Windows
 Constructor for RdkUndoRecord
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RdkUndoRecord(
	IntPtr pUndoRecord
)
Public Sub New (
	pUndoRecord As IntPtr
)
Parameters
pUndoRecord
Type: System.IntPtr
[Missing <param name="pUndoRecord"/> documentation for "M:Rhino.Render.RdkUndoRecord.#ctor(System.IntPtr)"]
See Also
Reference
RdkUndoRecord Class
Rhino.Render Namespace