RhinoCommon SDK
MaterialRefCreateParams Constructor
Initializes a new instance of the MaterialRefCreateParams class
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MaterialRefCreateParams()
Public Sub New
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace