RhinoCommon SDK
ModelComponent.LockName Method
Rhino WIP for Windows
 Locks the component Name property.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void LockName()
Public Sub LockName
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace