RhinoCommon SDK
RdkThumbnaillistViewModel.SetSelected Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.RdkThumbnaillistViewModel.SetSelected(System.Collections.Generic.List{System.Guid})"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetSelected(
	List<Guid> list
)
Public Sub SetSelected (
	list As List(Of Guid)
)
Parameters
list
Type: System.Collections.Generic.List<Guid>
[Missing <param name="list"/> documentation for "M:Rhino.UI.Controls.RdkThumbnaillistViewModel.SetSelected(System.Collections.Generic.List{System.Guid})"]
See Also
Reference
RdkThumbnaillistViewModel Class
Rhino.UI.Controls Namespace