RhinoCommon SDK
BinaryArchiveFile.Close Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.FileIO.BinaryArchiveFile.Close"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Close()
Public Sub Close
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace