RhinoCommon SDK
RdkViewModel.UndoHelper.Dispose Method
Rhino WIP for Windows
Releases all resources used by the RdkViewModel.UndoHelper
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RdkViewModel.UndoHelper Class
Dispose Overload
Rhino.UI.Controls Namespace