RhinoCommon SDK
Dialogs.KillSplash Method
 Destroy the splash screen if it is being displayed.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void KillSplash()
Public Shared Sub KillSplash
See Also
Reference
Dialogs Class
Rhino.UI Namespace