RhinoCommon SDK
GetCircle.Finalize Method
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace