RhinoCommon SDK
Arc.GetHashCode Method
Rhino WIP for Windows
 Computes a hash code for the present arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique integer that represents this arc.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace