RhinoCommon SDK
RenderPipeline.PauseRendering Method
 Implement to pause the current render session
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void PauseRendering()
Public Overridable Sub PauseRendering
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace