RhinoCommon SDK
LinetypeTable.GetUnusedLinetypeName Method
Rhino WIP for Windows
 Gets unused linetype name used as default when creating new linetypes.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string GetUnusedLinetypeName()
Public Function GetUnusedLinetypeName As String
Return Value
Type: String
The unused linetype name.
See Also
Reference
LinetypeTable Class
GetUnusedLinetypeName Overload
Rhino.DocObjects.Tables Namespace