RhinoCommon SDK
SelCommand Constructor
Initializes a new instance of the SelCommand class
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected SelCommand()
Protected Sub New
See Also
Reference
SelCommand Class
Rhino.Commands Namespace