RhinoCommon SDK
Curve.NonConstOperation Method
Rhino WIP for Windows
 For derived classes implementers.
Defines the necessary implementation to free the instance from being const.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void NonConstOperation()
Protected Overrides Sub NonConstOperation
See Also
Reference
Curve Class
Rhino.Geometry Namespace