RhinoCommon SDK
ChangeQueue.GetQueueView Method
Rhino WIP for Windows
 Get view known to the queue at the time of the Flush
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ViewInfo GetQueueView()
Public Function GetQueueView As ViewInfo
Return Value
Type: ViewInfo
ViewInfo
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace