RhinoCommon SDK
ChangeQueue.BakeFor Method
Rhino WIP for Windows
 Override this if you need to control baking behavior for textures. By default bake everything.
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual ChangeQueue.BakingFunctions BakeFor()
Protected Overridable Function BakeFor As ChangeQueue.BakingFunctions
Return Value
Type: ChangeQueue.BakingFunctions
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.BakeFor"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace