RhinoCommon SDK
ChangeQueue.ApplyLinearWorkflowChanges Method
Rhino WIP for Windows
 Override this when you want to handle linear workflow changes
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void ApplyLinearWorkflowChanges(
	LinearWorkflow lw
)
Protected Overridable Sub ApplyLinearWorkflowChanges (
	lw As LinearWorkflow
)
Parameters
lw
Type: Rhino.Render.ChangeQueue.LinearWorkflow
[Missing <param name="lw"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyLinearWorkflowChanges(Rhino.Render.ChangeQueue.LinearWorkflow)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace