RhinoCommon SDK
CurveBlend.GetScaleFactor Method
 Derivative length scales
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double GetScaleFactor(
	int end
)
Public Function GetScaleFactor (
	end As Integer
) As Double
Parameters
end
Type: System.Int32
 Which end
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Geometry.CurveBlend.GetScaleFactor(System.Int32)"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace