RhinoCommon SDK
MenuTaskCollection.Task Method
 Gets the task at specified index
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MenuTask Task(
	int index
)
Public Function Task (
	index As Integer
) As MenuTask
Parameters
index
Type: System.Int32
The index of the desired menutask
Return Value
Type: MenuTask
Returns the menutask at specified index
See Also
Reference
MenuTaskCollection Class
Rhino.Render Namespace