RhinoCommon SDK
Curve.IsArc Method
Rhino WIP for Windows
 Test a curve to see if it can be represented by an arc or circle within RhinoMath.ZeroTolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsArc()
Public Function IsArc As Boolean
Return Value
Type: Boolean
 true if the curve can be represented by an arc or a circle within tolerance.
See Also
Reference
Curve Class
IsArc Overload
Rhino.Geometry Namespace