RhinoCommon SDK
MappingTag Constructor
Initializes a new instance of the MappingTag class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MappingTag()
Public Sub New
See Also
Reference
MappingTag Class
Rhino.Render Namespace