RhinoCommon SDK
CurveBlend.SetScaleFactor Method
 This multiplies the derivative lengths after they have been calculated by whatever the normal way is
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetScaleFactor(
	int end,
	double scale
)
Public Sub SetScaleFactor (
	end As Integer,
	scale As Double
)
Parameters
end
Type: System.Int32
[Missing <param name="end"/> documentation for "M:Rhino.Geometry.CurveBlend.SetScaleFactor(System.Int32,System.Double)"]
scale
Type: System.Double
[Missing <param name="scale"/> documentation for "M:Rhino.Geometry.CurveBlend.SetScaleFactor(System.Int32,System.Double)"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace