RhinoCommon SDK
V6LinearDimensionObject.DuplicateDimLinearGeometry Method
 Constructs a deep (full) copy of the LinearDimension geometry.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6LinearDimension DuplicateDimLinearGeometry()
Public Function DuplicateDimLinearGeometry As V6LinearDimension
Return Value
Type: V6LinearDimension
 A copy of the internal V6LinearDimension geometry.
See Also
Reference
V6LinearDimensionObject Class
Rhino.DocObjects Namespace