RhinoCommon SDK
Interval.MakeIncreasing Method
Rhino WIP for Windows
 Ensures this Interval is either singleton or increasing.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void MakeIncreasing()
Public Sub MakeIncreasing
See Also
Reference
Interval Structure
Rhino.Geometry Namespace