RhinoCommon SDK
RealtimeDisplayMode.ShowCaptureProgress Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.ShowCaptureProgress"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool ShowCaptureProgress()
Public Overridable Function ShowCaptureProgress As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.ShowCaptureProgress"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace