RhinoCommon SDK
Point2f Explicit Conversion (Point2d to Point2f)
Rhino WIP for Windows
 Converts a double-precision point in a single-precision point. Needs explicit casting to help retain precision.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static explicit operator Point2f (
	Point2d point
)
Public Shared Narrowing Operator CType (
	point As Point2d
) As Point2f
Parameters
point
Type: Rhino.Geometry.Point2d
A point.
Return Value
Type: Point2f
The resulting point.
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace