RhinoCommon SDK
Line.Flip Method
 Flip the endpoints of the line segment.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Flip()
Public Sub Flip
See Also
Reference
Line Structure
Rhino.Geometry Namespace