RhinoCommon SDK
HistoryRecord.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
HistoryRecord Class
Dispose Overload
Rhino.DocObjects Namespace