RhinoCommon SDK
IPanel.PanelShown Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.UI.IPanel.PanelShown(System.UInt32)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void PanelShown(
	uint documentSerialNumber
)
Sub PanelShown (
	documentSerialNumber As UInteger
)
Parameters
documentSerialNumber
Type: System.UInt32
[Missing <param name="documentSerialNumber"/> documentation for "M:Rhino.UI.IPanel.PanelShown(System.UInt32)"]
See Also
Reference
IPanel Interface
Rhino.UI Namespace