RhinoCommon SDK
CurveBlend.GetCurveParameter Method
Rhino WIP for Windows
 Parameter on curve underlying target
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double GetCurveParameter(
	int end
)
Public Function GetCurveParameter (
	end As Integer
) As Double
Parameters
end
Type: System.Int32
[Missing <param name="end"/> documentation for "M:Rhino.Geometry.CurveBlend.GetCurveParameter(System.Int32)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Geometry.CurveBlend.GetCurveParameter(System.Int32)"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace