RhinoCommon SDK
ContentCollection.Find Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.ContentCollection.Find(System.Guid,System.UInt32)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderContent Find(
	Guid uuid,
	uint flags
)
Public Function Find (
	uuid As Guid,
	flags As UInteger
) As RenderContent
Parameters
uuid
Type: System.Guid
[Missing <param name="uuid"/> documentation for "M:Rhino.Render.ContentCollection.Find(System.Guid,System.UInt32)"]
flags
Type: System.UInt32
[Missing <param name="flags"/> documentation for "M:Rhino.Render.ContentCollection.Find(System.Guid,System.UInt32)"]
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.ContentCollection.Find(System.Guid,System.UInt32)"]
See Also
Reference
ContentCollection Class
Rhino.Render Namespace