RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames Constructor
Rhino WIP for Windows
Initializes a new instance of the RenderMaterial.BasicMaterialParameterNames class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BasicMaterialParameterNames()
Public Sub New
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace