RhinoCommon SDK
BinaryArchiveReader.ReadBool Method
Rhino WIP for Windows
 Reads a Boolean from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ReadBool()
Public Function ReadBool As Boolean
Return Value
Type: Boolean
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace