RhinoCommon SDK
Delegates Constructor
Initializes a new instance of the Delegates class
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Delegates()
Public Sub New
See Also
Reference
Delegates Class
Rhino.UI.Controls Namespace