RhinoCommon SDK
Brep.CullUnusedLoops Method
Rhino WIP for Windows
Culls loops with m_loop_index == -1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool CullUnusedLoops()
Public Function CullUnusedLoops As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace