RhinoCommon SDK
IRhRdkBreadcrumbCtrl.TextColor Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkBreadcrumbCtrl.TextColor"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
Color TextColor()
Function TextColor As Color
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkBreadcrumbCtrl.TextColor"]
See Also
Reference
IRhRdkBreadcrumbCtrl Interface
Rhino.UI.Controls Namespace