RhinoCommon SDK
Fonts Constructor
Initializes a new instance of the Fonts class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Fonts()
Public Sub New
See Also
Reference
Fonts Class
Rhino.UI Namespace