RhinoCommon SDK
DimStyleTable.GetEnumerator Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override IEnumerator<DimensionStyle> GetEnumerator()
Public Overrides Function GetEnumerator As IEnumerator(Of DimensionStyle)
Return Value
Type: IEnumerator<DimensionStyle>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
IEnumerable<T>.GetEnumerator()
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace