RhinoCommon SDK
Unroller.PerformUnroll Method (List<Brep>)
 Executes unrolling operations.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int PerformUnroll(
	List<Brep> flatbreps
)
Public Function PerformUnroll (
	flatbreps As List(Of Brep)
) As Integer
Parameters
flatbreps
Type: System.Collections.Generic.List<Brep>
List of breps containg flattened results.
Return Value
Type: Int32
Number of breps in result
See Also
Reference
Unroller Class
PerformUnroll Overload
Rhino.Geometry Namespace