RhinoCommon SDK
AnnotationText.SetAnnotationStyleId Method
Rhino WIP for Windows
 Set this text's dimstyle id. This causes the text runs to be recreated with the properties from the corresponding AnnotationStyle
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetAnnotationStyleId(
	Guid id,
	RhinoDoc doc
)
Public Sub SetAnnotationStyleId (
	id As Guid,
	doc As RhinoDoc
)
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.Geometry.AnnotationText.SetAnnotationStyleId(System.Guid,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Geometry.AnnotationText.SetAnnotationStyleId(System.Guid,Rhino.RhinoDoc)"]
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace