RhinoCommon SDK
ObjectTable.Find Method (Guid)
Rhino WIP for Windows
 Please use FindId().
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoObject Find(
	Guid objectId
)
Public Function Find (
	objectId As Guid
) As RhinoObject
Parameters
objectId
Type: System.Guid
Do not use this method.
Return Value
Type: RhinoObject
Do not use this method.
See Also
Reference
ObjectTable Class
Find Overload
Rhino.DocObjects.Tables Namespace