RhinoCommon SDK
SupportOptions.SetLibrariesInitialLocation Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetLibrariesInitialLocation(Rhino.Render.SupportOptions.RdkInitialLocation)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void SetLibrariesInitialLocation(
	SupportOptions.RdkInitialLocation l
)
Public Shared Sub SetLibrariesInitialLocation (
	l As SupportOptions.RdkInitialLocation
)
Parameters
l
Type: Rhino.Render.SupportOptions.RdkInitialLocation
[Missing <param name="l"/> documentation for "M:Rhino.Render.SupportOptions.SetLibrariesInitialLocation(Rhino.Render.SupportOptions.RdkInitialLocation)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace