RhinoCommon SDK
Command.InCommand Method
Rhino WIP for Windows
 Determines if Rhino is currently running a command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static bool InCommand()
Public Shared Function InCommand As Boolean
Return Value
Type: Boolean
true if a command is currently running, false if no commands are currently running.
See Also
Reference
Command Class
Rhino.Commands Namespace