RhinoCommon SDK
Sun Constructor
Rhino WIP for Windows
 Create a non-document controlled Sun
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Sun()
Public Sub New
See Also
Reference
Sun Class
Rhino.Render Namespace