RhinoCommon SDK
PreviewJobSignature.Dispose Method
Releases all resources used by the PreviewJobSignature
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
PreviewJobSignature Class
Rhino.Render Namespace