RhinoCommon SDK
MeshUnsafeLock.Release Method
Rhino WIP for Windows
 Releases the lock and updates the underlying unmanaged data structures.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Release()
Public Sub Release
See Also
Reference
MeshUnsafeLock Class
Rhino.Geometry Namespace