RhinoCommon SDK
PointCloud.GetPoints Method
Rhino WIP for Windows
 Copy all the point coordinates in this point cloud to an array.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d[] GetPoints()
Public Function GetPoints As Point3d()
Return Value
Type: Point3d[]
An array containing all the points in this point cloud.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace