RhinoCommon SDK
V6Dimension.SetUserTextString Method
[Missing <summary> documentation for "M:Rhino.Geometry.V6Dimension.SetUserTextString(System.String)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetUserTextString(
	string rtf_text
)
Public Sub SetUserTextString (
	rtf_text As String
)
Parameters
rtf_text
Type: System.String
[Missing <param name="rtf_text"/> documentation for "M:Rhino.Geometry.V6Dimension.SetUserTextString(System.String)"]
See Also
Reference
V6Dimension Class
Rhino.Geometry Namespace