RhinoCommon SDK
CurveBlend.SetTargetPoint Method
 Set the target point for one end of a blend
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetTargetPoint(
	int end,
	Point3d point
)
Public Sub SetTargetPoint (
	end As Integer,
	point As Point3d
)
Parameters
end
Type: System.Int32
Which end
point
Type: Rhino.Geometry.Point3d
The target point
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace