RhinoCommon SDK
CurveList.Add Method (Circle)
Rhino WIP for Windows
 Adds a circle to this list.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Add(
	Circle circle
)
Public Sub Add (
	circle As Circle
)
Parameters
circle
Type: Rhino.Geometry.Circle
A circle value that will be the model of the new internal curve.
See Also
Reference
CurveList Class
Add Overload
Rhino.Collections Namespace