RhinoCommon SDK
BinaryArchiveWriter.EndWrite3dmChunk Method
Rhino WIP for Windows
 updates length in chunk header
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool EndWrite3dmChunk()
Public Function EndWrite3dmChunk As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveWriter.EndWrite3dmChunk"]
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace