RhinoCommon SDK
V6RadialDimension Constructor
Rhino WIP for Windows
Initializes a new instance of the V6RadialDimension class
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6RadialDimension()
Public Sub New
See Also
Reference
V6RadialDimension Class
V6RadialDimension Overload
Rhino.Geometry Namespace