RhinoCommon SDK
ChangeQueue.CreateWorld Method
 Calls CreateWorld with true passed.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void CreateWorld()
Public Sub CreateWorld
See Also
Reference
ChangeQueue Class
CreateWorld Overload
Rhino.Render.ChangeQueue Namespace