RhinoCommon SDK
V6OrdinateDimension.Get3dPoints Method
Rhino WIP for Windows
 Get locations of dimension's 3d points
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Get3dPoints(
	out Point3d basepoint,
	out Point3d defpoint,
	out Point3d leaderpoint,
	out Point3d kinkpoint1,
	out Point3d kinkpoint2
)
Public Function Get3dPoints (
	<OutAttribute> ByRef basepoint As Point3d,
	<OutAttribute> ByRef defpoint As Point3d,
	<OutAttribute> ByRef leaderpoint As Point3d,
	<OutAttribute> ByRef kinkpoint1 As Point3d,
	<OutAttribute> ByRef kinkpoint2 As Point3d
) As Boolean
Parameters
basepoint
Type: Rhino.Geometry.Point3d
[Missing <param name="basepoint"/> documentation for "M:Rhino.Geometry.V6OrdinateDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)"]
defpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="defpoint"/> documentation for "M:Rhino.Geometry.V6OrdinateDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)"]
leaderpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="leaderpoint"/> documentation for "M:Rhino.Geometry.V6OrdinateDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)"]
kinkpoint1
Type: Rhino.Geometry.Point3d
[Missing <param name="kinkpoint1"/> documentation for "M:Rhino.Geometry.V6OrdinateDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)"]
kinkpoint2
Type: Rhino.Geometry.Point3d
[Missing <param name="kinkpoint2"/> documentation for "M:Rhino.Geometry.V6OrdinateDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.V6OrdinateDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)"]
See Also
Reference
V6OrdinateDimension Class
Rhino.Geometry Namespace