RhinoCommon SDK
SupportOptions.SetShowCustom Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetShowCustom(System.Boolean)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void SetShowCustom(
	bool b
)
Public Shared Sub SetShowCustom (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetShowCustom(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace