RhinoCommon SDK
MenuTaskCollection.Finalize Method
Rhino WIP for Windows
 MenuTaskCollection destructor
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
MenuTaskCollection Class
Rhino.Render Namespace