RhinoCommon SDK
RenderSettings Constructor (RenderSettings)
Rhino WIP for Windows
 Initializes a new instance of the RenderSettings class.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderSettings(
	RenderSettings source
)
Public Sub New (
	source As RenderSettings
)
Parameters
source
Type: Rhino.Render.RenderSettings
[Missing <param name="source"/> documentation for "M:Rhino.Render.RenderSettings.#ctor(Rhino.Render.RenderSettings)"]
See Also
Reference
RenderSettings Class
RenderSettings Overload
Rhino.Render Namespace