RhinoCommon SDK
RenderPrimitiveList.Clear Method
Rhino WIP for Windows
 Remove all primitives from this list
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace