RhinoCommon SDK
PointCloud Constructor
Rhino WIP for Windows
 Initializes a new instance of the PointCloud class that is empty.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PointCloud()
Public Sub New
See Also
Reference
PointCloud Class
PointCloud Overload
Rhino.Geometry Namespace