RhinoCommon SDK
Vector3f.GetHashCode Method
Rhino WIP for Windows
 Computes a hash number that represents the current vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A hash code that is not unique for each vector.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace