RhinoCommon SDK
NameHash.Equals Method (Object)
Rhino WIP for Windows
 Determines if another object is a name hash with same value.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The other content hash to compare.
Return Value
Type: Boolean
True if the two hashes are equal.
See Also
Reference
NameHash Class
Equals Overload
Rhino.FileIO Namespace