RhinoCommon SDK
Vector2d.Add Method
Rhino WIP for Windows
 Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Vector2d Add(
	Vector2d vector1,
	Vector2d vector2
)
Public Shared Function Add (
	vector1 As Vector2d,
	vector2 As Vector2d
) As Vector2d
Parameters
vector1
Type: Rhino.Geometry.Vector2d
A vector.
vector2
Type: Rhino.Geometry.Vector2d
A second vector.
Return Value
Type: Vector2d
A new vector that results from the componentwise addition of the two vectors.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace