RhinoCommon SDK
Curve.TangentAt Method
Rhino WIP for Windows
Evaluates the unit tangent vector at a curve parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d TangentAt(
	double t
)
Public Function TangentAt (
	t As Double
) As Vector3d
Parameters
t
Type: System.Double
Evaluation parameter.
Return Value
Type: Vector3d
Unit tangent vector of the curve at the parameter t.
Remarks
No error handling.
See Also
Reference
Curve Class
Rhino.Geometry Namespace