RhinoCommon SDK
PointCloud.ClearHiddenFlags Method
Rhino WIP for Windows
 Destroys the hidden flag information in this point cloud.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ClearHiddenFlags()
Public Sub ClearHiddenFlags
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace