RhinoCommon SDK
ModelComponent.ClearName Method
Rhino WIP for Windows
 Resets the HasName property of the model component to false, if possible.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ClearName()
Public Sub ClearName
Exceptions
Exception | Condition
InvalidOperationException | If the name is locked.
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace