RhinoCommon SDK
CustomBrepObject.Finalize Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomBrepObject.Finalize"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
CustomBrepObject Class
Rhino.DocObjects.Custom Namespace