RhinoCommon SDK
HiddenLineDrawingParameters.AddClippingPlane Method
Rhino WIP for Windows
 Specify clipping planes that are active for this view.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void AddClippingPlane(
	Plane plane
)
Public Sub AddClippingPlane (
	plane As Plane
)
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.HiddenLineDrawingParameters.AddClippingPlane(Rhino.Geometry.Plane)"]
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace