RhinoCommon SDK
RenderContent.GetEmbeddedFilesList Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.GetEmbeddedFilesList"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string[] GetEmbeddedFilesList()
Public Function GetEmbeddedFilesList As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.GetEmbeddedFilesList"]
See Also
Reference
RenderContent Class
Rhino.Render Namespace