RhinoCommon SDK
AsyncRenderContext.Dispose Method (Boolean)
Rhino WIP for Windows
Releases the unmanaged resources used by the AsyncRenderContext and optionally releases the managed resources
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void Dispose(
	bool isDisposing
)
Protected Overridable Sub Dispose (
	isDisposing As Boolean
)
Parameters
isDisposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
AsyncRenderContext Class
Dispose Overload
Rhino.Render Namespace