RhinoCommon SDK
ZBufferCapture.ShowAnnotations Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowAnnotations(System.Boolean)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ShowAnnotations(
	bool on
)
Public Sub ShowAnnotations (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowAnnotations(System.Boolean)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace