RhinoCommon SDK
BrepFaceList.RemoveAt Method
Rhino WIP for Windows
 Deletes a face at a specified index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void RemoveAt(
	int faceIndex
)
Public Sub RemoveAt (
	faceIndex As Integer
)
Parameters
faceIndex
Type: System.Int32
The index of the mesh face.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace