RhinoCommon SDK
BrepFace.AdjacentFaces Method
Rhino WIP for Windows
 Gets the indices of all the BrepFaces that surround (are adjacent to) this face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int[] AdjacentFaces()
Public Function AdjacentFaces As Integer()
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.Geometry.BrepFace.AdjacentFaces"]
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace