RhinoCommon SDK
GetBaseClass.Color Method
Rhino WIP for Windows
Gets a color if Get*() returns GetResult.Color.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color Color()
Public Function Color As Color
Return Value
Type: Color
The color chosen by the user.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace