RhinoCommon SDK
BrepFaceList.SplitBipolarFaces Method
Rhino WIP for Windows
 Splits surfaces with two singularities, like spheres, so the results have at most one singularity.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SplitBipolarFaces()
Public Function SplitBipolarFaces As Boolean
Return Value
Type: Boolean
true if successful.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace