RhinoCommon SDK
BrepLoop.To2dCurve Method
Rhino WIP for Windows
 Create a 2d curve that traces the entire loop
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve To2dCurve()
Public Function To2dCurve As Curve
Return Value
Type: Curve
[Missing <returns> documentation for "M:Rhino.Geometry.BrepLoop.To2dCurve"]
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace