RhinoCommon SDK
MeshFace.GetHashCode Method
Rhino WIP for Windows
 Returns a runtime-stable hashcode for the current mesh face. You are not allowed to rely on persistance of this hashcode in serialization, but for each version of RhinoCommon, this hashcode will be the same for each mesh face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique integer that represents this mesh face.
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace