RhinoCommon SDK
RenderContentSerializer Constructor
Rhino WIP for Windows
 Protected constructor to be called from derived class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected RenderContentSerializer(
	string fileExtension,
	RenderContentKind contentKind,
	bool canRead,
	bool canWrite
)
Protected Sub New (
	fileExtension As String,
	contentKind As RenderContentKind,
	canRead As Boolean,
	canWrite As Boolean
)
Parameters
fileExtension
Type: System.String
 File extension associated with this serialize object
contentKind
Type: Rhino.Render.RenderContentKind
 Type of content created when importing or exporting this file type.
canRead
Type: System.Boolean
 If true then the file type can be imported and will be included in the file open box when importing the specified render content type.
canWrite
Type: System.Boolean
 If true then the file type can be exported and will be included in the file save box when exporting the specified render content type.
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace