RhinoCommon SDK
SupportOptions.PreferNativeRenderer Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.PreferNativeRenderer"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static bool PreferNativeRenderer()
Public Shared Function PreferNativeRenderer As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.PreferNativeRenderer"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace