RhinoCommon SDK
RenderEnvironment.NewBasicEnvironment Method
 Constructs a new RenderEnvironment from a SimulatedEnvironment.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RenderEnvironment NewBasicEnvironment(
	SimulatedEnvironment environment
)
Public Shared Function NewBasicEnvironment (
	environment As SimulatedEnvironment
) As RenderEnvironment
Parameters
environment
Type: Rhino.Render.SimulatedEnvironment
The environment to create the basic environment from.
Return Value
Type: RenderEnvironment
A new basic environment.
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace