RhinoCommon SDK
GetCancel Constructor
Initializes a new instance of the GetCancel class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GetCancel()
Public Sub New
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace