RhinoCommon SDK
CustomGripObject.Dispose Method (Boolean)
Rhino WIP for Windows
Releases the unmanaged resources used by the CustomGripObject and optionally releases the managed resources
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Dispose(
	bool disposing
)
Protected Overrides Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
CustomGripObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace