RhinoCommon SDK
GetBaseClass Constructor
Initializes a new instance of the GetBaseClass class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected GetBaseClass()
Protected Sub New
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace