RhinoCommon SDK
SupportOptions.SetShowRenderContent Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetShowRenderContent(System.Boolean)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void SetShowRenderContent(
	bool b
)
Public Shared Sub SetShowRenderContent (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetShowRenderContent(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace