RhinoCommon SDK
GetPoint.ConstrainToTargetPlane Method
Rhino WIP for Windows
 Constrains point to lie on a plane that is parallel to the viewing plane and passes through the view's target point.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ConstrainToTargetPlane()
Public Sub ConstrainToTargetPlane
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace