RhinoCommon SDK
File3dmNotes Constructor
 Creates empty default notes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public File3dmNotes()
Public Sub New
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace