RhinoCommon SDK
MenuTask.MenuSeparators Method
Rhino WIP for Windows
 Returns a value indicating if the menutask has menuseparators before, after or none
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Separator MenuSeparators()
Public Function MenuSeparators As Separator
Return Value
Type: Separator
 Returns Separator value kNone = No separators will surround this task on the menu. kBefore = A separator will appear before this task on the menu. kAfter = A separator will appear after this task on the menu. kBoth,
See Also
Reference
MenuTask Class
Rhino.Render Namespace