RhinoCommon SDK
RealtimeDisplayMode.SetView Method
 Set ViewInfo for this RealtimeDisplayMode instance.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetView(
	ViewInfo view
)
Public Sub SetView (
	view As ViewInfo
)
Parameters
view
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="view"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.SetView(Rhino.DocObjects.ViewInfo)"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace