RhinoCommon SDK
StringField.ValueAsObject Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.Fields.StringField.ValueAsObject"]
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override Object ValueAsObject()
Public Overrides Function ValueAsObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Render.Fields.StringField.ValueAsObject"]
See Also
Reference
StringField Class
Rhino.Render.Fields Namespace