RhinoCommon SDK
NameHash.GetHashCode Method
Rhino WIP for Windows
 Gets an hash code for this name hash. Two equal content hashes have equal hash code. The other way around might not be true.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
An hash code value.
See Also
Reference
NameHash Class
Rhino.FileIO Namespace