RhinoCommon SDK
V6RadialDimensionObject.DuplicateDimRadialGeometry Method
Rhino WIP for Windows
 Constructs a deep (full) copy of the LinearDimension geometry.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6RadialDimension DuplicateDimRadialGeometry()
Public Function DuplicateDimRadialGeometry As V6RadialDimension
Return Value
Type: V6RadialDimension
 A copy of the internal V6LinearDimension geometry.
See Also
Reference
V6RadialDimensionObject Class
Rhino.DocObjects Namespace