RhinoCommon SDK
BinaryArchiveReader.ReadGeometry Method
Rhino WIP for Windows
 Reads a GeometryBase-derived object from the archive.
The GeometryBase class is abstract.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GeometryBase ReadGeometry()
Public Function ReadGeometry As GeometryBase
Return Value
Type: GeometryBase
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace