RhinoCommon SDK
DisplayPipeline.DrawText Method (AnnotationText, Color)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.AnnotationText,System.Drawing.Color)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void DrawText(
	AnnotationText text,
	Color color
)
Public Sub DrawText (
	text As AnnotationText,
	color As Color
)
Parameters
text
Type: Rhino.Geometry.AnnotationText
[Missing <param name="text"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.AnnotationText,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.AnnotationText,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
DrawText Overload
Rhino.Display Namespace