RhinoCommon SDK
Extrusion Constructor
Rhino WIP for Windows
 Initializes a new instance of the Extrusion class.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Extrusion()
Public Sub New
See Also
Reference
Extrusion Class
Extrusion Overload
Rhino.Geometry Namespace