RhinoCommon SDK
RenderContentCollection Constructor
Initializes a new instance of the RenderContentCollection class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderContentCollection()
Public Sub New
See Also
Reference
RenderContentCollection Class
RenderContentCollection Overload
Rhino.Render Namespace