RhinoCommon SDK
ObjectAttributes.Transform Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.Transform(Rhino.Geometry.Transform)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
[Missing <param name="xform"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.Transform(Rhino.Geometry.Transform)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.Transform(Rhino.Geometry.Transform)"]
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace