RhinoCommon SDK
UserData.OnDuplicate Method
Rhino WIP for Windows
 Is called when the object is being duplicated.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void OnDuplicate(
	UserData source
)
Protected Overridable Sub OnDuplicate (
	source As UserData
)
Parameters
source
Type: Rhino.DocObjects.Custom.UserData
The source data.
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace