RhinoCommon SDK
PreviewJobSignature Constructor
Rhino WIP for Windows
Initializes a new instance of the PreviewJobSignature class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PreviewJobSignature()
Public Sub New
See Also
Reference
PreviewJobSignature Class
PreviewJobSignature Overload
Rhino.Render Namespace