RhinoCommon SDK
ManifestTable.GetEnumerator Method
Rhino WIP for Windows
 Visits all model components in the document, including default ones.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual IEnumerator<ModelComponent> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of ModelComponent)
Return Value
Type: IEnumerator<ModelComponent>
An enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ManifestTable Class
GetEnumerator Overload
Rhino.FileIO Namespace