RhinoCommon SDK
V6LinearDimension.Create Method
 Initialize Dimension parameters
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Create(
	V6Dimension.DimensionType dimtype,
	Guid style_id,
	Plane plane,
	Point3d defpoint1,
	Point3d defpoint2,
	Point3d dimlinepoint,
	double rotation_in_plane
)
Public Function Create (
	dimtype As V6Dimension.DimensionType,
	style_id As Guid,
	plane As Plane,
	defpoint1 As Point3d,
	defpoint2 As Point3d,
	dimlinepoint As Point3d,
	rotation_in_plane As Double
) As Boolean
Parameters
dimtype
Type: Rhino.Geometry.V6Dimension.DimensionType
[Missing <param name="dimtype"/> documentation for "M:Rhino.Geometry.V6LinearDimension.Create(Rhino.Geometry.V6Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
style_id
Type: System.Guid
[Missing <param name="style_id"/> documentation for "M:Rhino.Geometry.V6LinearDimension.Create(Rhino.Geometry.V6Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.V6LinearDimension.Create(Rhino.Geometry.V6Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
defpoint1
Type: Rhino.Geometry.Point3d
[Missing <param name="defpoint1"/> documentation for "M:Rhino.Geometry.V6LinearDimension.Create(Rhino.Geometry.V6Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
defpoint2
Type: Rhino.Geometry.Point3d
[Missing <param name="defpoint2"/> documentation for "M:Rhino.Geometry.V6LinearDimension.Create(Rhino.Geometry.V6Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
dimlinepoint
Type: Rhino.Geometry.Point3d
[Missing <param name="dimlinepoint"/> documentation for "M:Rhino.Geometry.V6LinearDimension.Create(Rhino.Geometry.V6Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
rotation_in_plane
Type: System.Double
[Missing <param name="rotation_in_plane"/> documentation for "M:Rhino.Geometry.V6LinearDimension.Create(Rhino.Geometry.V6Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.V6LinearDimension.Create(Rhino.Geometry.V6Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
See Also
Reference
V6LinearDimension Class
Rhino.Geometry Namespace