RhinoCommon SDK
LightTable.FindNameHash Method
 Finds a Layer given its name hash.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Layer FindNameHash(
	NameHash nameHash
)
Public Function FindNameHash (
	nameHash As NameHash
) As Layer
Parameters
nameHash
Type: Rhino.FileIO.NameHash
The name hash of the Layer to be searched.
Return Value
Type: Layer
An Layer, or null on error.
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace