RhinoCommon SDK
ParticleSystem.Update Method
Rhino WIP for Windows
 Calls Update on every particle in the system.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void Update()
Public Overridable Sub Update
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace