RhinoCommon SDK
Unroller Constructor (Surface)
Rhino WIP for Windows
 Initializes a new instance of the Unroller class with surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Unroller(
	Surface surface
)
Public Sub New (
	surface As Surface
)
Parameters
surface
Type: Rhino.Geometry.Surface
A surface to be unrolled.
See Also
Reference
Unroller Class
Unroller Overload
Rhino.Geometry Namespace