RhinoCommon SDK
SimulatedEnvironment.Dispose Method
Releases all resources used by the SimulatedEnvironment
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
SimulatedEnvironment Class
Dispose Overload
Rhino.Render Namespace