RhinoCommon SDK
CurveBlend.SetTargetCurve Method
Rhino WIP for Windows
 Set the target curve for one end of a blend
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetTargetCurve(
	int end,
	Curve curve
)
Public Sub SetTargetCurve (
	end As Integer,
	curve As Curve
)
Parameters
end
Type: System.Int32
Which end
curve
Type: Rhino.Geometry.Curve
The target curve
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace