RhinoCommon SDK
MenuTaskOriginFactory.Origin Method
 Returns the menu task origin
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MenuTaskOrigin Origin()
Public Function Origin As MenuTaskOrigin
Return Value
Type: MenuTaskOrigin
[Missing <returns> documentation for "M:Rhino.Render.MenuTaskOriginFactory.Origin"]
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace