RhinoCommon SDK
FieldDictionary.Set Method (String, Transform)
Rhino WIP for Windows
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Set(
	string key,
	Transform value
)
Public Sub Set (
	key As String,
	value As Transform
)
Parameters
key
Type: System.String
Key name for the field value to change.
value
Type: Rhino.Geometry.Transform
New value for this field.
See Also
Reference
FieldDictionary Class
Set Overload
Rhino.Render.Fields Namespace