RhinoCommon SDK
V6AngularDimension.GetDisplayLines Method
[Missing <summary> documentation for "M:Rhino.Geometry.V6AngularDimension.GetDisplayLines(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Line[]@,Rhino.Geometry.Arc[]@)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool GetDisplayLines(
	DimensionStyle style,
	double scale,
	out Line[] lines,
	out Arc[] arcs
)
Public Function GetDisplayLines (
	style As DimensionStyle,
	scale As Double,
	<OutAttribute> ByRef lines As Line(),
	<OutAttribute> ByRef arcs As Arc()
) As Boolean
Parameters
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.V6AngularDimension.GetDisplayLines(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Line[]@,Rhino.Geometry.Arc[]@)"]
scale
Type: System.Double
[Missing <param name="scale"/> documentation for "M:Rhino.Geometry.V6AngularDimension.GetDisplayLines(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Line[]@,Rhino.Geometry.Arc[]@)"]
lines
Type: Rhino.Geometry.Line[]
[Missing <param name="lines"/> documentation for "M:Rhino.Geometry.V6AngularDimension.GetDisplayLines(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Line[]@,Rhino.Geometry.Arc[]@)"]
arcs
Type: Rhino.Geometry.Arc[]
[Missing <param name="arcs"/> documentation for "M:Rhino.Geometry.V6AngularDimension.GetDisplayLines(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Line[]@,Rhino.Geometry.Arc[]@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.V6AngularDimension.GetDisplayLines(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Line[]@,Rhino.Geometry.Arc[]@)"]
See Also
Reference
V6AngularDimension Class
Rhino.Geometry Namespace