RhinoCommon SDK
MenuTask.IconIn Method
 Returns the associated in icon for the menutask item. Out icon is the icon displayed if the menu task is not selected and the in icon is represents that the menutask is selected. If the menutask does not contain two states then the IconIn will return the same icon as IconOut
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Bitmap IconIn(
	string kind,
	int size
)
Public Function IconIn (
	kind As String,
	size As Integer
) As Bitmap
Parameters
kind
Type: System.String
kind as a string. E.g environment, material, texture ...
size
Type: System.Int32
The size of the icon.
Return Value
Type: Bitmap
Returns a bitmap representing the icon
See Also
Reference
MenuTask Class
Rhino.Render Namespace