RhinoCommon SDK
IRhRdkContentThumbnailList.SaveMetaDataToDocument Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnailList.SaveMetaDataToDocument"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void SaveMetaDataToDocument()
Sub SaveMetaDataToDocument
See Also
Reference
IRhRdkContentThumbnailList Interface
Rhino.UI.Controls Namespace