RhinoCommon SDK
LengthValue.Dispose Method
actively reclaim native allocated ON_LenghtValue*
Namespace: Rhino
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
LengthValue Class
Rhino Namespace