RhinoCommon SDK
RealtimeDisplayMode.GetRealtimeViewport Method (IntPtr)
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RealtimeDisplayMode GetRealtimeViewport(
	IntPtr realtimeViewport
)
Public Shared Function GetRealtimeViewport (
	realtimeViewport As IntPtr
) As RealtimeDisplayMode
Parameters
realtimeViewport
Type: System.IntPtr
[Missing <param name="realtimeViewport"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr)"]
Return Value
Type: RealtimeDisplayMode
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr)"]
See Also
Reference
RealtimeDisplayMode Class
GetRealtimeViewport Overload
Rhino.Render Namespace