RhinoCommon SDK
Mesh.Split Method (Mesh)
Rhino WIP for Windows
 Split a mesh with another mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Mesh[] Split(
	Mesh mesh
)
Public Function Split (
	mesh As Mesh
) As Mesh()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to split with.
Return Value
Type: Mesh[]
An array of mesh segments representing the split result.
See Also
Reference
Mesh Class
Split Overload
Rhino.Geometry Namespace