RhinoCommon SDK
ClippingPlaneSurface.ViewportIds Method
Rhino WIP for Windows
 Returns Ids of viewports that this clipping plane is supposed to clip.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid[] ViewportIds()
Public Function ViewportIds As Guid()
Return Value
Type: Guid[]
An array of globally unique ideantifiers (Guids) to the viewports.
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace