RhinoCommon SDK
Interval.Swap Method
Rhino WIP for Windows
 Exchanges T0 and T1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Swap()
Public Sub Swap
See Also
Reference
Interval Structure
Rhino.Geometry Namespace