RhinoCommon SDK
HatchPattern Constructor
Rhino WIP for Windows
Initializes a new instance of the HatchPattern class
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public HatchPattern()
Public Sub New
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace