RhinoCommon SDK
MenuTaskOriginFactory Constructor
 MenuTaskOriginFactory constructor
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MenuTaskOriginFactory()
Public Sub New
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace