RhinoCommon SDK
V6RadialDimension.Create Method
 Initialize Dimension parameters
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Create(
	Guid style_id,
	V6Dimension.DimensionType dimtype,
	Plane plane,
	Point3d centerpoint,
	Point3d radiuspoint,
	Point3d dimlinepoint
)
Public Function Create (
	style_id As Guid,
	dimtype As V6Dimension.DimensionType,
	plane As Plane,
	centerpoint As Point3d,
	radiuspoint As Point3d,
	dimlinepoint As Point3d
) As Boolean
Parameters
style_id
Type: System.Guid
[Missing <param name="style_id"/> documentation for "M:Rhino.Geometry.V6RadialDimension.Create(System.Guid,Rhino.Geometry.V6Dimension.DimensionType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
dimtype
Type: Rhino.Geometry.V6Dimension.DimensionType
[Missing <param name="dimtype"/> documentation for "M:Rhino.Geometry.V6RadialDimension.Create(System.Guid,Rhino.Geometry.V6Dimension.DimensionType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.V6RadialDimension.Create(System.Guid,Rhino.Geometry.V6Dimension.DimensionType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
centerpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="centerpoint"/> documentation for "M:Rhino.Geometry.V6RadialDimension.Create(System.Guid,Rhino.Geometry.V6Dimension.DimensionType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
radiuspoint
Type: Rhino.Geometry.Point3d
[Missing <param name="radiuspoint"/> documentation for "M:Rhino.Geometry.V6RadialDimension.Create(System.Guid,Rhino.Geometry.V6Dimension.DimensionType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
dimlinepoint
Type: Rhino.Geometry.Point3d
[Missing <param name="dimlinepoint"/> documentation for "M:Rhino.Geometry.V6RadialDimension.Create(System.Guid,Rhino.Geometry.V6Dimension.DimensionType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.V6RadialDimension.Create(System.Guid,Rhino.Geometry.V6Dimension.DimensionType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
See Also
Reference
V6RadialDimension Class
Rhino.Geometry Namespace