RhinoCommon SDK
CurveObject.DuplicateCurveGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.CurveObject.DuplicateCurveGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve DuplicateCurveGeometry()
Public Function DuplicateCurveGeometry As Curve
Return Value
Type: Curve
[Missing <returns> documentation for "M:Rhino.DocObjects.CurveObject.DuplicateCurveGeometry"]
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace