RhinoCommon SDK
ContentEditingContext.UuidEditor Method
Rhino WIP for Windows
 UuidEditor
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid UuidEditor()
Public Function UuidEditor As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.ContentEditingContext.UuidEditor"]
See Also
Reference
ContentEditingContext Class
Rhino.Render Namespace