RhinoCommon SDK
CurveBlend.GetTargetPoint Method
Rhino WIP for Windows
 Get the blend target point
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d GetTargetPoint(
	int end
)
Public Function GetTargetPoint (
	end As Integer
) As Point3d
Parameters
end
Type: System.Int32
Which end
Return Value
Type: Point3d
The target point
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace