RhinoCommon SDK
ContentEditingContext.TopLevelKind Method
Rhino WIP for Windows
 TopLevelKind
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string TopLevelKind()
Public Function TopLevelKind As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.ContentEditingContext.TopLevelKind"]
See Also
Reference
ContentEditingContext Class
Rhino.Render Namespace