RhinoCommon SDK
ChangeQueue.ApplyMaterialChanges Method
Rhino WIP for Windows
 Override when you want to handle material changes
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void ApplyMaterialChanges(
	List<Material> mats
)
Protected Overridable Sub ApplyMaterialChanges (
	mats As List(Of Material)
)
Parameters
mats
Type: System.Collections.Generic.List<Material>
List of ChangeQueue::Material that have changed
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace