RhinoCommon SDK
RealtimeDisplayMode.HudShowMaxPasses Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudShowMaxPasses"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool HudShowMaxPasses()
Public Overridable Function HudShowMaxPasses As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudShowMaxPasses"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace