RhinoCommon SDK
IRhRdkThumbnailList.Add Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.Add(Rhino.UI.Controls.IRhRdkThumbnail@)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void Add(
	ref IRhRdkThumbnail t
)
Sub Add (
	ByRef t As IRhRdkThumbnail
)
Parameters
t
Type: Rhino.UI.Controls.IRhRdkThumbnail
[Missing <param name="t"/> documentation for "M:Rhino.UI.Controls.IRhRdkThumbnailList.Add(Rhino.UI.Controls.IRhRdkThumbnail@)"]
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls Namespace