RhinoCommon SDK
BinaryArchiveReader.ReadIntArray Method
Rhino WIP for Windows
 Reads an array of Int32 from the archive.
An array is returned even if the input was another enumerable type.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int[] ReadIntArray()
Public Function ReadIntArray As Integer()
Return Value
Type: Int32[]
The array that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace