RhinoCommon SDK
HatchPatternTable.Delete Method (HatchPattern)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.Delete(Rhino.DocObjects.HatchPattern)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override bool Delete(
	HatchPattern item
)
Public Overrides Function Delete (
	item As HatchPattern
) As Boolean
Parameters
item
Type: Rhino.DocObjects.HatchPattern
[Missing <param name="item"/> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.Delete(Rhino.DocObjects.HatchPattern)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.HatchPatternTable.Delete(Rhino.DocObjects.HatchPattern)"]
See Also
Reference
HatchPatternTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace