RhinoCommon SDK
V6RadialDimension.AdjustFromPoints Method
 Update Dimension geometry from point locations
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool AdjustFromPoints(
	Plane plane,
	Point3d centerpoint,
	Point3d radiuspoint,
	Point3d dimlinepoint,
	double rotation_in_plane
)
Public Function AdjustFromPoints (
	plane As Plane,
	centerpoint As Point3d,
	radiuspoint As Point3d,
	dimlinepoint As Point3d,
	rotation_in_plane As Double
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.V6RadialDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
centerpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="centerpoint"/> documentation for "M:Rhino.Geometry.V6RadialDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
radiuspoint
Type: Rhino.Geometry.Point3d
[Missing <param name="radiuspoint"/> documentation for "M:Rhino.Geometry.V6RadialDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
dimlinepoint
Type: Rhino.Geometry.Point3d
[Missing <param name="dimlinepoint"/> documentation for "M:Rhino.Geometry.V6RadialDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
rotation_in_plane
Type: System.Double
[Missing <param name="rotation_in_plane"/> documentation for "M:Rhino.Geometry.V6RadialDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.V6RadialDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)"]
See Also
Reference
V6RadialDimension Class
Rhino.Geometry Namespace