RhinoCommon SDK
HiddenLineDrawingParameters Constructor
default constructor
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public HiddenLineDrawingParameters()
Public Sub New
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace