RhinoCommon SDK
Extrusion.GetWireframe Method
 Constructs all the Wireframe curves for this Extrusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve[] GetWireframe()
Public Function GetWireframe As Curve()
Return Value
Type: Curve[]
An array of Wireframe curves.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace