RhinoCommon SDK
AnnotationArrowhead Constructor (DimensionStyle.ArrowType, Guid)
Rhino WIP for Windows
 Constructotr type of this arrowhead Guid of the block used for user defined display
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public AnnotationArrowhead(
	DimensionStyle.ArrowType arrowType,
	Guid blockId
)
Public Sub New (
	arrowType As DimensionStyle.ArrowType,
	blockId As Guid
)
Parameters
arrowType
Type: Rhino.DocObjects.DimensionStyle.ArrowType
[Missing <param name="arrowType"/> documentation for "M:Rhino.Geometry.AnnotationArrowhead.#ctor(Rhino.DocObjects.DimensionStyle.ArrowType,System.Guid)"]
blockId
Type: System.Guid
[Missing <param name="blockId"/> documentation for "M:Rhino.Geometry.AnnotationArrowhead.#ctor(Rhino.DocObjects.DimensionStyle.ArrowType,System.Guid)"]
See Also
Reference
AnnotationArrowhead Class
AnnotationArrowhead Overload
Rhino.Geometry Namespace