RhinoCommon SDK
Decals.Remove Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.Decals.Remove(Rhino.Render.Decal)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Remove(
	Decal decal
)
Public Function Remove (
	decal As Decal
) As Boolean
Parameters
decal
Type: Rhino.Render.Decal
[Missing <param name="decal"/> documentation for "M:Rhino.Render.Decals.Remove(Rhino.Render.Decal)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.Decals.Remove(Rhino.Render.Decal)"]
See Also
Reference
Decals Class
Rhino.Render Namespace