RhinoCommon SDK
CustomDisplay.Clear Method
 Clear the drawing lists.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace