RhinoCommon SDK
Command.OnHelp Method
Rhino WIP for Windows
 Is called when the user needs assistance with this command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void OnHelp()
Protected Overridable Sub OnHelp
See Also
Reference
Command Class
Rhino.Commands Namespace