RhinoCommon SDK
Transform.ToString Method
Rhino WIP for Windows
 Returns a string representation of this transform.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A textual representation.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace