RhinoCommon SDK
ControlPoint Constructor (Point3d)
Rhino WIP for Windows
 Constructs a new unweighted control point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ControlPoint(
	Point3d pt
)
Public Sub New (
	pt As Point3d
)
Parameters
pt
Type: Rhino.Geometry.Point3d
Coordinate of Control Point.
See Also
Reference
ControlPoint Structure
ControlPoint Overload
Rhino.Geometry Namespace