RhinoCommon SDK
RealtimeDisplayMode.HudRendererPaused Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudRendererPaused"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool HudRendererPaused()
Public Overridable Function HudRendererPaused As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudRendererPaused"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace