RhinoCommon SDK
ContentArray.Dispose Method
Rhino WIP for Windows
Releases all resources used by the ContentArray
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ContentArray Class
Rhino.Render Namespace