RhinoCommon SDK
RenderTexture Constructor
Rhino WIP for Windows
Initializes a new instance of the RenderTexture class
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected RenderTexture()
Protected Sub New
See Also
Reference
RenderTexture Class
Rhino.Render Namespace