RhinoCommon SDK
CurveBlend.GetContinuity Method
Rhino WIP for Windows
 0: position, 1: tangency, 2: curvature, 3: g3, 4: g4
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int GetContinuity(
	int end
)
Public Function GetContinuity (
	end As Integer
) As Integer
Parameters
end
Type: System.Int32
[Missing <param name="end"/> documentation for "M:Rhino.Geometry.CurveBlend.GetContinuity(System.Int32)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Geometry.CurveBlend.GetContinuity(System.Int32)"]
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace