RhinoCommon SDK
RealtimeDisplayMode.ShutdownRenderer Method
Rhino WIP for Windows
 Override to shutdown your render engine
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual void ShutdownRenderer()
Public Overridable Sub ShutdownRenderer
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace