RhinoCommon SDK
BinaryArchiveWriter.WriteDictionary Method
Rhino WIP for Windows
 Delivers the complete content of a dictionary to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void WriteDictionary(
	ArchivableDictionary dictionary
)
Public Sub WriteDictionary (
	dictionary As ArchivableDictionary
)
Parameters
dictionary
Type: Rhino.Collections.ArchivableDictionary
A dictionary to archive.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace