RhinoCommon SDK
PreviewAppearance.Geometry Method
Rhino WIP for Windows
 Geometry
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PreviewGeometry Geometry()
Public Function Geometry As PreviewGeometry
Return Value
Type: PreviewGeometry
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.Geometry"]
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace