RhinoCommon SDK
GetLine Constructor
Initializes a new instance of the GetLine class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GetLine()
Public Sub New
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace