RhinoCommon SDK
BinaryArchiveReader.ReadColor Method
Rhino WIP for Windows
 Reads a Color from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color ReadColor()
Public Function ReadColor As Color
Return Value
Type: Color
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace