RhinoCommon SDK
BinaryArchiveReader.ReadSByte Method
Rhino WIP for Windows
 Reads a SByte from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sbyte ReadSByte()
Public Function ReadSByte As SByte
Return Value
Type: SByte
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace