RhinoCommon SDK
ObjectTable.AddV6AngularDimension Method (V6AngularDimension)
 Adds a angular dimension object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddV6AngularDimension(
	V6AngularDimension dimangular
)
Public Function AddV6AngularDimension (
	dimangular As V6AngularDimension
) As Guid
Parameters
dimangular
Type: Rhino.Geometry.V6AngularDimension
 Dimension object to add.
Return Value
Type: Guid
 The Id of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddV6AngularDimension Overload
Rhino.DocObjects.Tables Namespace