RhinoCommon SDK
BinaryArchiveReader.ReadPlane Method
Rhino WIP for Windows
 Reads a Plane from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Plane ReadPlane()
Public Function ReadPlane As Plane
Return Value
Type: Plane
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace