RhinoCommon SDK
V6Centermark Constructor
Rhino WIP for Windows
Initializes a new instance of the V6Centermark class
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6Centermark()
Public Sub New
See Also
Reference
V6Centermark Class
V6Centermark Overload
Rhino.Geometry Namespace