RhinoCommon SDK
BinaryArchiveFile.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace