RhinoCommon SDK
V6AngularDimensionObject.DuplicateDimAngularGeometry Method
 Constructs a deep (full) copy of the AngularDimension geometry.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6AngularDimension DuplicateDimAngularGeometry()
Public Function DuplicateDimAngularGeometry As V6AngularDimension
Return Value
Type: V6AngularDimension
 A copy of the internal V6LinearDimension geometry.
See Also
Reference
V6AngularDimensionObject Class
Rhino.DocObjects Namespace