RhinoCommon SDK
CustomPointObject Constructor
Rhino WIP for Windows
Initializes a new instance of the CustomPointObject class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected CustomPointObject()
Protected Sub New
See Also
Reference
CustomPointObject Class
CustomPointObject Overload
Rhino.DocObjects.Custom Namespace