RhinoCommon SDK
RdkViewModel.NewUndoRecord.Dispose Method
Releases all resources used by the RdkViewModel.NewUndoRecord
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RdkViewModel.NewUndoRecord Class
Dispose Overload
Rhino.UI.Controls Namespace