RhinoCommon SDK
InstanceDefinitionGeometry.GetObjectIds Method
Rhino WIP for Windows
 list of object ids in the instance geometry table
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid[] GetObjectIds()
Public Function GetObjectIds As Guid()
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.Geometry.InstanceDefinitionGeometry.GetObjectIds"]
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace