RhinoCommon SDK
BreadCrumbImpl Constructor
Rhino WIP for Windows
Initializes a new instance of the BreadCrumbImpl class
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BreadCrumbImpl(
	IBreadCrumb client
)
Public Sub New (
	client As IBreadCrumb
)
Parameters
client
Type: Rhino.UI.Controls.IBreadCrumb
[Missing <param name="client"/> documentation for "M:Rhino.UI.Controls.BreadCrumbImpl.#ctor(Rhino.UI.Controls.IBreadCrumb)"]
See Also
Reference
BreadCrumbImpl Class
Rhino.UI.Controls Namespace