RhinoCommon SDK
Dialogs.ShowAboutDialog Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.UI.Dialogs.ShowAboutDialog(System.Boolean)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void ShowAboutDialog(
	bool forceSimpleDialog
)
Public Shared Sub ShowAboutDialog (
	forceSimpleDialog As Boolean
)
Parameters
forceSimpleDialog
Type: System.Boolean
[Missing <param name="forceSimpleDialog"/> documentation for "M:Rhino.UI.Dialogs.ShowAboutDialog(System.Boolean)"]
See Also
Reference
Dialogs Class
Rhino.UI Namespace