RhinoCommon SDK
MenuTaskCollection.Dispose Method
Rhino WIP for Windows
 MenuTaskCollection dispose
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
MenuTaskCollection Class
Rhino.Render Namespace