RhinoCommon SDK
MenuTask.Finalize Method
 MenuTask destructor
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
MenuTask Class
Rhino.Render Namespace