RhinoCommon SDK
RenderContentCollection.Dispose Method
Releases all resources used by the RenderContentCollection
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace