RhinoCommon SDK
PointCloud.RemoveAt Method
Rhino WIP for Windows
 Remove the point at the given index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void RemoveAt(
	int index
)
Public Sub RemoveAt (
	index As Integer
)
Parameters
index
Type: System.Int32
Index of point to remove.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace