RhinoCommon SDK
ContentCollection.Iterator Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.ContentCollection.Iterator(System.UInt32)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ContentCollectionIterator Iterator(
	uint flags
)
Public Function Iterator (
	flags As UInteger
) As ContentCollectionIterator
Parameters
flags
Type: System.UInt32
[Missing <param name="flags"/> documentation for "M:Rhino.Render.ContentCollection.Iterator(System.UInt32)"]
Return Value
Type: ContentCollectionIterator
[Missing <returns> documentation for "M:Rhino.Render.ContentCollection.Iterator(System.UInt32)"]
See Also
Reference
ContentCollection Class
Rhino.Render Namespace