RhinoCommon SDK
MenuTask.MenuString Method
 Returns the title of the menutask
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string MenuString(
	MenuTaskOrigin origin,
	string kind
)
Public Function MenuString (
	origin As MenuTaskOrigin,
	kind As String
) As String
Parameters
origin
Type: Rhino.Render.MenuTaskOrigin
The menutask origin.
kind
Type: System.String
kind as a string. E.g environment, material, texture ...
Return Value
Type: String
Returns the menutask title string
See Also
Reference
MenuTask Class
Rhino.Render Namespace