RhinoCommon SDK
File3dmObject.GetHashCode Method
Rhino WIP for Windows
 Provides an hash code for this item.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
The hash code.
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace