RhinoCommon SDK
MaterialRef.Finalize Method
[Missing <summary> documentation for "M:Rhino.DocObjects.MaterialRef.Finalize"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace