RhinoCommon SDK
Quaternion.DistanceTo Method
Rhino WIP for Windows
 Computes the distance or norm of the difference between this and another quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double DistanceTo(
	Quaternion q
)
Public Function DistanceTo (
	q As Quaternion
) As Double
Parameters
q
Type: Rhino.Geometry.Quaternion
Another quaternion.
Return Value
Type: Double
(this - q).Length.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace