RhinoCommon SDK
File3dmObjectTable.Delete Method (File3dmObject)
 Deletes object from document.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override bool Delete(
	File3dmObject obj
)
Public Overrides Function Delete (
	obj As File3dmObject
) As Boolean
Parameters
obj
Type: Rhino.FileIO.File3dmObject
The object to delete.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
File3dmObjectTable Class
Delete Overload
Rhino.FileIO Namespace