RhinoCommon SDK
RenderTexture.GetMappingChannel Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetMappingChannel"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual int GetMappingChannel()
Public Overridable Function GetMappingChannel As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetMappingChannel"]
See Also
Reference
RenderTexture Class
Rhino.Render Namespace