RhinoCommon SDK
MenuTask.Query Method
[Missing <summary> documentation for "M:Rhino.Render.MenuTask.Query(Rhino.Render.MenuTaskOrigin,System.Boolean)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Query(
	MenuTaskOrigin origin,
	bool bOnItem
)
Public Function Query (
	origin As MenuTaskOrigin,
	bOnItem As Boolean
) As Boolean
Parameters
origin
Type: Rhino.Render.MenuTaskOrigin
[Missing <param name="origin"/> documentation for "M:Rhino.Render.MenuTask.Query(Rhino.Render.MenuTaskOrigin,System.Boolean)"]
bOnItem
Type: System.Boolean
[Missing <param name="bOnItem"/> documentation for "M:Rhino.Render.MenuTask.Query(Rhino.Render.MenuTaskOrigin,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.MenuTask.Query(Rhino.Render.MenuTaskOrigin,System.Boolean)"]
See Also
Reference
MenuTask Class
Rhino.Render Namespace