RhinoCommon SDK
DimensionStyle.SetFieldOverride Method
Rhino WIP for Windows
 Set a field as overridden
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetFieldOverride(
	DimensionStyle.Field field
)
Public Sub SetFieldOverride (
	field As DimensionStyle.Field
)
Parameters
field
Type: Rhino.DocObjects.DimensionStyle.Field
[Missing <param name="field"/> documentation for "M:Rhino.DocObjects.DimensionStyle.SetFieldOverride(Rhino.DocObjects.DimensionStyle.Field)"]
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace