RhinoCommon SDK
ZBufferCapture.ShowText Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowText(System.Boolean)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void ShowText(
	bool on
)
Public Sub ShowText (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowText(System.Boolean)"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace