RhinoCommon SDK
V6CentermarkObject.DuplicateDimOrdinateGeometry Method
 Constructs a deep (full) copy of the Centermark geometry.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6Centermark DuplicateDimOrdinateGeometry()
Public Function DuplicateDimOrdinateGeometry As V6Centermark
Return Value
Type: V6Centermark
 A copy of the internal V6LinearDimension geometry.
See Also
Reference
V6CentermarkObject Class
Rhino.DocObjects Namespace