RhinoCommon SDK
RealtimeDisplayMode.HudStartTime Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudStartTime"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual DateTime HudStartTime()
Public Overridable Function HudStartTime As DateTime
Return Value
Type: DateTime
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudStartTime"]
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace