RhinoCommon SDK
RenderTexture.NewBitmapTexture Method
Rhino WIP for Windows
 Constructs a new basic texture from a SimulatedTexture.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RenderTexture NewBitmapTexture(
	SimulatedTexture texture
)
Public Shared Function NewBitmapTexture (
	texture As SimulatedTexture
) As RenderTexture
Parameters
texture
Type: Rhino.Render.SimulatedTexture
The texture to create the basic texture from.
Return Value
Type: RenderTexture
A new render texture.
See Also
Reference
RenderTexture Class
Rhino.Render Namespace