RhinoCommon SDK
Layer.UnsetPersistentVisibility Method
 Remove any explicit persistent visibility setting from this layer
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void UnsetPersistentVisibility()
Public Sub UnsetPersistentVisibility
See Also
Reference
Layer Class
Rhino.DocObjects Namespace