RhinoCommon SDK
DimStyleTable.Find Method (Guid, Boolean)
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.Guid,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle Find(
	Guid styleId,
	bool ignoreDeletedAnnotationStyles
)
Public Function Find (
	styleId As Guid,
	ignoreDeletedAnnotationStyles As Boolean
) As DimensionStyle
Parameters
styleId
Type: System.Guid
[Missing <param name="styleId"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.Guid,System.Boolean)"]
ignoreDeletedAnnotationStyles
Type: System.Boolean
[Missing <param name="ignoreDeletedAnnotationStyles"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.Guid,System.Boolean)"]
Return Value
Type: DimensionStyle
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.Guid,System.Boolean)"]
See Also
Reference
DimStyleTable Class
Find Overload
Rhino.DocObjects.Tables Namespace