RhinoCommon SDK
GetPolyline Constructor
Rhino WIP for Windows
Initializes a new instance of the GetPolyline class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GetPolyline()
Public Sub New
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace