RhinoCommon SDK
MenuTask.IconOut Method
Rhino WIP for Windows
 Returns the associated out icon for the menutask item. Out icon is the icon displayed if the menu task is not selected.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Bitmap IconOut(
	string kind,
	int size
)
Public Function IconOut (
	kind As String,
	size As Integer
) As Bitmap
Parameters
kind
Type: System.String
kind as a string. E.g environment, material, texture ...
size
Type: System.Int32
The size of the icon.
Return Value
Type: Bitmap
Returns a bitmap representing the icon
See Also
Reference
MenuTask Class
Rhino.Render Namespace