RhinoCommon SDK
ChangeQueue Constructor (Guid, UInt32, ViewInfo)
 Construct a new ChangeQueue from the given document
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected ChangeQueue(
	Guid pluginId,
	uint docRuntimeSerialNumber,
	ViewInfo viewinfo
)
Protected Sub New (
	pluginId As Guid,
	docRuntimeSerialNumber As UInteger,
	viewinfo As ViewInfo
)
Parameters
pluginId
Type: System.Guid
Id of plugin instantiating ChangeQueue
docRuntimeSerialNumber
Type: System.UInt32
[Missing <param name="docRuntimeSerialNumber"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,System.UInt32,Rhino.DocObjects.ViewInfo)"]
viewinfo
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="viewinfo"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,System.UInt32,Rhino.DocObjects.ViewInfo)"]
See Also
Reference
ChangeQueue Class
ChangeQueue Overload
Rhino.Render.ChangeQueue Namespace