RhinoCommon SDK
CurveBlend.GetTargetTrim Method
Rhino WIP for Windows
 Get the blend target trim
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve GetTargetTrim(
	int end
)
Public Function GetTargetTrim (
	end As Integer
) As Curve
Parameters
end
Type: System.Int32
Which end
Return Value
Type: Curve
The target trim
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace