RhinoCommon SDK
IRhRdkContentThumbnailList.SelectedAppearance Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnailList.SelectedAppearance"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
PreviewAppearance SelectedAppearance()
Function SelectedAppearance As PreviewAppearance
Return Value
Type: PreviewAppearance
[Missing <returns> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnailList.SelectedAppearance"]
See Also
Reference
IRhRdkContentThumbnailList Interface
Rhino.UI.Controls Namespace