RhinoCommon SDK
LayerTable.FindByFullPath Method (String, Boolean)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("ignoreDeletedLayers is no longer supported for research by name. Use the overload with notFoundReturnValue (-1 was the previous default).")]
public int FindByFullPath(
	string layerPath,
	bool ignoreDeletedLayers
)
<ObsoleteAttribute("ignoreDeletedLayers is no longer supported for research by name. Use the overload with notFoundReturnValue (-1 was the previous default).")>
Public Function FindByFullPath (
	layerPath As String,
	ignoreDeletedLayers As Boolean
) As Integer
Parameters
layerPath
Type: System.String
[Missing <param name="layerPath"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)"]
ignoreDeletedLayers
Type: System.Boolean
[Missing <param name="ignoreDeletedLayers"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)"]
See Also
Reference
LayerTable Class
FindByFullPath Overload
Rhino.DocObjects.Tables Namespace