RhinoCommon SDK
Mesh.CreateFromPlanarBoundary Method (Curve, MeshingParameters)
Note: This API is now obsolete.
 Attempts to construct a mesh from a closed planar curve.RhinoMakePlanarMeshes
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Use version that takes a tolerance parameter instead")]
public static Mesh CreateFromPlanarBoundary(
	Curve boundary,
	MeshingParameters parameters
)
<ObsoleteAttribute("Use version that takes a tolerance parameter instead")>
Public Shared Function CreateFromPlanarBoundary (
	boundary As Curve,
	parameters As MeshingParameters
) As Mesh
Parameters
boundary
Type: Rhino.Geometry.Curve
must be a closed planar curve.
parameters
Type: Rhino.Geometry.MeshingParameters
parameters used for creating the mesh.
Return Value
Type: Mesh
 New mesh on success or null on failure.
See Also
Reference
Mesh Class
CreateFromPlanarBoundary Overload
Rhino.Geometry Namespace