RhinoCommon SDK
AsyncRenderContext.StopRendering Method
[Missing <summary> documentation for "M:Rhino.Render.AsyncRenderContext.StopRendering"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract void StopRendering()
Public MustOverride Sub StopRendering
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace