RhinoCommon SDK
RdkContentLookup.LookUpContent Method
[Missing <summary> documentation for "M:Rhino.Render.RdkContentLookup.LookUpContent(System.Guid)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderContent LookUpContent(
	Guid uuidInstance
)
Public Function LookUpContent (
	uuidInstance As Guid
) As RenderContent
Parameters
uuidInstance
Type: System.Guid
[Missing <param name="uuidInstance"/> documentation for "M:Rhino.Render.RdkContentLookup.LookUpContent(System.Guid)"]
Return Value
Type: RenderContent
[Missing <returns> documentation for "M:Rhino.Render.RdkContentLookup.LookUpContent(System.Guid)"]
See Also
Reference
RdkContentLookup Class
Rhino.Render Namespace