RhinoCommon SDK
Curve.Duplicate Method
Rhino WIP for Windows
 Constructs an exact duplicate of this Curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override GeometryBase Duplicate()
Public Overrides Function Duplicate As GeometryBase
Return Value
Type: GeometryBase
[Missing <returns> documentation for "M:Rhino.Geometry.Curve.Duplicate"]
See Also
Reference
Curve Class
Rhino.Geometry Namespace
Curve.DuplicateCurve()