RhinoCommon SDK
Surface.IsCone Method
Rhino WIP for Windows
 Determines if the surface is a portion of a cone within RhinoMath.ZeroTolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsCone()
Public Function IsCone As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a cone.
See Also
Reference
Surface Class
IsCone Overload
Rhino.Geometry Namespace