RhinoCommon SDK
LightManagerSupport Constructor
 Default constructor
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected LightManagerSupport()
Protected Sub New
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace