RhinoCommon SDK
ZBufferCapture.HitCount Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.HitCount"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int HitCount()
Public Function HitCount As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.HitCount"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace