RhinoCommon SDK
V6Centermark.Create Method
Rhino WIP for Windows
 Initialize Dimension parameters
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Create(
	Guid style_id,
	Plane plane,
	Point3d centerpoint,
	double radius
)
Public Function Create (
	style_id As Guid,
	plane As Plane,
	centerpoint As Point3d,
	radius As Double
) As Boolean
Parameters
style_id
Type: System.Guid
[Missing <param name="style_id"/> documentation for "M:Rhino.Geometry.V6Centermark.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.V6Centermark.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
centerpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="centerpoint"/> documentation for "M:Rhino.Geometry.V6Centermark.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
radius
Type: System.Double
[Missing <param name="radius"/> documentation for "M:Rhino.Geometry.V6Centermark.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.V6Centermark.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
See Also
Reference
V6Centermark Class
Rhino.Geometry Namespace