RhinoCommon SDK
MenuTaskOriginFactory.SetController Method
 Set the Controller
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetController(
	IntPtr pControl
)
Public Sub SetController (
	pControl As IntPtr
)
Parameters
pControl
Type: System.IntPtr
The controller
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace