RhinoCommon SDK
IRhRdkContentThumbnailList.SetSettingsPath Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnailList.SetSettingsPath(System.String)"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
void SetSettingsPath(
	string w
)
Sub SetSettingsPath (
	w As String
)
Parameters
w
Type: System.String
[Missing <param name="w"/> documentation for "M:Rhino.UI.Controls.IRhRdkContentThumbnailList.SetSettingsPath(System.String)"]
See Also
Reference
IRhRdkContentThumbnailList Interface
Rhino.UI.Controls Namespace