RhinoCommon SDK
BreadCrumbImpl.Dispose Method
Rhino WIP for Windows
Releases all resources used by the BreadCrumbImpl
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
BreadCrumbImpl Class
Rhino.UI.Controls Namespace