RhinoCommon SDK
ClassIdAttribute Constructor
Initializes a class id attrbute.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ClassIdAttribute(
	string id
)
Public Sub New (
	id As String
)
Parameters
id
Type: System.String
String in the form of a Guid.
See Also
Reference
ClassIdAttribute Class
Rhino.DocObjects.Custom Namespace