RhinoCommon SDK
SimulatedEnvironment Constructor
Initializes a new instance of the SimulatedEnvironment class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SimulatedEnvironment()
Public Sub New
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace