RhinoCommon SDK
MenuTaskOrigin Constructor
 MenuTaskOrigin constructor
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MenuTaskOrigin(
	IntPtr pTaskOrigin
)
Public Sub New (
	pTaskOrigin As IntPtr
)
Parameters
pTaskOrigin
Type: System.IntPtr
[Missing <param name="pTaskOrigin"/> documentation for "M:Rhino.Render.MenuTaskOrigin.#ctor(System.IntPtr)"]
See Also
Reference
MenuTaskOrigin Class
Rhino.Render Namespace