RhinoCommon SDK
Field.CreateCppPointer Method
Rhino WIP for Windows
 Create the RDK C++ field object and set its initial value, fields are added to a RenderContent.FieldDictionary in the RenderContent constructor before the RenderContent C++ pointer is created, the RenderContent C++ pointer is required when creating a field in order for the field to get added to the RenderContent C++ Field list so this method is called by RenderContent when it is safe to create the Field C++ pointers.
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected void CreateCppPointer(
	RenderContent content,
	IntPtr attachToPointer
)
Protected Sub CreateCppPointer (
	content As RenderContent,
	attachToPointer As IntPtr
)
Parameters
content
Type: Rhino.Render.RenderContent
RenderContent.FiledDictionary that owns this Field.
attachToPointer
Type: System.IntPtr
Existing C++ pointer to attach to.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace