RhinoCommon SDK
SweepTwoRail Constructor
Rhino WIP for Windows
Initializes a new instance of the SweepTwoRail class
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SweepTwoRail()
Public Sub New
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace