RhinoCommon SDK
SHA1OpenNURBS.Finalize Method
 Instructs the runtime to reclaim unmanaged resources if the developer forgot to call Dispose().
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
SHA1OpenNURBS Class
Rhino.FileIO Namespace