RhinoCommon SDK
DisplayModeDescription.Dispose Method
Rhino WIP for Windows
Releases all resources used by the DisplayModeDescription
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
DisplayModeDescription Class
Dispose Overload
Rhino.Display Namespace