RhinoCommon SDK
SupportOptions.SetPreferredUnpackFolder Method
Rhino WIP for Windows
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetPreferredUnpackFolder(System.String)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static void SetPreferredUnpackFolder(
	string path
)
Public Shared Sub SetPreferredUnpackFolder (
	path As String
)
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.Render.SupportOptions.SetPreferredUnpackFolder(System.String)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace