RhinoCommon SDK
BinaryArchiveWriter.WriteUShort Method
Rhino WIP for Windows
 Writes a UInt16 value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void WriteUShort(
	ushort value
)
Public Sub WriteUShort (
	value As UShort
)
Parameters
value
Type: System.UInt16
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace