RhinoCommon SDK
AnnotationText.SetAnnotationStyle Method
Rhino WIP for Windows
 Set this text's AnnotationStyle
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetAnnotationStyle(
	DimensionStyle style,
	RhinoDoc doc
)
Public Sub SetAnnotationStyle (
	style As DimensionStyle,
	doc As RhinoDoc
)
Parameters
style
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="style"/> documentation for "M:Rhino.Geometry.AnnotationText.SetAnnotationStyle(Rhino.DocObjects.DimensionStyle,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Geometry.AnnotationText.SetAnnotationStyle(Rhino.DocObjects.DimensionStyle,Rhino.RhinoDoc)"]
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace