RhinoCommon SDK
SaveFileDialog.ShowDialog Method
Rhino WIP for Windows
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.UI.SaveFileDialog.ShowDialog"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Use ShowSaveDialog")]
public DialogResult ShowDialog()
<ObsoleteAttribute("Use ShowSaveDialog")>
Public Function ShowDialog As DialogResult
Return Value
Type: DialogResult
[Missing <returns> documentation for "M:Rhino.UI.SaveFileDialog.ShowDialog"]
See Also
Reference
SaveFileDialog Class
Rhino.UI Namespace