RhinoCommon SDK
CollapsibleSectionHolderImpl.Dispose Method
Rhino WIP for Windows
Releases all resources used by the CollapsibleSectionHolderImpl
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
CollapsibleSectionHolderImpl Class
Rhino.UI.Controls Namespace