RhinoCommon SDK
PolylineCurve Constructor
Rhino WIP for Windows
 Initializes a new empty polyline curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PolylineCurve()
Public Sub New
See Also
Reference
PolylineCurve Class
PolylineCurve Overload
Rhino.Geometry Namespace