RhinoCommon SDK
MenuTaskCollection.Build Method
 Constructs the menu task collection. In other words fills the collection with menu task items
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Build(
	MenuTaskOrigin tos,
	bool bOnItem
)
Public Function Build (
	tos As MenuTaskOrigin,
	bOnItem As Boolean
) As Boolean
Parameters
tos
Type: Rhino.Render.MenuTaskOrigin
The menutask origin.
bOnItem
Type: System.Boolean
true if the UI click event was on the item (click on selected item) or false if no item selected
Return Value
Type: Boolean
Return true if menu task collection build was successfull, otherwise false
See Also
Reference
MenuTaskCollection Class
Rhino.Render Namespace