RhinoCommon SDK
TimeZone.TimeZones Method
Rhino WIP for Windows
 Returns number of available time zones.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static int TimeZones()
Public Shared Function TimeZones As Integer
Return Value
Type: Int32
Time zone count.
See Also
Reference
TimeZone Class
Rhino.Render Namespace