RhinoCommon SDK
MenuTaskOriginFactory Methods
The MenuTaskOriginFactory type exposes the following members.
Methods
Name | Description
Dispose
 MenuTaskOriginFactory dispose
Finalize
 MenuTaskOriginFactory destructor
 (Overrides Object.Finalize().)
NewButtonTaskOrigin
 Returns the menu task origin for new button
Origin
 Returns the menu task origin
SetController
 Set the Controller
SetInstaceIdArray
 Set the InstanceIdArray: Array of selected items Guids
Top
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace