RhinoCommon SDK
BitmapEntry Methods
Rhino WIP for Windows
The BitmapEntry type exposes the following members.
Methods
Name | Description
Save
Top
See Also
Reference
BitmapEntry Class
Rhino.DocObjects Namespace