RhinoCommon SDK
V6CentermarkObject Methods
The V6CentermarkObject type exposes the following members.
Methods
Name | Description
DuplicateDimOrdinateGeometry
 Constructs a deep (full) copy of the Centermark geometry.
Top
See Also
Reference
V6CentermarkObject Class
Rhino.DocObjects Namespace