RhinoCommon SDK
File3dmHatchPatternTable Methods
The File3dmHatchPatternTable type exposes the following members.
Methods
Name | Description
FindName
 Finds a HatchPattern given its name.
FindNameHash
 Finds a HatchPattern given its name hash.
Top
See Also
Reference
File3dmHatchPatternTable Class
Rhino.FileIO Namespace