RhinoCommon SDK
ILocalizationService Methods
Rhino WIP for Windows
The ILocalizationService type exposes the following members.
Methods
Name | Description
LocalizeCommandName
LocalizeDialogItem
LocalizeForm
LocalizeString
Top
See Also
Reference
ILocalizationService Interface
Rhino.UI Namespace