RhinoCommon SDK
ExtrusionObject Methods
Rhino WIP for Windows
The ExtrusionObject type exposes the following members.
Methods
Name | Description
DuplicateExtrusionGeometry
Top
See Also
Reference
ExtrusionObject Class
Rhino.DocObjects Namespace