RhinoCommon SDK
Point3dField Methods
Rhino WIP for Windows
The Point3dField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
Point3dField Class
Rhino.Render.Fields Namespace