RhinoCommon SDK
ContentEditingContext Methods
Rhino WIP for Windows
The ContentEditingContext type exposes the following members.
Methods
Name | Description
Dispose
 Dispose for ContentEditingContext
Finalize
 Destructor for ContentEditingContext
 (Overrides Object.Finalize().)
SetSelection
 Set Selection
TopLevelKind
 TopLevelKind
UuidEditor
 UuidEditor
Top
See Also
Reference
ContentEditingContext Class
Rhino.Render Namespace