RhinoCommon SDK
MenuTaskCollection Methods
The MenuTaskCollection type exposes the following members.
Methods
Name | Description
Build
 Constructs the menu task collection. In other words fills the collection with menu task items
Count
 The number of menutasks in collection
Dispose
 MenuTaskCollection dispose
Finalize
 MenuTaskCollection destructor
 (Overrides Object.Finalize().)
Find
 Find a specific menutask in the collection
Task
 Gets the task at specified index
Top
See Also
Reference
MenuTaskCollection Class
Rhino.Render Namespace