RhinoCommon SDK
FileObjReadOptions Methods
Rhino WIP for Windows
The FileObjReadOptions type exposes the following members.
Methods
Name | Description
GetTransform
 Calculates the YToZ transform.
Top
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace