RhinoCommon SDK
V6RadialDimension Methods
The V6RadialDimension type exposes the following members.
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
See Also
Reference
V6RadialDimension Class
Rhino.Geometry Namespace