RhinoCommon SDK
RLeader Methods
Rhino WIP for Windows
The RLeader type exposes the following members.
Methods
Name | Description
Create
 Creates a RLeader geometry object
SetTextString
 Sets the text string for this leader
Top
See Also
Reference
RLeader Class
Rhino.Geometry Namespace