RhinoCommon SDK
LightObject Methods
Rhino WIP for Windows
The LightObject type exposes the following members.
Methods
Name | Description
DuplicateLightGeometry
Top
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace