RhinoCommon SDK
V6AngularDimension Methods
Rhino WIP for Windows
The V6AngularDimension type exposes the following members.
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
See Also
Reference
V6AngularDimension Class
Rhino.Geometry Namespace