RhinoCommon SDK
IRhRdkContentThumbnailList Methods
The IRhRdkContentThumbnailList type exposes the following members.
Methods
Name | Description
ContentFromThumbId
PropagateSelectedAppearance
SaveMetaDataToDocument
SelectedAppearance
SetSearchPattern
SetSettingsPath
Top
See Also
Reference
IRhRdkContentThumbnailList Interface
Rhino.UI.Controls Namespace