RhinoCommon SDK
SaveFileDialog Methods
Rhino WIP for Windows
The SaveFileDialog type exposes the following members.
Methods
Name | Description
ShowDialog |  Obsolete.
ShowSaveDialog
Top
See Also
Reference
SaveFileDialog Class
Rhino.UI Namespace