RhinoCommon SDK
AsyncRenderContext Methods
Rhino WIP for Windows
The AsyncRenderContext type exposes the following members.
Methods
Name | Description
DeleteThis
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
StopRendering
Top
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace