RhinoCommon SDK
SimulatedEnvironment Methods
Rhino WIP for Windows
The SimulatedEnvironment type exposes the following members.
Methods
Name | Description
ConstPointer
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
ProjectionFromString
StringFromProjection
Top
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace