RhinoCommon SDK
GumballPickResult Methods
Rhino WIP for Windows
The GumballPickResult type exposes the following members.
Methods
Name | Description
SetToDefault
Top
See Also
Reference
GumballPickResult Class
Rhino.UI.Gumball Namespace