RhinoCommon SDK
ObjectPropertiesPage Methods
The ObjectPropertiesPage type exposes the following members.
Methods
Name | Description
AnySelectedObject<T>
 Return true if any of the selected objects match the given type
GetSelectedObjects(ObjectType)
 Get selected objects that match a given filter
GetSelectedObjects<T>()
 Get selected objects of a given type
InitializeControls
 Called on the active page after the selected objects list has changed to notify the page to initialize its content to reflect the new object list.
OnActivate
Called when this page is activated/deactivated.
OnCreateParent
 Called when the parent container is initially created.
OnHelp
 Called when the F1 key or help button is pressed, override to display plug-in specific help for this page.
OnSizeParent
 Called when the parent containers client rectangle size has changed and the PageControl has been resized.
RunScript
 This method is called when scripting the Rhino Properties command and choosing this page.
ShouldDisplay
 Called when the selected objects list changes, return true if the object list contains one or more object the page can modify.
Top
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace