RhinoCommon SDK
Vector3dField Methods
Rhino WIP for Windows
The Vector3dField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
Vector3dField Class
Rhino.Render.Fields Namespace