RhinoCommon SDK
Field Methods
The Field type exposes the following members.
Methods
Name | Description
CreateCppPointer
 Create the RDK C++ field object and set its initial value, fields are added to a RenderContent.FieldDictionary in the RenderContent constructor before the RenderContent C++ pointer is created, the RenderContent C++ pointer is required when creating a field in order for the field to get added to the RenderContent C++ Field list so this method is called by RenderContent when it is safe to create the Field C++ pointers.
ValueAsBool
 Return field value as a bool.
ValueAsByteArray
 Return field as a byte array.
ValueAsColor4f
 Return field as a Rhino.Display.Color4f color value.
ValueAsDateTime
 Return field as a DateTime value.
ValueAsDouble
 Return field value as a double precision number.
ValueAsFloat
 Return field value as floating point number.
ValueAsGuid
 Return field value as Guid.
ValueAsInt
 Return field value as integer.
ValueAsObject
ValueAsPoint2d
 Return field as a Rhino.Geometry.Point2d color value.
ValueAsPoint3d
 Return field as a Rhino.Geometry.Point3d color value.
ValueAsPoint4d
 Return field as a Rhino.Geometry.Point4d color value.
ValueAsString
 Get field value as a string.
ValueAsTransform
 Return field as a Rhino.Geometry.Transform color value.
ValueAsVector2d
 Return field as a Rhino.Geometry.Vector2d color value.
ValueAsVector3d
 Return field as a Rhino.Geometry.Vector3d color value.
Top
See Also
Reference
Field Class
Rhino.Render.Fields Namespace