RhinoCommon SDK
V6RadialDimensionObject Methods
Rhino WIP for Windows
The V6RadialDimensionObject type exposes the following members.
Methods
Name | Description
DuplicateDimRadialGeometry
 Constructs a deep (full) copy of the LinearDimension geometry.
Top
See Also
Reference
V6RadialDimensionObject Class
Rhino.DocObjects Namespace