RhinoCommon SDK
FileWriteOptions Methods
The FileWriteOptions type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace