RhinoCommon SDK
ThumbArray Methods
The ThumbArray type exposes the following members.
Methods
Name | Description
ContentAtIndex
Count
Dispose
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
ThumbArray Class
Rhino.Render Namespace