RhinoCommon SDK
HiddenLineDrawingParameters Methods
Rhino WIP for Windows
The HiddenLineDrawingParameters type exposes the following members.
Methods
Name | Description
AddClippingPlane
 Specify clipping planes that are active for this view.
AddGeometry(GeometryBase, Object)
 Add geometry that should be included in the calculation
AddGeometry(GeometryBase, Transform, Object)
 Add geometry that should be included in the calculation
SetViewport(RhinoViewport)
 Set the viewport for the hidden line drawing (HLD). The viewport supplies the projection that determinest he visibility of curves, and the HLD coordinate system in which the resulting curves are represented. The HLD-coordinate system is a right handed system for 3-D model space, in which the 3rd coordinate direction is the projection direction. In particular the z-coordinate direction points from the scene toward the camera.
SetViewport(ViewportInfo)
 Set the viewport for the hidden line drawing (HLD). The viewport supplies the projection that determines the visibility of curves, and the HLD coordinate system in which the resulting curves are represented. The HLD-coordinate system is a right handed system for 3-D model space, in which the 3rd coordinate direction is the projection direction. In particular the z-coordinate direction points from the scene toward the camera.
Top
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace