RhinoCommon SDK
HatchPattern Methods
Rhino WIP for Windows
The HatchPattern type exposes the following members.
Methods
Name | Description
ReadFromFile
 Reads hatch pattern definitions from a file.
Top
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace