RhinoCommon SDK
LinearDimensionObject Methods
The LinearDimensionObject type exposes the following members.
Methods
Name | Description
DisplayHelper
Top
See Also
Reference
LinearDimensionObject Class
Rhino.DocObjects Namespace