RhinoCommon SDK
SubDObject Methods
Rhino WIP for Windows
The SubDObject type exposes the following members.
Methods
Name | Description
DuplicateSubDGeometry
Top
See Also
Reference
SubDObject Class
Rhino.DocObjects Namespace