RhinoCommon SDK
V6OrdinateDimensionObject Methods
Rhino WIP for Windows
The V6OrdinateDimensionObject type exposes the following members.
Methods
Name | Description
DuplicateDimOrdinateGeometry
 Constructs a deep (full) copy of the OrdinateDimension geometry.
Top
See Also
Reference
V6OrdinateDimensionObject Class
Rhino.DocObjects Namespace