RhinoCommon SDK
HatchPatternTable Methods
The HatchPatternTable type exposes the following members.
Methods
Name | Description
Add
 Adds a new hatch pattern with specified definition to the table.
Delete(HatchPattern) |  (Overrides CommonComponentTable<T>.Delete(T).)
Delete(HatchPattern, Boolean)
Find |  Obsolete.
 Finds the hatch pattern with a given name. Search ignores case.
FindIndex
 Retrieves a HatchPattern object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds the hatch pattern with a given name. Search ignores case.
FindNameHash
 Finds a HatchPattern given its name hash.
Top
See Also
Reference
HatchPatternTable Class
Rhino.DocObjects.Tables Namespace