RhinoCommon SDK
V6AngularDimensionObject Methods
The V6AngularDimensionObject type exposes the following members.
Methods
Name | Description
DuplicateDimAngularGeometry
 Constructs a deep (full) copy of the AngularDimension geometry.
Top
See Also
Reference
V6AngularDimensionObject Class
Rhino.DocObjects Namespace