RhinoCommon SDK
IRdkViewModel Methods
Rhino WIP for Windows
The IRdkViewModel type exposes the following members.
Methods
Name | Description
Commit
GetData
Top
See Also
Reference
IRdkViewModel Interface
Rhino.UI.Controls Namespace