RhinoCommon SDK
V6OrdinateDimension Methods
Rhino WIP for Windows
The V6OrdinateDimension type exposes the following members.
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
See Also
Reference
V6OrdinateDimension Class
Rhino.Geometry Namespace