RhinoCommon SDK
IStackedDialogPageService Methods
The IStackedDialogPageService type exposes the following members.
Methods
Name | Description
AddChildPage
MakeActive
NewObjectPropertiesDialogPagePointer
NewOptionsDialogPagePointer
PageWindowHandle
RemovePage
SetGetTreeItemBold
SetGetTreeItemColor
SetPageTitle
UnManagedPointerCreated
Top
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace