RhinoCommon SDK
V6LinearDimensionObject Methods
The V6LinearDimensionObject type exposes the following members.
Methods
Name | Description
DuplicateDimLinearGeometry
 Constructs a deep (full) copy of the LinearDimension geometry.
Top
See Also
Reference
V6LinearDimensionObject Class
Rhino.DocObjects Namespace