RhinoCommon SDK
V6Centermark Methods
The V6Centermark type exposes the following members.
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
GetDisplayLines
Top
See Also
Reference
V6Centermark Class
Rhino.Geometry Namespace