RhinoCommon SDK
IntField Methods
Rhino WIP for Windows
The IntField type exposes the following members.
Methods
Name | Description
ValueAsObject |  (Overrides Field.ValueAsObject().)
Top
See Also
Reference
IntField Class
Rhino.Render.Fields Namespace