RhinoCommon SDK
UndoHelper Methods
The RdkViewModel.UndoHelper type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
RdkViewModel.UndoHelper Class
Rhino.UI.Controls Namespace