RhinoCommon SDK
BrepSurfaceList Methods
Rhino WIP for Windows
The BrepSurfaceList type exposes the following members.
Methods
Name | Description
GetEnumerator
 Gets an enumerator that visits all surfaces.
Top
See Also
Reference
BrepSurfaceList Class
Rhino.Geometry.Collections Namespace