RhinoCommon SDK
TextureEvaluator Methods
The TextureEvaluator type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
GetColor
Initialize
Top
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace