RhinoCommon SDK
ViewCapture Methods
Rhino WIP for Windows
The ViewCapture type exposes the following members.
Methods
Name | Description
CaptureToBitmap
Top
See Also
Reference
ViewCapture Class
Rhino.Display Namespace