RhinoCommon SDK
File3dmLayerTable Methods
The File3dmLayerTable type exposes the following members.
Methods
Name | Description
FindName
 Finds a Layer given its name.
FindNameHash
 Finds a Layer given its name hash.
Top
See Also
Reference
File3dmLayerTable Class
Rhino.FileIO Namespace