RhinoCommon SDK
CustomPointObject Methods
Rhino WIP for Windows
The CustomPointObject type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean) |  (Overrides CommonObject.Dispose(Boolean).)
Finalize |  (Overrides CommonObject.Finalize().)
Top
See Also
Reference
CustomPointObject Class
Rhino.DocObjects.Custom Namespace