RhinoCommon SDK
LightTable Methods
Rhino WIP for Windows
The LightTable type exposes the following members.
Methods
Name | Description
Add(Light)
Add(Light, ObjectAttributes)
Delete(LightObject) |  (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean)
Find
FindName
 Finds the LightObject with a given name.
Deleted layers have no name.
FindNameHash
 Finds a Layer given its name hash.
GetEnumerator |  (Overrides CommonComponentTable<T>.GetEnumerator().)
Modify(Guid, Light)
Modify(Int32, Light)
Top
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace