RhinoCommon SDK
ICollapsibleSectionHolder Methods
Rhino WIP for Windows
The ICollapsibleSectionHolder type exposes the following members.
Methods
Name | Description
Add
ExpandSection
IsSectionExpanded
Remove
SectionAt
UpdateAllViews
Top
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace