RhinoCommon SDK
TextEntity Methods
The TextEntity type exposes the following members.
Methods
Name | Description
Explode
 Explodes this text entity into an array of curves.
Top
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace