RhinoCommon SDK
IRhRdkThumbnail Methods
Rhino WIP for Windows
The IRhRdkThumbnail type exposes the following members.
Methods
Name | Description
Dib
GetDisplayRect
Id
IsHot
IsSelected
Label
Top
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls Namespace