RhinoCommon SDK
PreviewJobSignature Methods
Rhino WIP for Windows
The PreviewJobSignature type exposes the following members.
Methods
Name | Description
Dispose
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
PreviewJobSignature Class
Rhino.Render Namespace