RhinoCommon SDK
CollapsibleSectionImpl Methods
The CollapsibleSectionImpl type exposes the following members.
Methods
Name | Description
__InternalSetParent
CreateHostedSection
Dispose
Finalize |  (Overrides Object.Finalize().)
Find
NewNativeWrapper
ReplaceClient
Top
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace