RhinoCommon SDK
RenderWindow Methods
Rhino WIP for Windows
The RenderWindow type exposes the following members.
Methods
Name | Description
AddChannel
 Add a channel to the frame buffer in addition to the fixed Red, Green, Blue and Alpha channels.
AddWireframeChannel
 A wireframe channel will not be added if none of the document properties settings indicate that one is needed. In other words, Rhino will not generate an empty wireframe channel just for the fun of it.
ChannelId
Create
EndAsyncRender
 Must be called when an asynchronous render has finished or ended for any reason.
FromSessionId
GetAdjust
 Get an ImageAdjust instance containing current image adjusting settings for this RenderWindow
GetBitmap
Invalidate
 Invalidate the entire view window so that the pixels get painted.
InvalidateArea
OpenChannel
SaveDibAsBitmap
 Save current Dib of RenderWindow as file Helper function for debugging purposes.
SetAdjust
 Set new ImageAdjust to use. An ImageAdjust instance can be obtained by first querying for one using GetAdjust()
SetProgress
 Accepts a rendering progress value to inform the user of the rendering advances.
SetRGBAChannelColors(Rectangle, Color4f[])
 Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
SetRGBAChannelColors(Size, Color4f[])
 Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
SetSize
SetView
Size
Top
See Also
Reference
RenderWindow Class
Rhino.Render Namespace