RhinoCommon SDK
AnnotationText Methods
Rhino WIP for Windows
The AnnotationText type exposes the following members.
Methods
Name | Description
Create
 Create RichText geometry or null if input is invalid
GetAnnotationStyle
 Get this text's dimstyle
GetTextTransform
 Get the transform for this text object's text geometry
SetAnnotationStyle
 Set this text's AnnotationStyle
SetAnnotationStyleId
 Set this text's dimstyle id. This causes the text runs to be recreated with the properties from the corresponding AnnotationStyle
SetTextString
WrapText
Top
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace