RhinoCommon SDK
Dimension Methods
The Dimension type exposes the following members.
Methods
Name | Description
GetTextTransform
 Get the transform for this text object's text geometry
Top
Extension Methods
Name | Description
SetDefaultContext
 injects into AnnotationBase a way to get to dimension styles without having a dependency in RhinoDoc
 (Defined by AnnotationExtensions.)
Top
See Also
Reference
Dimension Class
Rhino.Geometry Namespace