RhinoCommon SDK
PreviewAppearance Methods
Rhino WIP for Windows
The PreviewAppearance type exposes the following members.
Methods
Name | Description
Background
 Background
Dispose
 Dispose for previewappearance
Finalize
 Destructor for previewappearance
 (Overrides Object.Finalize().)
Geometry
 Geometry
Lighting
 Lighting
RotationType
 RotationType
RotationX
 RotationX
RotationY
 RotationY
SetRotationType
 SetRotationType
SetRotationX
 SetRotationX
SetRotationY
 SetRotationY
SetSize
 SetSize
Size
 Size
Top
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace