RhinoCommon SDK
PreviewLighting Methods
Rhino WIP for Windows
The PreviewLighting type exposes the following members.
Methods
Name | Description
ElementKind
 ElementKind
SetUpPreview
 SetUpPreview
Top
See Also
Reference
PreviewLighting Class
Rhino.Render Namespace