RhinoCommon SDK
NewUndoRecord Methods
The RdkViewModel.NewUndoRecord type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
RdkViewModel.NewUndoRecord Class
Rhino.UI.Controls Namespace