RhinoCommon SDK
BrepRegionFaceSide Methods
Rhino WIP for Windows
The BrepRegionFaceSide type exposes the following members.
Methods
Name | Description
NonConstOperation
 (Overrides CommonObject.NonConstOperation().)
Top
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace