RhinoCommon SDK
Leader Methods
The Leader type exposes the following members.
Methods
Name | Description
Create
 Creates a Leader geometry object
Top
Extension Methods
Name | Description
SetDefaultContext
 injects into AnnotationBase a way to get to dimension styles without having a dependency in RhinoDoc
 (Defined by AnnotationExtensions.)
Top
See Also
Reference
Leader Class
Rhino.Geometry Namespace