RhinoCommon SDK
Color4f Operators
Rhino WIP for Windows
The Color4f type exposes the following members.
Operators
Name | Description
Equality
Inequality
Top
See Also
Reference
Color4f Structure
Rhino.Display Namespace