RhinoCommon SDK
ColorHSL Type Conversions
Rhino WIP for Windows
The ColorHSL type exposes the following members.
Operators
Name | Description
Implicit(ColorHSL to Color)
 Implicitly converts a ColorHSL in a .Net library color.
Top
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace