RhinoCommon SDK
ColorCMYK Type Conversions
Rhino WIP for Windows
The ColorCMYK type exposes the following members.
Operators
Name | Description
Implicit(ColorCMYK to Color)
 Implicitly converts a CMYK color into a .Net library color.
Top
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace