RhinoCommon SDK
SubDFacePtr Operators
Rhino WIP for Windows
The SubDFacePtr type exposes the following members.
Operators
Name | Description
Equality
Inequality
Top
See Also
Reference
SubDFacePtr Structure
Rhino.Geometry Namespace