RhinoCommon SDK
Line Operators
Rhino WIP for Windows
The Line type exposes the following members.
Operators
Name | Description
Equality
 Determines whether two lines have the same value.
Inequality
 Determines whether two lines have different values.
Top
See Also
Reference
Line Structure
Rhino.Geometry Namespace