RhinoCommon SDK
Matrix Constructor
Rhino WIP for Windows
Overload List
Name | Description
Matrix(Transform)
 Initializes a new instance of the matrix based on a 4x4 matrix Transform.
Matrix(Int32, Int32)
 Initializes a new instance of the matrix.
Top
See Also
Reference
Matrix Class
Rhino.Geometry Namespace