RhinoCommon SDK
V6AngularDimension Constructor
Overload List
Name | Description
V6AngularDimension()
Initializes a new instance of the V6AngularDimension class
V6AngularDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
V6AngularDimension Class
Rhino.Geometry Namespace