RhinoCommon SDK
LinetypeTable.Add Method
Rhino WIP for Windows
Overload List
Name | Description
Add(Linetype)
 Adds a new linetype with specified definition to the linetype table.
Add(String, IEnumerable<Double>)
 Adds a new linetype with specified definition to the linetype table.
Top
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace