RhinoCommon SDK
Rectangle3d.RecenterPlane Method
Rhino WIP for Windows
Overload List
Name | Description
RecenterPlane(Int32)
 Recenters the base plane on one of the corners.
RecenterPlane(Point3d)
 Recenters the base plane on a new origin.
Top
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace