RhinoCommon SDK
Panels.IsPanelVisible Method
Overload List
Name | Description
IsPanelVisible(Guid)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
IsPanelVisible(Type)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
IsPanelVisible(Guid, Boolean)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
IsPanelVisible(Type, Boolean)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace