RhinoCommon SDK
GroupTable.Find Method
Rhino WIP for Windows
Overload List
Name | Description
Find(String)
Finds a group with a given name.
Find(String, Boolean) |  Obsolete.
Finds a group with a given name.
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace