RhinoCommon SDK
File3dmCommonComponentTable<T>.Delete Method
Rhino WIP for Windows
Overload List
Name | Description
Delete(Int32)
 Flags a component as deleted.
Delete(T)
 Flags a component as deleted.
 (Overrides CommonComponentTable<T>.Delete(T).)
Top
See Also
Reference
File3dmCommonComponentTable<T> Class
Rhino.FileIO Namespace