RhinoCommon SDK
Material.SetTransparencyTexture Method
Rhino WIP for Windows
Overload List
Name | Description
SetTransparencyTexture(String)
SetTransparencyTexture(Texture)
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace