RhinoCommon SDK
ObjectTable.UnselectAll Method
Rhino WIP for Windows
Overload List
Name | Description
UnselectAll()
Unselect objects.
UnselectAll(Boolean)
Unselect objects.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace