RhinoCommon SDK
Text3d Constructor
Rhino WIP for Windows
Overload List
Name | Description
Text3d(String)
 Constructs a new instance of Text3d.
Text3d(String, Plane, Double)
 Constructs a new instance of Text3d.
Top
See Also
Reference
Text3d Class
Rhino.Display Namespace