RhinoCommon SDK
V6Dimension Constructor
Rhino WIP for Windows
Overload List
Name | Description
V6Dimension()
Initializes a new instance of the V6Dimension class
V6Dimension(SerializationInfo, StreamingContext)
Initializes a new instance of the V6Dimension class
Top
See Also
Reference
V6Dimension Class
Rhino.Geometry Namespace