RhinoCommon SDK
File3dm.IsValid Method
Rhino WIP for Windows
Overload List
Name | Description
IsValid(String) |  Obsolete.
 The File3dm object is kept consistent during its creation. Therefore, this function now returns only true.
IsValid(TextLog) |  Obsolete.
 The File3dm object is kept consistent during its creation. Therefore, this function now returns only true.
Top
See Also
Reference
File3dm Class
Rhino.FileIO Namespace