RhinoCommon SDK
SimulatedTexture.MetersToUnits Method
Rhino WIP for Windows
Overload List
Name | Description
MetersToUnits(Double) |  Obsolete.
MetersToUnits(RhinoDoc, Double)
Top
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace