RhinoCommon SDK
RhinoGet.GetInteger Method
Rhino WIP for Windows
Overload List
Name | Description
GetInteger(String, Boolean, Int32)
 Easy to use number getter.
GetInteger(String, Boolean, Int32, Int32, Int32)
 Easy to use number getter.
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace