RhinoCommon SDK
DisplayPipeline.DrawSphere Method
Rhino WIP for Windows
Overload List
Name | Description
DrawSphere(Sphere, Color)
 Draw a wireframe sphere.
DrawSphere(Sphere, Color, Int32)
 Draw a wireframe sphere.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace