RhinoCommon SDK
Layer.Equals Method
Rhino WIP for Windows
Overload List
Name | Description
Equals(Object) |  (Overrides Object.Equals(Object).)
Equals(Layer)
Top
See Also
Reference
Layer Class
Rhino.DocObjects Namespace