RhinoCommon SDK
AsyncRenderContext.Dispose Method
Rhino WIP for Windows
Overload List
Name | Description
Dispose()
Releases all resources used by the AsyncRenderContext
Dispose(Boolean)
Releases the unmanaged resources used by the AsyncRenderContext and optionally releases the managed resources
Top
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace