RhinoCommon SDK
NewUndoRecord.Dispose Method
Rhino WIP for Windows
Overload List
Name | Description
Dispose()
Releases all resources used by the RdkViewModel.NewUndoRecord
Dispose(Boolean)
Releases the unmanaged resources used by the RdkViewModel.NewUndoRecord and optionally releases the managed resources
Top
See Also
Reference
RdkViewModel.NewUndoRecord Class
Rhino.UI.Controls Namespace