RhinoCommon SDK
Curve.ExtendOnSurface Method
Rhino WIP for Windows
Overload List
Name | Description
ExtendOnSurface(CurveEnd, BrepFace)
 Extends a curve on a surface.
ExtendOnSurface(CurveEnd, Surface)
 Extends a curve on a surface.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace