RhinoCommon SDK
File3dmObjectTable.Delete Method
Rhino WIP for Windows
Overload List
Name | Description
Delete(IEnumerable<Guid>)
 Deletes a collection of objects from the document.
Delete(Guid)
 Deletes object from document.
Delete(File3dmObject)
 Deletes object from document.
 (Overrides File3dmCommonComponentTable<T>.Delete(T).)
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace