RhinoCommon SDK
File3dmObjectTable.AddSurface Method
Rhino WIP for Windows
Overload List
Name | Description
AddSurface(Surface)
Adds a surface object to Rhino.
AddSurface(Surface, ObjectAttributes)
Adds a surface object to Rhino.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace