RhinoCommon SDK
Brep.CreateChamferSurface Method
Overload List
Name | Description
CreateChamferSurface(BrepFace, Point2d, Double, BrepFace, Point2d, Double, Boolean, Double)
 Creates a ruled surface as a bevel between two input surface edges.
CreateChamferSurface(BrepFace, Point2d, Double, BrepFace, Point2d, Double, Boolean, Boolean, Double, Brep[], Brep[])
 Creates a ruled surface as a bevel between two input surface edges.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace