RhinoCommon SDK
DimensionStyle Constructor
Rhino WIP for Windows
Overload List
Name | Description
DimensionStyle()
 Create a new non-document controlled annotation style
DimensionStyle(SerializationInfo, StreamingContext)
Initializes a new instance of the DimensionStyle class
Top
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace