RhinoCommon SDK
V6RadialDimension Constructor
Rhino WIP for Windows
Overload List
Name | Description
V6RadialDimension()
Initializes a new instance of the V6RadialDimension class
V6RadialDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
V6RadialDimension Class
Rhino.Geometry Namespace