RhinoCommon SDK
ManifestTable.GetEnumerator Method
Rhino WIP for Windows
Overload List
Name | Description
GetEnumerator<T>()
 Visits all model components in the document, including default ones.
GetEnumerator()
 Visits all model components in the document, including default ones.
GetEnumerator(ModelComponentType)
 Returns an enumerators that yields all model components, including default ones, relating to a particular type.
Top
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace