RhinoCommon SDK
DisplayPipeline.DrawPatternedLine Method
Rhino WIP for Windows
Overload List
Name | Description
DrawPatternedLine(Line, Color, Int32, Int32)
 Draws a single line with specified pattern.
DrawPatternedLine(Point3d, Point3d, Color, Int32, Int32)
 Draws a single line with specified pattern.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace