RhinoCommon SDK
DisplayMaterial.SetBumpTexture Method
Rhino WIP for Windows
Overload List
Name | Description
SetBumpTexture(String, Boolean)
SetBumpTexture(Texture, Boolean)
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace