RhinoCommon SDK
BrepVertexList.Add Method
Rhino WIP for Windows
Overload List
Name | Description
Add()
 Create and add a new vertex to this list
Add(Point3d, Double)
 Create and add a new vertex to this list
Top
See Also
Reference
BrepVertexList Class
Rhino.Geometry.Collections Namespace