RhinoCommon SDK
V6OrdinateDimension Constructor
Overload List
Name | Description
V6OrdinateDimension()
Initializes a new instance of the V6OrdinateDimension class
V6OrdinateDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
V6OrdinateDimension Class
Rhino.Geometry Namespace