RhinoCommon SDK
Layer.GetParentName Method
Rhino WIP for Windows
Overload List
Name | Description
GetParentName(String)
 Get a layer's "parent" path name
GetParentName(Layer)
 Get a layer's "parent" path name
Top
See Also
Reference
Layer Class
Rhino.DocObjects Namespace