RhinoCommon SDK
ObjectTable.AddSubD Method
Rhino WIP for Windows
Overload List
Name | Description
AddSubD(SubD)
Adds a SubD object to Rhino.
AddSubD(SubD, ObjectAttributes)
Adds a SubD object to Rhino.
AddSubD(SubD, ObjectAttributes, HistoryRecord, Boolean)
Adds a SubD object to Rhino.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace