RhinoCommon SDK
Material.SetBitmapTexture Method
Rhino WIP for Windows
Overload List
Name | Description
SetBitmapTexture(String)
SetBitmapTexture(Texture)
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace