RhinoCommon SDK
NurbsCurve.CreateFromCircle Method
Rhino WIP for Windows
Overload List
Name | Description
CreateFromCircle(Circle)
 Gets a rational degree 2 NURBS curve representation of the circle. Note that the parameterization of NURBS curve does not match circle's transcendental paramaterization. Use GetRadianFromNurbFormParameter() and GetParameterFromRadian() to convert between the NURBS curve parameter and the transcendental parameter.
CreateFromCircle(Circle, Int32, Int32)
 Create a uniform non-ratonal cubic NURBS approximation of a circle.
Top
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace