RhinoCommon SDK
HiddenLineDrawingObjectCurve.Curve Method
Rhino WIP for Windows
Overload List
Name | Description
Curve(Double)
 Returns the HiddenLineDrawingCurve object containing parameter 't'.
Curve(Double, Int32)
 Returns the HiddenLineDrawingCurve object containing parameter 't'.
Top
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace