RhinoCommon SDK
SporphSpaceMorph Constructor
Rhino WIP for Windows
Overload List
Name | Description
SporphSpaceMorph(Surface, Surface)
 Constructs a sporph space morph.
SporphSpaceMorph(Surface, Surface, Point2d, Point2d)
 Constructs a sporph space morph.
Top
See Also
Reference
SporphSpaceMorph Class
Rhino.Geometry.Morphs Namespace