RhinoCommon SDK
RealtimeDisplayMode.GetRealtimeViewport Method
Overload List
Name | Description
GetRealtimeViewport(IntPtr)
GetRealtimeViewport(IntPtr, Boolean)
Top
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace