RhinoCommon SDK
IPanelsService.OpenPanel Method
Rhino WIP for Windows
Overload List
Name | Description
OpenPanel(Guid)
OpenPanel(Guid, Guid)
Top
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace