RhinoCommon SDK
LayerTable.Delete Method
Overload List
Name | Description
Delete(Layer)
Deletes layer.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Guid, Boolean)
Deletes layer.
Delete(Int32, Boolean)
Deletes layer.
Delete(Layer, Boolean)
Deletes layer.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace