RhinoCommon SDK
Point2d.Subtraction Operator
Rhino WIP for Windows
Overload List
Name | Description
Subtraction(Point2d, Point2d)
 Subtracts point2 from point1.
Subtraction(Point2d, Vector2d)
 Subtracts a vector from a point.
Top
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace