RhinoCommon SDK
DisplayMaterial.SetEnvironmentTexture Method
Rhino WIP for Windows
Overload List
Name | Description
SetEnvironmentTexture(String, Boolean)
SetEnvironmentTexture(Texture, Boolean)
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace