RhinoCommon SDK
Panels.GetPanel Method
Overload List
Name | Description
GetPanel<T>()
 Return an instance of a .Net panel
GetPanel(Guid)
 Will return an instance of a .Net panel if the panel has been displayed at least once. Panel instances are not created until a panel is displayed.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace