RhinoCommon SDK
InstanceDefinitionTable.GetUnusedInstanceDefinitionName Method
Rhino WIP for Windows
Overload List
Name | Description
GetUnusedInstanceDefinitionName()
 Gets unsed instance definition name used as default when creating new instance definitions.
GetUnusedInstanceDefinitionName(String)
 Gets unsed instance definition name used as default when creating new instance definitions.
GetUnusedInstanceDefinitionName(String, UInt32) |  Obsolete.
 Gets unsed instance definition name used as default when creating new instance definitions.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace