RhinoCommon SDK
RenderSettings Constructor
Rhino WIP for Windows
Overload List
Name | Description
RenderSettings()
 Initializes a new instance of the RenderSettings class.
RenderSettings(RenderSettings)
 Initializes a new instance of the RenderSettings class.
Top
See Also
Reference
RenderSettings Class
Rhino.Render Namespace