RhinoCommon SDK
NameHash Constructor
Rhino WIP for Windows
Overload List
Name | Description
NameHash(String)
 Creates a new NameHash, representing a piece of text.
NameHash(NameHash)
 Constructs a copy of a content hash.
NameHash(String, Guid)
 Creates a new NameHash, representing a piece of text.
Top
See Also
Reference
NameHash Class
Rhino.FileIO Namespace