RhinoCommon SDK
RhinoViewport.SetWallpaper Method
Rhino WIP for Windows
Overload List
Name | Description
SetWallpaper(String, Boolean)
SetWallpaper(String, Boolean, Boolean)
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace