RhinoCommon SDK
CustomGripObject.Dispose Method
Rhino WIP for Windows
Overload List
Name | Description
Dispose()
Releases all resources used by the CustomGripObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomGripObject and optionally releases the managed resources
 (Overrides CommonObject.Dispose(Boolean).)
Top
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace