RhinoCommon SDK
ObjectTable.AddV6AngularDimension Method
Rhino WIP for Windows
Overload List
Name | Description
AddV6AngularDimension(V6AngularDimension)
 Adds a angular dimension object to the document.
AddV6AngularDimension(V6AngularDimension, ObjectAttributes)
 Adds a angular dimension object to the document.
AddV6AngularDimension(V6AngularDimension, ObjectAttributes, HistoryRecord, Boolean)
 Adds an angular dimension object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace