RhinoCommon SDK
LayerTable.FindByFullPath Method
Rhino WIP for Windows
Overload List
Name | Description
FindByFullPath(String, Boolean) |  Obsolete.
FindByFullPath(String, Int32)
 Searches for a layer using the fully qualified name, that includes ancestors.
Deleted layers have no name.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace