RhinoCommon SDK
InstanceDefinitionTable.Find Method
Rhino WIP for Windows
Overload List
Name | Description
Find(String)
Finds the instance definition with a given name.
Find(Guid, Boolean)
Finds the instance definition with a given id.
Find(String, Boolean) |  Obsolete.
Finds the instance definition with a given name.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace