RhinoCommon SDK
RenderTexture.SetEnvironmentMappingMode Method
Rhino WIP for Windows
Overload List
Name | Description
SetEnvironmentMappingMode(TextureEnvironmentMappingMode)
SetEnvironmentMappingMode(TextureEnvironmentMappingMode, RenderContent.ChangeContexts)
Top
See Also
Reference
RenderTexture Class
Rhino.Render Namespace