RhinoCommon SDK
AnnotationArrowhead Constructor
Overload List
Name | Description
AnnotationArrowhead()
 Constructotr
AnnotationArrowhead(DimensionStyle.ArrowType, Guid)
 Constructotr type of this arrowhead Guid of the block used for user defined display
Top
See Also
Reference
AnnotationArrowhead Class
Rhino.Geometry Namespace