RhinoCommon SDK
Interop.NativeNonConstPointer Method
Rhino WIP for Windows
Overload List
Name | Description
NativeNonConstPointer(DisplayPipeline)
 Get CRhinoDisplayPipeline* for a DisplayPipeline instance
NativeNonConstPointer(GetPoint)
 Get CRhinoGetPoint* from a GetPoint instance
NativeNonConstPointer(RhinoViewport)
 Get CRhinoViewport* from a RhinoViewport instance
NativeNonConstPointer(ViewportInfo)
 Get ON_Viewport* from a ViewportInfo instance
Top
See Also
Reference
Interop Class
Rhino.Runtime Namespace