RhinoCommon SDK
RenderPipeline Constructor
Overload List
Name | Description
RenderPipeline(RhinoDoc, RunMode, PlugIn, Size, String, RenderWindow.StandardChannels, Boolean, Boolean)
 Constructs a subclass of this object on the stack in your Rhino plug-in's Render() or RenderWindow() implementation.
RenderPipeline(RhinoDoc, RunMode, PlugIn, Size, String, RenderWindow.StandardChannels, Boolean, Boolean, AsyncRenderContext)
 Constructs a subclass of this object on the stack in your Rhino plug-in's Render() or RenderWindow() implementation.
Top
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace