RhinoCommon SDK
Localization.LocalizeCommandOptionValue Method
Rhino WIP for Windows
Overload List
Name | Description
LocalizeCommandOptionValue(String, Int32)
LocalizeCommandOptionValue(String, Object, Int32)
Top
See Also
Reference
Localization Class
Rhino.UI Namespace