RhinoCommon SDK
Point3d Implicit Conversion Operators
Rhino WIP for Windows
Overload List
Name | Description
Implicit(Point3d to ControlPoint)
 Converts a point in a control point, without needing casting.
Implicit(Point3f to Point3d)
 Converts a single-precision point in a double-precision point, without needing casting.
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace