RhinoCommon SDK
MeshNgonList.GetNgonCenter Method
Rhino WIP for Windows
Overload List
Name | Description
GetNgonCenter(Int32)
 Gets the center point of an ngon.
This the avarage of the corner points.
GetNgonCenter(MeshNgon)
 Gets the center point of an ngon.
This the avarage of the corner points.
Top
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace