RhinoCommon SDK
V6LinearDimension Constructor
Rhino WIP for Windows
Overload List
Name | Description
V6LinearDimension()
Initializes a new instance of the V6LinearDimension class
V6LinearDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
V6LinearDimension Class
Rhino.Geometry Namespace