RhinoCommon SDK
ObjectTable.AddRichText Method
Rhino WIP for Windows
Overload List
Name | Description
AddRichText(AnnotationText)
 Adds a rich text object to the document.
AddRichText(AnnotationText, ObjectAttributes)
 Adds a rich text object to the document.
AddRichText(AnnotationText, ObjectAttributes, HistoryRecord, Boolean)
 Adds a rich text object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace