RhinoCommon SDK
File3dmObjectTable.AddMesh Method
Rhino WIP for Windows
Overload List
Name | Description
AddMesh(Mesh)
Adds a mesh object to Rhino.
AddMesh(Mesh, ObjectAttributes)
Adds a mesh object to Rhino.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace