RhinoCommon SDK
UndoHelper.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the RdkViewModel.UndoHelper
Dispose(Boolean)
Releases the unmanaged resources used by the RdkViewModel.UndoHelper and optionally releases the managed resources
Top
See Also
Reference
RdkViewModel.UndoHelper Class
Rhino.UI.Controls Namespace