RhinoCommon SDK
ObjectAttributes Constructor
Rhino WIP for Windows
Overload List
Name | Description
ObjectAttributes()
Initializes a new instance of the ObjectAttributes class
ObjectAttributes(SerializationInfo, StreamingContext)
Initializes a new instance of the ObjectAttributes class
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace