RhinoCommon SDK
ObjectTable.AddRLeader Method
Overload List
Name | Description
AddRLeader(RLeader)
 Adds a Leader object to the document.
AddRLeader(RLeader, ObjectAttributes)
 Adds a Leader object to the document.
AddRLeader(RLeader, ObjectAttributes, HistoryRecord, Boolean)
 Adds a Leader object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace