RhinoCommon SDK
Curve.GetConicSectionType Method
Rhino WIP for Windows
Overload List
Name | Description
GetConicSectionType()
 Returns the type of conic section based on the curve's shape.
GetConicSectionType(Point3d, Point3d, Point3d)
 Returns the type of conic section based on the curve's shape.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace