RhinoCommon SDK
ObjectAttributes.DrawColor Method
Rhino WIP for Windows
Overload List
Name | Description
DrawColor(RhinoDoc)
DrawColor(RhinoDoc, Guid)
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace