RhinoCommon SDK
File3dmObjectTable.AddCurve Method
Rhino WIP for Windows
Overload List
Name | Description
AddCurve(Curve)
Adds a curve object to the table.
AddCurve(Curve, ObjectAttributes)
Adds a curve object to the table.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace