RhinoCommon SDK
DisplayPipeline.DrawPoint Method
Rhino WIP for Windows
Overload List
Name | Description
DrawPoint(Point3d)
 Draws a point using the current display attribute size, style and color
DrawPoint(Point3d, Color)
Draws a point with a given radius, style and color.
DrawPoint(Point3d, PointStyle, Int32, Color)
Draws a point with a given radius, style and color.
DrawPoint(Point3d, PointStyle, Single, Color)
Draws a point with a given radius, style and color.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace