RhinoCommon SDK
Arc.ToNurbsCurve Method
Rhino WIP for Windows
Overload List
Name | Description
ToNurbsCurve()
 Initializes a nurbs curve representation of this arc. This amounts to the same as calling NurbsCurve.CreateFromArc().
ToNurbsCurve(Int32, Int32)
 Create a uniform non-ratonal cubic NURBS approximation of an arc.
Top
See Also
Reference
Arc Structure
Rhino.Geometry Namespace