RhinoCommon SDK
Mesh.CreateFromPlanarBoundary Method
Overload List
Name | Description
CreateFromPlanarBoundary(Curve, MeshingParameters) |  Obsolete.
 Attempts to construct a mesh from a closed planar curve.RhinoMakePlanarMeshes
CreateFromPlanarBoundary(Curve, MeshingParameters, Double)
 Attempts to construct a mesh from a closed planar curve.RhinoMakePlanarMeshes
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace