RhinoCommon SDK
PreviewJobSignature Constructor
Overload List
Name | Description
PreviewJobSignature()
Initializes a new instance of the PreviewJobSignature class
PreviewJobSignature(Int32, Int32, UInt32)
Initializes a new instance of the PreviewJobSignature class
Top
See Also
Reference
PreviewJobSignature Class
Rhino.Render Namespace