RhinoCommon SDK
ChangeQueue Constructor
Overload List
Name | Description
ChangeQueue(Guid, CreatePreviewEventArgs)
 Construct a new ChangeQueue using the given CreatePreviewEventArgs. The preview scene for these args will be used to populate the world.
ChangeQueue(Guid, UInt32, ViewInfo)
 Construct a new ChangeQueue from the given document
Top
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace