RhinoCommon SDK
ObjectTable.AddAngularDimension Method
Rhino WIP for Windows
Overload List
Name | Description
AddAngularDimension(AngularDimension)
AddAngularDimension(AngularDimension, ObjectAttributes)
AddAngularDimension(AngularDimension, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace