RhinoCommon SDK
ObjectAttributes.ComputedPlotColor Method
Rhino WIP for Windows
Overload List
Name | Description
ComputedPlotColor(RhinoDoc)
ComputedPlotColor(RhinoDoc, Guid)
Top
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace