RhinoCommon SDK
DisplayPipeline.DrawObject Method
Overload List
Name | Description
DrawObject(RhinoObject)
DrawObject(RhinoObject, Transform)
 Draws a RhinoObject with an applied transformation.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace