RhinoCommon SDK
DisplayPipeline.DrawPoints Method
Rhino WIP for Windows
Overload List
Name | Description
DrawPoints(IEnumerable<Point3d>, PointStyle, Int32, Color)
Draw a set of points with a given radius, style and color.
DrawPoints(IEnumerable<Point3d>, PointStyle, Single, Color)
Draw a set of points with a given radius, style and color.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace