RhinoCommon SDK
StringParserSettings.ParseSignificandDigitSeparators Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseSignificandDigitSeparators"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ParseSignificandDigitSeparators { get; set; }
Public Property ParseSignificandDigitSeparators As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace