RhinoCommon SDK
MeshFace.A Property
Rhino WIP for Windows
 Gets or sets the first corner index of the mesh face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int A { get; set; }
Public Property A As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace