RhinoCommon SDK
Circle.Diameter Property
Rhino WIP for Windows
 Gets or sets the diameter (radius * 2.0) of this circle. Diameters should be positive values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Diameter { get; set; }
Public Property Diameter As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Circle Structure
Rhino.Geometry Namespace