RhinoCommon SDK
Point3f.Z Property
Rhino WIP for Windows
 Gets or sets the Z (third) component of the vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public float Z { get; set; }
Public Property Z As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace