RhinoCommon SDK
RdkThumbnaillistViewModel.Selected Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkThumbnaillistViewModel.Selected"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public List<Guid> Selected { set; }
Public WriteOnly Property Selected As List(Of Guid)
	Set
Property Value
Type: List<Guid>
See Also
Reference
RdkThumbnaillistViewModel Class
Rhino.UI.Controls Namespace