RhinoCommon SDK
TimeZone.Hours Property
 Gets hours of a time zone.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Hours { get; }
Public ReadOnly Property Hours As Double
	Get
Property Value
Type: Double
See Also
Reference
TimeZone Class
Rhino.Render Namespace