RhinoCommon SDK
Layer.UserStringCount Property
 Gets the amount of user strings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int UserStringCount { get; }
Public ReadOnly Property UserStringCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Layer Class
Rhino.DocObjects Namespace