RhinoCommon SDK
AnnotationBase.TextFormula Property
Rhino WIP for Windows
 Gets or sets a formula for this annotation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string TextFormula { get; set; }
Public Property TextFormula As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace