RhinoCommon SDK
Vector3d.YAxis Property
Rhino WIP for Windows
 Gets the value of the vector with components 0,1,0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Vector3d YAxis { get; }
Public Shared ReadOnly Property YAxis As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace