RhinoCommon SDK
TextureMapping.ComponentType Property
Rhino WIP for Windows
 Returns TextureMapping.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
TextureMapping Class
Rhino.Render Namespace