RhinoCommon SDK
ViewTable.RedrawEnabled Property
Rhino WIP for Windows
Returns or sets (enable or disables) screen redrawing.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool RedrawEnabled { get; set; }
Public Property RedrawEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace