RhinoCommon SDK
DisplayPipelineAttributes.ShadingEnabled Property
Rhino WIP for Windows
Draw shaded meshes and surfaces
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ShadingEnabled { get; set; }
Public Property ShadingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace