RhinoCommon SDK
Rectangle3d.Area Property
Rhino WIP for Windows
 Gets the unsigned Area of the rectangle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
Property Value
Type: Double
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace