RhinoCommon SDK
ColorLCH.A Property
Rhino WIP for Windows
 Gets or sets the Alpha channel. The Alpha channel is limited to the 0~1 range.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double A { get; set; }
Public Property A As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace