RhinoCommon SDK
Quaternion.Identity Property
Rhino WIP for Windows
 Returns the (1,0,0,0) quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Quaternion Identity { get; }
Public Shared ReadOnly Property Identity As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace