RhinoCommon SDK
Decal.VectorAcross Property
 Gets the vector across. For cylindrical and spherical mapping, the vector is unitized.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d VectorAcross { get; }
Public ReadOnly Property VectorAcross As Vector3d
	Get
Property Value
Type: Vector3d
The 'across' vector of the decal. For planar mapping the length of the vector is relevant.
See Also
Reference
Decal Class
Rhino.Render Namespace