RhinoCommon SDK
Cylinder.Radius Property
Rhino WIP for Windows
 Gets or sets the radius of the cylinder.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace