RhinoCommon SDK
AreaMassProperties.WorldCoordinatesFirstMomentsError Property
Rhino WIP for Windows
 Uncertainty in world coordinates first moments calculation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d WorldCoordinatesFirstMomentsError { get; }
Public ReadOnly Property WorldCoordinatesFirstMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace