RhinoCommon SDK
DimensionStyle.ScaleLeftLengthMillimeters Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ScaleLeftLengthMillimeters"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ScaleLeftLengthMillimeters { get; set; }
Public Property ScaleLeftLengthMillimeters As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace