RhinoCommon SDK
DisplayModeDescription.ShadedPipelineRequired Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.ShadedPipelineRequired"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ShadedPipelineRequired { get; set; }
Public Property ShadedPipelineRequired As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace