RhinoCommon SDK
Vector3f.Unset Property
Rhino WIP for Windows
 Gets the value of the vector with each component set to RhinoMath.UnsetValue.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Vector3f Unset { get; }
Public Shared ReadOnly Property Unset As Vector3f
	Get
Property Value
Type: Vector3f
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace