RhinoCommon SDK
GetCancel.ProgressReporting Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCancel.ProgressReporting"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ProgressReporting { get; set; }
Public Property ProgressReporting As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace