RhinoCommon SDK
ModelComponent.IndexIsLocked Property
Rhino WIP for Windows
 Returns a value indicating whether the component Index is already locked.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IndexIsLocked { get; }
Public ReadOnly Property IndexIsLocked As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace