RhinoCommon SDK
Command.PlugIn Property
Rhino WIP for Windows
 Gets the plug-in where this commands is placed.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PlugIn PlugIn { get; }
Public ReadOnly Property PlugIn As PlugIn
	Get
Property Value
Type: PlugIn
See Also
Reference
Command Class
Rhino.Commands Namespace