RhinoCommon SDK
LayerTableEventArgs.OldState Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.OldState"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Layer OldState { get; }
Public ReadOnly Property OldState As Layer
	Get
Property Value
Type: Layer
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace