RhinoCommon SDK
ArcCurve.AngleDegrees Property
Rhino WIP for Windows
 Gets the angles of this arc in degrees.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double AngleDegrees { get; }
Public ReadOnly Property AngleDegrees As Double
	Get
Property Value
Type: Double
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace