RhinoCommon SDK
NurbsSurfaceKnotList.ClampedAtStart Property
Rhino WIP for Windows
Determines if a knot vector is clamped.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ClampedAtStart { get; }
Public ReadOnly Property ClampedAtStart As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace