RhinoCommon SDK
Quaternion.B Property
 Gets or sets the first imaginary coefficient of the quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double B { get; set; }
Public Property B As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace