RhinoCommon SDK
PanelIds.Texture Property
Rhino WIP for Windows
 Rhino texture panel
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid Texture { get; }
Public Shared ReadOnly Property Texture As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace