RhinoCommon SDK
Point2f.IsValid Property
Rhino WIP for Windows
 Gets a value indicating whether this point is considered valid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace