RhinoCommon SDK
RhinoViewport.Id Property
Rhino WIP for Windows
Unique id for this viewport.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace