RhinoCommon SDK
VolumeMassProperties.Centroid Property
Rhino WIP for Windows
 Gets the volume centroid in the world coordinate system.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Centroid { get; }
Public ReadOnly Property Centroid As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace