RhinoCommon SDK
ClassIdAttribute.Id Property
Rhino WIP for Windows
 Gets the associated style.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ClassIdAttribute Class
Rhino.DocObjects.Custom Namespace