RhinoCommon SDK
Linetype.IsDeleted Property
Rhino WIP for Windows
 Gets a value indicating whether this linetype has been deleted and is currently in the Undo buffer.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsDeleted { get; }
Public ReadOnly Property IsDeleted As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace