RhinoCommon SDK
Cone.BasePoint Property
Rhino WIP for Windows
Center of base circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d BasePoint { get; }
Public ReadOnly Property BasePoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Cone Structure
Rhino.Geometry Namespace