RhinoCommon SDK
PanelIds.Environment Property
 Rhino environment panel
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid Environment { get; }
Public Shared ReadOnly Property Environment As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace