RhinoCommon SDK
PointCloud.ContainsHiddenFlags Property
Rhino WIP for Windows
 Gets a value indicating whether or not the points in this pointcloud have hidden flags assigned to them.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ContainsHiddenFlags { get; }
Public ReadOnly Property ContainsHiddenFlags As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace