RhinoCommon SDK
File3dmSettings.PageRelativeTolerance Property
Rhino WIP for Windows
Gets or sets the page space relative tolerance.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double PageRelativeTolerance { get; set; }
Public Property PageRelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace