RhinoCommon SDK
UndoRedoEventArgs.IsBeginRecording Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsBeginRecording"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsBeginRecording { get; }
Public ReadOnly Property IsBeginRecording As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace