RhinoCommon SDK
RdkBreadCrumbViewModel.RenderContentCollectionSelectionReader Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkBreadCrumbViewModel.RenderContentCollectionSelectionReader"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ContentCollection RenderContentCollectionSelectionReader { get; }
Public ReadOnly Property RenderContentCollectionSelectionReader As ContentCollection
	Get
Property Value
Type: ContentCollection
See Also
Reference
RdkBreadCrumbViewModel Class
Rhino.UI.Controls Namespace