RhinoCommon SDK
HatchPattern.Defaults.Grid60 Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Grid60"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static HatchPattern Grid60 { get; }
Public Shared ReadOnly Property Grid60 As HatchPattern
	Get
Property Value
Type: HatchPattern
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace