RhinoCommon SDK
TextEntity.MaskOffset Property
Rhino WIP for Windows
 Offset for the border around text of the rectangle used to draw the mask. This value multiplied by TextHeight is the offset on each side of the tight rectangle around the text characters to the mask rectangle. The default value is 0.1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double MaskOffset { get; set; }
Public Property MaskOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace