RhinoCommon SDK
FileObjWriteOptions.ExportOpenMeshes Property
Rhino WIP for Windows
 Enable/Disable bailing when an open mesh is encountered.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ExportOpenMeshes { get; set; }
Public Property ExportOpenMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace