RhinoCommon SDK
RenderContentSerializer.ContentType Property
 Type of content created when importing or exporting this file type.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderContentKind ContentType { get; }
Public ReadOnly Property ContentType As RenderContentKind
	Get
Property Value
Type: RenderContentKind
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace