RhinoCommon SDK
MeshFaceList.QuadCount Property
Rhino WIP for Windows
 Gets the number of faces that are quads (4 corners).
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int QuadCount { get; }
Public ReadOnly Property QuadCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace