RhinoCommon SDK
DimensionStyle.LeaderHorizontalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderHorizontalAlignment"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.HorizontalAlignment LeaderHorizontalAlignment { get; set; }
Public Property LeaderHorizontalAlignment As DimensionStyle.HorizontalAlignment
	Get
	Set
Property Value
Type: DimensionStyle.HorizontalAlignment
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace