RhinoCommon SDK
StackedDialogPage.Handle Property
Rhino WIP for Windows
 When running on Windows return the window handle for the parent of this page otherwise; return IntPtr.Zero.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IntPtr Handle { get; }
Public ReadOnly Property Handle As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace