RhinoCommon SDK
ComponentStatus.Clear Property
Rhino WIP for Windows
 This is the default value and equal to undefined.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static ComponentStatus Clear { get; }
Public Shared ReadOnly Property Clear As ComponentStatus
	Get
Property Value
Type: ComponentStatus
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace