RhinoCommon SDK
TwoColorRenderTexture.SuperSample Property
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.SuperSample"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SuperSample { get; set; }
Public Property SuperSample As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace