RhinoCommon SDK
DetailView.PageToModelRatio Property
Rhino WIP for Windows
 Gets the page units/model units quotient.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double PageToModelRatio { get; }
Public ReadOnly Property PageToModelRatio As Double
	Get
Property Value
Type: Double
See Also
Reference
DetailView Class
Rhino.Geometry Namespace