RhinoCommon SDK
V6Dimension.UseDefaultTextPoint Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.V6Dimension.UseDefaultTextPoint"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool UseDefaultTextPoint { get; set; }
Public Property UseDefaultTextPoint As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
V6Dimension Class
Rhino.Geometry Namespace