RhinoCommon SDK
ObjectEnumeratorSettings.LockedObjects Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.LockedObjects"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool LockedObjects { get; set; }
Public Property LockedObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace