RhinoCommon SDK
RdkThumbnaillistViewModel.RenderContentCollectionReader Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkThumbnaillistViewModel.RenderContentCollectionReader"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ContentCollection RenderContentCollectionReader { get; }
Public ReadOnly Property RenderContentCollectionReader As ContentCollection
	Get
Property Value
Type: ContentCollection
See Also
Reference
RdkThumbnaillistViewModel Class
Rhino.UI.Controls Namespace