RhinoCommon SDK
Dithering.Method Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.Dithering.Method"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Dithering.Methods Method { get; set; }
Public Property Method As Dithering.Methods
	Get
	Set
Property Value
Type: Dithering.Methods
See Also
Reference
Dithering Class
Rhino.Render Namespace