RhinoCommon SDK
BrepLoop.Brep Property
Rhino WIP for Windows
 Gets the Brep that owns this loop.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace