RhinoCommon SDK
OptionToggle.InitialValue Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionToggle.InitialValue"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool InitialValue { get; }
Public ReadOnly Property InitialValue As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
OptionToggle Class
Rhino.Input.Custom Namespace