RhinoCommon SDK
TwoColorRenderTexture.Color2 Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.Color2"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color4f Color2 { get; set; }
Public Property Color2 As Color4f
	Get
	Set
Property Value
Type: Color4f
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace