RhinoCommon SDK
BoundingBox.Max Property
Rhino WIP for Windows
 Gets or sets the point in the maximal corner.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Max { get; set; }
Public Property Max As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace