RhinoCommon SDK
V6Dimension.Plane Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Dimension.Plane"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
V6Dimension Class
Rhino.Geometry Namespace