RhinoCommon SDK
StringParserSettings.ParseArcDegreesMinutesSeconds Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseArcDegreesMinutesSeconds"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ParseArcDegreesMinutesSeconds { get; set; }
Public Property ParseArcDegreesMinutesSeconds As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace