RhinoCommon SDK
HiddenLineDrawingObjectCurve.OriginalDomainStart Property
Rhino WIP for Windows
 Initialized to RhinoMath.UnsetValue. Valid if the full curve is closed. Rejoin can reparmeterize the curve by moving the seam. When this has been done the original domain start is stored here.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double OriginalDomainStart { get; }
Public ReadOnly Property OriginalDomainStart As Double
	Get
Property Value
Type: Double
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace