RhinoCommon SDK
File3dmLayerTable.ComponentType Property
Rhino WIP for Windows
 Returns Layer.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
See Also
Reference
File3dmLayerTable Class
Rhino.FileIO Namespace