RhinoCommon SDK
Matrix.IsColumnOrthogonal Property
Rhino WIP for Windows
 Gets a value indicating whether the matrix is column orthogonal.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsColumnOrthogonal { get; }
Public ReadOnly Property IsColumnOrthogonal As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Matrix Class
Rhino.Geometry Namespace