RhinoCommon SDK
MeshFaceList.Count Property
Rhino WIP for Windows
 Gets or sets the number of mesh faces.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; set; }
Public Property Count As Integer
	Get
	Set
Property Value
Type: Int32
Implements
IResizableList<T>.Count
ICollection<T>.Count
ICollection.Count
IReadOnlyCollection<T>.Count
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace