RhinoCommon SDK
Hatch.PatternScale Property
 Gets or sets the scaling factor of the pattern.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double PatternScale { get; set; }
Public Property PatternScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Hatch Class
Rhino.Geometry Namespace