RhinoCommon SDK
Sun.Latitude Property
[Missing <summary> documentation for "P:Rhino.Render.Sun.Latitude"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Latitude { get; }
Public ReadOnly Property Latitude As Double
	Get
Property Value
Type: Double
See Also
Reference
Sun Class
Rhino.Render Namespace