RhinoCommon SDK
MaterialRef.BackFaceMaterialId Property
Rhino WIP for Windows
 The Id of the Material used to render the back of an object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid BackFaceMaterialId { get; }
Public ReadOnly Property BackFaceMaterialId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace