RhinoCommon SDK
BreadCrumbImpl.ViewModel Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.BreadCrumbImpl.ViewModel"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RdkBreadCrumbViewModel ViewModel { get; }
Public ReadOnly Property ViewModel As RdkBreadCrumbViewModel
	Get
Property Value
Type: RdkBreadCrumbViewModel
See Also
Reference
BreadCrumbImpl Class
Rhino.UI.Controls Namespace