RhinoCommon SDK
DisplayPipelineAttributes.DisableConduits Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.DisableConduits"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool DisableConduits { get; set; }
Public Property DisableConduits As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace