RhinoCommon SDK
Box.Y Property
Rhino WIP for Windows
 Gets or sets the Interval that describes the dimension of the Box along the orientation plane Y-Axis. Otherwise known as the Depth of the Box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Interval Y { get; set; }
Public Property Y As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
Box Structure
Rhino.Geometry Namespace