RhinoCommon SDK
FileReadOptions.ImportReferenceMode Property
Rhino WIP for Windows
 true means we are reading information for a work session reference model or a linked instance definition.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ImportReferenceMode { get; set; }
Public Property ImportReferenceMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace