RhinoCommon SDK
RenderPropertyChangedEvent.Document Property
 The document triggering the event.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RenderPropertyChangedEvent Class
Rhino.Render Namespace