RhinoCommon SDK
MeshVertexColorList.Item Property
Rhino WIP for Windows
 Gets or sets the vertex color at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Color
	Get
	Set
Parameters
index
Type: System.Int32
Index of vertex control to access.
Return Value
Type: Color
The vertex color at [index].
Implements
IList<T>.Item[Int32]
IReadOnlyList<T>.Item[Int32]
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace