RhinoCommon SDK
ICommonComponentTable<T>.ComponentType Property
Rhino WIP for Windows
 Returns the model component type the table handles.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
ModelComponentType ComponentType { get; }
ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
ICommonComponentTable<T> Interface
Rhino.FileIO Namespace