RhinoCommon SDK
ViewInfo.Name Property
 Gets or sets the name of the NamedView.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace