RhinoCommon SDK
CreatePreviewEventArgs.Id Property
Unique Id for this scene.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Id { get; }
Public ReadOnly Property Id As Integer
	Get
Property Value
Type: Int32
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace