RhinoCommon SDK
File3dmObject.Attributes Property
Rhino WIP for Windows
 Gets the attributes that are linked with this document object.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ObjectAttributes Attributes { get; }
Public ReadOnly Property Attributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace