RhinoCommon SDK
IBreadCrumb.Height Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.IBreadCrumb.Height"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
int Height { get; }
ReadOnly Property Height As Integer
	Get
Property Value
Type: Int32
See Also
Reference
IBreadCrumb Interface
Rhino.UI.Controls Namespace