RhinoCommon SDK
StringParserSettings.ParseIntegerDashFraction Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseIntegerDashFraction"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ParseIntegerDashFraction { get; set; }
Public Property ParseIntegerDashFraction As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace