RhinoCommon SDK
File3dmSettings.ModelUrl Property
Rhino WIP for Windows
 Gets or sets a Uniform Resource Locator (URL) direction for the model.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string ModelUrl { get; set; }
Public Property ModelUrl As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace