RhinoCommon SDK
Brep.Edges Property
Rhino WIP for Windows
 Gets the brep edges list accessor.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BrepEdgeList Edges { get; }
Public ReadOnly Property Edges As BrepEdgeList
	Get
Property Value
Type: BrepEdgeList
See Also
Reference
Brep Class
Rhino.Geometry Namespace