RhinoCommon SDK
File3dm.Settings Property
Rhino WIP for Windows
 Settings include tolerance, and unit system, and defaults used for creating views and objects.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public File3dmSettings Settings { get; }
Public ReadOnly Property Settings As File3dmSettings
	Get
Property Value
Type: File3dmSettings
See Also
Reference
File3dm Class
Rhino.FileIO Namespace