RhinoCommon SDK
ImageFileEventArgs.SessionId Property
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.SessionId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid SessionId { get; }
Public ReadOnly Property SessionId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace