RhinoCommon SDK
NameHash.MappedCodePoints Property
 Gets the length of ordinal minimum mapped unicode (UTF-32) code points.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public uint MappedCodePoints { get; }
Public ReadOnly Property MappedCodePoints As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
NameHash Class
Rhino.FileIO Namespace