RhinoCommon SDK
GumballAppearanceSettings.ColorMenuButton Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballAppearanceSettings.ColorMenuButton"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color ColorMenuButton { get; set; }
Public Property ColorMenuButton As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace