RhinoCommon SDK
GuidField.Value Property
 Gets or sets the field value
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Value { get; set; }
Public Property Value As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
GuidField Class
Rhino.Render.Fields Namespace