RhinoCommon SDK
Transform.M22 Property
Gets or sets this[2,2].
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double M22 { get; set; }
Public Property M22 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform Structure
Rhino.Geometry Namespace