RhinoCommon SDK
RenderContentCollection.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentCollection.CppPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace