RhinoCommon SDK
Box.Center Property
 Gets the point that is in the center of the box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Center { get; }
Public ReadOnly Property Center As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Box Structure
Rhino.Geometry Namespace