RhinoCommon SDK
GumballAppearanceSettings.ScaleZEnabled Property
Rhino WIP for Windows
 When ScaleZEnabled is true, the Z scale control is available. The default setting is true.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ScaleZEnabled { get; set; }
Public Property ScaleZEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace