RhinoCommon SDK
Point3f.IsValid Property
Rhino WIP for Windows
 Each coordinate of the point must pass the IsValidSingle(Single) test.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace