RhinoCommon SDK
Point3f.Origin Property
Rhino WIP for Windows
 Gets the value of a point at location 0,0,0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Point3f Origin { get; }
Public Shared ReadOnly Property Origin As Point3f
	Get
Property Value
Type: Point3f
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace