RhinoCommon SDK
RhinoObject.Document Property
Rhino WIP for Windows
 Gets the document that owns this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace