RhinoCommon SDK
RenderContentSerializer.FileExtension Property
Rhino WIP for Windows
 File extension associated with this serialize object
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string FileExtension { get; }
Public ReadOnly Property FileExtension As String
	Get
Property Value
Type: String
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace