RhinoCommon SDK
File3dm.StartSectionComments Property
Rhino WIP for Windows
 Gets or sets the start section comments, which are the comments with which the 3dm file begins.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string StartSectionComments { get; set; }
Public Property StartSectionComments As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dm Class
Rhino.FileIO Namespace