RhinoCommon SDK
CommonComponentTable<T>.Count Property
Rhino WIP for Windows
 Returns the count of all items, including deleted ones.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual int Count { get; }
Public Overridable ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
IReadOnlyCollection<T>.Count
ICollection<T>.Count
See Also
Reference
CommonComponentTable<T> Class
Rhino.FileIO Namespace