RhinoCommon SDK
PanelIds.Notes Property
Rhino WIP for Windows
 Rhino notes panel
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid Notes { get; }
Public Shared ReadOnly Property Notes As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace