RhinoCommon SDK
Quaternion.I Property
Rhino WIP for Windows
 Returns the (0,1,0,0) quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Quaternion I { get; }
Public Shared ReadOnly Property I As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace