RhinoCommon SDK
File3dm.Views Property
Rhino WIP for Windows
 Views that represent the RhinoViews which are displayed when Rhino loads this file
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IList<ViewInfo> Views { get; }
Public ReadOnly Property Views As IList(Of ViewInfo)
	Get
Property Value
Type: IList<ViewInfo>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace