RhinoCommon SDK
Layer.SortIndex Property
 Runtime index used to sort layers in layer dialog.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int SortIndex { get; }
Public ReadOnly Property SortIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Layer Class
Rhino.DocObjects Namespace