RhinoCommon SDK
RuiUpdateUi.MenuIndex Property
Zero based index of item in the Windows menu
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int MenuIndex { get; }
Public ReadOnly Property MenuIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace