RhinoCommon SDK
Transform.M32 Property
Gets or sets this[3,2].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double M32 { get; set; }
Public Property M32 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform Structure
Rhino.Geometry Namespace