RhinoCommon SDK
ComponentStatus.IsDamaged Property
Rhino WIP for Windows
 Returns false if component is not damaged. True otherwise.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsDamaged { get; }
Public ReadOnly Property IsDamaged As Boolean
	Get
Return Value
Type: Boolean
The component status for damaged.
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace