RhinoCommon SDK
RhinoViewport.WallpaperGrayscale Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.WallpaperGrayscale"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool WallpaperGrayscale { get; }
Public ReadOnly Property WallpaperGrayscale As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace