RhinoCommon SDK
V6RadialDimension.RadiusPoint Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.V6RadialDimension.RadiusPoint"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d RadiusPoint { get; set; }
Public Property RadiusPoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
V6RadialDimension Class
Rhino.Geometry Namespace