RhinoCommon SDK
DisplayMaterial.BackShine Property
Rhino WIP for Windows
 Gets or sets the shine factor of the back side of the material (0.0 to 1.0)
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double BackShine { get; set; }
Public Property BackShine As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace