RhinoCommon SDK
StringParserSettings.ParseSurveyorsNotation Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseSurveyorsNotation"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ParseSurveyorsNotation { get; set; }
Public Property ParseSurveyorsNotation As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace