RhinoCommon SDK
RenderPrimitive.InstanceTransform Property
 Instance reference transform or Identity if not an instance reference.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform InstanceTransform { get; }
Public ReadOnly Property InstanceTransform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace