RhinoCommon SDK
RdkBreadCrumbViewModel.Selected Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkBreadCrumbViewModel.Selected"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public List<Guid> Selected { set; }
Public WriteOnly Property Selected As List(Of Guid)
	Set
Property Value
Type: List<Guid>
See Also
Reference
RdkBreadCrumbViewModel Class
Rhino.UI.Controls Namespace