RhinoCommon SDK
FileWriteOptions.WriteAsTemplate Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.WriteAsTemplate"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool WriteAsTemplate { get; }
Public ReadOnly Property WriteAsTemplate As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace