RhinoCommon SDK
ReduceMeshParameters.AllowDistortion Property
Rhino WIP for Windows
If true mesh appearance is not changed even if the target polygon count is not reached
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool AllowDistortion { get; set; }
Public Property AllowDistortion As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace