RhinoCommon SDK
Light.IsLinearLight Property
Rhino WIP for Windows
 Gets a value indicating whether the light style is LightStyle WorldLinear.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsLinearLight { get; }
Public ReadOnly Property IsLinearLight As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Light Class
Rhino.Geometry Namespace