RhinoCommon SDK
ViewportInfo.FrustumTop Property
Rhino WIP for Windows
 Gets the frustum top value. This is -bottom if the frustum has a horizontal symmetry axis.
This number is usually positive.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FrustumTop { get; }
Public ReadOnly Property FrustumTop As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace