RhinoCommon SDK
InstanceDefinition.Id Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.Id"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override Guid Id { get; }
Public Overrides ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace