RhinoCommon SDK
FileObjReadOptions.Split32BitTextures Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjReadOptions.Split32BitTextures"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Split32BitTextures { get; set; }
Public Property Split32BitTextures As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace