RhinoCommon SDK
SurfaceCurvature.UVPoint Property
 Gets the UV location where the curvature was computed.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d UVPoint { get; }
Public ReadOnly Property UVPoint As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace