RhinoCommon SDK
RuiUpdateUi.Checked Property
Set to true to enable menu item or false to check menu item
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Checked { get; set; }
Public Property Checked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace