RhinoCommon SDK
GetPointDrawEventArgs.CurrentPoint Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointDrawEventArgs.CurrentPoint"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d CurrentPoint { get; }
Public ReadOnly Property CurrentPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
GetPointDrawEventArgs Class
Rhino.Input.Custom Namespace