RhinoCommon SDK
Point.Location Property
Rhino WIP for Windows
 Gets or sets the location (position) of this point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Location { get; set; }
Public Property Location As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Point Class
Rhino.Geometry Namespace