RhinoCommon SDK
GetColorEventArgs.IncludeButtonColors Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.GetColorEventArgs.IncludeButtonColors"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IncludeButtonColors { get; }
Public ReadOnly Property IncludeButtonColors As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace