RhinoCommon SDK
DisplayModeDescription.InMenu Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.InMenu"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool InMenu { get; set; }
Public Property InMenu As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace