RhinoCommon SDK
RhinoViewport.Bounds Property
Rhino WIP for Windows
 Gets the size and location of the viewport, in pixels, relative to the parent view.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Rectangle Bounds { get; }
Public ReadOnly Property Bounds As Rectangle
	Get
Property Value
Type: Rectangle
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace