RhinoCommon SDK
Arc.StartAngle Property
Rhino WIP for Windows
 Gets or sets the start angle (in Radians) for this arc segment.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double StartAngle { get; set; }
Public Property StartAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Arc Structure
Rhino.Geometry Namespace