RhinoCommon SDK
CreatePreviewEventArgs.Cancel Property
Rhino WIP for Windows
 Get set by Rhino if the preview generation should be canceled for this
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Cancel { get; }
Public ReadOnly Property Cancel As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace