RhinoCommon SDK
Utilities.ShowIncompatibleEnvironments Property
 Specifies whether incompatible content should be shown in the corresponding editor.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static bool ShowIncompatibleEnvironments { get; set; }
Public Shared Property ShowIncompatibleEnvironments As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Utilities Class
Rhino.Render Namespace