RhinoCommon SDK
DecalCreateParams.DecalMapping Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.DecalMapping"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DecalMapping DecalMapping { get; set; }
Public Property DecalMapping As DecalMapping
	Get
	Set
Property Value
Type: DecalMapping
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace