RhinoCommon SDK
Cylinder.Center Property
Rhino WIP for Windows
 Gets the center point of the defining circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Center { get; }
Public ReadOnly Property Center As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace