RhinoCommon SDK
PanelIds.Rendering Property
 Rhino rendering properties panel
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid Rendering { get; }
Public Shared ReadOnly Property Rendering As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace