RhinoCommon SDK
MeshNgon.BoundaryVertexCount Property
Rhino WIP for Windows
 Get the number of vertices in this ngon.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int BoundaryVertexCount { get; }
Public ReadOnly Property BoundaryVertexCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace