RhinoCommon SDK
FileObjWriteOptions.ExportTcs Property
Rhino WIP for Windows
 Enable/disable export of texture coordinates, if they exist.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ExportTcs { get; set; }
Public Property ExportTcs As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace