RhinoCommon SDK
GetPointMouseEventArgs.Viewport Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.Viewport"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace