RhinoCommon SDK
InstanceDefinitionGeometry.Name Property
Rhino WIP for Windows
 Gets or sets the name of the definition.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string Name { get; set; }
Public Overrides Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace