RhinoCommon SDK
IntersectionEvent.PointA Property
Rhino WIP for Windows
 Gets the point on Curve A where the intersection occured. If the intersection type is overlap, then this will return the start of the overlap region.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d PointA { get; }
Public ReadOnly Property PointA As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace