RhinoCommon SDK
PolyCurve.HasGap Property
Rhino WIP for Windows
 This is a quick way to see if the curve has gaps between the sub curve segments.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool HasGap { get; }
Public ReadOnly Property HasGap As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace