RhinoCommon SDK
Brep.Trims Property
Rhino WIP for Windows
 Gets the brep trims list accessor.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BrepTrimList Trims { get; }
Public ReadOnly Property Trims As BrepTrimList
	Get
Property Value
Type: BrepTrimList
See Also
Reference
Brep Class
Rhino.Geometry Namespace