RhinoCommon SDK
GetCircle.DeformablePointCount Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCircle.DeformablePointCount"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int DeformablePointCount { get; set; }
Public Property DeformablePointCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace