RhinoCommon SDK
File3dmSettings.ModelRelativeTolerance Property
Rhino WIP for Windows
Gets or sets the model space relative tolerance.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ModelRelativeTolerance { get; set; }
Public Property ModelRelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace