RhinoCommon SDK
Layer.IsExpanded Property
Rhino WIP for Windows
 Gets or sets a value indicating whether this layer is expanded in the Rhino Layer dialog.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsExpanded { get; set; }
Public Property IsExpanded As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace