RhinoCommon SDK
HatchPattern.FillType Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.FillType"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public HatchPatternFillType FillType { get; set; }
Public Property FillType As HatchPatternFillType
	Get
	Set
Property Value
Type: HatchPatternFillType
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace