RhinoCommon SDK
Quaternion.D Property
 Gets or sets the third imaginary coefficient of the quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double D { get; set; }
Public Property D As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace