RhinoCommon SDK
V6AngularDimension.DefPoint2 Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.V6AngularDimension.DefPoint2"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d DefPoint2 { get; set; }
Public Property DefPoint2 As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
V6AngularDimension Class
Rhino.Geometry Namespace