RhinoCommon SDK
BrepEdge.EdgeCurve Property
Rhino WIP for Windows
 Get the brep.Curves3D[] 3d curve geometry used by this edge or null.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve EdgeCurve { get; }
Public ReadOnly Property EdgeCurve As Curve
	Get
Property Value
Type: Curve
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace