RhinoCommon SDK
Point3f.Unset Property
Rhino WIP for Windows
 Gets the value of a point at location RhinoMath.UnsetValue,RhinoMath.UnsetValue,RhinoMath.UnsetValue.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Point3f Unset { get; }
Public Shared ReadOnly Property Unset As Point3f
	Get
Property Value
Type: Point3f
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace