RhinoCommon SDK
GetLine.FixedLength Property
Rhino WIP for Windows
 If FixedLength > 0, the line must have the specified length
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FixedLength { get; set; }
Public Property FixedLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace