RhinoCommon SDK
GumballAppearanceSettings.ArcThickness Property
in pixels.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int ArcThickness { get; set; }
Public Property ArcThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace