RhinoCommon SDK
Quaternion.Scalar Property
Rhino WIP for Windows
 The real (scalar) part of the quaternion
This is A.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Scalar { get; }
Public ReadOnly Property Scalar As Double
	Get
Property Value
Type: Double
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace