RhinoCommon SDK
MeshingParameters.GridAspectRatio Property
Rhino WIP for Windows
 Gets or sets the maximum allowed aspect ratio of sampling quads.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double GridAspectRatio { get; set; }
Public Property GridAspectRatio As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace