RhinoCommon SDK
PointCloudItem.Hidden Property
 Gets or sets the hidden flag of this point cloud item.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Hidden { get; set; }
Public Property Hidden As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace