RhinoCommon SDK
HiddenLineDrawingObjectCurve.IsProjecting Property
Rhino WIP for Windows
 Returns true if all the non clipped portions of this curve are projecting.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsProjecting { get; }
Public ReadOnly Property IsProjecting As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace