RhinoCommon SDK
ParticleSystem.BoundingBox Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.ParticleSystem.BoundingBox"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace