RhinoCommon SDK
DimensionStyle.ToleranceFormat Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ToleranceFormat"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.ToleranceDisplayFormat ToleranceFormat { get; set; }
Public Property ToleranceFormat As DimensionStyle.ToleranceDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.ToleranceDisplayFormat
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace