RhinoCommon SDK
Material.RenderMaterial Property
Rhino WIP for Windows
 Get the RenderMaterial related to this Material. Will create a new RenderMaterial if none exists. This can happen for older documents.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderMaterial RenderMaterial { get; }
Public ReadOnly Property RenderMaterial As RenderMaterial
	Get
Property Value
Type: RenderMaterial
See Also
Reference
Material Class
Rhino.DocObjects Namespace