RhinoCommon SDK
IThumbnailList.Hidden Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IThumbnailList.Hidden"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
bool Hidden { get; }
ReadOnly Property Hidden As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
IThumbnailList Interface
Rhino.UI.Controls Namespace