RhinoCommon SDK
DateTimeField.Value Property
Rhino WIP for Windows
 Gets or sets the field value
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DateTime Value { get; set; }
Public Property Value As DateTime
	Get
	Set
Property Value
Type: DateTime
See Also
Reference
DateTimeField Class
Rhino.Render.Fields Namespace