RhinoCommon SDK
SweepTwoRail.AngleToleranceRadians Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.SweepTwoRail.AngleToleranceRadians"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double AngleToleranceRadians { get; set; }
Public Property AngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace