RhinoCommon SDK
RhinoViewport.CameraZ Property
Gets the unit vector in CameraDirection.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d CameraZ { get; }
Public ReadOnly Property CameraZ As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace