RhinoCommon SDK
ReplayHistoryData.Document Property
Rhino WIP for Windows
The document this record belongs to
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace