RhinoCommon SDK
GetPolyline.MinPointCount Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPolyline.MinPointCount"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int MinPointCount { get; set; }
Public Property MinPointCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace