RhinoCommon SDK
V6RadialDimension.CenterPoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6RadialDimension.CenterPoint"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d CenterPoint { get; set; }
Public Property CenterPoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
V6RadialDimension Class
Rhino.Geometry Namespace