RhinoCommon SDK
DisplayPipelineAttributes.ViewDisplayAttributes.DrawTransparentGridPlane Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes.DrawTransparentGridPlane"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool DrawTransparentGridPlane { get; set; }
Public Property DrawTransparentGridPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace