RhinoCommon SDK
Line.Unset Property
 Gets a line segment which has Unset end points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Line Unset { get; }
Public Shared ReadOnly Property Unset As Line
	Get
Property Value
Type: Line
See Also
Reference
Line Structure
Rhino.Geometry Namespace