RhinoCommon SDK
Vector2d.X Property
Rhino WIP for Windows
 Gets or sets the X (first) component of this vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace