RhinoCommon SDK
RuiUpdateUi.Enabled Property
Set to true to enable menu item or false to disable menu item
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace