RhinoCommon SDK
File3dmSettings.PageAngleToleranceDegrees Property
Rhino WIP for Windows
Gets or sets the page space angle tolerance.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double PageAngleToleranceDegrees { get; set; }
Public Property PageAngleToleranceDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace