RhinoCommon SDK
RenderMaterial.SmellsLikeGem Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeGem"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SmellsLikeGem { get; }
Public ReadOnly Property SmellsLikeGem As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace