RhinoCommon SDK
ContentEditingContext.CppPointer Property
Rhino WIP for Windows
 ContextEditingContext c++ pointer
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
ContentEditingContext Class
Rhino.Render Namespace