RhinoCommon SDK
ConstructionPlane.ThinLineColor Property
Rhino WIP for Windows
 Gets or sets the color of the thinner, less prominent line.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color ThinLineColor { get; set; }
Public Property ThinLineColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace