RhinoCommon SDK
ClippingPlaneObject.ClippingPlaneGeometry Property
Rhino WIP for Windows
 Gets the clipping plane surface.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ClippingPlaneSurface ClippingPlaneGeometry { get; }
Public ReadOnly Property ClippingPlaneGeometry As ClippingPlaneSurface
	Get
Property Value
Type: ClippingPlaneSurface
See Also
Reference
ClippingPlaneObject Class
Rhino.DocObjects Namespace