RhinoCommon SDK
LightObject.ComponentType Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.LightObject.ComponentType"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace