RhinoCommon SDK
City.TimeZone Property
 Gets time zone of city.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TimeZone { get; }
Public ReadOnly Property TimeZone As Double
	Get
Property Value
Type: Double
See Also
Reference
City Class
Rhino.Render Namespace