RhinoCommon SDK
Material.IsDefaultMaterial Property
Rhino WIP for Windows
 By default Rhino layers and objects are assigned the default rendering material.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsDefaultMaterial { get; }
Public ReadOnly Property IsDefaultMaterial As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Material Class
Rhino.DocObjects Namespace