RhinoCommon SDK
RhinoViewport.Camera35mmLensLength Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.Camera35mmLensLength"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Camera35mmLensLength { get; set; }
Public Property Camera35mmLensLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace