RhinoCommon SDK
Cylinder.Unset Property
Rhino WIP for Windows
 Gets an invalid Cylinder.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Cylinder Unset { get; }
Public Shared ReadOnly Property Unset As Cylinder
	Get
Property Value
Type: Cylinder
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace