RhinoCommon SDK
Cylinder.Height2 Property
 Gets or sets the end height of the cylinder. If the end height equals the start height, the cylinder is presumed to be infinite.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Height2 { get; set; }
Public Property Height2 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace