RhinoCommon SDK
Surface.IsSolid Property
Rhino WIP for Windows
 Gets a values indicating whether a surface is solid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool IsSolid { get; }
Public Overridable ReadOnly Property IsSolid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Surface Class
Rhino.Geometry Namespace