RhinoCommon SDK
SaveFileDialog.Title Property
Rhino WIP for Windows
 Gets or sets the file dialog box title.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Title { get; set; }
Public Property Title As String
	Get
	Set
Property Value
Type: String
See Also
Reference
SaveFileDialog Class
Rhino.UI Namespace