RhinoCommon SDK
MaterialRefs.IsReadOnly Property
Rhino WIP for Windows
 IDictionary required property, always returns false for this dictionary.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsReadOnly { get; }
Public ReadOnly Property IsReadOnly As Boolean
	Get
Property Value
Type: Boolean
Implements
ICollection<T>.IsReadOnly
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace