RhinoCommon SDK
AreaMassProperties.WorldCoordinatesProductMomentsError Property
Rhino WIP for Windows
 Uncertainty in world coordinates second moments calculation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d WorldCoordinatesProductMomentsError { get; }
Public ReadOnly Property WorldCoordinatesProductMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace