RhinoCommon SDK
Curve.PointAtStart Property
 Evaluates point at the start of the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d PointAtStart { get; }
Public ReadOnly Property PointAtStart As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Curve Class
Rhino.Geometry Namespace