RhinoCommon SDK
Box.Plane Property
 Gets or sets the orientation plane for this Box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Box Structure
Rhino.Geometry Namespace