RhinoCommon SDK
ComponentStatus.AllSet Property
Rhino WIP for Windows
 All flags are checked.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static ComponentStatus AllSet { get; }
Public Shared ReadOnly Property AllSet As ComponentStatus
	Get
Property Value
Type: ComponentStatus
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace