RhinoCommon SDK
Curve.IsClosed Property
Rhino WIP for Windows
 Gets a value indicating whether or not this curve is a closed curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsClosed { get; }
Public ReadOnly Property IsClosed As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Curve Class
Rhino.Geometry Namespace