RhinoCommon SDK
LinetypeTable.ComponentType Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LinetypeTable.ComponentType"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace