RhinoCommon SDK
MaterialRef.MaterialSource Property
Rhino WIP for Windows
 Determines if the simple material should come from the object or from it's layer.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ObjectMaterialSource MaterialSource { get; }
Public ReadOnly Property MaterialSource As ObjectMaterialSource
	Get
Property Value
Type: ObjectMaterialSource
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace