RhinoCommon SDK
MappingTag.MeshTransform Property
 Gets or sets a 4x4 matrix transform.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform MeshTransform { get; set; }
Public Property MeshTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
MappingTag Class
Rhino.Render Namespace