RhinoCommon SDK
ViewportInfo.FrustumBottom Property
Rhino WIP for Windows
 Gets the frustum bottom value. This is -top if the frustum has a horizontal symmetry axis.
This number is usually negative.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FrustumBottom { get; }
Public ReadOnly Property FrustumBottom As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace