RhinoCommon SDK
ObjectEnumeratorSettings.LayerIndexFilter Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.LayerIndexFilter"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int LayerIndexFilter { get; set; }
Public Property LayerIndexFilter As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace