RhinoCommon SDK
IThumbnailList.ViewModel Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.IThumbnailList.ViewModel"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
RdkThumbnaillistViewModel ViewModel { get; }
ReadOnly Property ViewModel As RdkThumbnaillistViewModel
	Get
Property Value
Type: RdkThumbnaillistViewModel
See Also
Reference
IThumbnailList Interface
Rhino.UI.Controls Namespace