RhinoCommon SDK
RdkBreadCrumbViewModel.Type Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkBreadCrumbViewModel.Type"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Type { get; set; }
Public Property Type As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RdkBreadCrumbViewModel Class
Rhino.UI.Controls Namespace