RhinoCommon SDK
File3dmObjectTable.Count Property
Rhino WIP for Windows
 Gets the number of File3dmObjects in this table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace