RhinoCommon SDK
ReplayHistoryResult.ExistingObject Property
Rhino WIP for Windows
 The previously existing object.
Do not attempt to edit this object. It might have been already deleted by, for example, dragging.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoObject ExistingObject { get; }
Public ReadOnly Property ExistingObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace