RhinoCommon SDK
InstanceDefinitionTable.Count Property
Rhino WIP for Windows
Number of items in the instance definitions table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int Count { get; }
Public Overrides ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
IReadOnlyCollection<T>.Count
ICollection<T>.Count
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace