RhinoCommon SDK
Line.To Property
 End point of line segment.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d To { get; set; }
Public Property To As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Line Structure
Rhino.Geometry Namespace