RhinoCommon SDK
BrepRegion.IsFinite Property
 Gets a value indicating whether this region is finite.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsFinite { get; }
Public ReadOnly Property IsFinite As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace