RhinoCommon SDK
BrepRegionFaceSide.Region Property
Rhino WIP for Windows
 The region this side belongs to.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BrepRegion Region { get; }
Public ReadOnly Property Region As BrepRegion
	Get
Property Value
Type: BrepRegion
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace