RhinoCommon SDK
Material.TransparentColor Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.TransparentColor"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color TransparentColor { get; set; }
Public Property TransparentColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Material Class
Rhino.DocObjects Namespace