RhinoCommon SDK
RichTextObject.TextGeometry Property
Rhino WIP for Windows
 Get the AnnotationText geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public AnnotationText TextGeometry { get; }
Public ReadOnly Property TextGeometry As AnnotationText
	Get
Property Value
Type: AnnotationText
See Also
Reference
RichTextObject Class
Rhino.DocObjects Namespace