RhinoCommon SDK
CommandEventArgs.CommandId Property
Rhino WIP for Windows
 Gets the ID of the command that raised this event.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid CommandId { get; }
Public ReadOnly Property CommandId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace