RhinoCommon SDK
MenuTaskOriginFactory.CEC Property
Rhino WIP for Windows
 Set the ContentEditingContext if the usercontrol has one
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ContentEditingContext CEC { set; }
Public WriteOnly Property CEC As ContentEditingContext
	Set
Property Value
Type: ContentEditingContext
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace