RhinoCommon SDK
DecalCreateParams.Radius Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.Radius"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace