RhinoCommon SDK
RdkBreadCrumbViewModel.Collection Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkBreadCrumbViewModel.Collection"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ObservableCollection<ThumbData> Collection { get; }
Public ReadOnly Property Collection As ObservableCollection(Of ThumbData)
	Get
Property Value
Type: ObservableCollection<ThumbData>
See Also
Reference
RdkBreadCrumbViewModel Class
Rhino.UI.Controls Namespace