RhinoCommon SDK
Ellipse.Plane Property
 Gets or sets the base plane of the ellipse.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace