RhinoCommon SDK
File3dm.LastEditedBy Property
Rhino WIP for Windows
 Gets a string that names the user who last edited the file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string LastEditedBy { get; }
Public ReadOnly Property LastEditedBy As String
	Get
Property Value
Type: String
See Also
Reference
File3dm Class
Rhino.FileIO Namespace