RhinoCommon SDK
File3dmSettings.ModelUnitSystem Property
Rhino WIP for Windows
 Gets or sets the model unit system, using UnitSystem enumeration.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public UnitSystem ModelUnitSystem { get; set; }
Public Property ModelUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace