RhinoCommon SDK
PanelIds.LightManager Property
 Rhino light manager panel
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid LightManager { get; }
Public Shared ReadOnly Property LightManager As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace