RhinoCommon SDK
MeshDisplacementInfo.FairingAmount Property
Rhino WIP for Windows
 Straightens rough feature edges. The value specifies the number of passes.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int FairingAmount { get; set; }
Public Property FairingAmount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace