RhinoCommon SDK
ParticleSystem.DisplaySizesInWorldUnits Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.ParticleSystem.DisplaySizesInWorldUnits"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool DisplaySizesInWorldUnits { get; set; }
Public Property DisplaySizesInWorldUnits As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace