RhinoCommon SDK
MenuTaskOriginFactory.OnItem Property
 Set OnItem to true to get menutaskorigin for on item clicked and set to false to get menutaskorigin for none selected item
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool OnItem { set; }
Public WriteOnly Property OnItem As Boolean
	Set
Property Value
Type: Boolean
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace