RhinoCommon SDK
LayerTableEventArgs.NewState Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.NewState"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Layer NewState { get; }
Public ReadOnly Property NewState As Layer
	Get
Property Value
Type: Layer
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace