RhinoCommon SDK
Sun.Enabled Property
Turn the sun on/off in this document.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Sun Class
Rhino.Render Namespace