RhinoCommon SDK
HiddenLineDrawingObjectCurve.IsValid Property
Rhino WIP for Windows
 Verifies the object is valid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace