RhinoCommon SDK
LeaderObject.LeaderGeometry Property
 Gets the leader geometry of this leader object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Leader LeaderGeometry { get; }
Public ReadOnly Property LeaderGeometry As Leader
	Get
Property Value
Type: Leader
See Also
Reference
LeaderObject Class
Rhino.DocObjects Namespace