RhinoCommon SDK
Matrix.IsRowOrthogonal Property
Rhino WIP for Windows
 Gets a value indicating whether the matrix is row orthogonal.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsRowOrthogonal { get; }
Public ReadOnly Property IsRowOrthogonal As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Matrix Class
Rhino.Geometry Namespace