RhinoCommon SDK
Quaternion.K Property
 Returns the (0,0,0,1) quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Quaternion K { get; }
Public Shared ReadOnly Property K As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace