RhinoCommon SDK
Layer.ComponentStatus Property
Rhino WIP for Windows
 Gets or sets the status of the layer.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override ComponentStatus ComponentStatus { get; set; }
Public Overrides Property ComponentStatus As ComponentStatus
	Get
	Set
Property Value
Type: ComponentStatus
See Also
Reference
Layer Class
Rhino.DocObjects Namespace