RhinoCommon SDK
RLeader.ContentType Property
Rhino WIP for Windows
 Type of annotation on the leader Currently only text
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.LeaderContentType ContentType { get; }
Public ReadOnly Property ContentType As DimensionStyle.LeaderContentType
	Get
Property Value
Type: DimensionStyle.LeaderContentType
See Also
Reference
RLeader Class
Rhino.Geometry Namespace