RhinoCommon SDK
SimulatedTexture.LocalMappingTransform Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.LocalMappingTransform"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform LocalMappingTransform { get; }
Public ReadOnly Property LocalMappingTransform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace