RhinoCommon SDK
RenderSettings.UseHiddenLights Property
Rhino WIP for Windows
 Gets or sets a value indicating whether to render using lights that are on layers that are off.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool UseHiddenLights { get; set; }
Public Property UseHiddenLights As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace