RhinoCommon SDK
ParticleSystem.DrawRequiresDepthSorting Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.ParticleSystem.DrawRequiresDepthSorting"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool DrawRequiresDepthSorting { get; set; }
Public Property DrawRequiresDepthSorting As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace