RhinoCommon SDK
Brep.Vertices Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.Brep.Vertices"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BrepVertexList Vertices { get; }
Public ReadOnly Property Vertices As BrepVertexList
	Get
Property Value
Type: BrepVertexList
See Also
Reference
Brep Class
Rhino.Geometry Namespace