RhinoCommon SDK
Material.ComponentType Property
Rhino WIP for Windows
 Returns RenderMaterial.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
Material Class
Rhino.DocObjects Namespace