RhinoCommon SDK
ViewportInfo.FrustumCenter Property
 Gets the frustum center point.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d FrustumCenter { get; }
Public ReadOnly Property FrustumCenter As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace