RhinoCommon SDK
Material.AmbientColor Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.AmbientColor"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color AmbientColor { get; set; }
Public Property AmbientColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Material Class
Rhino.DocObjects Namespace