RhinoCommon SDK
ObjectEnumeratorSettings.ActiveObjects Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.ActiveObjects"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ActiveObjects { get; set; }
Public Property ActiveObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace