RhinoCommon SDK
DisplayMaterial.Emission Property
Rhino WIP for Windows
 Gets or sets the Emissive color of the Material. The alpha component of the color will be ignored.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color Emission { get; set; }
Public Property Emission As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace