RhinoCommon SDK
LinearDimensionObject.DimensionStyle Property
 Gets the DimensionStyle associated with this LinearDimensionObject.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle DimensionStyle { get; }
Public ReadOnly Property DimensionStyle As DimensionStyle
	Get
Property Value
Type: DimensionStyle
See Also
Reference
LinearDimensionObject Class
Rhino.DocObjects Namespace