RhinoCommon SDK
ToolbarFile.Id Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFile.Id"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace