RhinoCommon SDK
RenderSettings.AntialiasLevel Property
Rhino WIP for Windows
 Gets or sets antialias level, used for render quality
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public AntialiasLevel AntialiasLevel { get; set; }
Public Property AntialiasLevel As AntialiasLevel
	Get
	Set
Property Value
Type: AntialiasLevel
See Also
Reference
RenderSettings Class
Rhino.Render Namespace