RhinoCommon SDK
DoubleField.Value Property
 Gets or sets the field value
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Value { get; set; }
Public Property Value As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DoubleField Class
Rhino.Render.Fields Namespace