RhinoCommon SDK
RenderWindow.SessionId Property
[Missing <summary> documentation for "P:Rhino.Render.RenderWindow.SessionId"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid SessionId { get; }
Public ReadOnly Property SessionId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RenderWindow Class
Rhino.Render Namespace