RhinoCommon SDK
Interval.Unset Property
 Gets an Interval whose limits are RhinoMath.UnsetValue.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Interval Unset { get; }
Public Shared ReadOnly Property Unset As Interval
	Get
Property Value
Type: Interval
See Also
Reference
Interval Structure
Rhino.Geometry Namespace