RhinoCommon SDK
IBreadCrumb.BackgroundColor Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.IBreadCrumb.BackgroundColor"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
Color BackgroundColor { get; set; }
Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
IBreadCrumb Interface
Rhino.UI.Controls Namespace