RhinoCommon SDK
V6RadialDimensionObject.DimRadialGeometry Property
 Get the dimension geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6RadialDimension DimRadialGeometry { get; set; }
Public Property DimRadialGeometry As V6RadialDimension
	Get
	Set
Property Value
Type: V6RadialDimension
See Also
Reference
V6RadialDimensionObject Class
Rhino.DocObjects Namespace