RhinoCommon SDK
GetTransform.Transform Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetTransform.Transform"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform Transform { get; set; }
Public Property Transform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace