RhinoCommon SDK
BrepLoopList.Count Property
Rhino WIP for Windows
 Gets the number of brep loops.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepLoopList Class
Rhino.Geometry.Collections Namespace