RhinoCommon SDK
Circle.Radius Property
 Gets or sets the radius of this circle. Radii should be positive values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Circle Structure
Rhino.Geometry Namespace