RhinoCommon SDK
Point3f.X Property
 Gets or sets the X (first) component of the vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public float X { get; set; }
Public Property X As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace