RhinoCommon SDK
V6AngularDimension.DimlinePoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6AngularDimension.DimlinePoint"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d DimlinePoint { get; set; }
Public Property DimlinePoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
V6AngularDimension Class
Rhino.Geometry Namespace