RhinoCommon SDK
MeshFace.Unset Property
Rhino WIP for Windows
 Gets an Unset MeshFace. Unset faces have Int32.MinValue for all corner indices.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static MeshFace Unset { get; }
Public Shared ReadOnly Property Unset As MeshFace
	Get
Property Value
Type: MeshFace
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace