RhinoCommon SDK
CullObjectEventArgs.CullObject Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.CullObjectEventArgs.CullObject"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool CullObject { get; set; }
Public Property CullObject As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CullObjectEventArgs Class
Rhino.Display Namespace