RhinoCommon SDK
V6AngularDimensionObject.DimAngularGeometry Property
 Get the dimension geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6AngularDimension DimAngularGeometry { get; set; }
Public Property DimAngularGeometry As V6AngularDimension
	Get
	Set
Property Value
Type: V6AngularDimension
See Also
Reference
V6AngularDimensionObject Class
Rhino.DocObjects Namespace