RhinoCommon SDK
HatchPattern.Description Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Description"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace