RhinoCommon SDK
RuiUpdateUi.RadioChecked Property
Rhino WIP for Windows
Set to true to enable menu item or false to check menu item
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool RadioChecked { get; set; }
Public Property RadioChecked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace