RhinoCommon SDK
RhinoTransformObjectsEventArgs.Objects Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoTransformObjectsEventArgs.Objects"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoObject[] Objects { get; }
Public ReadOnly Property Objects As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace