RhinoCommon SDK
TextEntity.MaskEnabled Property
 Determines whether or not to draw a Text Mask
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool MaskEnabled { get; set; }
Public Property MaskEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace