RhinoCommon SDK
StringParserSettings.ParseDAsExponentInScientificENotation Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseDAsExponentInScientificENotation"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ParseDAsExponentInScientificENotation { get; set; }
Public Property ParseDAsExponentInScientificENotation As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace