RhinoCommon SDK
FileWriteOptions.WriteUserData Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.WriteUserData"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool WriteUserData { get; set; }
Public Property WriteUserData As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace