RhinoCommon SDK
RhinoView.RenderedDisplayMode Property
 Gets the RealtimeDisplayMode active for this view. null if the view doesn't have a RealtimeDisplayMode set.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RealtimeDisplayMode RenderedDisplayMode { get; }
Public ReadOnly Property RenderedDisplayMode As RealtimeDisplayMode
	Get
Property Value
Type: RealtimeDisplayMode
See Also
Reference
RhinoView Class
Rhino.Display Namespace