RhinoCommon SDK
Transform.M23 Property
Rhino WIP for Windows
Gets or sets this[2,3].
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double M23 { get; set; }
Public Property M23 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform Structure
Rhino.Geometry Namespace