RhinoCommon SDK
GroupTable.Count Property
Rhino WIP for Windows
Number of groups in the group table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int Count { get; }
Public Overrides ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
IReadOnlyCollection<T>.Count
ICollection<T>.Count
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace