RhinoCommon SDK
Arc.EndPoint Property
Rhino WIP for Windows
 Gets the end point of the arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d EndPoint { get; }
Public ReadOnly Property EndPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Arc Structure
Rhino.Geometry Namespace