RhinoCommon SDK
Material.AlphaTransparency Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.AlphaTransparency"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool AlphaTransparency { get; set; }
Public Property AlphaTransparency As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Material Class
Rhino.DocObjects Namespace