RhinoCommon SDK
GumballAppearanceSettings.TranslateZEnabled Property
Rhino WIP for Windows
 TranslateZEnabled is true, the Z axis translation control is available. The default setting is true.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool TranslateZEnabled { get; set; }
Public Property TranslateZEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace