RhinoCommon SDK
Point2d.Y Property
Rhino WIP for Windows
 Gets or sets the Y (second) coordinate of the point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Y { get; set; }
Public Property Y As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace