RhinoCommon SDK
ReduceMeshParameters.Accuracy Property
Rhino WIP for Windows
Integer from 1 to 10 telling how accurate reduction algorithm to use. Greater number gives more accurate results
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Accuracy { get; set; }
Public Property Accuracy As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace