RhinoCommon SDK
File3dmNotes.WindowRectangle Property
Rhino WIP for Windows
 Gets or sets the position of the Notes when they were saved.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Rectangle WindowRectangle { get; set; }
Public Property WindowRectangle As Rectangle
	Get
	Set
Property Value
Type: Rectangle
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace