RhinoCommon SDK
BrepEdge.EndVertex Property
Rhino WIP for Windows
 BrepVertex at end of edge
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BrepVertex EndVertex { get; }
Public ReadOnly Property EndVertex As BrepVertex
	Get
Property Value
Type: BrepVertex
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace