RhinoCommon SDK
Linetype.LinetypeIndex Property
Rhino WIP for Windows
The index of this linetype.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int LinetypeIndex { get; set; }
Public Property LinetypeIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace