RhinoCommon SDK
StringParserSettings.DefaultLengthUnitSystem Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.DefaultLengthUnitSystem"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public UnitSystem DefaultLengthUnitSystem { get; set; }
Public Property DefaultLengthUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace