RhinoCommon SDK
ViewportInfo.IsPerspectiveProjection Property
Rhino WIP for Windows
 Get or set whether this projection is perspective.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsPerspectiveProjection { get; set; }
Public Property IsPerspectiveProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace