RhinoCommon SDK
Layer.Id Property
Rhino WIP for Windows
 Gets or sets the ID of this layer object. You typically do not need to assign a custom ID.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override Guid Id { get; set; }
Public Overrides Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Layer Class
Rhino.DocObjects Namespace