RhinoCommon SDK
V6AngularDimension.Type Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.V6AngularDimension.Type"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6Dimension.DimensionType Type { get; set; }
Public Property Type As V6Dimension.DimensionType
	Get
	Set
Property Value
Type: V6Dimension.DimensionType
See Also
Reference
V6AngularDimension Class
Rhino.Geometry Namespace