RhinoCommon SDK
Decal.Height Property
 Gets the height of the decal. Only used when mapping is cylindrical.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Height { get; }
Public ReadOnly Property Height As Double
	Get
Property Value
Type: Double
See Also
Reference
Decal Class
Rhino.Render Namespace