RhinoCommon SDK
AnnotationText.AnnotationStyleId Property
Rhino WIP for Windows
 Get this text's dimstyle id
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AnnotationStyleId { get; }
Public ReadOnly Property AnnotationStyleId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace