RhinoCommon SDK
FloatField.Value Property
 Gets or sets the field value
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public float Value { get; set; }
Public Property Value As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
FloatField Class
Rhino.Render.Fields Namespace