RhinoCommon SDK
ICurrentEnvironment.ForReflectionAndRefraction Property
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment.ForReflectionAndRefraction"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
RenderEnvironment ForReflectionAndRefraction { get; set; }
Property ForReflectionAndRefraction As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
Implements
ICurrentEnvironment_Get.ForReflectionAndRefraction
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace