RhinoCommon SDK
TextDot.FontFace Property
Font face used for displaying the dot
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string FontFace { get; set; }
Public Property FontFace As String
	Get
	Set
Property Value
Type: String
See Also
Reference
TextDot Class
Rhino.Geometry Namespace