RhinoCommon SDK
CachedTextureCoordinates.Count Property
Rhino WIP for Windows
 Number of cached coordinates.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace