RhinoCommon SDK
V6Dimension.DetailMeasured Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Dimension.DetailMeasured"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid DetailMeasured { get; set; }
Public Property DetailMeasured As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
V6Dimension Class
Rhino.Geometry Namespace