RhinoCommon SDK
Text3d.Text Property
 Gets or sets the text string for this Text3d object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Text3d Class
Rhino.Display Namespace