RhinoCommon SDK
DimensionStyle.AngularRoundoff Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AngularRoundoff"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double AngularRoundoff { get; set; }
Public Property AngularRoundoff As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace