RhinoCommon SDK
GroundPlane.ShowUnderside Property
Rhino WIP for Windows
 If this is off, the ground plane will not be visible when seen from below.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ShowUnderside { get; set; }
Public Property ShowUnderside As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GroundPlane Class
Rhino.Render Namespace