RhinoCommon SDK
V6RadialDimension.DimlinePoint Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.V6RadialDimension.DimlinePoint"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d DimlinePoint { get; set; }
Public Property DimlinePoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
V6RadialDimension Class
Rhino.Geometry Namespace