RhinoCommon SDK
Torus.Plane Property
Rhino WIP for Windows
 Gets or sets the plane for the torus large circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Torus Structure
Rhino.Geometry Namespace