RhinoCommon SDK
RdkThumbnaillistViewModel.RenderContentLookupReader Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkThumbnaillistViewModel.RenderContentLookupReader"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RdkContentLookup RenderContentLookupReader { get; }
Public ReadOnly Property RenderContentLookupReader As RdkContentLookup
	Get
Property Value
Type: RdkContentLookup
See Also
Reference
RdkThumbnaillistViewModel Class
Rhino.UI.Controls Namespace