RhinoCommon SDK
V6OrdinateDimension.KinkOffset1 Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.V6OrdinateDimension.KinkOffset1"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double KinkOffset1 { get; set; }
Public Property KinkOffset1 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
V6OrdinateDimension Class
Rhino.Geometry Namespace