RhinoCommon SDK
Line.ToY Property
 Gets or sets the Y coordinate of the line To point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ToY { get; set; }
Public Property ToY As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Line Structure
Rhino.Geometry Namespace