RhinoCommon SDK
BoolField.Value Property
 Gets or sets the field value
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Value { get; set; }
Public Property Value As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BoolField Class
Rhino.Render.Fields Namespace