RhinoCommon SDK
Skylight.ShadowIntensity Property
Rhino WIP for Windows
 Get shadow intensity for skylight
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ShadowIntensity { get; }
Public ReadOnly Property ShadowIntensity As Double
	Get
Property Value
Type: Double
See Also
Reference
Skylight Class
Rhino.Render.ChangeQueue Namespace