RhinoCommon SDK
Point3d.MaximumCoordinate Property
Rhino WIP for Windows
 Gets the largest (both positive and negative) valid coordinate in this point, or RhinoMath.UnsetValue if no coordinate is valid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double MaximumCoordinate { get; }
Public ReadOnly Property MaximumCoordinate As Double
	Get
Property Value
Type: Double
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace