RhinoCommon SDK
Toolbar.TabSize Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Toolbar.TabSize"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Size TabSize { get; set; }
Public Shared Property TabSize As Size
	Get
	Set
Property Value
Type: Size
See Also
Reference
Toolbar Class
Rhino.UI Namespace