RhinoCommon SDK
V6OrdinateDimension.Type Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6OrdinateDimension.Type"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6Dimension.DimensionType Type { get; }
Public ReadOnly Property Type As V6Dimension.DimensionType
	Get
Property Value
Type: V6Dimension.DimensionType
See Also
Reference
V6OrdinateDimension Class
Rhino.Geometry Namespace