RhinoCommon SDK
ToolbarGroup.Id Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarGroup.Id"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace