RhinoCommon SDK
RLeader.DimstyleId Property
Rhino WIP for Windows
 Get or set the id of this leader's dimstyle
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid DimstyleId { get; set; }
Public Property DimstyleId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
RLeader Class
Rhino.Geometry Namespace