RhinoCommon SDK
UndoRedoEventArgs.IsEndRedo Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsEndRedo"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsEndRedo { get; }
Public ReadOnly Property IsEndRedo As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace