RhinoCommon SDK
MenuTaskOriginFactory.AllowedKinds Property
Rhino WIP for Windows
 Semicolon delimited string with allowed content kind for menutasks
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string AllowedKinds { set; }
Public WriteOnly Property AllowedKinds As String
	Set
Property Value
Type: String
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace