RhinoCommon SDK
MouseCallbackEventArgs.Button Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.Button"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Use MouseButton property instead")]
public MouseButtons Button { get; }
<ObsoleteAttribute("Use MouseButton property instead")>
Public ReadOnly Property Button As MouseButtons
	Get
Property Value
Type: MouseButtons
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace