RhinoCommon SDK
ToolbarFileCollection.MruSidebarIsVisible Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFileCollection.MruSidebarIsVisible"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static bool MruSidebarIsVisible { get; set; }
Public Shared Property MruSidebarIsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace