RhinoCommon SDK
BrepLoop.LoopIndex Property
Rhino WIP for Windows
 Gets the index of this loop in the Brep.Loops collection.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int LoopIndex { get; }
Public ReadOnly Property LoopIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace