RhinoCommon SDK
BrepObject.BrepGeometry Property
Rhino WIP for Windows
 Gets the brep geometry linked with this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Brep BrepGeometry { get; }
Public ReadOnly Property BrepGeometry As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepObject Class
Rhino.DocObjects Namespace