RhinoCommon SDK
V6Dimension.DimstyleId Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.V6Dimension.DimstyleId"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid DimstyleId { get; set; }
Public Property DimstyleId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
V6Dimension Class
Rhino.Geometry Namespace