RhinoCommon SDK
File3dm.HatchPatterns Property
Note: This API is now obsolete.
 Hatch patterns in this file
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Use the new AllDimStyles property")]
public IList<HatchPattern> HatchPatterns { get; }
<ObsoleteAttribute("Use the new AllDimStyles property")>
Public ReadOnly Property HatchPatterns As IList(Of HatchPattern)
	Get
Property Value
Type: IList<HatchPattern>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace