RhinoCommon SDK
TwistSpaceMorph.TwistAngleRadians Property
 Twist angle in radians.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TwistAngleRadians { get; set; }
Public Property TwistAngleRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace