RhinoCommon SDK
BrepRegion.Brep Property
Gets a reference to the Brep this region belongs to.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace