RhinoCommon SDK
Localization.RunningAsEnglish Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Localization.RunningAsEnglish"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static bool RunningAsEnglish { get; }
Public Shared ReadOnly Property RunningAsEnglish As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Localization Class
Rhino.UI Namespace