RhinoCommon SDK
UndoRedoEventArgs.IsBeginUndo Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsBeginUndo"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsBeginUndo { get; }
Public ReadOnly Property IsBeginUndo As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace