RhinoCommon SDK
RhinoTransformObjectsEventArgs.Transform Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoTransformObjectsEventArgs.Transform"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform Transform { get; }
Public ReadOnly Property Transform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace