RhinoCommon SDK
DimStyleTable.Current Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTable.Current"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle Current { get; }
Public ReadOnly Property Current As DimensionStyle
	Get
Property Value
Type: DimensionStyle
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace