RhinoCommon SDK
RenderMaterial.SmellsLikePlaster Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikePlaster"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SmellsLikePlaster { get; }
Public ReadOnly Property SmellsLikePlaster As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace