RhinoCommon SDK
GroundPlane.TextureSize Property
Rhino WIP for Windows
 Texture mapping single UV span size in world units.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector2d TextureSize { get; set; }
Public Property TextureSize As Vector2d
	Get
	Set
Property Value
Type: Vector2d
See Also
Reference
GroundPlane Class
Rhino.Render Namespace