RhinoCommon SDK
IBreadCrumb.ViewModel Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.IBreadCrumb.ViewModel"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
RdkBreadCrumbViewModel ViewModel { get; }
ReadOnly Property ViewModel As RdkBreadCrumbViewModel
	Get
Property Value
Type: RdkBreadCrumbViewModel
See Also
Reference
IBreadCrumb Interface
Rhino.UI.Controls Namespace