RhinoCommon SDK
ThumbData.Child Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbData.Child"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public List<ThumbData> Child { get; set; }
Public Property Child As List(Of ThumbData)
	Get
	Set
Property Value
Type: List<ThumbData>
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace