RhinoCommon SDK
LightTableEventArgs.Document Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.Document"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace