RhinoCommon SDK
RenderTexture.LocalMappingTransform Property
Rhino WIP for Windows
 Gets the transformation that can be applied to the UVW vector to convert it from normalized texture space into locally mapped space (ie - with repeat, offset and rotation applied.)
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform LocalMappingTransform { get; }
Public ReadOnly Property LocalMappingTransform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
RenderTexture Class
Rhino.Render Namespace