RhinoCommon SDK
PanelIds.Display Property
[Missing <summary> documentation for "P:Rhino.UI.PanelIds.Display"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid Display { get; }
Public Shared ReadOnly Property Display As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace