RhinoCommon SDK
CachedTextureCoordinates.MappingId Property
Rhino WIP for Windows
 The texture mapping Id.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid MappingId { get; }
Public ReadOnly Property MappingId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace