RhinoCommon SDK
RhinoViewport.ConstructionAxesVisible Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.ConstructionAxesVisible"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ConstructionAxesVisible { get; set; }
Public Property ConstructionAxesVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace