RhinoCommon SDK
Layer.PlotWeight Property
Rhino WIP for Windows
 Gets or sets the thickness of the plotting pen in millimeters. A thickness of 0.0 indicates the "default" pen weight should be used.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double PlotWeight { get; set; }
Public Property PlotWeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Layer Class
Rhino.DocObjects Namespace