RhinoCommon SDK
StringParserSettings.ParseDivision Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseDivision"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ParseDivision { get; set; }
Public Property ParseDivision As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace