RhinoCommon SDK
InstanceDefinition.SourceArchive Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.SourceArchive"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string SourceArchive { get; }
Public ReadOnly Property SourceArchive As String
	Get
Property Value
Type: String
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace