RhinoCommon SDK
RhinoObject.SubobjectMaterialComponents Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoObject.SubobjectMaterialComponents"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ComponentIndex[] SubobjectMaterialComponents { get; }
Public ReadOnly Property SubobjectMaterialComponents As ComponentIndex()
	Get
Property Value
Type: ComponentIndex[]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace