RhinoCommon SDK
InstanceDefinitionTable.ActiveCount Property
Rhino WIP for Windows
 Number of items in the instance definitions table, excluding deleted definitions.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace