RhinoCommon SDK
LinearDimension.TextPosition Property
Rhino WIP for Windows
 Gets and sets the position of text on the plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d TextPosition { get; set; }
Public Property TextPosition As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace