RhinoCommon SDK
RhinoViewport.CameraLocation Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.CameraLocation"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d CameraLocation { get; }
Public ReadOnly Property CameraLocation As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace