RhinoCommon SDK
GumballAppearanceSettings.ColorY Property
Rhino WIP for Windows
Default is Green.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color ColorY { get; set; }
Public Property ColorY As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace