RhinoCommon SDK
Torus.Unset Property
 Gets an invalid Torus.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Torus Unset { get; }
Public Shared ReadOnly Property Unset As Torus
	Get
Property Value
Type: Torus
See Also
Reference
Torus Structure
Rhino.Geometry Namespace