RhinoCommon SDK
Brep.Surfaces Property
Rhino WIP for Windows
 Parametric surfaces used by faces
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BrepSurfaceList Surfaces { get; }
Public ReadOnly Property Surfaces As BrepSurfaceList
	Get
Property Value
Type: BrepSurfaceList
See Also
Reference
Brep Class
Rhino.Geometry Namespace