RhinoCommon SDK
File3dmObject.Geometry Property
Rhino WIP for Windows
 Gets the geometry that is linked with this document object.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GeometryBase Geometry { get; }
Public ReadOnly Property Geometry As GeometryBase
	Get
Property Value
Type: GeometryBase
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace