RhinoCommon SDK
V6LinearDimensionObject.DimLinearGeometry Property
Rhino WIP for Windows
 Get the dimension geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6LinearDimension DimLinearGeometry { get; set; }
Public Property DimLinearGeometry As V6LinearDimension
	Get
	Set
Property Value
Type: V6LinearDimension
See Also
Reference
V6LinearDimensionObject Class
Rhino.DocObjects Namespace