RhinoCommon SDK
DrawObjectEventArgs.RhinoObject Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.DrawObjectEventArgs.RhinoObject"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoObject RhinoObject { get; }
Public ReadOnly Property RhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
DrawObjectEventArgs Class
Rhino.Display Namespace