RhinoCommon SDK
MeshPart.StartVertexIndex Property
Rhino WIP for Windows
Start of subinterval of parent mesh vertex array
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int StartVertexIndex { get; }
Public ReadOnly Property StartVertexIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace