RhinoCommon SDK
TwoColorRenderTexture.Texture2Amount Property
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.Texture2Amount"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Texture2Amount { get; set; }
Public Property Texture2Amount As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace