RhinoCommon SDK
Material.Id Property
Rhino WIP for Windows
Gets or sets the ID of this material.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Material Class
Rhino.DocObjects Namespace