RhinoCommon SDK
CreatePreviewEventArgs.SceneObject.Material Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.CreatePreviewEventArgs.SceneObject.Material"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderMaterial Material { get; }
Public ReadOnly Property Material As RenderMaterial
	Get
Property Value
Type: RenderMaterial
See Also
Reference
CreatePreviewEventArgs.SceneObject Class
Rhino.Render Namespace