RhinoCommon SDK
GumballAppearanceSettings.ScaleGripSize Property
Rhino WIP for Windows
in pixels.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int ScaleGripSize { get; set; }
Public Property ScaleGripSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace