RhinoCommon SDK
UndoRedoEventArgs.IsEndUndo Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsEndUndo"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsEndUndo { get; }
Public ReadOnly Property IsEndUndo As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace