RhinoCommon SDK
ViewportInfo.FrustumRight Property
Rhino WIP for Windows
 Gets the frustum right value. This is -left if the frustum has a vertical symmetry axis.
This number is usually positive.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FrustumRight { get; }
Public ReadOnly Property FrustumRight As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace