RhinoCommon SDK
Rectangle3d.BoundingBox Property
Rhino WIP for Windows
 Gets the world aligned boundingbox for this rectangle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace