RhinoCommon SDK
BrepTrim.IsoStatus Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.BrepTrim.IsoStatus"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IsoStatus IsoStatus { get; set; }
Public Property IsoStatus As IsoStatus
	Get
	Set
Property Value
Type: IsoStatus
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace