RhinoCommon SDK
Command.LocalName Property
Rhino WIP for Windows
 Gets the local name of the command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual string LocalName { get; }
Public Overridable ReadOnly Property LocalName As String
	Get
Property Value
Type: String
See Also
Reference
Command Class
Rhino.Commands Namespace