RhinoCommon SDK
LightTable.Sun Property
Rhino WIP for Windows
 Gets the Sun instance that is applied to the document.
If the RDK is loaded, an instance is always returned.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Sun Sun { get; }
Public ReadOnly Property Sun As Sun
	Get
Property Value
Type: Sun
Exceptions
Exception | Condition
RdkNotLoadedException | If the RDK is not loaded.
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace