RhinoCommon SDK
VolumeMassProperties.CentroidCoordinatesMomentsOfInertiaError Property
Rhino WIP for Windows
 Uncertainty in centroid coordinates moments of inertia calculation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d CentroidCoordinatesMomentsOfInertiaError { get; }
Public ReadOnly Property CentroidCoordinatesMomentsOfInertiaError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace