RhinoCommon SDK
BrepLoop.Trims Property
Rhino WIP for Windows
 List of trims for this loop
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BrepTrimList Trims { get; }
Public ReadOnly Property Trims As BrepTrimList
	Get
Property Value
Type: BrepTrimList
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace