RhinoCommon SDK
V6Dimension.DistanceScale Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Dimension.DistanceScale"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double DistanceScale { get; set; }
Public Property DistanceScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
V6Dimension Class
Rhino.Geometry Namespace