RhinoCommon SDK
Ellipse.Radius2 Property
Rhino WIP for Windows
 Gets or sets the radius of the ellipse along the base plane Y semiaxis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Radius2 { get; set; }
Public Property Radius2 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace