RhinoCommon SDK
Sun.ManualControl Property
Rhino WIP for Windows
Set angles directly or use place/date/time
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ManualControl { get; set; }
Public Property ManualControl As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Sun Class
Rhino.Render Namespace