RhinoCommon SDK
ShutLiningCurveInfo.Radius Property
Rhino WIP for Windows
 The profile radius.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Radius { get; }
Public ReadOnly Property Radius As Double
	Get
Property Value
Type: Double
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace