RhinoCommon SDK
Sphere.EquitorialPlane Property
Rhino WIP for Windows
 Gets or sets the Equatorial plane for this sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Plane EquitorialPlane { get; set; }
Public Property EquitorialPlane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace