RhinoCommon SDK
Rectangle3d.Circumference Property
 Gets the circumference of the rectangle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Circumference { get; }
Public ReadOnly Property Circumference As Double
	Get
Property Value
Type: Double
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace