RhinoCommon SDK
V6RadialDimension.KneePoint Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.V6RadialDimension.KneePoint"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d KneePoint { get; }
Public ReadOnly Property KneePoint As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
V6RadialDimension Class
Rhino.Geometry Namespace