RhinoCommon SDK
CommandStyleAttribute.Styles Property
 Gets the associated style.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Style Styles { get; }
Public ReadOnly Property Styles As Style
	Get
Property Value
Type: Style
See Also
Reference
CommandStyleAttribute Class
Rhino.Commands Namespace