RhinoCommon SDK
ConstructionPlane.GridSpacing Property
Rhino WIP for Windows
 Gets or sets the distance between grid lines.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double GridSpacing { get; set; }
Public Property GridSpacing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace