RhinoCommon SDK
V6OrdinateDimension.KinkPoint1 Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.V6OrdinateDimension.KinkPoint1"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d KinkPoint1 { get; }
Public ReadOnly Property KinkPoint1 As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
V6OrdinateDimension Class
Rhino.Geometry Namespace