RhinoCommon SDK
Font.Italic Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Italic"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Italic { get; }
Public ReadOnly Property Italic As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Font Class
Rhino.DocObjects Namespace