RhinoCommon SDK
BrepTrim.TrimIndex Property
Rhino WIP for Windows
 Gets the index of this trim in the Brep.Trims collection.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int TrimIndex { get; }
Public ReadOnly Property TrimIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace