RhinoCommon SDK
DimensionStyle.LeaderContentAngleType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderContentAngleType"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.ContentAngle LeaderContentAngleType { get; set; }
Public Property LeaderContentAngleType As DimensionStyle.ContentAngle
	Get
	Set
Property Value
Type: DimensionStyle.ContentAngle
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace