RhinoCommon SDK
DisplayModeDescription.LocalName Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.LocalName"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string LocalName { get; }
Public ReadOnly Property LocalName As String
	Get
Property Value
Type: String
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace