RhinoCommon SDK
Texture.Enabled Property
Rhino WIP for Windows
 If the texture is enabled then it will be visible in the rendered display otherwise it will not.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Texture Class
Rhino.DocObjects Namespace