RhinoCommon SDK
DimensionStyle.DimensionScaleValue Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimensionScaleValue"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ScaleValue DimensionScaleValue { get; set; }
Public Property DimensionScaleValue As ScaleValue
	Get
	Set
Property Value
Type: ScaleValue
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace