RhinoCommon SDK
RenderSettings.ImageUnitSystem Property
Rhino WIP for Windows
 unit system to use when converting image pixel size and dpi information into a print size. Default = inches
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public UnitSystem ImageUnitSystem { get; set; }
Public Property ImageUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
RenderSettings Class
Rhino.Render Namespace