RhinoCommon SDK
ComponentStatus.Hidden Property
Rhino WIP for Windows
 The hidden flag is checked.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static ComponentStatus Hidden { get; }
Public Shared ReadOnly Property Hidden As ComponentStatus
	Get
Property Value
Type: ComponentStatus
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace