RhinoCommon SDK
TextDot.SecondaryText Property
 Gets or sets the secondary text of the textdot.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string SecondaryText { get; set; }
Public Property SecondaryText As String
	Get
	Set
Property Value
Type: String
See Also
Reference
TextDot Class
Rhino.Geometry Namespace