RhinoCommon SDK
CustomRenderContentAttribute.IsBuiltIn Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.IsBuiltIn"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsBuiltIn { get; set; }
Public Property IsBuiltIn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace