RhinoCommon SDK
Vector3dField.Value Property
Rhino WIP for Windows
 Gets or sets the field value
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d Value { get; set; }
Public Property Value As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Vector3dField Class
Rhino.Render.Fields Namespace