RhinoCommon SDK
TextureMapping.UvwTransform Property
Rhino WIP for Windows
 Transform applied to mapping coordinate (u,v,w) to convert it into a texture coordinate.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform UvwTransform { get; set; }
Public Property UvwTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
TextureMapping Class
Rhino.Render Namespace