RhinoCommon SDK
PanelIds.ObjectProperties Property
Rhino WIP for Windows
 Rhino object properties panel
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid ObjectProperties { get; }
Public Shared ReadOnly Property ObjectProperties As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace