RhinoCommon SDK
EarthAnchorPoint.Name Property
Rhino WIP for Windows
 Gets or sets the short form of the identifying information about this location.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace