RhinoCommon SDK
DecalCreateParams.MinU Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.MinU"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double MinU { get; set; }
Public Property MinU As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace