RhinoCommon SDK
UserDictionary.Description Property
Rhino WIP for Windows
 Gets the text "RhinoCommon UserDictionary".
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override string Description { get; }
Public Overrides ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace