RhinoCommon SDK
MouseCallbackEventArgs.MouseButton Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.MouseButton"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MouseButton MouseButton { get; }
Public ReadOnly Property MouseButton As MouseButton
	Get
Property Value
Type: MouseButton
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace