RhinoCommon SDK
File3dm.Manifest Property
Rhino WIP for Windows
 Retrieves the manifest with all object descriptions in this file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ManifestTable Manifest { get; }
Public ReadOnly Property Manifest As ManifestTable
	Get
Property Value
Type: ManifestTable
See Also
Reference
File3dm Class
Rhino.FileIO Namespace