RhinoCommon SDK
HiddenLineDrawingObjectCurve.Segments Property
Rhino WIP for Windows
 The HiddenLineDrawingCurve objects that make up this full curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public HiddenLineDrawingSegment[] Segments { get; }
Public ReadOnly Property Segments As HiddenLineDrawingSegment()
	Get
Property Value
Type: HiddenLineDrawingSegment[]
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace