RhinoCommon SDK
MeshingParameters.ComputeCurvature Property
Rhino WIP for Windows
 Gets or sets a value indicating whether or not surface curvature data will be embedded in the mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ComputeCurvature { get; set; }
Public Property ComputeCurvature As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace