RhinoCommon SDK
MeshVertexNormalList.Count Property
Rhino WIP for Windows
 Gets or sets the number of mesh vertex normals.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; set; }
Public Property Count As Integer
	Get
	Set
Property Value
Type: Int32
Implements
IResizableList<T>.Count
ICollection<T>.Count
ICollection.Count
IReadOnlyCollection<T>.Count
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace