RhinoCommon SDK
LocalizeStringPair.English Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.LocalizeStringPair.English"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string English { get; }
Public ReadOnly Property English As String
	Get
Property Value
Type: String
See Also
Reference
LocalizeStringPair Class
Rhino.UI Namespace