RhinoCommon SDK
CustomObjectGrips.GripCount Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.CustomObjectGrips.GripCount"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int GripCount { get; }
Public ReadOnly Property GripCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace