RhinoCommon SDK
ToolbarFile.Name Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFile.Name"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace