RhinoCommon SDK
DisplayModeDescription.SupportsShading Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.SupportsShading"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SupportsShading { get; set; }
Public Property SupportsShading As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace