RhinoCommon SDK
RhinoObject.HasDynamicTransform Property
Rhino WIP for Windows
 True if the object has a dynamic transformation
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool HasDynamicTransform { get; }
Public ReadOnly Property HasDynamicTransform As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace