RhinoCommon SDK
RenderContentSerializer.CanRead Property
Rhino WIP for Windows
 If true then the file type can be imported and will be included in the file open box when importing the specified render content type.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool CanRead { get; }
Public ReadOnly Property CanRead As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace