RhinoCommon SDK
GumballObject.Frame Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballObject.Frame"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GumballFrame Frame { get; set; }
Public Property Frame As GumballFrame
	Get
	Set
Property Value
Type: GumballFrame
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace