RhinoCommon SDK
PanelEventArgs.Document Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.PanelEventArgs.Document"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
PanelEventArgs Class
Rhino.UI Namespace