RhinoCommon SDK
AreaMassProperties.AreaError Property
 Gets the uncertainty in the area calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double AreaError { get; }
Public ReadOnly Property AreaError As Double
	Get
Property Value
Type: Double
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace