RhinoCommon SDK
V6Dimension.UserTextString Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Dimension.UserTextString"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string UserTextString { get; }
Public ReadOnly Property UserTextString As String
	Get
Property Value
Type: String
See Also
Reference
V6Dimension Class
Rhino.Geometry Namespace