RhinoCommon SDK
IThumbnailList.ShowUnits Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.IThumbnailList.ShowUnits"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
bool ShowUnits { get; set; }
Property ShowUnits As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
IThumbnailList Interface
Rhino.UI.Controls Namespace