RhinoCommon SDK
SweepOneRail.ClosedSweep Property
Rhino WIP for Windows
 If the input rail is closed, ClosedSweep determines if the swept breps will also be closed.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ClosedSweep { get; set; }
Public Property ClosedSweep As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace