RhinoCommon SDK
EarthAnchorPoint.ModelBasePoint Property
Rhino WIP for Windows
Corresponding model point in model coordinates.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d ModelBasePoint { get; set; }
Public Property ModelBasePoint As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace