RhinoCommon SDK
Curve.TangentAtStart Property
Rhino WIP for Windows
Evaluates the unit tangent vector at the start of the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d TangentAtStart { get; }
Public ReadOnly Property TangentAtStart As Vector3d
	Get
Return Value
Type: Vector3d
Unit tangent vector of the curve at the start point.
Remarks
No error handling.
See Also
Reference
Curve Class
Rhino.Geometry Namespace