RhinoCommon SDK
V6LinearDimension.ArrowPoint1 Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.V6LinearDimension.ArrowPoint1"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d ArrowPoint1 { get; }
Public ReadOnly Property ArrowPoint1 As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
V6LinearDimension Class
Rhino.Geometry Namespace