RhinoCommon SDK
Material.UserStringCount Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.UserStringCount"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int UserStringCount { get; }
Public ReadOnly Property UserStringCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Material Class
Rhino.DocObjects Namespace