RhinoCommon SDK
NurbsCurveKnotList.Count Property
Rhino WIP for Windows
Total number of knots in this curve.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace