RhinoCommon SDK
AnnotationArrowhead.ArrowBlockId Property
 Id of block used for user-defined arrowhead
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid ArrowBlockId { get; set; }
Public Property ArrowBlockId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
AnnotationArrowhead Class
Rhino.Geometry Namespace