RhinoCommon SDK
RenderSettings.BackgroundStyle Property
Rhino WIP for Windows
 How the viewport's backgroun should be filled.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BackgroundStyle BackgroundStyle { get; set; }
Public Property BackgroundStyle As BackgroundStyle
	Get
	Set
Property Value
Type: BackgroundStyle
See Also
Reference
RenderSettings Class
Rhino.Render Namespace