RhinoCommon SDK
Toolbar.BitmapSize Property
[Missing <summary> documentation for "P:Rhino.UI.Toolbar.BitmapSize"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Size BitmapSize { get; set; }
Public Shared Property BitmapSize As Size
	Get
	Set
Property Value
Type: Size
See Also
Reference
Toolbar Class
Rhino.UI Namespace