RhinoCommon SDK
Layer.PlotColor Property
Rhino WIP for Windows
 Gets or sets the plot color for this layer.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color PlotColor { get; set; }
Public Property PlotColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Layer Class
Rhino.DocObjects Namespace