RhinoCommon SDK
GetPointMouseEventArgs.ControlKeyDown Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.ControlKeyDown"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ControlKeyDown { get; }
Public ReadOnly Property ControlKeyDown As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace