RhinoCommon SDK
RenderSettings.RenderBackfaces Property
Rhino WIP for Windows
 Gets or sets a value indicating whether to render back faces.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool RenderBackfaces { get; set; }
Public Property RenderBackfaces As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace