RhinoCommon SDK
File3dmPlugInData.PlugInId Property
 Plug-in this data is associated with
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid PlugInId { get; }
Public ReadOnly Property PlugInId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
File3dmPlugInData Class
Rhino.FileIO Namespace