RhinoCommon SDK
GumballAppearanceSettings.ColorX Property
Default is Red.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color ColorX { get; set; }
Public Property ColorX As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace