RhinoCommon SDK
DisplayPipelineAttributes.LockedObjectsDrawBehindOthers Property
Rhino WIP for Windows
Locked object are drawn behind other objects
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool LockedObjectsDrawBehindOthers { get; set; }
Public Property LockedObjectsDrawBehindOthers As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace