RhinoCommon SDK
UserDictionary.Dictionary Property
Rhino WIP for Windows
 Gets the dictionary that is associated with this class.
This dictionary is unique.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ArchivableDictionary Dictionary { get; }
Public ReadOnly Property Dictionary As ArchivableDictionary
	Get
Property Value
Type: ArchivableDictionary
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace