RhinoCommon SDK
Matrix.IsColumnOrthoNormal Property
Rhino WIP for Windows
 Gets a value indicating whether the matrix is column orthonormal.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsColumnOrthoNormal { get; }
Public ReadOnly Property IsColumnOrthoNormal As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Matrix Class
Rhino.Geometry Namespace