RhinoCommon SDK
GumballDisplayConduit.BaseGumball Property
Rhino WIP for Windows
Starting location.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GumballObject BaseGumball { get; }
Public ReadOnly Property BaseGumball As GumballObject
	Get
Property Value
Type: GumballObject
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace