RhinoCommon SDK
RdkThumbnaillistViewModel.Kind Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkThumbnaillistViewModel.Kind"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Kind { get; set; }
Public Property Kind As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RdkThumbnaillistViewModel Class
Rhino.UI.Controls Namespace