RhinoCommon SDK
Rectangle3d.Center Property
Rhino WIP for Windows
 Gets the point in the center of the rectangle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Center { get; }
Public ReadOnly Property Center As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace