RhinoCommon SDK
LightObject.LightGeometry Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.LightObject.LightGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Light LightGeometry { get; }
Public ReadOnly Property LightGeometry As Light
	Get
Property Value
Type: Light
See Also
Reference
LightObject Class
Rhino.DocObjects Namespace