RhinoCommon SDK
ViewInfo.Viewport Property
Rhino WIP for Windows
 Gets the viewport, or viewing frustum, associated with this view.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ViewportInfo Viewport { get; }
Public ReadOnly Property Viewport As ViewportInfo
	Get
Property Value
Type: ViewportInfo
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace