RhinoCommon SDK
MeshVertexNormalList.Item Property
Rhino WIP for Windows
 Gets or sets the vertex at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3f this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Vector3f
	Get
	Set
Parameters
index
Type: System.Int32
Index of control vertex to access.
Return Value
Type: Vector3f
The control vertex at [index].
Implements
IList<T>.Item[Int32]
IReadOnlyList<T>.Item[Int32]
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace