RhinoCommon SDK
ConstructionPlane.ShowGrid Property
Rhino WIP for Windows
 Gets or sets whether the grid itself should be visible.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ShowGrid { get; set; }
Public Property ShowGrid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace