RhinoCommon SDK
DisplayPipelineAttributes.RealtimeRenderPasses Property
 Get or set the realtime passes amount
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int RealtimeRenderPasses { get; set; }
Public Property RealtimeRenderPasses As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace