RhinoCommon SDK
EarthAnchorPoint.EarthBasepointElevation Property
Rhino WIP for Windows
 Gets or sets the point elevation on earth, in meters.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double EarthBasepointElevation { get; set; }
Public Property EarthBasepointElevation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace