RhinoCommon SDK
Text3d.FontFace Property
Rhino WIP for Windows
 Gets or sets the FontFace name.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string FontFace { get; set; }
Public Property FontFace As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Text3d Class
Rhino.Display Namespace