RhinoCommon SDK
SweepOneRail.IsFreeform Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsFreeform"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsFreeform { get; }
Public ReadOnly Property IsFreeform As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace