RhinoCommon SDK
Linetype.IsReference Property
 Gets a value indicting whether this linetype is a referenced linetype. Referenced linetypes are part of referenced documents.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsReference { get; }
Public ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace