RhinoCommon SDK
ObjectPropertiesPage.SelectedObjects Property
Rhino WIP for Windows
 Return a list of Rhino objects to be processed by this object properties page
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoObject[] SelectedObjects { get; }
Public ReadOnly Property SelectedObjects As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace