RhinoCommon SDK
ThumbnailListImpl.CppPointer Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailListImpl.CppPointer"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
ThumbnailListImpl Class
Rhino.UI.Controls Namespace