RhinoCommon SDK
UserInterfaceSection.Window Property
Rhino WIP for Windows
 The user control associated with this user interface object.
Namespace: Rhino.Render.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Object Window { get; }
Public ReadOnly Property Window As Object
	Get
Property Value
Type: Object
See Also
Reference
UserInterfaceSection Class
Rhino.Render.UI Namespace