RhinoCommon SDK
ControlPoint.Unset Property
 Gets the predefined unset control point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static ControlPoint Unset { get; }
Public Shared ReadOnly Property Unset As ControlPoint
	Get
Property Value
Type: ControlPoint
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace