RhinoCommon SDK
V6OrdinateDimension.KinkOffset2 Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.V6OrdinateDimension.KinkOffset2"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double KinkOffset2 { get; set; }
Public Property KinkOffset2 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
V6OrdinateDimension Class
Rhino.Geometry Namespace