RhinoCommon SDK
IThumbnailList.TreeModeOnly Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IThumbnailList.TreeModeOnly"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
bool TreeModeOnly { get; set; }
Property TreeModeOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
IThumbnailList Interface
Rhino.UI.Controls Namespace