RhinoCommon SDK
LayerTable.Count Property
Rhino WIP for Windows
 Returns number of layers in the layer table, including deleted layers.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int Count { get; }
Public Overrides ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
IReadOnlyCollection<T>.Count
ICollection<T>.Count
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace