RhinoCommon SDK
DecalCreateParams.TextureInstanceId Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.TextureInstanceId"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid TextureInstanceId { get; set; }
Public Property TextureInstanceId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace