RhinoCommon SDK
MostRecentCommandDescription.DisplayString Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Commands.MostRecentCommandDescription.DisplayString"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string DisplayString { get; set; }
Public Property DisplayString As String
	Get
	Set
Property Value
Type: String
See Also
Reference
MostRecentCommandDescription Class
Rhino.Commands Namespace