RhinoCommon SDK
ColorLAB.A Property
 Gets or sets the Base channel. The channel is limited to 0~1.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double A { get; set; }
Public Property A As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace