RhinoCommon SDK
GetLine.MidPointPrompt Property
Prompt when getting midpoint
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string MidPointPrompt { get; set; }
Public Property MidPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace