RhinoCommon SDK
Quaternion.Conjugate Property
Rhino WIP for Windows
 Gets a new quaternion that is the conjugate of this quaternion.
This is (a,-b,-c,-d)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Quaternion Conjugate { get; }
Public ReadOnly Property Conjugate As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace