RhinoCommon SDK
RenderSettings.LinearWorkflow Property
Rhino WIP for Windows
 Get the document linear workflow interface
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public LinearWorkflow LinearWorkflow { get; }
Public ReadOnly Property LinearWorkflow As LinearWorkflow
	Get
Property Value
Type: LinearWorkflow
See Also
Reference
RenderSettings Class
Rhino.Render Namespace