RhinoCommon SDK
StringTable.Document Property
Rhino WIP for Windows
Document that owns this object table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace