RhinoCommon SDK
RefinementSettings.NakedEdgeMode Property
Rhino WIP for Windows
 Set this property to define how naked edges should be treated.
Namespace: Rhino.Geometry.MeshRefinements
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public CreaseEdges NakedEdgeMode { get; set; }
Public Property NakedEdgeMode As CreaseEdges
	Get
	Set
Property Value
Type: CreaseEdges
See Also
Reference
RefinementSettings Class
Rhino.Geometry.MeshRefinements Namespace