RhinoCommon SDK
FileObjWriteOptions.UnderbarMaterialNames Property
Rhino WIP for Windows
 Enable/disable replacing white space with underbars in material names.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool UnderbarMaterialNames { get; set; }
Public Property UnderbarMaterialNames As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace