RhinoCommon SDK
RealtimeDisplayModeClassInfo.ClassName Property
Rhino WIP for Windows
 Get human-facing class name for RealtimeDisplayMode implementation. This name will show up in the Rhino UI.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract string ClassName { get; }
Public MustOverride ReadOnly Property ClassName As String
	Get
Property Value
Type: String
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace