RhinoCommon SDK
ManifestTable.LongCount Property
Rhino WIP for Windows
 Total number of items in the manifest, including deleted items.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public long LongCount { get; }
Public ReadOnly Property LongCount As Long
	Get
Property Value
Type: Int64
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace