RhinoCommon SDK
RhinoObject.RenderMaterial Property
Rhino WIP for Windows
 Gets the render material associated with this object or null if there is none. This does not pay attention to the material source and will not check parent objects or layers for a RenderMaterial.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderMaterial RenderMaterial { get; }
Public ReadOnly Property RenderMaterial As RenderMaterial
	Get
Property Value
Type: RenderMaterial
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace