RhinoCommon SDK
Extrusion.ProfileCount Property
Rhino WIP for Windows
 Gets the amount of profile curves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int ProfileCount { get; }
Public ReadOnly Property ProfileCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace