RhinoCommon SDK
GripObject.Moved Property
Rhino WIP for Windows
 true if the grip has moved from OriginalLocation.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Moved { get; }
Public ReadOnly Property Moved As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace