RhinoCommon SDK
ICollapsibleSection.SettingsTag Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.SettingsTag"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
string SettingsTag { get; }
ReadOnly Property SettingsTag As String
	Get
Property Value
Type: String
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace