RhinoCommon SDK
LightTable.Count Property
Rhino WIP for Windows
Number of lights in the light table. Does not include Sun or Skylight.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int Count { get; }
Public Overrides ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
IReadOnlyCollection<T>.Count
ICollection<T>.Count
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace