RhinoCommon SDK
Decal.DecalMapping Property
 Gets the mapping of the decal.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DecalMapping DecalMapping { get; }
Public ReadOnly Property DecalMapping As DecalMapping
	Get
Property Value
Type: DecalMapping
See Also
Reference
Decal Class
Rhino.Render Namespace