RhinoCommon SDK
RhinoReplaceObjectEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoReplaceObjectEventArgs.Document"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace