RhinoCommon SDK
ViewCapture.DrawGrid Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.DrawGrid"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool DrawGrid { get; set; }
Public Property DrawGrid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCapture Class
Rhino.Display Namespace