RhinoCommon SDK
Quaternion.J Property
Rhino WIP for Windows
 Returns the (0,0,1,0) quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Quaternion J { get; }
Public Shared ReadOnly Property J As Quaternion
	Get
Property Value
Type: Quaternion
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace