RhinoCommon SDK
DimStyleTable.ComponentType Property
Rhino WIP for Windows
 Returns DimStyle.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace