RhinoCommon SDK
Decal.Radius Property
 Gets the radius of the decal. Only used when mapping is cylindrical or spherical.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Radius { get; }
Public ReadOnly Property Radius As Double
	Get
Property Value
Type: Double
See Also
Reference
Decal Class
Rhino.Render Namespace