RhinoCommon SDK
AnnotationArrowhead.ArrowheadType Property
 Type of arrowhead used by annotation
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.ArrowType ArrowheadType { get; set; }
Public Property ArrowheadType As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
See Also
Reference
AnnotationArrowhead Class
Rhino.Geometry Namespace