RhinoCommon SDK
BrepRegionFaceSide.Face Property
Rhino WIP for Windows
Gets the face this side belongs to.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BrepFace Face { get; }
Public ReadOnly Property Face As BrepFace
	Get
Property Value
Type: BrepFace
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace