RhinoCommon SDK
StackedDialogPage.HasChildren Property
Rhino WIP for Windows
 Will be true if this page contains sub pages.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool HasChildren { get; }
Public ReadOnly Property HasChildren As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace