RhinoCommon SDK
Torus.IsValid Property
 Gets a value indicating whether this torus is valid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Torus Structure
Rhino.Geometry Namespace