RhinoCommon SDK
Decal.MapToInside Property
Rhino WIP for Windows
 Used only when mapping is cylindrical or spherical.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool MapToInside { get; }
Public ReadOnly Property MapToInside As Boolean
	Get
Property Value
Type: Boolean
true if texture is mapped to inside of sphere or cylinder, else \e false.
See Also
Reference
Decal Class
Rhino.Render Namespace