RhinoCommon SDK
File3dm.AllNamedViews Property
 Named view list
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public File3dmViewTable AllNamedViews { get; }
Public ReadOnly Property AllNamedViews As File3dmViewTable
	Get
Property Value
Type: File3dmViewTable
See Also
Reference
File3dm Class
Rhino.FileIO Namespace