RhinoCommon SDK
Point2d.Unset Property
Rhino WIP for Windows
 Gets a point at RhinoMath.UnsetValue,RhinoMath.UnsetValue.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Point2d Unset { get; }
Public Shared ReadOnly Property Unset As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace