RhinoCommon SDK
FileWriteOptions.SuppressDialogBoxes Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.SuppressDialogBoxes"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SuppressDialogBoxes { get; set; }
Public Property SuppressDialogBoxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace