RhinoCommon SDK
File3dmSettings.ModelAbsoluteTolerance Property
Rhino WIP for Windows
Gets or sets the model space absolute tolerance.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ModelAbsoluteTolerance { get; set; }
Public Property ModelAbsoluteTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace