RhinoCommon SDK
Line.FromX Property
Rhino WIP for Windows
 Gets or sets the X coordinate of the line From point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FromX { get; set; }
Public Property FromX As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Line Structure
Rhino.Geometry Namespace