RhinoCommon SDK
Vector3f.XAxis Property
Rhino WIP for Windows
 Gets the value of the vector with components 1,0,0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Vector3f XAxis { get; }
Public Shared ReadOnly Property XAxis As Vector3f
	Get
Property Value
Type: Vector3f
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace