RhinoCommon SDK
Material.ReflectionColor Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.ReflectionColor"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color ReflectionColor { get; set; }
Public Property ReflectionColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Material Class
Rhino.DocObjects Namespace