RhinoCommon SDK
Matrix.IsValid Property
Rhino WIP for Windows
 Gets a value indicating whether this matrix is valid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Matrix Class
Rhino.Geometry Namespace