RhinoCommon SDK
Ellipse.Radius1 Property
Rhino WIP for Windows
 Gets or sets the radius of the ellipse along the base plane X semiaxis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Radius1 { get; set; }
Public Property Radius1 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace