RhinoCommon SDK
File3dm.DimStyles Property
Rhino WIP for Windows
Note: This API is now obsolete.
 Dimension Styles in this file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Use the new AllDimStyles property")]
public IList<DimensionStyle> DimStyles { get; }
<ObsoleteAttribute("Use the new AllDimStyles property")>
Public ReadOnly Property DimStyles As IList(Of DimensionStyle)
	Get
Property Value
Type: IList<DimensionStyle>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace