RhinoCommon SDK
SimulatedTexture.HasTransparentColor Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.HasTransparentColor"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool HasTransparentColor { get; set; }
Public Property HasTransparentColor As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace