RhinoCommon SDK
ContentArray.CppPointer Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.ContentArray.CppPointer"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
ContentArray Class
Rhino.Render Namespace