RhinoCommon SDK
NamedPositionTable.Ids Property
Rhino WIP for Windows
Array of Named Position guids.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid[] Ids { get; }
Public ReadOnly Property Ids As Guid()
	Get
Return Value
Type: Guid[]
 Guid array of each Named Position in the document.
See Also
Reference
NamedPositionTable Class
Rhino.DocObjects.Tables Namespace