RhinoCommon SDK
DisplayPipelineAttributes.ViewDisplayAttributes.VerticalViewportScale Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes.VerticalViewportScale"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double VerticalViewportScale { get; set; }
Public Property VerticalViewportScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace