RhinoCommon SDK
Material.FresnelIndexOfRefraction Property
Rhino WIP for Windows
 Gets or sets the Fresnel index of refraction of the material, default is 1.56
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FresnelIndexOfRefraction { get; set; }
Public Property FresnelIndexOfRefraction As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Material Class
Rhino.DocObjects Namespace