RhinoCommon SDK
MouseCallbackEventArgs.View Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.View"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoView View { get; }
Public ReadOnly Property View As RhinoView
	Get
Property Value
Type: RhinoView
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace