RhinoCommon SDK
InstanceDefinition.LayerStyle Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.LayerStyle"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public InstanceDefinitionLayerStyle LayerStyle { get; }
Public ReadOnly Property LayerStyle As InstanceDefinitionLayerStyle
	Get
Property Value
Type: InstanceDefinitionLayerStyle
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace