RhinoCommon SDK
DisplayPipelineAttributes.MeshDisplayAttributes.MeshWireThickness Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes.MeshWireThickness"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int MeshWireThickness { get; set; }
Public Property MeshWireThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes.MeshDisplayAttributes Class
Rhino.Display Namespace