RhinoCommon SDK
LinearWorkflow.Gamma Property
 Linear workflow gamma
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public float Gamma { get; set; }
Public Property Gamma As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace