RhinoCommon SDK
ICurrentEnvironment.ForLighting Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment.ForLighting"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
RenderEnvironment ForLighting { get; set; }
Property ForLighting As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
Implements
ICurrentEnvironment_Get.ForLighting
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace