RhinoCommon SDK
UserDictionary.ShouldWrite Property
Rhino WIP for Windows
 Writes this entity if the count is larger than 0.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override bool ShouldWrite { get; }
Public Overrides ReadOnly Property ShouldWrite As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace