RhinoCommon SDK
Brep.SolidOrientation Property
Rhino WIP for Windows
 Gets the solid orientation state of this Brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BrepSolidOrientation SolidOrientation { get; }
Public ReadOnly Property SolidOrientation As BrepSolidOrientation
	Get
Property Value
Type: BrepSolidOrientation
See Also
Reference
Brep Class
Rhino.Geometry Namespace