RhinoCommon SDK
SimulatedTexture.OriginalFilename Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.OriginalFilename"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string OriginalFilename { get; }
Public ReadOnly Property OriginalFilename As String
	Get
Property Value
Type: String
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace