RhinoCommon SDK
MenuTaskOriginFactory.UuidOrigin Property
 Returns the Guid of the menutask origin
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid UuidOrigin { set; }
Public WriteOnly Property UuidOrigin As Guid
	Set
Return Value
Type: Guid
 Returns the Guid of the menutask origin
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace