RhinoCommon SDK
TextEntity.FontIndex Property
Rhino WIP for Windows
 Gets or sets the index of font in document font table used by the text.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int FontIndex { get; set; }
Public Property FontIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace