RhinoCommon SDK
Point4dField.Value Property
Rhino WIP for Windows
 Gets or sets the field value
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point4d Value { get; set; }
Public Property Value As Point4d
	Get
	Set
Property Value
Type: Point4d
See Also
Reference
Point4dField Class
Rhino.Render.Fields Namespace