RhinoCommon SDK
ViewInfo.ShowWallpaperInGrayScale Property
Rhino WIP for Windows
 True if wallpaper (if any) is to be shown in gray scale in this view.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ShowWallpaperInGrayScale { get; }
Public ReadOnly Property ShowWallpaperInGrayScale As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace