RhinoCommon SDK
PolylineCurve.PointCount Property
Rhino WIP for Windows
 Gets the number of points in this polyline.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int PointCount { get; }
Public ReadOnly Property PointCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace