RhinoCommon SDK
RhinoObjectSelectionEventArgs.Document Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoObjectSelectionEventArgs.Document"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace