RhinoCommon SDK
MeshFace.B Property
Rhino WIP for Windows
 Gets or sets the second corner index of the mesh face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int B { get; set; }
Public Property B As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace