RhinoCommon SDK
DimensionStyle.AlternateUnitsDisplay Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateUnitsDisplay"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool AlternateUnitsDisplay { get; set; }
Public Property AlternateUnitsDisplay As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace