RhinoCommon SDK
MaterialTableEventArgs.Index Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.MaterialTableEventArgs.Index"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MaterialTableEventArgs Class
Rhino.DocObjects.Tables Namespace