RhinoCommon SDK
Interval.Item Property
Rhino WIP for Windows
 Gets or sets the indexed bound of this Interval.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Double
	Get
	Set
Parameters
index
Type: System.Int32
Bound index (0 = lower; 1 = upper).
Property Value
Type: Double
See Also
Reference
Interval Structure
Rhino.Geometry Namespace