RhinoCommon SDK
SimulatedTexture.Offset Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.Offset"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector2d Offset { get; set; }
Public Property Offset As Vector2d
	Get
	Set
Property Value
Type: Vector2d
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace