RhinoCommon SDK
Particle.Location Property
Rhino WIP for Windows
3d Location of the Particle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Location { get; set; }
Public Property Location As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Particle Class
Rhino.Geometry Namespace