RhinoCommon SDK
ICurrentEnvironment.ForBackground Property
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment.ForBackground"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
RenderEnvironment ForBackground { get; set; }
Property ForBackground As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
Implements
ICurrentEnvironment_Get.ForBackground
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace