RhinoCommon SDK
GetCircle.DeformableDegree Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCircle.DeformableDegree"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int DeformableDegree { get; set; }
Public Property DeformableDegree As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace