RhinoCommon SDK
Field.Tag Property
Rhino WIP for Windows
 Gets or sets an object that contains data to associate with the field.
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Object Tag { get; set; }
Public Property Tag As Object
	Get
	Set
Return Value
Type: Object
 An object that contains information that is associated with the field.
See Also
Reference
Field Class
Rhino.Render.Fields Namespace