RhinoCommon SDK
IWindow.LocalCaption Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.IWindow.LocalCaption"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
string LocalCaption { get; }
ReadOnly Property LocalCaption As String
	Get
Property Value
Type: String
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace