RhinoCommon SDK
ToolbarGroup.Name Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.ToolbarGroup.Name"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace