RhinoCommon SDK
RhinoObject.Visible Property
Gets the object visibility.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Visible { get; }
Public ReadOnly Property Visible As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace