RhinoCommon SDK
CommandLineOption.EnglishName Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.Custom.CommandLineOption.EnglishName"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string EnglishName { get; }
Public ReadOnly Property EnglishName As String
	Get
Property Value
Type: String
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace