RhinoCommon SDK
Ray3d.Position Property
Rhino WIP for Windows
 Gets the starting position of this ray.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Position { get; }
Public ReadOnly Property Position As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace