RhinoCommon SDK
LinetypeTable.ActiveCount Property
Rhino WIP for Windows
 Returns number of linetypes in the linetypes table, excluding deleted linetypes.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace