RhinoCommon SDK
LinearWorkflow.Enabled Property
Rhino WIP for Windows
 Linear workflow active state
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace