RhinoCommon SDK
File3dmObject.ComponentType Property
Rhino WIP for Windows
 Returns ModelGeometry.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace