RhinoCommon SDK
ShowPanelEventArgs.Show Property
Rhino WIP for Windows
 Will be true if showing or false if hiding
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Show { get; }
Public ReadOnly Property Show As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ShowPanelEventArgs Class
Rhino.UI Namespace