RhinoCommon SDK
IThumbnailList.BackgroundColor Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IThumbnailList.BackgroundColor"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
Color BackgroundColor { get; set; }
Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
IThumbnailList Interface
Rhino.UI.Controls Namespace