RhinoCommon SDK
BrepFace.FaceIndex Property
Rhino WIP for Windows
Index of face in Brep.Faces array.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int FaceIndex { get; }
Public ReadOnly Property FaceIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace