RhinoCommon SDK
VolumeMassProperties.CentroidError Property
 Gets the uncertainty in the Centroid calculation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d CentroidError { get; }
Public ReadOnly Property CentroidError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace