RhinoCommon SDK
V6OrdinateDimensionObject.DimOrdinateGeometry Property
 Get the dimension geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6OrdinateDimension DimOrdinateGeometry { get; set; }
Public Property DimOrdinateGeometry As V6OrdinateDimension
	Get
	Set
Property Value
Type: V6OrdinateDimension
See Also
Reference
V6OrdinateDimensionObject Class
Rhino.DocObjects Namespace