RhinoCommon SDK
MeshPoint.ComponentIndex Property
Rhino WIP for Windows
 Gets the component index of the intersecting element in the mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ComponentIndex ComponentIndex { get; }
Public ReadOnly Property ComponentIndex As ComponentIndex
	Get
Property Value
Type: ComponentIndex
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace