RhinoCommon SDK
ColorLAB.Alpha Property
Rhino WIP for Windows
 Gets or sets the Alpha channel. The channel is limited to 0~1.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Alpha { get; set; }
Public Property Alpha As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace