RhinoCommon SDK
DimStyleTable.Count Property
Number of dimstyles in the table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace