RhinoCommon SDK
MeshThicknessMeasurement.MeshIndex Property
Rhino WIP for Windows
 Gets the index of the mesh associated with this thickness measurement.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int MeshIndex { get; }
Public ReadOnly Property MeshIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace