RhinoCommon SDK
RealtimeDisplayModeClassInfo.FullName Property
Rhino WIP for Windows
 Get human-facing class description for RealtimeDisplayMode implementation. This string might show up in the Rhino UI.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract string FullName { get; }
Public MustOverride ReadOnly Property FullName As String
	Get
Property Value
Type: String
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace