RhinoCommon SDK
ViewportInfo.ScreenPortAspect Property
 Gets the sceen aspect ratio.
This is width / height.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ScreenPortAspect { get; }
Public ReadOnly Property ScreenPortAspect As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace