RhinoCommon SDK
ChangeQueue.IsPreview Property
 Return true if this ChangeQueue is created for preview rendering
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsPreview { get; }
Public ReadOnly Property IsPreview As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace