RhinoCommon SDK
Silhouette.SilhouetteType Property
Rhino WIP for Windows
 Gets the type of this silhouette curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SilhouetteType SilhouetteType { get; }
Public ReadOnly Property SilhouetteType As SilhouetteType
	Get
Property Value
Type: SilhouetteType
See Also
Reference
Silhouette Class
Rhino.Geometry Namespace