RhinoCommon SDK
HatchPattern.Defaults.Hatch2 Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Hatch2"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static HatchPattern Hatch2 { get; }
Public Shared ReadOnly Property Hatch2 As HatchPattern
	Get
Property Value
Type: HatchPattern
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace