RhinoCommon SDK
FileWriteOptions.IncludeHistory Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.IncludeHistory"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IncludeHistory { get; set; }
Public Property IncludeHistory As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace