RhinoCommon SDK
Light.SpotAngleRadians Property
Rhino WIP for Windows
 Gets or sets the spot angle in radians.
Ignored for non-spot lights.
angle = 0 to pi/2 (0 to 90 degrees).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double SpotAngleRadians { get; set; }
Public Property SpotAngleRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace