RhinoCommon SDK
Decal.TextureInstanceId Property
Rhino WIP for Windows
 Gets the texture ID for this decal.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid TextureInstanceId { get; }
Public ReadOnly Property TextureInstanceId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
Decal Class
Rhino.Render Namespace