RhinoCommon SDK
V6OrdinateDimension.DefPoint Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.V6OrdinateDimension.DefPoint"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point2d DefPoint { get; set; }
Public Property DefPoint As Point2d
	Get
	Set
Property Value
Type: Point2d
See Also
Reference
V6OrdinateDimension Class
Rhino.Geometry Namespace