RhinoCommon SDK
ArcCurve.Arc Property
Rhino WIP for Windows
 Gets the arc that is contained within this ArcCurve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Arc Arc { get; }
Public ReadOnly Property Arc As Arc
	Get
Property Value
Type: Arc
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace