RhinoCommon SDK
SweepOneRail.IsRoadlikeFront Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsRoadlikeFront"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsRoadlikeFront { get; }
Public ReadOnly Property IsRoadlikeFront As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace