RhinoCommon SDK
Light.Data Property
Rhino WIP for Windows
 Get the actual light data
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Light Data { get; }
Public ReadOnly Property Data As Light
	Get
Property Value
Type: Light
See Also
Reference
Light Class
Rhino.Render.ChangeQueue Namespace