RhinoCommon SDK
ViewCapture.Height Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.Height"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Height { get; set; }
Public Property Height As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ViewCapture Class
Rhino.Display Namespace