RhinoCommon SDK
ConstructionPlane.GridYColor Property
Rhino WIP for Windows
 Gets or sets the color of the grid Y-axis mark.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color GridYColor { get; set; }
Public Property GridYColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace