RhinoCommon SDK
AnnotationBase.Plane Property
 Gets or sets the plane containing the annotation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace