RhinoCommon SDK
Vector3d.MaximumCoordinate Property
Rhino WIP for Windows
 Gets the largest (both positive and negative) component value in this vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double MaximumCoordinate { get; }
Public ReadOnly Property MaximumCoordinate As Double
	Get
Property Value
Type: Double
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace