RhinoCommon SDK
ToolbarFileCollection.Count Property
 Number of open toolbar files
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace