RhinoCommon SDK
Skylight.CustomEnvironment Property
[Missing <summary> documentation for "P:Rhino.Render.Skylight.CustomEnvironment"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid CustomEnvironment { get; set; }
Public Property CustomEnvironment As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Skylight Class
Rhino.Render Namespace