RhinoCommon SDK
StackedDialogPage.EnglishPageTitle Property
Rhino WIP for Windows
 English string used when scripting this page and a user prefixes a command option with "_"
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string EnglishPageTitle { get; }
Public ReadOnly Property EnglishPageTitle As String
	Get
Property Value
Type: String
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace