RhinoCommon SDK
BrepVertex.VertexIndex Property
Rhino WIP for Windows
 Gets the index of this vertex in the Brep.Vertices collection.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int VertexIndex { get; }
Public ReadOnly Property VertexIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace