RhinoCommon SDK
RLeader.TextHeight Property
 Set or get the text height for this leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TextHeight { get; set; }
Public Property TextHeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RLeader Class
Rhino.Geometry Namespace