RhinoCommon SDK
ViewportInfo.FrustumWidth Property
Rhino WIP for Windows
 Gets the frustum width. This is FrustumRight - FrustumLeft.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FrustumWidth { get; }
Public ReadOnly Property FrustumWidth As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace