RhinoCommon SDK
PanelIds.Sun Property
 Rhino sun panel
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid Sun { get; }
Public Shared ReadOnly Property Sun As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace