RhinoCommon SDK
MeshDisplacementInfo.Texture Property
Rhino WIP for Windows
 The texture used as displacement.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderTexture Texture { get; }
Public ReadOnly Property Texture As RenderTexture
	Get
Property Value
Type: RenderTexture
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace