RhinoCommon SDK
UserData.Description Property
Descriptive name of the user data.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual string Description { get; }
Public Overridable ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace