RhinoCommon SDK
MenuTaskOriginFactory.PreviewAppearance Property
Rhino WIP for Windows
 Set the PreviewAppearance if the usercontrol has one
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public PreviewAppearance PreviewAppearance { set; }
Public WriteOnly Property PreviewAppearance As PreviewAppearance
	Set
Property Value
Type: PreviewAppearance
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace