RhinoCommon SDK
CustomRenderContentAttribute.RenderEngineId Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.RenderEngineId"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid RenderEngineId { get; }
Public ReadOnly Property RenderEngineId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace