RhinoCommon SDK
ReplayHistoryData.HistoryVersion Property
Rhino WIP for Windows
 ReplayHistory overrides check the version number to ensure the information saved in the history record is compatible with the current implementation of ReplayHistory
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int HistoryVersion { get; }
Public ReadOnly Property HistoryVersion As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace