RhinoCommon SDK
ViewCapture.ScaleScreenItems Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.ScaleScreenItems"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ScaleScreenItems { get; set; }
Public Property ScaleScreenItems As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewCapture Class
Rhino.Display Namespace