RhinoCommon SDK
File3dmWriteOptions.SaveRenderMeshes Property
Rhino WIP for Windows
Note: This API is now obsolete.
 Include Render meshes in the file. Default is true
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Specify analysis meshes for object types individually. Use EnableAnalysisMeshes()")]
public bool SaveRenderMeshes { get; set; }
<ObsoleteAttribute("Specify analysis meshes for object types individually. Use EnableAnalysisMeshes()")>
Public Property SaveRenderMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace