RhinoCommon SDK
SaveFileDialog.DefaultExt Property
Rhino WIP for Windows
 The default file name extension. The returned string does not include the period.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string DefaultExt { get; set; }
Public Property DefaultExt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
SaveFileDialog Class
Rhino.UI Namespace