RhinoCommon SDK
DisplayPipeline.Viewport Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.Viewport"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace