RhinoCommon SDK
Material.FresnelReflections Property
Rhino WIP for Windows
 Gets or sets if fresnel reflections are used.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool FresnelReflections { get; set; }
Public Property FresnelReflections As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Material Class
Rhino.DocObjects Namespace