RhinoCommon SDK
Circle.Normal Property
 Gets the normal vector for this circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d Normal { get; }
Public ReadOnly Property Normal As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Circle Structure
Rhino.Geometry Namespace