RhinoCommon SDK
RenderSettings.AmbientLight Property
Rhino WIP for Windows
 Gets or sets the ambient light color used in rendering.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color AmbientLight { get; set; }
Public Property AmbientLight As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
RenderSettings Class
Rhino.Render Namespace