RhinoCommon SDK
ThumbnailListImpl.ViewModel Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailListImpl.ViewModel"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RdkThumbnaillistViewModel ViewModel { get; }
Public ReadOnly Property ViewModel As RdkThumbnaillistViewModel
	Get
Property Value
Type: RdkThumbnaillistViewModel
See Also
Reference
ThumbnailListImpl Class
Rhino.UI.Controls Namespace