RhinoCommon SDK
FileWriteOptions.Xform Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.Xform"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform Xform { get; set; }
Public Property Xform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace