RhinoCommon SDK
Vector3d.ZAxis Property
 Gets the value of the vector with components 0,0,1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Vector3d ZAxis { get; }
Public Shared ReadOnly Property ZAxis As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace