RhinoCommon SDK
NurbsSurface.OrderV Property
Rhino WIP for Windows
 Gets the order in the V direction.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int OrderV { get; }
Public ReadOnly Property OrderV As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace