RhinoCommon SDK
InstanceDefinition.Description Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.Description"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace