RhinoCommon SDK
LightTable.Skylight Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTable.Skylight"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Skylight Skylight { get; }
Public ReadOnly Property Skylight As Skylight
	Get
Property Value
Type: Skylight
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace