RhinoCommon SDK
Material.Shine Property
Rhino WIP for Windows
 Gets or sets the shine factor of the material.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Shine { get; set; }
Public Property Shine As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Material Class
Rhino.DocObjects Namespace