RhinoCommon SDK
LightTableEventArgs.OldState Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.OldState"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Light OldState { get; }
Public ReadOnly Property OldState As Light
	Get
Property Value
Type: Light
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace