RhinoCommon SDK
Material.MeshInstanceId Property
Rhino WIP for Windows
 Get the material InstanceAncestry
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public uint MeshInstanceId { get; }
Public ReadOnly Property MeshInstanceId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
Material Class
Rhino.Render.ChangeQueue Namespace