RhinoCommon SDK
ComponentStatus.IsHighlighted Property
Rhino WIP for Windows
 Returns true if highlighted. False otherwise.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsHighlighted { get; }
Public ReadOnly Property IsHighlighted As Boolean
	Get
Return Value
Type: Boolean
The component status for highlighted.
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace