RhinoCommon SDK
ViewportInfo.IsCameraLocationLocked Property
Rhino WIP for Windows
 Gets or sets a value that indicates whether the camera location is unmodifiable.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsCameraLocationLocked { get; set; }
Public Property IsCameraLocationLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace