RhinoCommon SDK
MenuTaskOriginFactory.UserControl Property
Rhino WIP for Windows
 Set the RhRdkUserControl
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhRdkUserControl UserControl { set; }
Public WriteOnly Property UserControl As RhRdkUserControl
	Set
Property Value
Type: RhRdkUserControl
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace