RhinoCommon SDK
RhinoViewport.WallpaperFilename Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.WallpaperFilename"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string WallpaperFilename { get; }
Public ReadOnly Property WallpaperFilename As String
	Get
Property Value
Type: String
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace