RhinoCommon SDK
DisplayPipeline.IsPrinting Property
Rhino WIP for Windows
 Gets a value that indicates whether this pipeline is currently drawing for printing purposes.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsPrinting { get; }
Public ReadOnly Property IsPrinting As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace