RhinoCommon SDK
Layer.Color Property
 Gets or sets the display color for this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color Color { get; set; }
Public Property Color As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Layer Class
Rhino.DocObjects Namespace