RhinoCommon SDK
RenderSettings.RenderCurves Property
Rhino WIP for Windows
 Gets or sets a value indicating whether to instruct the rendering engine to show curves.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool RenderCurves { get; set; }
Public Property RenderCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RenderSettings Class
Rhino.Render Namespace