RhinoCommon SDK
ImageFileEventArgs.Event Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.Event"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ImageFileEvent Event { get; }
Public ReadOnly Property Event As ImageFileEvent
	Get
Property Value
Type: ImageFileEvent
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace