RhinoCommon SDK
Field.Key Property
 Field key value string set by constructor
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Key { get; }
Public ReadOnly Property Key As String
	Get
Property Value
Type: String
See Also
Reference
Field Class
Rhino.Render.Fields Namespace