RhinoCommon SDK
EarthAnchorPoint.ModelEast Property
Rhino WIP for Windows
Earth directions in model coordinates.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d ModelEast { get; set; }
Public Property ModelEast As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace