RhinoCommon SDK
RenderPrimitive.BoundingBox Property
Rhino WIP for Windows
 The bounding box for this primitive.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace