RhinoCommon SDK
Box.BoundingBox Property
Rhino WIP for Windows
 Gets the world axis aligned Bounding box for this oriented box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
Box Structure
Rhino.Geometry Namespace