RhinoCommon SDK
ModelComponent.Name Property
 Gets or sets the name
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual string Name { get; set; }
Public Overridable Property Name As String
	Get
	Set
Property Value
Type: String
Exceptions
Exception | Condition
InvalidOperationException |  When setting the Name failed. This usually happend because the instance Name is already locked.
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace