RhinoCommon SDK
FileObjReadOptions.IgnoreTextures Property
Rhino WIP for Windows
 Determines whether textures are read from the .mtl file, if it exists.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IgnoreTextures { get; set; }
Public Property IgnoreTextures As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace