RhinoCommon SDK
BitmapEntry.FileName Property
Rhino WIP for Windows
The name of this bitmap.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
See Also
Reference
BitmapEntry Class
Rhino.DocObjects Namespace