RhinoCommon SDK
VolumeMassProperties.WorldCoordinatesMomentsOfInertiaError Property
Rhino WIP for Windows
 Uncertainty in world coordinates moments of inertia calculation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d WorldCoordinatesMomentsOfInertiaError { get; }
Public ReadOnly Property WorldCoordinatesMomentsOfInertiaError As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace