RhinoCommon SDK
MappingChannelCollection.Channels Property
Rhino WIP for Windows
 Enumerate all available channels in this mapping
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerable<MappingChannel> Channels { get; }
Public ReadOnly Property Channels As IEnumerable(Of MappingChannel)
	Get
Property Value
Type: IEnumerable<MappingChannel>
See Also
Reference
MappingChannelCollection Class
Rhino.Render.ChangeQueue Namespace