RhinoCommon SDK
Point3d.Z Property
Rhino WIP for Windows
 Gets or sets the Z (third) coordinate of this point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Z { get; set; }
Public Property Z As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace