RhinoCommon SDK
InstanceReferenceGeometry.Xform Property
Transformation for this reference.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Transform Xform { get; }
Public ReadOnly Property Xform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
InstanceReferenceGeometry Class
Rhino.Geometry Namespace