RhinoCommon SDK
VisualAnalysisMode.Id Property
Rhino WIP for Windows
 Gets the visual analysis mode GUID. The Guid is specified with the GuidAttribute applied to the class.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace