RhinoCommon SDK
Transform.IsIdentity Property
Rhino WIP for Windows
Return true if this Transform is the identity transform
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsIdentity { get; }
Public ReadOnly Property IsIdentity As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Transform Structure
Rhino.Geometry Namespace