RhinoCommon SDK
TwoColorRenderTexture.Texture1Amount Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.Texture1Amount"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Texture1Amount { get; set; }
Public Property Texture1Amount As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace