RhinoCommon SDK
GetPolyline.ThirdPointPrompt Property
Rhino WIP for Windows
Prompt when getting third point
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string ThirdPointPrompt { get; set; }
Public Property ThirdPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace