RhinoCommon SDK
Vector3f.X Property
Rhino WIP for Windows
 Gets or sets the X (first) component of this vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public float X { get; set; }
Public Property X As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace