RhinoCommon SDK
NamedValue.Value Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.NamedValue.Value"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Object Value { get; set; }
Public Property Value As Object
	Get
	Set
Property Value
Type: Object
See Also
Reference
NamedValue Class
Rhino.Render Namespace