RhinoCommon SDK
DimensionStyle.TextHorizontalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextHorizontalAlignment"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle.HorizontalAlignment TextHorizontalAlignment { get; set; }
Public Property TextHorizontalAlignment As DimensionStyle.HorizontalAlignment
	Get
	Set
Property Value
Type: DimensionStyle.HorizontalAlignment
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace