RhinoCommon SDK
Vector2d.Zero Property
 Gets the value of the vector with components 0,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Vector2d Zero { get; }
Public Shared ReadOnly Property Zero As Vector2d
	Get
Property Value
Type: Vector2d
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace