RhinoCommon SDK
ImageFileEventArgs.FileName Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.FileName"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace