RhinoCommon SDK
Transform.M00 Property
Rhino WIP for Windows
Gets or sets this[0,0].
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double M00 { get; set; }
Public Property M00 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Transform Structure
Rhino.Geometry Namespace