RhinoCommon SDK
ObjectEnumeratorSettings.ClassTypeFilter Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.ClassTypeFilter"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Type ClassTypeFilter { get; set; }
Public Property ClassTypeFilter As Type
	Get
	Set
Property Value
Type: Type
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace