RhinoCommon SDK
ShutLiningCurveInfo.CurveIntervals Property
Rhino WIP for Windows
 The parts of the curve to use as profiles.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ReadOnlyCollection<Interval> CurveIntervals { get; }
Public ReadOnly Property CurveIntervals As ReadOnlyCollection(Of Interval)
	Get
Property Value
Type: ReadOnlyCollection<Interval>
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace