RhinoCommon SDK
CurveObject.CurveGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.CurveObject.CurveGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve CurveGeometry { get; }
Public ReadOnly Property CurveGeometry As Curve
	Get
Property Value
Type: Curve
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace