RhinoCommon SDK
OpenFileDialog.InitialDirectory Property
Rhino WIP for Windows
 Gets or sets the initial directory displayed by the file dialog box.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string InitialDirectory { get; set; }
Public Property InitialDirectory As String
	Get
	Set
Property Value
Type: String
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace