RhinoCommon SDK
PanelIds.Libraries Property
 Rhino render properties panel
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid Libraries { get; }
Public Shared ReadOnly Property Libraries As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace