RhinoCommon SDK
V6Dimension.TextRotation Property
[Missing <summary> documentation for "P:Rhino.Geometry.V6Dimension.TextRotation"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TextRotation { get; set; }
Public Property TextRotation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
V6Dimension Class
Rhino.Geometry Namespace