RhinoCommon SDK
RenderContentSerializer.EnglishDescription Property
 English string describing this plug-in
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract string EnglishDescription { get; }
Public MustOverride ReadOnly Property EnglishDescription As String
	Get
Property Value
Type: String
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace