RhinoCommon SDK
Arc.AngleDegrees Property
Rhino WIP for Windows
 Gets or sets the sweep -or subtended- angle (in Radians) for this arc segment.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double AngleDegrees { get; set; }
Public Property AngleDegrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Arc Structure
Rhino.Geometry Namespace