RhinoCommon SDK
ViewportInfo.IsFrustumLeftRightSymmetric Property
Rhino WIP for Windows
 Gets or sets a value that indicates whether the camera frustum has a vertical symmetry axis.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool IsFrustumLeftRightSymmetric { get; set; }
Public Property IsFrustumLeftRightSymmetric As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace