RhinoCommon SDK
StringTable.Count Property
Rhino WIP for Windows
 The number of user data strings in the current document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace