RhinoCommon SDK
Vector3f.Z Property
 Gets or sets the Z (third) component of this vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public float Z { get; set; }
Public Property Z As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace