RhinoCommon SDK
ReduceMeshParameters.NormalizeMeshSize Property
Rhino WIP for Windows
If true mesh is fitted to an axis aligned unit cube until reduction is complete
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool NormalizeMeshSize { get; set; }
Public Property NormalizeMeshSize As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace