RhinoCommon SDK
AnnotationText.FormatHeight Property
 Text format height (Wrapping rectangle)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FormatHeight { get; set; }
Public Property FormatHeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace