RhinoCommon SDK
ReduceMeshParameters.ProgressReporter Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Geometry.ReduceMeshParameters.ProgressReporter"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IProgress<double> ProgressReporter { get; set; }
Public Property ProgressReporter As IProgress(Of Double)
	Get
	Set
Property Value
Type: IProgress<Double>
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace