RhinoCommon SDK
ContentHash.ByteCount Property
Rhino WIP for Windows
 Gets the length of the content, in bytes.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ulong ByteCount { get; }
Public ReadOnly Property ByteCount As ULong
	Get
Property Value
Type: UInt64
See Also
Reference
ContentHash Class
Rhino.FileIO Namespace