RhinoCommon SDK
V6CentermarkObject.CentermarkGeometry Property
Rhino WIP for Windows
 Get the dimension geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public V6Centermark CentermarkGeometry { get; set; }
Public Property CentermarkGeometry As V6Centermark
	Get
	Set
Property Value
Type: V6Centermark
See Also
Reference
V6CentermarkObject Class
Rhino.DocObjects Namespace