RhinoCommon SDK
ViewportInfo.CameraDirection Property
 Gets the direction that the camera faces.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d CameraDirection { get; }
Public ReadOnly Property CameraDirection As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace