RhinoCommon SDK
ShutLiningCurveInfo.Enabled Property
Rhino WIP for Windows
 If true, this curve is active.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Enabled { get; }
Public ReadOnly Property Enabled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace