RhinoCommon SDK
ICollapsibleSectionHolder.Sections Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSectionHolder.Sections"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
IEnumerable<ICollapsibleSection> Sections { get; }
ReadOnly Property Sections As IEnumerable(Of ICollapsibleSection)
	Get
Property Value
Type: IEnumerable<ICollapsibleSection>
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace