RhinoCommon SDK
RdkViewModel.CppPointer Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkViewModel.CppPointer"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Implements
IHasCppImplementation.CppPointer
See Also
Reference
RdkViewModel Class
Rhino.UI.Controls Namespace