RhinoCommon SDK
RhinoObject.Attributes Property
Rhino WIP for Windows
 Gets or sets the object attributes.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ObjectAttributes Attributes { get; set; }
Public Property Attributes As ObjectAttributes
	Get
	Set
Property Value
Type: ObjectAttributes
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace