RhinoCommon SDK
PickContext.PickLine Property
Rhino WIP for Windows
 pick chord starts on near clipping plane and ends on far clipping plane.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Line PickLine { get; set; }
Public Property PickLine As Line
	Get
	Set
Property Value
Type: Line
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace