RhinoCommon SDK
Line.ToZ Property
 Gets or sets the Z coordinate of the line To point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ToZ { get; set; }
Public Property ToZ As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Line Structure
Rhino.Geometry Namespace