RhinoCommon SDK
RdkThumbnaillistViewModel.RenderContentCollectionSelectionReader Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkThumbnaillistViewModel.RenderContentCollectionSelectionReader"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ContentCollection RenderContentCollectionSelectionReader { get; }
Public ReadOnly Property RenderContentCollectionSelectionReader As ContentCollection
	Get
Property Value
Type: ContentCollection
See Also
Reference
RdkThumbnaillistViewModel Class
Rhino.UI.Controls Namespace