RhinoCommon SDK
RhinoObjectSelectionEventArgs.RhinoObjects Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoObjectSelectionEventArgs.RhinoObjects"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoObject[] RhinoObjects { get; }
Public ReadOnly Property RhinoObjects As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace