RhinoCommon SDK
GetCone.DefaultSize Property
Rhino WIP for Windows
 Default radius or diameter (based on InDiameterMode)
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double DefaultSize { get; set; }
Public Property DefaultSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace