RhinoCommon SDK
TwistSpaceMorph.TwistAxis Property
Rhino WIP for Windows
Axis to rotate about.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Line TwistAxis { get; set; }
Public Property TwistAxis As Line
	Get
	Set
Property Value
Type: Line
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace