RhinoCommon SDK
DimStyleTable.CurrentId Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTable.CurrentId"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid CurrentId { get; }
Public ReadOnly Property CurrentId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace