RhinoCommon SDK
MeshThicknessMeasurement.Point Property
Rhino WIP for Windows
 Gets the location of the thickness measurement.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Point { get; }
Public ReadOnly Property Point As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace