RhinoCommon SDK
AnnotationBase.Index Property
Rhino WIP for Windows
 Index of DimensionStyleV5 in document DimStyle table used by the dimension.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Index { get; set; }
Public Property Index As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace