RhinoCommon SDK
RdkThumbnaillistViewModel.RenderContentCollectionWriter Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkThumbnaillistViewModel.RenderContentCollectionWriter"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ContentCollection RenderContentCollectionWriter { get; }
Public ReadOnly Property RenderContentCollectionWriter As ContentCollection
	Get
Property Value
Type: ContentCollection
See Also
Reference
RdkThumbnaillistViewModel Class
Rhino.UI.Controls Namespace