RhinoCommon SDK
FontTable.Count Property
Number of fonts in the table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
FontTable Class
Rhino.DocObjects.Tables Namespace