RhinoCommon SDK
Text3d.Italic Property
 Gets or sets whether this Text3d object will be drawn in Italics.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Italic { get; set; }
Public Property Italic As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Text3d Class
Rhino.Display Namespace