RhinoCommon SDK
GetPolyline.SecondPointPrompt Property
Rhino WIP for Windows
Prompt when getting second point
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string SecondPointPrompt { get; set; }
Public Property SecondPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace