RhinoCommon SDK
StringParserSettings.ParseFullStopAsDigitSeparator Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseFullStopAsDigitSeparator"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ParseFullStopAsDigitSeparator { get; set; }
Public Property ParseFullStopAsDigitSeparator As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace