RhinoCommon SDK
Silhouette.Curve Property
Rhino WIP for Windows
 3D curve representing the shape of the silhouette.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Curve Curve { get; }
Public ReadOnly Property Curve As Curve
	Get
Property Value
Type: Curve
See Also
Reference
Silhouette Class
Rhino.Geometry Namespace