RhinoCommon SDK
File3dm.InstanceDefinitions Property
Note: This API is now obsolete.
 Instance definitions in this file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Use the new AllDimStyles property")]
public IList<InstanceDefinitionGeometry> InstanceDefinitions { get; }
<ObsoleteAttribute("Use the new AllDimStyles property")>
Public ReadOnly Property InstanceDefinitions As IList(Of InstanceDefinitionGeometry)
	Get
Property Value
Type: IList<InstanceDefinitionGeometry>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace