RhinoCommon SDK
LinetypeTable.ByParentLinetypeName Property
 Returns the text name of the byparent linetype.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string ByParentLinetypeName { get; }
Public ReadOnly Property ByParentLinetypeName As String
	Get
Property Value
Type: String
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace