RhinoCommon SDK
MeshingParameters.SimplePlanes Property
Rhino WIP for Windows
 Gets or sets a value indicating whether or not planar areas are allowed to be meshed in a simplified manner.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SimplePlanes { get; set; }
Public Property SimplePlanes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace