RhinoCommon SDK
Box.Unset Property
Rhino WIP for Windows
 Gets a Box whose base plane and axis dimensions are all Unset.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Box Unset { get; }
Public Shared ReadOnly Property Unset As Box
	Get
Property Value
Type: Box
See Also
Reference
Box Structure
Rhino.Geometry Namespace