RhinoCommon SDK
ObjectEnumeratorSettings.VisibleFilter Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.VisibleFilter"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool VisibleFilter { get; set; }
Public Property VisibleFilter As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace