RhinoCommon SDK
MeshDisplacementInfo.FaceLimit Property
Rhino WIP for Windows
 Runs a mesh reduction as a post process o simplify the result of displacement to meet the specified number of faces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int FaceLimit { get; set; }
Public Property FaceLimit As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace