RhinoCommon SDK
MeshClash.MeshA Property
Rhino WIP for Windows
 Gets the first mesh.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Mesh MeshA { get; }
Public ReadOnly Property MeshA As Mesh
	Get
Property Value
Type: Mesh
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace