RhinoCommon SDK
Sun.Azimuth Property
[Missing <summary> documentation for "P:Rhino.Render.Sun.Azimuth"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Azimuth { get; }
Public ReadOnly Property Azimuth As Double
	Get
Property Value
Type: Double
See Also
Reference
Sun Class
Rhino.Render Namespace