RhinoCommon SDK
MeshClash.ClashPoint Property
Rhino WIP for Windows
 If valid, then the sphere centered at ClashPoint of ClashRadius distance interesects the clashing meshes.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d ClashPoint { get; }
Public ReadOnly Property ClashPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace