RhinoCommon SDK
RenderPrimitive.RhinoObject Property
Rhino WIP for Windows
 The Rhino object associated with this render primitive.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoObject RhinoObject { get; }
Public ReadOnly Property RhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace