RhinoCommon SDK
ColorCMYK.M Property
Rhino WIP for Windows
 Gets or sets the Magenta channel value. Magenta channels are limited to the 0~1 range.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double M { get; set; }
Public Property M As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace