RhinoCommon SDK
RdkThumbnaillistViewModel.RenderContentCollectionSelectionWriter Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkThumbnaillistViewModel.RenderContentCollectionSelectionWriter"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ContentCollection RenderContentCollectionSelectionWriter { get; }
Public ReadOnly Property RenderContentCollectionSelectionWriter As ContentCollection
	Get
Property Value
Type: ContentCollection
See Also
Reference
RdkThumbnaillistViewModel Class
Rhino.UI.Controls Namespace