RhinoCommon SDK
RhinoObject.GroupCount Property
Rhino WIP for Windows
Number of groups object belongs to.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int GroupCount { get; }
Public ReadOnly Property GroupCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace