RhinoCommon SDK
IWindow.EnglishCaption Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IWindow.EnglishCaption"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
string EnglishCaption { get; }
ReadOnly Property EnglishCaption As String
	Get
Property Value
Type: String
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace