RhinoCommon SDK
RenderEnvironmentTable.Item Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Render.RenderEnvironmentTable.Item(System.Int32)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderEnvironment this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As RenderEnvironment
	Get
Parameters
index
Type: System.Int32
Property Value
Type: RenderEnvironment
See Also
Reference
RenderEnvironmentTable Class
Rhino.Render Namespace