RhinoCommon SDK
Sphere.Radius Property
 Gets or sets the Radius for this sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace