RhinoCommon SDK
ViewCapture.Width Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.Width"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Width { get; set; }
Public Property Width As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ViewCapture Class
Rhino.Display Namespace