RhinoCommon SDK
RdkBreadCrumbViewModel.NmbOfSelected Property
Rhino WIP for Windows
[Missing <summary> documentation for "P:Rhino.UI.Controls.RdkBreadCrumbViewModel.NmbOfSelected"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int NmbOfSelected { get; }
Public ReadOnly Property NmbOfSelected As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RdkBreadCrumbViewModel Class
Rhino.UI.Controls Namespace