RhinoCommon SDK
DisplayRenderSettings.CullBackFaces Property
Rhino WIP for Windows
 True if backfaces should be culled
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool CullBackFaces { get; }
Public ReadOnly Property CullBackFaces As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayRenderSettings Class
Rhino.Render.ChangeQueue Namespace