RhinoCommon SDK
MeshClash.MeshB Property
Rhino WIP for Windows
 Gets the second mesh.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Mesh MeshB { get; }
Public ReadOnly Property MeshB As Mesh
	Get
Property Value
Type: Mesh
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace