RhinoCommon SDK
Layer.ComponentType Property
Rhino WIP for Windows
 Returns Layer.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
See Also
Reference
Layer Class
Rhino.DocObjects Namespace