RhinoCommon SDK
Decal.Origin Property
 Gets the origin of the decal in world space.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Origin { get; }
Public ReadOnly Property Origin As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Decal Class
Rhino.Render Namespace