RhinoCommon SDK
RenderSettings.Dithering Property
 Get the document dithering interface
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Dithering Dithering { get; }
Public ReadOnly Property Dithering As Dithering
	Get
Property Value
Type: Dithering
See Also
Reference
RenderSettings Class
Rhino.Render Namespace