RhinoCommon SDK
V6Dimension Properties
The V6Dimension type exposes the following members.
Properties
Name | Description
DetailMeasured
DimstyleId
DistanceScale
Measurement
Plane
TextRotation
UseDefaultTextPoint
UserTextString
Top
See Also
Reference
V6Dimension Class
Rhino.Geometry Namespace