RhinoCommon SDK
AnnotationArrowhead Properties
Rhino WIP for Windows
The AnnotationArrowhead type exposes the following members.
Properties
Name | Description
ArrowBlockId
 Id of block used for user-defined arrowhead
ArrowheadType
 Type of arrowhead used by annotation
Top
See Also
Reference
AnnotationArrowhead Class
Rhino.Geometry Namespace