RhinoCommon SDK
HiddenLineDrawingParameters Properties
The HiddenLineDrawingParameters type exposes the following members.
Properties
Name | Description
AbsoluteTolerance
 Absolute tolerance is used to decide if curves overlap or intersect. A suggested value is to use RhinoDoc.AbsoluteTolerance
Flatten
 Flatten the computed geometry
IncludeTangentEdges
 Include tangent edges in hidden line drawing (default is true)
IncludeTangentSeams
 Include tangent seams in hidden line drawing (default is true)
Top
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace