RhinoCommon SDK
V6RadialDimension Properties
Rhino WIP for Windows
The V6RadialDimension type exposes the following members.
Properties
Name | Description
CenterPoint
DimlinePoint
KneePoint
RadiusPoint
Type
Top
See Also
Reference
V6RadialDimension Class
Rhino.Geometry Namespace