RhinoCommon SDK
BitmapTable Properties
The BitmapTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns Image.
 (Overrides CommonComponentTable<T>.ComponentType.)
Count
Gets the number of bitmaps in the table.
 (Overrides CommonComponentTable<T>.Count.)
Document
Gets the document that owns this bitmap table.
Item
 Conceptually, the bitmap table is an array of bitmaps. The operator[] can be used to get individual bitmaps.
Top
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace