RhinoCommon SDK
DynamicObjectTransform Properties
Rhino WIP for Windows
The DynamicObjectTransform type exposes the following members.
Properties
Name | Description
MeshInstanceId
 Get the mesh instance id for this dynamic object.
Transform
 Transform for the DynamicObject
Top
See Also
Reference
DynamicObjectTransform Class
Rhino.Render.ChangeQueue Namespace