RhinoCommon SDK
RhinoModifyObjectAttributesEventArgs Properties
Rhino WIP for Windows
The RhinoModifyObjectAttributesEventArgs type exposes the following members.
Properties
Name | Description
Document
NewAttributes
OldAttributes
RhinoObject
Top
See Also
Reference
RhinoModifyObjectAttributesEventArgs Class
Rhino.DocObjects Namespace