RhinoCommon SDK
V6OrdinateDimension Properties
Rhino WIP for Windows
The V6OrdinateDimension type exposes the following members.
Properties
Name | Description
DefPoint
KinkOffset1
KinkOffset2
KinkPoint1
KinkPoint2
LeaderPoint
Type
Top
See Also
Reference
V6OrdinateDimension Class
Rhino.Geometry Namespace