RhinoCommon SDK
ViewCapture Properties
Rhino WIP for Windows
The ViewCapture type exposes the following members.
Properties
Name | Description
DrawAxes
DrawGrid
DrawGridAxes
Height
ScaleScreenItems
TransparentBackground
Width
Top
See Also
Reference
ViewCapture Class
Rhino.Display Namespace