RhinoCommon SDK
LocalizeStringPair Properties
Rhino WIP for Windows
The LocalizeStringPair type exposes the following members.
Properties
Name | Description
English
Local
Top
See Also
Reference
LocalizeStringPair Class
Rhino.UI Namespace