RhinoCommon SDK
IThumbnailList Properties
Rhino WIP for Windows
The IThumbnailList type exposes the following members.
Properties
Name | Description
BackgroundColor
CEC
Height
Hidden
ShowUnits
TreeModeOnly
ViewModel
Top
See Also
Reference
IThumbnailList Interface
Rhino.UI.Controls Namespace