RhinoCommon SDK
PreviewAppearance Properties
The PreviewAppearance type exposes the following members.
Properties
Name | Description
CppPointer
 Previewappearances c++ pointer
Top
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace