RhinoCommon SDK
RhinoDocCommonTable<T> Properties
Rhino WIP for Windows
The RhinoDocCommonTable<T> generic type exposes the following members.
Properties
Name | Description
Document
Document that owns this table.
Top
See Also
Reference
RhinoDocCommonTable<T> Class
Rhino.DocObjects.Tables Namespace