RhinoCommon SDK
CustomRenderContentAttribute Properties
Rhino WIP for Windows
The CustomRenderContentAttribute type exposes the following members.
Properties
Name | Description
Category
ImageBased
IsBuiltIn
IsElevated
RenderEngineId
Top
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace