RhinoCommon SDK
RdkThumbnaillistViewModel Properties
The RdkThumbnaillistViewModel type exposes the following members.
Properties
Name | Description
CEC
Collection
Kind
RenderContentCollectionReader
RenderContentCollectionSelectionReader
RenderContentCollectionSelectionWriter
RenderContentCollectionWriter
RenderContentLookupReader
RenderContentLookupWriter
Selected
Type
Top
See Also
Reference
RdkThumbnaillistViewModel Class
Rhino.UI.Controls Namespace