RhinoCommon SDK
ThumbArray Properties
Rhino WIP for Windows
The ThumbArray type exposes the following members.
Properties
Name | Description
CppPointer
Top
See Also
Reference
ThumbArray Class
Rhino.Render Namespace