RhinoCommon SDK
V6LinearDimension Properties
The V6LinearDimension type exposes the following members.
Properties
Name | Description
ArrowPoint1
ArrowPoint2
DefPoint1
DefPoint2
DimlinePoint
Type
Top
See Also
Reference
V6LinearDimension Class
Rhino.Geometry Namespace