RhinoCommon SDK
RealtimeDisplayModeClassInfo Properties
The RealtimeDisplayModeClassInfo type exposes the following members.
Properties
Name | Description
ClassName
 Get human-facing class name for RealtimeDisplayMode implementation. This name will show up in the Rhino UI.
FullName
 Get human-facing class description for RealtimeDisplayMode implementation. This string might show up in the Rhino UI.
GUID
 Get the RealtimeDisplayMode implementation GUID
RealtimeDisplayModeType
 Get the type being registered.
Top
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace