RhinoCommon SDK
ViewInfo Properties
The ViewInfo type exposes the following members.
Properties
Name | Description
Name
 Gets or sets the name of the NamedView.
ShowWallpaperInGrayScale
 True if wallpaper (if any) is to be shown in gray scale in this view.
Viewport
 Gets the viewport, or viewing frustum, associated with this view.
WallpaperFilename
 Get filename for wallpaper set to this view, if any.
WallpaperHidden
 True if wallpaper (if any) is to be hidden from this view.
Top
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace