RhinoCommon SDK
RTree Properties
Rhino WIP for Windows
The RTree type exposes the following members.
Properties
Name | Description
Count
 Gets the number of items in this tree.
Top
See Also
Reference
RTree Class
Rhino.Geometry Namespace