RhinoCommon SDK
ViewEventArgs Properties
Rhino WIP for Windows
The ViewEventArgs type exposes the following members.
Properties
Name | Description
View
Top
See Also
Reference
ViewEventArgs Class
Rhino.Display Namespace