RhinoCommon SDK
RadialDimension Properties
The RadialDimension type exposes the following members.
Properties
Name | Description
DimensionStyleIndex
 Index of DimensionStyleV5 in document DimStyle table used by the dimension.
IsDiameterDimension
 Gets a value indicating whether the value refers to the diameter, rather than the radius.
Top
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace