RhinoCommon SDK
ShowPanelEventArgs Properties
Rhino WIP for Windows
The ShowPanelEventArgs type exposes the following members.
Properties
Name | Description
Show
 Will be true if showing or false if hiding
Top
See Also
Reference
ShowPanelEventArgs Class
Rhino.UI Namespace