RhinoCommon SDK
OptionToggle Properties
Rhino WIP for Windows
The OptionToggle type exposes the following members.
Properties
Name | Description
CurrentValue
InitialValue
Top
See Also
Reference
OptionToggle Class
Rhino.Input.Custom Namespace