RhinoCommon SDK
File3dmLayerTable Properties
Rhino WIP for Windows
The File3dmLayerTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns Layer.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
See Also
Reference
File3dmLayerTable Class
Rhino.FileIO Namespace