RhinoCommon SDK
RLeader Properties
The RLeader type exposes the following members.
Properties
Name | Description
ContentType
 Type of annotation on the leader Currently only text
Curve
 Gets the curve used by this leader
DimstyleId
 Get or set the id of this leader's dimstyle
Plane
 Get and set Leaders Plane
Points2D
 Get or set the 2d points defining the curve used by this leader
Points3D
 Get or set the 3d points defining the curve used by this leader
TextHeight
 Set or get the text height for this leader
TextString
 Return text string for this leader
Top
See Also
Reference
RLeader Class
Rhino.Geometry Namespace