RhinoCommon SDK
Color4f Properties
Rhino WIP for Windows
The Color4f type exposes the following members.
Properties
Name | Description
A
B
Black
Empty
G
R
White
Top
See Also
Reference
Color4f Structure
Rhino.Display Namespace