RhinoCommon SDK
FileWriteOptions Properties
Rhino WIP for Windows
The FileWriteOptions type exposes the following members.
Properties
Name | Description
FileVersion
IncludeBitmapTable
IncludeHistory
IncludePreviewImage
IncludeRenderMeshes
SuppressDialogBoxes
WriteAsTemplate
WriteGeometryOnly
WriteSelectedObjectsOnly
WriteUserData
Xform
Top
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace