RhinoCommon SDK
Surface Properties
Rhino WIP for Windows
The Surface type exposes the following members.
Properties
Name | Description
IsSolid
 Gets a values indicating whether a surface is solid.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace