RhinoCommon SDK
LinearWorkflow Properties
Rhino WIP for Windows
The LinearWorkflow type exposes the following members.
Properties
Name | Description
Enabled
 Linear workflow active state
Gamma
 Linear workflow gamma
Hash
 Linear workflow CRC
Top
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace