RhinoCommon SDK
GroupTable Properties
The GroupTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of groups in the group table.
 (Overrides CommonComponentTable<T>.Count.)
Document
Document that owns this group table.
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace