RhinoCommon SDK
ThumbData Properties
Rhino WIP for Windows
The ThumbData type exposes the following members.
Properties
Name | Description
Child
Id
Image
Intensity
InUse
Name
Selected
Tags
Type
Top
See Also
Reference
ThumbData Class
Rhino.UI.Controls Namespace