RhinoCommon SDK
Font Properties
Rhino WIP for Windows
The Font type exposes the following members.
Properties
Name | Description
Bold
FaceName
Italic
Strikeout
Style
Underlined
Weight
Top
See Also
Reference
Font Class
Rhino.DocObjects Namespace