RhinoCommon SDK
DimStyleTable Properties
The DimStyleTable type exposes the following members.
Properties
Name | Description
BuiltInStyles
 Creates an array of default AnnotationStyle objects
ComponentType
 Returns DimStyle.
 (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of dimstyles in the table.
Current
CurrentId
CurrentIndex
Document
Document that owns this dimstyle table.
Item
Top
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace