RhinoCommon SDK
Mesh Properties
Rhino WIP for Windows
The Mesh type exposes the following members.
Properties
Name | Description
Mapping
 Get the mapping for this mesh.
SingleMapping
 Get texture mapping info as single mapping
Top
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace