RhinoCommon SDK
AnnotationText Properties
Rhino WIP for Windows
The AnnotationText type exposes the following members.
Properties
Name | Description
AnnotationStyleId
 Get this text's dimstyle id
FormatHeight
 Text format height (Wrapping rectangle)
FormatWidth
 Text format width (Wrapping rectangle)
Height
 Text height
HorizontalAlignment
 Text horizontal alignment
PlainText
 Returns unformatted string
Plane
TextHeight
TextIsWrapped
TextString
VerticalAlignment
 Text vertical alignment
Top
See Also
Reference
AnnotationText Class
Rhino.Geometry Namespace