RhinoCommon SDK
ParticleSystem Properties
Rhino WIP for Windows
The ParticleSystem type exposes the following members.
Properties
Name | Description
BoundingBox
DisplaySizesInWorldUnits
DrawRequiresDepthSorting
Top
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace