RhinoCommon SDK
AngularDimension Properties
Rhino WIP for Windows
The AngularDimension type exposes the following members.
Properties
Name | Description
DimensionStyleIndex
 Index of DimensionStyleV5 in document DimStyle table used by the dimension.
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace