RhinoCommon SDK
TimeZone Properties
Rhino WIP for Windows
The TimeZone type exposes the following members.
Properties
Name | Description
Hours
 Gets hours of a time zone.
Name
 Gets name of a time zone.
Top
See Also
Reference
TimeZone Class
Rhino.Render Namespace