RhinoCommon SDK
RenderPlugInInfo Properties
Rhino WIP for Windows
The RenderPlugInInfo type exposes the following members.
Properties
Name | Description
Name
PlugInId
Top
See Also
Reference
RenderPlugInInfo Class
Rhino.Render Namespace