RhinoCommon SDK
OrdinateDimension Properties
The OrdinateDimension type exposes the following members.
Properties
Name | Description
DimensionStyleIndex
 Index of DimensionStyleV5 in document DimStyle table used by the dimension.
Top
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace