RhinoCommon SDK
DimStyleTableEventArgs Properties
Rhino WIP for Windows
The DimStyleTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
Index
NewState
OldState
Top
See Also
Reference
DimStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace