RhinoCommon SDK
ImageFileEventArgs Properties
Rhino WIP for Windows
The ImageFileEventArgs type exposes the following members.
Properties
Name | Description
EllapsedTime
Event
FileName
RenderEngine
RenderEngineId
SessionId
Top
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace