RhinoCommon SDK
CullObjectEventArgs Properties
Rhino WIP for Windows
The CullObjectEventArgs type exposes the following members.
Properties
Name | Description
CullObject
RhinoObject
Top
See Also
Reference
CullObjectEventArgs Class
Rhino.Display Namespace