RhinoCommon SDK
MouseCursor Properties
Rhino WIP for Windows
The MouseCursor type exposes the following members.
Properties
Name | Description
Location
 Retrieves the position of the mouse cursor, in screen coordinates
Top
See Also
Reference
MouseCursor Class
Rhino.UI Namespace