RhinoCommon SDK
Field Properties
Rhino WIP for Windows
The Field type exposes the following members.
Properties
Name | Description
IsTextured
Key
 Field key value string set by constructor
Prompt
 Optional UI prompt string set by constructor
Tag
 Gets or sets an object that contains data to associate with the field.
Top
See Also
Reference
Field Class
Rhino.Render.Fields Namespace