RhinoCommon SDK
RenderWindowClonedEventArgs Properties
Rhino WIP for Windows
The RenderWindowClonedEventArgs type exposes the following members.
Properties
Name | Description
NewRenderWindow
NewSessionId
OldRenderWindow
OldSessionId
Top
See Also
Reference
RenderWindowClonedEventArgs Class
Rhino.Render Namespace