RhinoCommon SDK
MenuTaskOriginFactory Properties
Rhino WIP for Windows
The MenuTaskOriginFactory type exposes the following members.
Properties
Name | Description
AllowedKinds
 Semicolon delimited string with allowed content kind for menutasks
CEC
 Set the ContentEditingContext if the usercontrol has one
CppPointer
OnItem
 Set OnItem to true to get menutaskorigin for on item clicked and set to false to get menutaskorigin for none selected item
PreviewAppearance
 Set the PreviewAppearance if the usercontrol has one
UserControl
 Set the RhRdkUserControl
UuidOrigin
 Returns the Guid of the menutask origin
Top
See Also
Reference
MenuTaskOriginFactory Class
Rhino.Render Namespace