RhinoCommon SDK
SubDVertexDirPair Properties
Rhino WIP for Windows
The SubDVertexDirPair type exposes the following members.
Properties
Name | Description
Flipped
Vertex
Top
See Also
Reference
SubDVertexDirPair Structure
Rhino.Geometry Namespace