RhinoCommon SDK
IBreadCrumb Properties
Rhino WIP for Windows
The IBreadCrumb type exposes the following members.
Properties
Name | Description
BackgroundColor
CEC
Height
Hidden
ViewModel
Top
See Also
Reference
IBreadCrumb Interface
Rhino.UI.Controls Namespace