RhinoCommon SDK
V6AngularDimension Properties
Rhino WIP for Windows
The V6AngularDimension type exposes the following members.
Properties
Name | Description
ArrowPoint1
ArrowPoint2
CenterPoint
DefPoint1
DefPoint2
DimlinePoint
Type
Top
See Also
Reference
V6AngularDimension Class
Rhino.Geometry Namespace