RhinoCommon SDK
TaskCompleteEventArgs Properties
Rhino WIP for Windows
The TaskCompleteEventArgs type exposes the following members.
Properties
Name | Description
Doc
Redraw
Task
Top
See Also
Reference
TaskCompleteEventArgs Class
Rhino.Input.Custom Namespace