RhinoCommon SDK
MaelstromSpaceMorph Properties
Rhino WIP for Windows
The MaelstromSpaceMorph type exposes the following members.
Properties
Name | Description
IsValid
 Returns true if the space morph definition is valid, false otherwise.
Top
See Also
Reference
MaelstromSpaceMorph Class
Rhino.Geometry.Morphs Namespace