RhinoCommon SDK
FileReference Properties
The FileReference type exposes the following members.
Properties
Name | Description
ContentHash
 Gets the content hash.
FullPath
 Gets the absolute path of this file reference.
FullPathStatus
 Gets the file reference status.
RelativePath
 Gets the relative path of this file reference.
Top
See Also
Reference
FileReference Class
Rhino.FileIO Namespace