RhinoCommon SDK
IWindow Properties
The IWindow type exposes the following members.
Properties
Name | Description
Created
Enabled
EnglishCaption
LocalCaption
Parent
Shown
WindowPtr
Top
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace