RhinoCommon SDK
CustomRenderMeshProvider Properties
Rhino WIP for Windows
The CustomRenderMeshProvider type exposes the following members.
Properties
Name | Description
Name
 The name of the provider for UI display.
Top
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace