RhinoCommon SDK
ChangeQueue Properties
Rhino WIP for Windows
The ChangeQueue type exposes the following members.
Properties
Name | Description
IsPreview
 Return true if this ChangeQueue is created for preview rendering
ViewId
 Return view ID for a RhinoDoc based ChangeQueue
Top
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace