RhinoCommon SDK
EventArgs Properties
Rhino WIP for Windows
The EventArgs type exposes the following members.
Properties
Name | Description
DataType
Top
See Also
Reference
EventArgs Class
Rhino.UI.Controls.DataSource Namespace