RhinoCommon SDK
RenderEnvironment Properties
Rhino WIP for Windows
The RenderEnvironment type exposes the following members.
Properties
Name | Description
CurrentEnvironment |  Obsolete.
TextureChildSlotName
Top
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace