RhinoCommon SDK
MeshInstance Properties
Rhino WIP for Windows
The MeshInstance type exposes the following members.
Properties
Name | Description
CastShadows
 Return true if mesh instance should cast shadows
InstanceId
 Get the instance identifier for this mesh instance.
MaterialId
 The Material CRC / RenderHash
MeshId
 Get the mesh identifier for this mesh instance.
MeshIndex
 Get the mesh index for this mesh instance.
ReceiveShadows
 Return true if mesh instance should receive shadows
Transform
 Transform for the MeshInstance
Top
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace