RhinoCommon SDK
GetCancel Properties
Rhino WIP for Windows
The GetCancel type exposes the following members.
Properties
Name | Description
Progress
ProgressMessage
ProgressReporting
Token
Top
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace