RhinoCommon SDK
GumballFrame Properties
Rhino WIP for Windows
The GumballFrame type exposes the following members.
Properties
Name | Description
Plane
ScaleGripDistance
ScaleMode
Top
See Also
Reference
GumballFrame Structure
Rhino.UI.Gumball Namespace