RhinoCommon SDK
DrawObjectEventArgs Properties
Rhino WIP for Windows
The DrawObjectEventArgs type exposes the following members.
Properties
Name | Description
DrawObject
RhinoObject
Top
See Also
Reference
DrawObjectEventArgs Class
Rhino.Display Namespace