RhinoCommon SDK
BinaryArchiveFile Properties
Rhino WIP for Windows
The BinaryArchiveFile type exposes the following members.
Properties
Name | Description
Reader
Writer
Top
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace