RhinoCommon SDK
RenderWindow Properties
Rhino WIP for Windows
The RenderWindow type exposes the following members.
Properties
Name | Description
SessionId
Top
See Also
Reference
RenderWindow Class
Rhino.Render Namespace