RhinoCommon SDK
Color4fField Properties
Rhino WIP for Windows
The Color4fField type exposes the following members.
Properties
Name | Description
SystemColorValue
 Gets or sets the field value
Value
 Gets or sets the field value
Top
See Also
Reference
Color4fField Class
Rhino.Render.Fields Namespace