RhinoCommon SDK
RhinoObjectEventArgs Properties
Rhino WIP for Windows
The RhinoObjectEventArgs type exposes the following members.
Properties
Name | Description
ObjectId
TheObject
Top
See Also
Reference
RhinoObjectEventArgs Class
Rhino.DocObjects Namespace