RhinoCommon SDK
CommandLineOption Properties
Rhino WIP for Windows
The CommandLineOption type exposes the following members.
Properties
Name | Description
CurrentListOptionIndex
EnglishName
Index
Top
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace