RhinoCommon SDK
SubMenus Enumeration
[Missing <summary> documentation for "T:Rhino.UI.Controls.Definitions.SubMenus"]
Namespace: Rhino.UI.Controls.Definitions
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum SubMenus
Public Enumeration SubMenus
Members
Member name | Value | Description
None | 0
CreateNew | 1
Thumbnails | 2
See Also
Reference
Rhino.UI.Controls.Definitions Namespace