RhinoCommon SDK
IThumbnailList Interface
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Controls.IThumbnailList"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IThumbnailList : IRhRdkContentEditorThumbnailList,
	IRhRdkContentThumbnailList, IRhRdkThumbnailList, IWindow, IHasCppImplementation, IDisposable
Public Interface IThumbnailList
	Inherits IRhRdkContentEditorThumbnailList, IRhRdkContentThumbnailList, IRhRdkThumbnailList, IWindow,
	IHasCppImplementation, IDisposable
The IThumbnailList type exposes the following members.
Properties
Name | Description
BackgroundColor
CEC
Height
Hidden
ShowUnits
TreeModeOnly
ViewModel
Top
Methods
Name | Description
ViewModelActivated
Top
See Also
Reference
Rhino.UI.Controls Namespace