RhinoCommon SDK
ToolbarGroup Class
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.ToolbarGroup"]
Inheritance Hierarchy
System.Object
 Rhino.UI.ToolbarGroup
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class ToolbarGroup
Public NotInheritable Class ToolbarGroup
The ToolbarGroup type exposes the following members.
Properties
Name | Description
Id
IsDocked
Name
Visible
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace