RhinoCommon SDK
FileObjWriteOptions.CurveType Enumeration
Rhino WIP for Windows
 Type of curve used for trimmed surfaces
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum CurveType
Public Enumeration CurveType
Members
Member name | Value | Description
Polyline | 0 |  Polyline approximation, see comments for AngleTolRadians
Nurbs | 1
See Also
Reference
Rhino.FileIO Namespace