RhinoCommon SDK
ThumbData Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbData"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.ThumbData
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class ThumbData
Public Class ThumbData
The ThumbData type exposes the following members.
Constructors
Name | Description
ThumbData
Initializes a new instance of the ThumbData class
Top
Properties
Name | Description
Child
Id
Image
Intensity
InUse
Name
Selected
Tags
Type
Top
Methods
Name | Description
Top
Events
Name | Description
PropertyChanged
Top
See Also
Reference
Rhino.UI.Controls Namespace