RhinoCommon SDK
it_Flags Enumeration
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.Render.it_Flags"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum it_Flags
Public Enumeration it_Flags
Members
Member name | Value | Description
it_Normal | 0
it_IncludeChildren | 1
it_IncludeSingleProxies | 2
it_IncludeMultiProxies | 4
it_IncludeAutoDeleted | 8
it_UpdateProxies | 268435456
See Also
Reference
Rhino.Render Namespace