RhinoCommon SDK
ContentEditingContext Class
 ContentEditingContext class
Inheritance Hierarchy
System.Object
 Rhino.Render.ContentEditingContext
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class ContentEditingContext : IDisposable
Public NotInheritable Class ContentEditingContext
	Implements IDisposable
The ContentEditingContext type exposes the following members.
Constructors
Name | Description
ContentEditingContext
 Constructor for ContentEditingContext
Top
Properties
Name | Description
CppPointer
 ContextEditingContext c++ pointer
Top
Methods
Name | Description
Dispose
 Dispose for ContentEditingContext
Finalize
 Destructor for ContentEditingContext
 (Overrides Object.Finalize().)
SetSelection
 Set Selection
TopLevelKind
 TopLevelKind
UuidEditor
 UuidEditor
Top
See Also
Reference
Rhino.Render Namespace