RhinoCommon SDK
MeshInstance Class
Rhino WIP for Windows
 Representation of ChangeQueue MeshInstance
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.MeshInstance
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class MeshInstance
Public Class MeshInstance
The MeshInstance type exposes the following members.
Properties
Name | Description
CastShadows
 Return true if mesh instance should cast shadows
InstanceId
 Get the instance identifier for this mesh instance.
MaterialId
 The Material CRC / RenderHash
MeshId
 Get the mesh identifier for this mesh instance.
MeshIndex
 Get the mesh index for this mesh instance.
ReceiveShadows
 Return true if mesh instance should receive shadows
Transform
 Transform for the MeshInstance
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace