RhinoCommon SDK
CursorStyle Enumeration
Rhino WIP for Windows
 Standard mouse cursors in Rhino
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum CursorStyle
Public Enumeration CursorStyle
Members
Member name | Value | Description
Default | 0
Wait | 1 |  Wait
CrossHair | 2
Hand | 3
Rotate | 4
Magnify | 5
ArrowCopy | 6 | arrow with +
CrosshairCopy | 7
See Also
Reference
Rhino.UI Namespace