RhinoCommon SDK
RLeader Class
Rhino WIP for Windows
 Leader geometry class
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.RLeader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class RLeader : GeometryBase
<SerializableAttribute>
Public Class RLeader
	Inherits GeometryBase
The RLeader type exposes the following members.
Constructors
Name | Description
RLeader
 Constructotr
Top
Properties
Name | Description
ContentType
 Type of annotation on the leader Currently only text
Curve
 Gets the curve used by this leader
DimstyleId
 Get or set the id of this leader's dimstyle
Plane
 Get and set Leaders Plane
Points2D
 Get or set the 2d points defining the curve used by this leader
Points3D
 Get or set the 3d points defining the curve used by this leader
TextHeight
 Set or get the text height for this leader
TextString
 Return text string for this leader
Top
Methods
Name | Description
Create
 Creates a RLeader geometry object
SetTextString
 Sets the text string for this leader
Top
See Also
Reference
Rhino.Geometry Namespace