RhinoCommon SDK
V6AngularDimension Class
 Represents an angular dimension. ON_V6_DimAngular
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Dimension
 Rhino.Geometry.V6AngularDimension
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class V6AngularDimension : V6Dimension
<SerializableAttribute>
Public Class V6AngularDimension
	Inherits V6Dimension
The V6AngularDimension type exposes the following members.
Constructors
Name | Description
V6AngularDimension()
Initializes a new instance of the V6AngularDimension class
V6AngularDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
ArrowPoint1
ArrowPoint2
CenterPoint
DefPoint1
DefPoint2
DimlinePoint
Type
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
See Also
Reference
Rhino.Geometry Namespace