RhinoCommon SDK
V6Centermark Class
 Represents a centermark. ON_V6_Centermark
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Dimension
 Rhino.Geometry.V6Centermark
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class V6Centermark : V6Dimension
<SerializableAttribute>
Public Class V6Centermark
	Inherits V6Dimension
The V6Centermark type exposes the following members.
Constructors
Name | Description
V6Centermark()
Initializes a new instance of the V6Centermark class
V6Centermark(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
Type
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
GetDisplayLines
Top
See Also
Reference
Rhino.Geometry Namespace