RhinoCommon SDK
ContentArray Class
[Missing <summary> documentation for "T:Rhino.Render.ContentArray"]
Inheritance Hierarchy
System.Object
 Rhino.Render.ContentArray
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class ContentArray : IDisposable
Public NotInheritable Class ContentArray
	Implements IDisposable
The ContentArray type exposes the following members.
Constructors
Name | Description
ContentArray
Initializes a new instance of the ContentArray class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Append
Dispose
Releases all resources used by the ContentArray
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render Namespace