RhinoCommon SDK
V6Dimension Class
 Represents a base class for dimensions ON_V6_Dimension
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Dimension
 Rhino.Geometry.V6AngularDimension
 Rhino.Geometry.V6Centermark
 Rhino.Geometry.V6LinearDimension
 Rhino.Geometry.V6OrdinateDimension
 Rhino.Geometry.V6RadialDimension
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public abstract class V6Dimension : GeometryBase
<SerializableAttribute>
Public MustInherit Class V6Dimension
	Inherits GeometryBase
The V6Dimension type exposes the following members.
Constructors
Name | Description
V6Dimension()
Initializes a new instance of the V6Dimension class
V6Dimension(SerializationInfo, StreamingContext)
Initializes a new instance of the V6Dimension class
Top
Properties
Name | Description
DetailMeasured
DimstyleId
DistanceScale
Measurement
Plane
TextRotation
UseDefaultTextPoint
UserTextString
Top
Methods
Name | Description
SetUserTextString
Top
See Also
Reference
Rhino.Geometry Namespace