RhinoCommon SDK
GroupTableEventType Enumeration
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.GroupTableEventType"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum GroupTableEventType
Public Enumeration GroupTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3
Sorted | 4
See Also
Reference
Rhino.DocObjects.Tables Namespace