RhinoCommon SDK
DocumentOrFreeFloatingBase Class
 Base class for Rhino.Render objects that are owned by the document, or can be delivered separately from other functions. In general, you cannot create these objects yourself.
Inheritance Hierarchy
System.Object
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.ContentCollection
 Rhino.Render.Dithering
 Rhino.Render.LinearWorkflow
 Rhino.Render.RdkContentLookup
 Rhino.Render.Skylight
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class DocumentOrFreeFloatingBase
Public Class DocumentOrFreeFloatingBase
The DocumentOrFreeFloatingBase type exposes the following members.
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace