RhinoCommon SDK
IRhRdkContentThumbnailList Interface
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Controls.IRhRdkContentThumbnailList"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IRhRdkContentThumbnailList : IRhRdkThumbnailList
Public Interface IRhRdkContentThumbnailList
	Inherits IRhRdkThumbnailList
The IRhRdkContentThumbnailList type exposes the following members.
Methods
Name | Description
ContentFromThumbId
PropagateSelectedAppearance
SaveMetaDataToDocument
SelectedAppearance
SetSearchPattern
SetSettingsPath
Top
See Also
Reference
Rhino.UI.Controls Namespace