RhinoCommon SDK
RenderContentChangedEventArgs Class
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.Render.RenderContentChangedEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RenderContentEventArgs
 Rhino.Render.RenderContentChangedEventArgs
 Rhino.Render.RenderContentFieldChangedEventArgs
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class RenderContentChangedEventArgs : RenderContentEventArgs
Public Class RenderContentChangedEventArgs
	Inherits RenderContentEventArgs
The RenderContentChangedEventArgs type exposes the following members.
Properties
Name | Description
ChangeContext
OldContent
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace