RhinoCommon SDK
CreatePreviewEventArgs.SceneObject Class
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.Render.CreatePreviewEventArgs.SceneObject"]
Inheritance Hierarchy
System.Object
 Rhino.Render.CreatePreviewEventArgs.SceneObject
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class SceneObject
Public Class SceneObject
The CreatePreviewEventArgs.SceneObject type exposes the following members.
Properties
Name | Description
Material
Mesh
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace