RhinoCommon SDK
PickStyle Enumeration
Rhino WIP for Windows
 Provides picking values that describe common CAD picking behavior.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum PickStyle
Public Enumeration PickStyle
Members
Member name | Value | Description
None | 0
PointPick | 1
WindowPick | 2
CrossingPick | 3
See Also
Reference
Rhino.Input.Custom Namespace