RhinoCommon SDK
TimeZone Class
Rhino WIP for Windows
 TimeZone
Inheritance Hierarchy
System.Object
 Rhino.Render.TimeZone
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class TimeZone
Public Class TimeZone
The TimeZone type exposes the following members.
Properties
Name | Description
Hours
 Gets hours of a time zone.
Name
 Gets name of a time zone.
Top
Methods
Name | Description
TimeZoneAt
 Returns a time zone at given index.
TimeZones
 Returns number of available time zones.
Top
See Also
Reference
Rhino.Render Namespace