RhinoCommon SDK
ICollapsibleSection Interface
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Controls.ICollapsibleSection"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface ICollapsibleSection : IWindow,
	IHasCppImplementation, IDisposable
Public Interface ICollapsibleSection
	Inherits IWindow, IHasCppImplementation, IDisposable
The ICollapsibleSection type exposes the following members.
Properties
Name | Description
BackgroundColor
Collapsible
Height
Hidden
Id
InitiallyExpanded
SettingsTag
ViewModel
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI.Controls Namespace