RhinoCommon SDK
IHasCppImplementation Interface
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Controls.IHasCppImplementation"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IHasCppImplementation
Public Interface IHasCppImplementation
The IHasCppImplementation type exposes the following members.
Properties
Name | Description
CppPointer
Top
See Also
Reference
Rhino.UI.Controls Namespace