RhinoCommon SDK
AnnotationArrowhead Class
 Arrowhead used by annotation
Inheritance Hierarchy
System.Object
 Rhino.Geometry.AnnotationArrowhead
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class AnnotationArrowhead
<SerializableAttribute>
Public Class AnnotationArrowhead
The AnnotationArrowhead type exposes the following members.
Constructors
Name | Description
AnnotationArrowhead()
 Constructotr
AnnotationArrowhead(DimensionStyle.ArrowType, Guid)
 Constructotr type of this arrowhead Guid of the block used for user defined display
Top
Properties
Name | Description
ArrowBlockId
 Id of block used for user-defined arrowhead
ArrowheadType
 Type of arrowhead used by annotation
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace