RhinoCommon SDK
SimulatedEnvironment.BackgroundProjections Enumeration
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.Render.SimulatedEnvironment.BackgroundProjections"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum BackgroundProjections
Public Enumeration BackgroundProjections
Members
Member name | Value | Description
Planar | 0
Spherical | 1
Emap | 2
Box | 3
Automatic | 4
Lightprobe | 5
Cubemap | 6
VerticalCrossCubemap | 7
HorizontalCrossCubemap | 8
See Also
Reference
Rhino.Render Namespace