RhinoCommon SDK
DepthMode Enumeration
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.Display.DepthMode"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum DepthMode
Public Enumeration DepthMode
Members
Member name | Value | Description
Neutral | 0
AlwaysInFront | 1
AlwaysInBack | 2
See Also
Reference
Rhino.Display Namespace