RhinoCommon SDK
PreviewBackground Class
 PreviewBackGround takes care of constucting and desctrutction of PreviewLight
Inheritance Hierarchy
System.Object
 Rhino.Render.PreviewBackground
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class PreviewBackground
Public Class PreviewBackground
The PreviewBackground type exposes the following members.
Constructors
Name | Description
PreviewBackground
 Constructor for PreivewLighting
Top
Methods
Name | Description
ElementKind
 ElementKind
EnvironmentInstanceId
 EnvironmentInstanceId
SetEnvironmentInstanceId
 SetEnvironmentInstanceId
SetUpPreview
 SetUpPreview
Top
See Also
Reference
Rhino.Render Namespace