RhinoCommon SDK
DimensionStyle.VerticalAlignment Enumeration
 Attachment of content
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum VerticalAlignment
Public Enumeration VerticalAlignment
Members
Member name | Value | Description
Centered | 0 |  Text centered on leader tail
Above | 1 |  Text above leader tail
Below | 2 |  Text below leader tail
Top | 3 |  Leader tail at top of text
FirstLine | 4 |  Leader tail at middle of first text line
Middle | 5 |  Leader tail at middle of text or content
LastLine | 6 |  Leader tail at middle of last text line
Bottom | 7 |  Leader tail at bottom of text
Underlined | 8 |  Leader tail at bottom of text, text underlined
See Also
Reference
Rhino.DocObjects Namespace