RhinoCommon SDK
ClippingPlane Class
Rhino WIP for Windows
 ChangeQueue clipping plane
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.ClippingPlane
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class ClippingPlane
Public Class ClippingPlane
The ClippingPlane type exposes the following members.
Properties
Name | Description
Id
 Get Guid for this clipping plane
IsEnabled
 True if clipping plane is enabled
Plane
 Get the plane that represents this clipping plane
ViewIds
 Get list of View IDs this clipping plane is supposed to clip.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace