RhinoCommon SDK
PreviewAppearance Class
 PreviewAppearance class
Inheritance Hierarchy
System.Object
 Rhino.Render.PreviewAppearance
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class PreviewAppearance : IDisposable
Public NotInheritable Class PreviewAppearance
	Implements IDisposable
The PreviewAppearance type exposes the following members.
Constructors
Name | Description
PreviewAppearance
 Constructor for previewappearance
Top
Properties
Name | Description
CppPointer
 Previewappearances c++ pointer
Top
Methods
Name | Description
Background
 Background
Dispose
 Dispose for previewappearance
Finalize
 Destructor for previewappearance
 (Overrides Object.Finalize().)
Geometry
 Geometry
Lighting
 Lighting
RotationType
 RotationType
RotationX
 RotationX
RotationY
 RotationY
SetRotationType
 SetRotationType
SetRotationX
 SetRotationX
SetRotationY
 SetRotationY
SetSize
 SetSize
Size
 Size
Top
See Also
Reference
Rhino.Render Namespace