RhinoCommon SDK
Linetype Class
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.DocObjects.Linetype"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.Linetype
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public sealed class Linetype : ModelComponent
<SerializableAttribute>
Public NotInheritable Class Linetype
	Inherits ModelComponent
The Linetype type exposes the following members.
Constructors
Name | Description
Linetype
Initializes a new instance of the Linetype class
Top
Properties
Name | Description
ComponentType
 Returns LinePattern.
 (Overrides ModelComponent.ComponentType.)
Id
 Gets the ID of this linetype object.
IsDeleted
 Gets a value indicating whether this linetype has been deleted and is currently in the Undo buffer.
IsModified
 true if this linetype has been modified by LinetypeTable.ModifyLinetype() and the modifications can be undone.
IsReference
 Gets a value indicting whether this linetype is a referenced linetype. Referenced linetypes are part of referenced documents.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
LinetypeIndex
The index of this linetype.
Name
The name of this linetype.
 (Overrides ModelComponent.Name.)
PatternLength
Total length of one repeat of the pattern.
SegmentCount
Number of segments in the pattern.
Top
Methods
Name | Description
AppendSegment
Adds a segment to the pattern.
CommitChanges
Default
 Set linetype to default settings.
GetSegment
 Gets the segment information at a index.
RemoveSegment
Removes a segment in the linetype.
SetSegment
Sets the length and type of the segment at index.
Top
See Also
Reference
Rhino.DocObjects Namespace