RhinoCommon SDK
ThumbArray Class
[Missing <summary> documentation for "T:Rhino.Render.ThumbArray"]
Inheritance Hierarchy
System.Object
 Rhino.Render.ThumbArray
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class ThumbArray : IDisposable
Public NotInheritable Class ThumbArray
	Implements IDisposable
The ThumbArray type exposes the following members.
Constructors
Name | Description
ThumbArray
Initializes a new instance of the ThumbArray class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
ContentAtIndex
Count
Dispose
Releases all resources used by the ThumbArray
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render Namespace