RhinoCommon SDK
LinearDimensionObject Class
 Represents a LinearDimension that is placed in a document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.AnnotationObjectBase
 Rhino.DocObjects.LinearDimensionObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class LinearDimensionObject : AnnotationObjectBase
Public Class LinearDimensionObject
	Inherits AnnotationObjectBase
The LinearDimensionObject type exposes the following members.
Properties
Name | Description
DimensionStyle
 Gets the DimensionStyle associated with this LinearDimensionObject.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Top
Methods
Name | Description
DisplayHelper
Top
See Also
Reference
Rhino.DocObjects Namespace