RhinoCommon SDK
V6LinearDimension Class
 Represents a linear dimension. ON_V6_DimLinear
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Dimension
 Rhino.Geometry.V6LinearDimension
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class V6LinearDimension : V6Dimension
<SerializableAttribute>
Public Class V6LinearDimension
	Inherits V6Dimension
The V6LinearDimension type exposes the following members.
Constructors
Name | Description
V6LinearDimension()
Initializes a new instance of the V6LinearDimension class
V6LinearDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
ArrowPoint1
ArrowPoint2
DefPoint1
DefPoint2
DimlinePoint
Type
Top
Methods
Name | Description
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
See Also
Reference
Rhino.Geometry Namespace