RhinoCommon SDK
InstanceDefinitionGeometry Class
 Represents a block definition in a File3dm. This is the same as Rhino.DocObjects.InstanceDefinition, but not associated with a RhinoDoc.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.Geometry.InstanceDefinitionGeometry
 Rhino.DocObjects.InstanceDefinition
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class InstanceDefinitionGeometry : ModelComponent
Public Class InstanceDefinitionGeometry
	Inherits ModelComponent
The InstanceDefinitionGeometry type exposes the following members.
Constructors
Name | Description
InstanceDefinitionGeometry
 Initializes a new block definition.
Top
Properties
Name | Description
ComponentType
 Returns InstanceDefinition.
 (Overrides ModelComponent.ComponentType.)
Description
 Gets or sets the description of the definition.
Id
 unique id for this instance definition
 (Overrides ModelComponent.Id.)
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Name
 Gets or sets the name of the definition.
 (Overrides ModelComponent.Name.)
Top
Methods
Name | Description
GetObjectIds
 list of object ids in the instance geometry table
Top
See Also
Reference
Rhino.Geometry Namespace