RhinoCommon SDK
ContentCollection Class
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.Render.ContentCollection"]
Inheritance Hierarchy
System.Object
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.ContentCollection
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class ContentCollection : DocumentOrFreeFloatingBase
Public NotInheritable Class ContentCollection
	Inherits DocumentOrFreeFloatingBase
The ContentCollection type exposes the following members.
Methods
Name | Description
Add
Clear
Find
Find_Sel
Iterator
Iterator_Sel
Remove
SetKind
Top
See Also
Reference
Rhino.Render Namespace