RhinoCommon SDK
DimensionStyle.HorizontalAlignment Enumeration
Rhino WIP for Windows
 Attachment of content
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum HorizontalAlignment
Public Enumeration HorizontalAlignment
Members
Member name | Value | Description
Left | 0 |  Left aligned
Center | 1 |  Centered
Right | 2 |  Right aligned
See Also
Reference
Rhino.DocObjects Namespace