RhinoCommon SDK
RhRdkUserControl Enumeration
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Controls.Definitions.RhRdkUserControl"]
Namespace: Rhino.UI.Controls.Definitions
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum RhRdkUserControl
Public Enumeration RhRdkUserControl
Members
Member name | Value | Description
Unknown | 0
MainThumb | 1
MainTree | 2
EditorPreview | 3
SubNodeCtrl | 4
ColorButton | 5
ContentCtrl | 6
NewContentCtrl | 7
NewContentCtrlDropDown | 8
BreadcrumbCtrl | 9
FloatingPreview | 10
Spanner | 11
SpannerSandbox | 12
ContentTypeSection | 13
ContentTypeBrowserNew | 14
ContentTypeBrowserExisting | 15
ContentInstanceBrowser | 16
ToolTipPreview | 17
See Also
Reference
Rhino.UI.Controls.Definitions Namespace