RhinoCommon SDK
DistanceDisplayMode Enumeration
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.DistanceDisplayMode"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum DistanceDisplayMode
Public Enumeration DistanceDisplayMode
Members
Member name | Value | Description
Decimal | 0
Fractional | 1
FeetInches | 2
See Also
Reference
Rhino.UI Namespace