RhinoCommon SDK
CylinderConstraint Enumeration
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.Input.Custom.CylinderConstraint"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum CylinderConstraint
Public Enumeration CylinderConstraint
Members
Member name | Value | Description
None | 0
Vertical | 1
AroundCurve | 2
See Also
Reference
Rhino.Input.Custom Namespace