RhinoCommon SDK
AnnotationBase Class
 Provides a common base class to all annotation geometry.
This class refers to the geometric element that is independent from the document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.Leader
 Rhino.Geometry.TextEntity
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class AnnotationBase : GeometryBase
<SerializableAttribute>
Public Class AnnotationBase
	Inherits GeometryBase
The AnnotationBase type exposes the following members.
Constructors
Name | Description
AnnotationBase()
 Protected constructor for internal use.
AnnotationBase(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
DimensionScale
 Gets or sets the dimension scale
DimensionStyle
 If there are no overrides then the parent style is returned otherwise the dimension style saved with the annotation is returned.
DimensionStyleId
 Id of this annotation's prent dimstyle If this annotation has overrides to dimstyle properties, those overrides will be represented in the DimensionStyle returned by DimensionStyle(ParentStyle)
DrawForward
 Gets or sets whether the text is oriented towards the reader when viewed from behind
Font
 The base Font for the text of the annotation. The text string is rich text and therefore a different font that the base font can be associated with sub strings of the text
FormatWidth
 Text format width (Wrapping rectangle)
GetModelUnits
 A delegate that returns the model units.
HasPropertyOverrides
MaskColor
 Color to use for drawing a text mask when it is enabled. If the mask is enabled and MaskColor is System.Drawing.Color.Transparent, then the viewport's color will be used for the MaskColor
MaskColorSource
 Gets or sets whether the mask background color is from the background or from a color
MaskEnabled
 Determines whether or not to draw a Text Mask
MaskOffset
 Offset for the border around text of the rectangle used to draw the mask. This value multiplied by TextHeight is the offset on each side of the tight rectangle around the text characters to the mask rectangle. The default value is 0.1.
MaskUsesViewportColor
 If true, the viewport's color is used for the mask color. If false, the color defined by MaskColor is used
ParentDimensionStyle
 The parent dimension style associated with this annotation
PlainText
 Text stripped of RTF formatting information
Plane
 Plane that this annotation lies on
RichText
 Text including additional RTF formatting information
Text |  Obsolete.
 Text including additional RTF formatting information
TextFormula |  Obsolete.
 See RichText
TextHeight
 AnnotationBase.TextHeight Gets the parent dimstyle for the annotation and gets or sets the text height in the dimstyle
TextIsWrapped
 Is text wrapping on
TextRotationDegrees
 Rotation of text in degrees
TextRotationRadians
 Rotation of text in radians
Top
Methods
Name | Description
ClearPropertyOverrides
 Clears all overriden properties for this annotation
Explode
 Explodes this text entity into an array of curves.
GetDimensionScale
 Get view dependent dimension scale
GetDimensionStyle
 Return the proper dimension style from which to get properties for this annotation object If this object has style overrides, those will be included in the returned dimension style and the style will be updated to include the current state of the parent style for non-overridden fields
IsPropertyOverridden
 Returns true if a property is overridden
SetContext
 This function would not be called outside of Rhino but it is written this way not to couple this class with RhinoDoc. If you're thinking of calling this method from the Rhino context you should call the SetDefaultContext() extension method (AnnotationExtensions.cs)
SetOverrideDimStyle
 Set a style including overrides for this annotation object. The DimensionStyle OverrideStyle must have the override fields marked as overridden and must have it's Id set to nil. Use DimensinoStyle.SetFieldOverride(Field field) and related functions to manage override settings. To override a field, the field value must be set and the field must be marked as an override. The DimensionStyle passed in here must not be in the dimstyle table
SetRichText
WrapText
 Wrap text
Top
Extension Methods
Name | Description
SetDefaultContext
 injects into AnnotationBase a way to get to dimension styles without having a dependency in RhinoDoc
 (Defined by AnnotationExtensions.)
Top
See Also
Reference
Rhino.Geometry Namespace