RhinoCommon SDK
MenuTaskOriginFactory Class
Rhino WIP for Windows
 Rdk MenuTaskOriginFactory creates the menu task origin for the UI. The MenuTaskOriginFactory needs information like Controller, UserControl, ContextEditingContext in order to create the correct origin.
Inheritance Hierarchy
System.Object
 Rhino.Render.MenuTaskOriginFactory
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class MenuTaskOriginFactory : IDisposable
Public NotInheritable Class MenuTaskOriginFactory
	Implements IDisposable
The MenuTaskOriginFactory type exposes the following members.
Constructors
Name | Description
MenuTaskOriginFactory
 MenuTaskOriginFactory constructor
Top
Properties
Name | Description
AllowedKinds
 Semicolon delimited string with allowed content kind for menutasks
CEC
 Set the ContentEditingContext if the usercontrol has one
CppPointer
OnItem
 Set OnItem to true to get menutaskorigin for on item clicked and set to false to get menutaskorigin for none selected item
PreviewAppearance
 Set the PreviewAppearance if the usercontrol has one
UserControl
 Set the RhRdkUserControl
UuidOrigin
 Returns the Guid of the menutask origin
Top
Methods
Name | Description
Dispose
 MenuTaskOriginFactory dispose
Finalize
 MenuTaskOriginFactory destructor
 (Overrides Object.Finalize().)
Origin
 Returns the menu task origin
SetController
 Set the Controller
SetInstaceIdArray
 Set the InstanceIdArray: Array of selected items Guids
Top
See Also
Reference
Rhino.Render Namespace