RhinoCommon SDK
UserExecuteResult Enumeration
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Controls.Definitions.UserExecuteResult"]
Namespace: Rhino.UI.Controls.Definitions
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum UserExecuteResult
Public Enumeration UserExecuteResult
Members
Member name | Value | Description
kSuccess | 0
kFailure | 1
kCancel | 2
See Also
Reference
Rhino.UI.Controls.Definitions Namespace