RhinoCommon SDK
MenuTaskOrigin Class
Rhino WIP for Windows
 MenuTaskOrigin class that wraps the IRhRdkTaskOrigin interface
Inheritance Hierarchy
System.Object
 Rhino.Render.MenuTaskOrigin
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class MenuTaskOrigin
Public NotInheritable Class MenuTaskOrigin
The MenuTaskOrigin type exposes the following members.
Constructors
Name | Description
MenuTaskOrigin
 MenuTaskOrigin constructor
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace