RhinoCommon SDK
IRhRdkContentEditorThumbnailList Interface
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Controls.IRhRdkContentEditorThumbnailList"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IRhRdkContentEditorThumbnailList : IRhRdkContentThumbnailList,
	IRhRdkThumbnailList
Public Interface IRhRdkContentEditorThumbnailList
	Inherits IRhRdkContentThumbnailList, IRhRdkThumbnailList
The IRhRdkContentEditorThumbnailList type exposes the following members.
Methods
Name | Description
Top
See Also
Reference
Rhino.UI.Controls Namespace