RhinoCommon SDK
GripStatus Class
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.GripStatus"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Custom.GripStatus
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class GripStatus
Public Class GripStatus
The GripStatus type exposes the following members.
Properties
Name | Description
Culled
Visible
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace