RhinoCommon SDK
DimensionStyle.StackDisplayFormat Enumeration
Rhino WIP for Windows
 Format of stacked fractions
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum StackDisplayFormat
Public Enumeration StackDisplayFormat
Members
Member name | Value | Description
None | 0 |  No stacking
StackHorizontal | 1 |  Stack with horizontal line
StackDiagonal | 2 |  Stack with angled line
See Also
Reference
Rhino.DocObjects Namespace