RhinoCommon SDK
RenderContentStyles Enumeration
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.Render.RenderContentStyles"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[FlagsAttribute]
public enum RenderContentStyles
<FlagsAttribute>
Public Enumeration RenderContentStyles
Members
Member name | Value | Description
None | 0 |  No defined styles
TextureSummary | 1 |  Texture UI includes an auto texture summary section. See AddAutoParameters().
QuickPreview | 2 |  Editor displays an instant preview before preview cycle begins.
PreviewCache | 4 |  Content's preview imagery can be stored in the preview cache.
ProgressivePreview | 8 |  Content's preview imagery can be rendered progressively.
LocalTextureMapping | 16 |  Texture UI includes an auto local mapping section for textures. See AddAutoParameters()
GraphDisplay | 32 |  Texture UI includes a graph section.
SharedUI | 64 |  Content supports UI sharing between contents of the same type id.
Adjustment | 128 |  Texture UI includes an adjustment section.
Fields | 256 |  Content uses fields to facilitate data storage and undo support. See Fields()
ModalEditing | 512 |  Content supports editing in a modal editor.
See Also
Reference
Rhino.Render Namespace