RhinoCommon SDK
V6RadialDimension Class
Rhino WIP for Windows
 Represents a radial dimension. ON_V6_DimRadial
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Dimension
 Rhino.Geometry.V6RadialDimension
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class V6RadialDimension : V6Dimension
<SerializableAttribute>
Public Class V6RadialDimension
	Inherits V6Dimension
The V6RadialDimension type exposes the following members.
Constructors
Name | Description
V6RadialDimension()
Initializes a new instance of the V6RadialDimension class
V6RadialDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
CenterPoint
DimlinePoint
KneePoint
RadiusPoint
Type
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
See Also
Reference
Rhino.Geometry Namespace