RhinoCommon SDK
Separator Enumeration
[Missing <summary> documentation for "T:Rhino.UI.Controls.Definitions.Separator"]
Namespace: Rhino.UI.Controls.Definitions
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum Separator
Public Enumeration Separator
Members
Member name | Value | Description
kNone | 0
kBefore | 1
kAfter | 2
kBoth | 3
See Also
Reference
Rhino.UI.Controls.Definitions Namespace