RhinoCommon SDK
CurveEvaluationSide Enumeration
Rhino WIP for Windows
 Defines enumerated values for the options that defines a curve evaluation side when evaluating kinks.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum CurveEvaluationSide
Public Enumeration CurveEvaluationSide
Members
Member name | Value | Description
Default | 0 |  The default evaluation side.
Below | -1 |  The below evaluation side.
Above | 1 |  The above evaluation side.
See Also
Reference
Rhino.Geometry Namespace