RhinoCommon SDK
IStackedDialogPageService Interface
Rhino WIP for Windows
 For internal use, the IStackedDialogPageService service is implemented in RhinoWindows or RhinoMac as appropriate and handles the communication with core Rhino
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IStackedDialogPageService
Public Interface IStackedDialogPageService
The IStackedDialogPageService type exposes the following members.
Methods
Name | Description
AddChildPage
MakeActive
NewObjectPropertiesDialogPagePointer
NewOptionsDialogPagePointer
PageWindowHandle
RemovePage
SetGetTreeItemBold
SetGetTreeItemColor
SetPageTitle
UnManagedPointerCreated
Top
See Also
Reference
Rhino.UI Namespace