RhinoCommon SDK
TextureProjectionMode Enumeration
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.Render.TextureProjectionMode"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum TextureProjectionMode
Public Enumeration TextureProjectionMode
Members
Member name | Value | Description
MappingChannel | 0
View | 1
Wcs | 2
EnvironmentMap | 3
WcsBox | 4
Screen | 5
See Also
Reference
Rhino.Render Namespace