RhinoCommon SDK
NurbsCurve.NurbsCurveEndConditionType Enumeration
Rhino WIP for Windows
 What end conditions to set
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum NurbsCurveEndConditionType
Public Enumeration NurbsCurveEndConditionType
Members
Member name | Value | Description
Nothing | 0 |  Set nothing
Position | 1 |  Set endpoint
Tangency | 2 |  Set tangent
Curvature | 3 |  Set curvature
See Also
Reference
Rhino.Geometry Namespace