RhinoCommon SDK
RenderWindow.RenderSuccessCode Enumeration
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.Render.RenderWindow.RenderSuccessCode"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum RenderSuccessCode
Public Enumeration RenderSuccessCode
Members
Member name | Value | Description
Completed | 0
Failed | 1
See Also
Reference
Rhino.Render Namespace