RhinoCommon SDK
RdkViewModel.UndoHelper Class
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Controls.RdkViewModel.UndoHelper"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.RdkViewModel.UndoHelper
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class UndoHelper : IDisposable
Public Class UndoHelper
	Implements IDisposable
The RdkViewModel.UndoHelper type exposes the following members.
Constructors
Name | Description
RdkViewModel.UndoHelper
Initializes a new instance of the RdkViewModel.UndoHelper class
Top
Methods
Name | Description
Dispose()
Releases all resources used by the RdkViewModel.UndoHelper
Dispose(Boolean)
Releases the unmanaged resources used by the RdkViewModel.UndoHelper and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.UI.Controls Namespace