RhinoCommon SDK
IBreadCrumb Interface
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Controls.IBreadCrumb"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IBreadCrumb : IRhRdkBreadcrumbCtrl,
	IWindow, IHasCppImplementation, IDisposable
Public Interface IBreadCrumb
	Inherits IRhRdkBreadcrumbCtrl, IWindow, IHasCppImplementation, IDisposable
The IBreadCrumb type exposes the following members.
Properties
Name | Description
BackgroundColor
CEC
Height
Hidden
ViewModel
Top
Methods
Name | Description
ViewModelActivated
Top
See Also
Reference
Rhino.UI.Controls Namespace