RhinoCommon SDK
File3dmLinetypeTable Class
Rhino WIP for Windows
 Provides access to Linetypes in the 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.CommonComponentTable<Linetype>
 Rhino.FileIO.File3dmCommonComponentTable<Linetype>
 Rhino.FileIO.File3dmLinetypeTable
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class File3dmLinetypeTable : File3dmCommonComponentTable<Linetype>,
	IList<Linetype>, ICollection<Linetype>, IEnumerable<Linetype>,
	IEnumerable
Public Class File3dmLinetypeTable
	Inherits File3dmCommonComponentTable(Of Linetype)
	Implements IList(Of Linetype), ICollection(Of Linetype),
	IEnumerable(Of Linetype), IEnumerable
The File3dmLinetypeTable type exposes the following members.
Properties
Name | Description
ComponentType
 Returns LinePattern.
 (Overrides CommonComponentTable<T>.ComponentType.)
Top
Methods
Name | Description
FindName
 Finds a Linetype given its name.
FindNameHash
 Finds a Linetype given its name hash.
Top
See Also
Reference
Rhino.FileIO Namespace