RhinoCommon SDK
MenuTaskCollection Class
 A collection of RDK Menu tasks
Inheritance Hierarchy
System.Object
 Rhino.Render.MenuTaskCollection
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class MenuTaskCollection : IDisposable
Public Class MenuTaskCollection
	Implements IDisposable
The MenuTaskCollection type exposes the following members.
Constructors
Name | Description
MenuTaskCollection
 MenuTaskCollection constructor
Top
Methods
Name | Description
Build
 Constructs the menu task collection. In other words fills the collection with menu task items
Count
 The number of menutasks in collection
Dispose
 MenuTaskCollection dispose
Finalize
 MenuTaskCollection destructor
 (Overrides Object.Finalize().)
Find
 Find a specific menutask in the collection
Task
 Gets the task at specified index
Top
See Also
Reference
Rhino.Render Namespace