RhinoCommon SDK
FileReference Class
 Manages a reference to an existing or nonexisting file, using either or both absolute or relative paths. Once constructed, this class is immutable.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.FileReference
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class FileReference : IDisposable
Public NotInheritable Class FileReference
	Implements IDisposable
The FileReference type exposes the following members.
Constructors
Name | Description
FileReference
 Constructs a new instance of the FileReference class, given all its items.
Top
Properties
Name | Description
ContentHash
 Gets the content hash.
FullPath
 Gets the absolute path of this file reference.
FullPathStatus
 Gets the file reference status.
RelativePath
 Gets the relative path of this file reference.
Top
Methods
Name | Description
CreateFromFullAndRelativePaths
 Returns a new file reference. This returns a new instance even if the path does not exist.
CreateFromFullPath
 Returns a new file reference. This returns a new instance even if the path does not exist.
Dispose
 Reclaims unmanaged resources used by this object.
Finalize
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.FileIO Namespace