RhinoCommon SDK
MeshNgon Class
 Represents a mesh ngon.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.MeshNgon
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class MeshNgon : IEquatable<MeshNgon>,
	IComparable<MeshNgon>, IComparable
Public Class MeshNgon
	Implements IEquatable(Of MeshNgon), IComparable(Of MeshNgon),
	IComparable
The MeshNgon type exposes the following members.
Properties
Name | Description
BoundaryVertexCount
 Get the number of vertices in this ngon.
Empty
 Gets an empty MeshNgon.
FaceCount
 Get the number of faces in this ngon.
Item
 Get a mesh vertex index from the ngon's vertex index list.
Top
Methods
Name | Description
BoundaryVertexIndexList
 Get the ngon's outer boundary mesh vertex list.
CompareTo
 Compares this MeshNgon with otherNgon and returns a value of 1, 0, or -1.
Priority is for vertex count, then face count, then vertex index list values, then face index list values.
Create
 Constructs an ngon from lists of mesh vertex and face indexes.
Equals(Object)
 Determines if otherObj is a MeshNgon and is identical to this ngon.
 (Overrides Object.Equals(Object).)
Equals(MeshNgon)
 Determines if this ngon and otherNgon are identical.
FaceIndexList
 Get the ngon's mesh face index list.
GetHashCode
 Returns a runtime-stable hashcode for the current mesh ngon. You are not allowed to rely on persistance of this hashcode in serialization, but for each instance of the application, this hashcode will be the same for ngons with identical vertex and face lists.
 (Overrides Object.GetHashCode().)
Set
 Set the ngon vertex and face index lists.
ToString
 Returns a string representation for this MeshNgon. This is to provide a meaningful visualization of this structure and is subject to change in newer releases.
 (Overrides Object.ToString().)
Top
Operators
Name | Description
Equality
 Determines whether two MeshNgon structures have equal values.
Inequality
 Determines whether two MeshNgon structures have different values.
Top
See Also
Reference
Rhino.Geometry Namespace