RhinoCommon SDK
ModelComponent Class
 Base class for all components in a model (document) and manages the index, id and other information common to this type of objects.
This class parallels the C++ ON_ModelComponent.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 More...
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class ModelComponent : CommonObject
Public MustInherit Class ModelComponent
	Inherits CommonObject
The ModelComponent type exposes the following members.
Properties
Name | Description
ComponentStatus
 Gets or sets the component status of the model component.
ComponentType
 Gets the ModelComponentType for this object. Useful in switch statements.
HasId
 Returns a value indicating whether the component has an ID.
HasIndex
 Returns a value indicating whether the component has an Index.
HasName
 Returns a value indicating whether the component has a Name.
Id
 Gets or sets the ID of the current instance.
IdIsLocked
 Returns a value indicating whether the component ID is already locked.
Index
 Gets or sets the model component index attribute.
IndexIsLocked
 Returns a value indicating whether the component Index is already locked.
IsComponentStatusLocked
 The component status itself can be locked. This returns an indication.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
ON_DimStyle::DefaultMillimeterArchitecture
Name
 Gets or sets the name
NameIsLocked
 Returns a value indicating whether the component Name is already locked.
Top
Methods
Name | Description
ClearId
 Resets the HasId property of the model component to false, if possible.
ClearIndex
 Resets the HasIndex property of the model component to false, if possible.
ClearName
 Resets the HasName property of the model component to false, if possible.
DataCRC
 Increments the Cyclic Redundancy Check value by this instance.
LockId
 Locks the component Id property.
LockIndex
 Locks the component Index property.
LockName
 Locks the component Name property.
ModelComponentTypeRequiresUniqueName
 Informs the developer if a particular model component type will require uniqueness within a document. This is currently true with render materials and model geometry; false otherwise.
ToString
 Returns the name of the model component type, and then its name and index.
 (Overrides Object.ToString().)
Top
See Also
Reference
Rhino.DocObjects Namespace
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.BitmapEntry
 Rhino.DocObjects.DimensionStyle
 Rhino.DocObjects.Group
 Rhino.DocObjects.HatchPattern
 Rhino.DocObjects.Layer
 Rhino.DocObjects.Linetype
 Rhino.DocObjects.Material
 Rhino.DocObjects.RhinoObject
 Rhino.FileIO.File3dmObject
 Rhino.Geometry.InstanceDefinitionGeometry
 Rhino.Render.TextureMapping