RhinoCommon SDK
TextureEvaluator Class
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.Render.TextureEvaluator"]
Inheritance Hierarchy
System.Object
 Rhino.Render.TextureEvaluator
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class TextureEvaluator : IDisposable
Public Class TextureEvaluator
	Implements IDisposable
The TextureEvaluator type exposes the following members.
Constructors
Name | Description
TextureEvaluator
Initializes a new instance of the TextureEvaluator class
Top
Methods
Name | Description
Dispose()
Releases all resources used by the TextureEvaluator
Dispose(Boolean)
Releases the unmanaged resources used by the TextureEvaluator and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
GetColor
Initialize
Top
See Also
Reference
Rhino.Render Namespace