RhinoCommon SDK
DimensionStyle.ToleranceDisplayFormat Enumeration
Rhino WIP for Windows
 Style of tolerance display for dimensions
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum ToleranceDisplayFormat
Public Enumeration ToleranceDisplayFormat
Members
Member name | Value | Description
None | 0 |  No tolerance display
Symmetrical | 1 |  Symmetrical +/- tolerance
Deviation | 2 |  Distance +tol, -tol
Limits | 3 |  Distance upper and lower limits
See Also
Reference
Rhino.DocObjects Namespace