RhinoCommon SDK
IRdkViewModel Interface
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Controls.IRdkViewModel"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IRdkViewModel : IHasCppImplementation
Public Interface IRdkViewModel
	Inherits IHasCppImplementation
The IRdkViewModel type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Commit
GetData
Top
See Also
Reference
Rhino.UI.Controls Namespace