RhinoCommon SDK
IPanel Interface
[Missing <summary> documentation for "T:Rhino.UI.IPanel"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IPanel
Public Interface IPanel
The IPanel type exposes the following members.
Methods
Name | Description
PanelClosing
PanelHidden
PanelShown
Top
See Also
Reference
Rhino.UI Namespace