RhinoCommon SDK
LineSphereIntersection Enumeration
Rhino WIP for Windows
 Represents all possible cases of a Line|Sphere intersection event.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum LineSphereIntersection
Public Enumeration LineSphereIntersection
Members
Member name | Value | Description
None | 0 |  No intersections.
Single | 1 |  One intersection.
Multiple | 2 |  Two intersections.
See Also
Reference
Rhino.Geometry.Intersect Namespace