RhinoCommon SDK
CurveBlend Class
Rhino WIP for Windows
 Represents a blend between two curves or surface edges with specific continuity at each end
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.CurveBlend
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class CurveBlend : GeometryBase
Public Class CurveBlend
	Inherits GeometryBase
The CurveBlend type exposes the following members.
Constructors
Name | Description
CurveBlend
 Makes a new uninitialized CurveBlend
Top
Properties
Name | Description
Top
Methods
Name | Description
CalcBlend
 Calculate the shape of the blend and make a curve to represent it
DrawBlend
 Draw the blend
GetBlendBezier
 Get the blend curve bezier as a NurbsCurve
GetContinuity
 0: position, 1: tangency, 2: curvature, 3: g3, 4: g4
GetCurveParameter
 Parameter on curve underlying target
GetDerLength
 Get the length of a derivative of the blend curve
GetEdgeAngle
 Rotation from perp to edge for surface blends
GetEndType
 Get type of target at this end
GetFlip
 true: Reverse blend curvev direction
GetPickParameter
 Pick parameter on the target
GetReset
 Reset blend derivatives to default lengths
GetScaleFactor
 Derivative length scales
GetTargetCurve
 Get the blend target curve
GetTargetPoint
 Get the blend target point
GetTargetTrim
 Get the blend target trim
HandlePoint
 Returns the location of a handle point of the blend
SetContinuity
 0: position, 1: tangency, 2: curvature, 3: g3, 4: g4
SetCurveParameter
 Set parameter on underlying curve
SetDerLength
 Set the length of a derivative of the blend curve
SetEdgeAngle
Rotation from perp to edge for surface blends
SetEndType
 Set type of target at this end
SetFlip
 Set flip tangent flag on one end of the blend
SetHandlePoint
 Set the location of a handle point on the blend
SetPickParameter
 Set pick parameter for one end of a blend
SetReset
 Set whether blend dericvative lengths are reset to default lengths
SetScaleFactor
 This multiplies the derivative lengths after they have been calculated by whatever the normal way is
SetTargetCurve
 Set the target curve for one end of a blend
SetTargetPoint
 Set the target point for one end of a blend
SetTargetTrim
 Set the target trim for one end of a blend
Top
See Also
Reference
Rhino.Geometry Namespace