RhinoCommon SDK
PointStyle Enumeration
 Defines styles used for drawing points.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum PointStyle
Public Enumeration PointStyle
Members
Member name | Value | Description
Simple | 0 |  Square
ControlPoint | 1 |  Square with white center
ActivePoint | 2 |  Like a control point but includes vertical/horizontal crosshair lines.
X | 3 |  X shape
RoundSimple | 4 |  Circular
RoundControlPoint | 5 |  Circular with white center
RoundActivePoint | 6 |  Round control point with crosshair lines
See Also
Reference
Rhino.Display Namespace