RhinoCommon SDK
PreviewJobSignature Class
[Missing <summary> documentation for "T:Rhino.Render.PreviewJobSignature"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PreviewJobSignature
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class PreviewJobSignature : IDisposable
Public NotInheritable Class PreviewJobSignature
	Implements IDisposable
The PreviewJobSignature type exposes the following members.
Constructors
Name | Description
PreviewJobSignature()
Initializes a new instance of the PreviewJobSignature class
PreviewJobSignature(Int32, Int32, UInt32)
Initializes a new instance of the PreviewJobSignature class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Dispose
Releases all resources used by the PreviewJobSignature
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render Namespace