RhinoCommon SDK
FileObjWriteOptions.AsciiEol Enumeration
Rhino WIP for Windows
 End of Line
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum AsciiEol
Public Enumeration AsciiEol
Members
Member name | Value | Description
Crlf | 0 |  MicroSoft
Lf | 1 |  UNIX
Cr | 2 |  Apple
See Also
Reference
Rhino.FileIO Namespace