RhinoCommon SDK
HiddenLineDrawingParameters Class
Rhino WIP for Windows
 Input used for computing a hidden line drawing
Inheritance Hierarchy
System.Object
 Rhino.Geometry.HiddenLineDrawingParameters
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class HiddenLineDrawingParameters
Public Class HiddenLineDrawingParameters
The HiddenLineDrawingParameters type exposes the following members.
Constructors
Name | Description
HiddenLineDrawingParameters
default constructor
Top
Properties
Name | Description
AbsoluteTolerance
 Absolute tolerance is used to decide if curves overlap or intersect. A suggested value is to use RhinoDoc.AbsoluteTolerance
Flatten
 Flatten the computed geometry
IncludeTangentEdges
 Include tangent edges in hidden line drawing (default is true)
IncludeTangentSeams
 Include tangent seams in hidden line drawing (default is true)
Top
Methods
Name | Description
AddClippingPlane
 Specify clipping planes that are active for this view.
AddGeometry(GeometryBase, Object)
 Add geometry that should be included in the calculation
AddGeometry(GeometryBase, Transform, Object)
 Add geometry that should be included in the calculation
SetViewport(RhinoViewport)
 Set the viewport for the hidden line drawing (HLD). The viewport supplies the projection that determinest he visibility of curves, and the HLD coordinate system in which the resulting curves are represented. The HLD-coordinate system is a right handed system for 3-D model space, in which the 3rd coordinate direction is the projection direction. In particular the z-coordinate direction points from the scene toward the camera.
SetViewport(ViewportInfo)
 Set the viewport for the hidden line drawing (HLD). The viewport supplies the projection that determines the visibility of curves, and the HLD coordinate system in which the resulting curves are represented. The HLD-coordinate system is a right handed system for 3-D model space, in which the 3rd coordinate direction is the projection direction. In particular the z-coordinate direction points from the scene toward the camera.
Top
See Also
Reference
Rhino.Geometry Namespace