RhinoCommon SDK
GumballFrame Structure
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Gumball.GumballFrame"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public struct GumballFrame
Public Structure GumballFrame
The GumballFrame type exposes the following members.
Properties
Name | Description
Plane
ScaleGripDistance
ScaleMode
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI.Gumball Namespace