RhinoCommon SDK
Material Class
Rhino WIP for Windows
 Representation of a Material through the change queue
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.Material
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class Material
Public Class Material
The Material type exposes the following members.
Properties
Name | Description
Id
 Get the material ID (crc)
MeshIndex
 Get mesh index
MeshInstanceId
 Get the material InstanceAncestry
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace