RhinoCommon SDK
V6OrdinateDimension Class
Rhino WIP for Windows
 Represents an ordinate dimension. ON_V6_DimOrdinate
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.V6Dimension
 Rhino.Geometry.V6OrdinateDimension
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class V6OrdinateDimension : V6Dimension
<SerializableAttribute>
Public Class V6OrdinateDimension
	Inherits V6Dimension
The V6OrdinateDimension type exposes the following members.
Constructors
Name | Description
V6OrdinateDimension()
Initializes a new instance of the V6OrdinateDimension class
V6OrdinateDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
DefPoint
KinkOffset1
KinkOffset2
KinkPoint1
KinkPoint2
LeaderPoint
Type
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetTextRectangle
GetTextTransform
 Get the transform for this text object's text geometry
Top
See Also
Reference
Rhino.Geometry Namespace