RhinoCommon SDK
RdkViewModel.NewUndoRecord Class
[Missing <summary> documentation for "T:Rhino.UI.Controls.RdkViewModel.NewUndoRecord"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.RdkViewModel.NewUndoRecord
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class NewUndoRecord : IDisposable
Public Class NewUndoRecord
	Implements IDisposable
The RdkViewModel.NewUndoRecord type exposes the following members.
Constructors
Name | Description
RdkViewModel.NewUndoRecord
Initializes a new instance of the RdkViewModel.NewUndoRecord class
Top
Methods
Name | Description
Dispose()
Releases all resources used by the RdkViewModel.NewUndoRecord
Dispose(Boolean)
Releases the unmanaged resources used by the RdkViewModel.NewUndoRecord and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.UI.Controls Namespace