RhinoCommon SDK
TextureType Enumeration
Rhino WIP for Windows
 The TextureType controls how the pixels in the bitmap are interpreted.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum TextureType
Public Enumeration TextureType
Members
Member name | Value | Description
None | 0
Bitmap | 1 |  Standard image texture
Bump | 2 |  bump map
Transparency | 3 |  value = alpha
See Also
Reference
Rhino.DocObjects Namespace