RhinoCommon SDK
ObjectPropertiesPage Class
Rhino WIP for Windows
 Base class used to add object property user interface panels
Inheritance Hierarchy
System.Object
 Rhino.UI.ObjectPropertiesPage
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class ObjectPropertiesPage
Public MustInherit Class ObjectPropertiesPage
The ObjectPropertiesPage type exposes the following members.
Constructors
Name | Description
ObjectPropertiesPage
Initializes a new instance of the ObjectPropertiesPage class
Top
Properties
Name | Description
EnglishPageTitle
 English string used to describe this page
Icon
 Icon to display in the object properties tab control
LocalPageTitle
 Localized page description string, returns the EnglishPageTitle by default.
PageControl
 The control that represents this page. Rhino Windows supports classes that implement the IWin32Windows interface, are derived from System.Windows.FrameworkElement or Eto.Forms.Control. Mac Rhino supports controls that are derived from NSview or Eto.Forms.Control.
PageType
 Override this and return the page you want to replace a specific object properties page.
SelectedObjects
 Return a list of Rhino objects to be processed by this object properties page
SupportedTypes
 Override to specify which objects this page supports
Top
Methods
Name | Description
AnySelectedObject<T>
 Return true if any of the selected objects match the given type
GetSelectedObjects(ObjectType)
 Get selected objects that match a given filter
GetSelectedObjects<T>()
 Get selected objects of a given type
InitializeControls
 Called on the active page after the selected objects list has changed to notify the page to initialize its content to reflect the new object list.
OnActivate
Called when this page is activated/deactivated.
OnCreateParent
 Called when the parent container is initially created.
OnHelp
 Called when the F1 key or help button is pressed, override to display plug-in specific help for this page.
OnSizeParent
 Called when the parent containers client rectangle size has changed and the PageControl has been resized.
RunScript
 This method is called when scripting the Rhino Properties command and choosing this page.
ShouldDisplay
 Called when the selected objects list changes, return true if the object list contains one or more object the page can modify.
Top
See Also
Reference
Rhino.UI Namespace