RhinoCommon SDK
DisplayModeDescription Class
Rhino WIP for Windows
 Description of a how Rhino will display in a viewport. These are the modes that are listed under "Advanced display" in the options dialog.
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayModeDescription
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class DisplayModeDescription : IDisposable,
	ISerializable
<SerializableAttribute>
Public Class DisplayModeDescription
	Implements IDisposable, ISerializable
The DisplayModeDescription type exposes the following members.
Properties
Name | Description
AllowObjectAssignment
DisplayAttributes
EnglishName
GhostedId
Id
InMenu
LocalName
PenId
PipelineLocked
RenderedId
RenderedShadowsId
ShadedId
ShadedPipelineRequired
SupportsShadeCommand
SupportsShading
TechId
WireframeId
WireframePipelineRequired
XRayId
Top
Methods
Name | Description
AddDisplayMode
DeleteDiplayMode
Dispose()
Releases all resources used by the DisplayModeDescription
Dispose(Boolean)
Releases the unmanaged resources used by the DisplayModeDescription and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
FindByName
GetDisplayMode
GetDisplayModes
 Gets all display mode descriptions that Rhino currently knows about.
UpdateDisplayMode
Top
See Also
Reference
Rhino.Display Namespace