RhinoCommon SDK
BreadCrumbImpl Class
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Controls.BreadCrumbImpl"]
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.BreadCrumbImpl
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class BreadCrumbImpl : IDisposable
Public NotInheritable Class BreadCrumbImpl
	Implements IDisposable
The BreadCrumbImpl type exposes the following members.
Constructors
Name | Description
BreadCrumbImpl
Initializes a new instance of the BreadCrumbImpl class
Top
Properties
Name | Description
CppPointer
ViewModel
Top
Methods
Name | Description
Dispose
Releases all resources used by the BreadCrumbImpl
Find
NewNativeWrapper
Top
Events
Name | Description
DataChanged
Top
See Also
Reference
Rhino.UI.Controls Namespace