RhinoCommon SDK
V6Dimension.DimensionType Enumeration
 Type of dimension
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum DimensionType
Public Enumeration DimensionType
Members
Member name | Value | Description
Unset | 0
Aligned | 1
Angular | 2
Diameter | 3
Radius | 4
Rotated | 5
Ordinate | 6
ArcLen | 7
Centermark | 8
See Also
Reference
Rhino.Geometry Namespace