RhinoCommon SDK
HatchPattern Class
[Missing <summary> documentation for "T:Rhino.DocObjects.HatchPattern"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.ModelComponent
 Rhino.DocObjects.HatchPattern
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public sealed class HatchPattern : ModelComponent
<SerializableAttribute>
Public NotInheritable Class HatchPattern
	Inherits ModelComponent
The HatchPattern type exposes the following members.
Constructors
Name | Description
HatchPattern
Initializes a new instance of the HatchPattern class
Top
Properties
Name | Description
ComponentType
 Returns HatchPattern.
 (Overrides ModelComponent.ComponentType.)
Description
FillType
Index
 Index in the hatch pattern table for this pattern. -1 if not in the table.
 (Overrides ModelComponent.Index.)
IsDeleted
 Deleted hatch patterns are kept in the runtime hatch pattern table so that undo will work with hatch patterns. Call IsDeleted to determine to determine if a hatch pattern is deleted.
IsReference
 Rhino allows multiple files to be viewed simultaneously. Hatch patterns in the document are "normal" or "reference". Reference hatch patterns are not saved.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
Name |  (Overrides ModelComponent.Name.)
Top
Methods
Name | Description
ReadFromFile
 Reads hatch pattern definitions from a file.
Top
See Also
Reference
Rhino.DocObjects Namespace