RhinoCommon SDK
PickContext.MeshHitFlag Enumeration
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.Input.Custom.PickContext.MeshHitFlag"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum MeshHitFlag
Public Enumeration MeshHitFlag
Members
Member name | Value | Description
Invalid | -1
Vertex | 0
Edge | 1
Face | 2
See Also
Reference
Rhino.Input.Custom Namespace