RhinoCommon SDK
IWindow Interface
Rhino WIP for Windows
[Missing <summary> documentation for "T:Rhino.UI.Controls.IWindow"]
Namespace: Rhino.UI.Controls
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public interface IWindow
Public Interface IWindow
The IWindow type exposes the following members.
Properties
Name | Description
Created
Enabled
EnglishCaption
LocalCaption
Parent
Shown
WindowPtr
Top
Methods
Name | Description
Move
Top
See Also
Reference
Rhino.UI.Controls Namespace