RhinoCommon SDK
it_strategy Enumeration
 Defines the collection type to iterate.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum it_strategy
Public Enumeration it_strategy
Members
Member name | Value | Description
ContentDataBase | 0
ContentSelection | 1
See Also
Reference
Rhino.Render Namespace