RhinoCommon API
RhinoDoc.TextureMappingEvent Event
 Called when any modification happens to a document objects texture mapping.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RhinoDoc.TextureMappingEventArgs> TextureMappingEvent
Public Shared Event TextureMappingEvent As EventHandler(Of RhinoDoc.TextureMappingEventArgs)
Value
Type: System.EventHandler<RhinoDoc.TextureMappingEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
RhinoDoc Class
Rhino Namespace