RhinoCommon API
RhinoDoc.SelectObjects Event
 Called when object(s) are selected.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RhinoObjectSelectionEventArgs> SelectObjects
Public Shared Event SelectObjects As EventHandler(Of RhinoObjectSelectionEventArgs)
Value
Type: System.EventHandler<RhinoObjectSelectionEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
RhinoDoc Class
Rhino Namespace