RhinoCommon API
RhinoApp.EscapeKeyPressed Event
 Can add or removed delegates that are raised when the escape key is clicked.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler EscapeKeyPressed
Public Shared Event EscapeKeyPressed As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
RhinoApp Class
Rhino Namespace