RhinoCommon API
RhinoDoc.PurgeRhinoObject Event
 Called if an object is being purged from a document. The object will cease to exist forever.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RhinoObjectEventArgs> PurgeRhinoObject
Public Shared Event PurgeRhinoObject As EventHandler(Of RhinoObjectEventArgs)
Value
Type: System.EventHandler<RhinoObjectEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
RhinoDoc Class
Rhino Namespace