RhinoCommon SDK
ImageFile.Loaded Event
 Generally called when the "RenderOpenLastRender" command is run, this event is raised after the render window has been created and the saved scene has been loaded.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<ImageFileEventArgs> Loaded
Public Shared Event Loaded As EventHandler(Of ImageFileEventArgs)
Value
Type: System.EventHandler<ImageFileEventArgs>
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ImageFile Class
Rhino.Render Namespace