RhinoCommon API
RhinoApp.RdkNewDocument Event
 Monitors when RDK document information is rebuilt.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler RdkNewDocument
Public Shared Event RdkNewDocument As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
RhinoApp Class
Rhino Namespace