RhinoCommon SDK
GetPoint.MouseDown Event
 Called during Get2dRectangle, Get2dLine, and GetPoint(..,true) when the mouse down event for the initial point occurs. This function is not called during ordinary point getting because the mouse down event terminates an ordinary point get and returns a GetResult.Point result.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public event EventHandler<GetPointMouseEventArgs> MouseDown
Public Event MouseDown As EventHandler(Of GetPointMouseEventArgs)
Value
Type: System.EventHandler<GetPointMouseEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace