RhinoCommon API
Command.EndCommand Event
 Called immediately after command.RunCommand().
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<CommandEventArgs> EndCommand
Public Shared Event EndCommand As EventHandler(Of CommandEventArgs)
Value
Type: System.EventHandler<CommandEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
Command Class
Rhino.Commands Namespace