RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames.TransparencyColor Field
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.TransparencyColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const string TransparencyColor = "transparency-color"
Public Const TransparencyColor As String = "transparency-color"
Field Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace