RhinoCommon SDK
File3dmTypeCodes.TCODE_HISTORYRECORD_TABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_HISTORYRECORD_TABLE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_HISTORYRECORD_TABLE = 268435494
Public Const TCODE_HISTORYRECORD_TABLE As UInteger = 268435494
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace