RhinoCommon SDK
File3dmTypeCodes.TCODE_TEXT_BLOCK Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_TEXT_BLOCK"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_TEXT_BLOCK = 2097156
Public Const TCODE_TEXT_BLOCK As UInteger = 2097156
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace