RhinoCommon API
File3dmTypeCodes.TCODE_PROPERTIES_TABLE Field
 Model Properties: revision history, notes, preview image.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_PROPERTIES_TABLE = 268435476
Public Const TCODE_PROPERTIES_TABLE As UInteger = 268435476
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace