RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_SPL Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_SPL"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_SPL = 65545
Public Const TCODE_LEGACY_SPL As UInteger = 65545
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace