RhinoCommon API
File3dmTypeCodes.TCODE_PROPERTIES_APPLICATION Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_PROPERTIES_APPLICATION"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_PROPERTIES_APPLICATION = 536903716
Public Const TCODE_PROPERTIES_APPLICATION As UInteger = 536903716
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace