RhinoCommon API
File3dmTypeCodes.TCODE_BITMAPPREVIEW Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_BITMAPPREVIEW"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_BITMAPPREVIEW = 33554452
Public Const TCODE_BITMAPPREVIEW As UInteger = 33554452
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace