RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_CURRENT_COLOR Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_CURRENT_COLOR"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SETTINGS_CURRENT_COLOR = 536903738
Public Const TCODE_SETTINGS_CURRENT_COLOR As UInteger = 536903738
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace