RhinoCommon API
File3dmTypeCodes.TCODE_LIGHT_RECORD Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LIGHT_RECORD"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LIGHT_RECORD = 536903776
Public Const TCODE_LIGHT_RECORD As UInteger = 536903776
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace