RhinoCommon API
File3dmTypeCodes.TCODE_HATCHPATTERN_TABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_HATCHPATTERN_TABLE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_HATCHPATTERN_TABLE = 268435490
Public Const TCODE_HATCHPATTERN_TABLE As UInteger = 268435490
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace