RhinoCommon API
File3dmTypeCodes.TCODE_GROUP_RECORD Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_GROUP_RECORD"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_GROUP_RECORD = 536903795
Public Const TCODE_GROUP_RECORD As UInteger = 536903795
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace