RhinoCommon SDK
File3dmTypeCodes.TCODE_LINEAR_DIMENSION Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LINEAR_DIMENSION"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LINEAR_DIMENSION = 2097158
Public Const TCODE_LINEAR_DIMENSION As UInteger = 2097158
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace