RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_PNTSTUFF Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_PNTSTUFF"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_PNTSTUFF = 65802
Public Const TCODE_LEGACY_PNTSTUFF As UInteger = 65802
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace