RhinoCommon API
File3dmTypeCodes.TCODE_OLD_RH_TRIMESH Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OLD_RH_TRIMESH"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OLD_RH_TRIMESH = 1048593
Public Const TCODE_OLD_RH_TRIMESH As UInteger = 1048593
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace