RhinoCommon API
File3dmTypeCodes.TCODE_LAYERTHAWED Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYERTHAWED"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LAYERTHAWED = 2151677975
Public Const TCODE_LAYERTHAWED As UInteger = 2151677975
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace