RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_ASMSTUFF Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_ASMSTUFF"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_ASMSTUFF = 65793
Public Const TCODE_LEGACY_ASMSTUFF As UInteger = 65793
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace