RhinoCommon API
File3dmTypeCodes.TCODE_DICTIONARY Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DICTIONARY"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_DICTIONARY = 1073774608
Public Const TCODE_DICTIONARY As UInteger = 1073774608
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace