RhinoCommon SDK
File3dmTypeCodes.TCODE_LAYER_OBSELETE_1 Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYER_OBSELETE_1"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LAYER_OBSELETE_1 = 2151677971
Public Const TCODE_LAYER_OBSELETE_1 As UInteger = 2151677971
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace