RhinoCommon SDK
File3dmTypeCodes.TCODE_RH_SPOTLIGHT Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RH_SPOTLIGHT"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_RH_SPOTLIGHT = 8388609
Public Const TCODE_RH_SPOTLIGHT As UInteger = 8388609
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace