RhinoCommon SDK
File3dmTypeCodes.TCODE_COMPRESSED_MESH_GEOMETRY Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_COMPRESSED_MESH_GEOMETRY"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_COMPRESSED_MESH_GEOMETRY = 1048599
Public Const TCODE_COMPRESSED_MESH_GEOMETRY As UInteger = 1048599
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace