RhinoCommon API
File3dmTypeCodes.TCODE_DISPLAY Field
0x0040000.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_DISPLAY = 4194304
Public Const TCODE_DISPLAY As UInteger = 4194304
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace