RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames.Emission Field
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.Emission"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const string Emission = "emission"
Public Const Emission As String = "emission"
Field Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace