RhinoCommon SDK
File3dmTypeCodes.TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE = 536903717
Public Const TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE As UInteger = 536903717
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace