RhinoCommon SDK
File3dmTypeCodes.TCODE_OPENNURBS_CLASS_END Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OPENNURBS_CLASS_END"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OPENNURBS_CLASS_END = 2147647487
Public Const TCODE_OPENNURBS_CLASS_END As UInteger = 2147647487
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace