RhinoCommon API
File3dmTypeCodes.TCODE_FONT_RECORD Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_FONT_RECORD"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_FONT_RECORD = 536903796
Public Const TCODE_FONT_RECORD As UInteger = 536903796
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace