RhinoCommon API
File3dmTypeCodes.TCODE_RGBDISPLAY Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RGBDISPLAY"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_RGBDISPLAY = 2151677958
Public Const TCODE_RGBDISPLAY As UInteger = 2151677958
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace