RhinoCommon SDK
File3dmTypeCodes.TCODE_NAMED_CPLANE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_NAMED_CPLANE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_NAMED_CPLANE = 33554436
Public Const TCODE_NAMED_CPLANE As UInteger = 33554436
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace