RhinoCommon API
File3dmTypeCodes.TCODE_GEOMETRY Field
0x0010000.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_GEOMETRY = 1048576
Public Const TCODE_GEOMETRY As UInteger = 1048576
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace