RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEW_ATTRIBUTES Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_ATTRIBUTES"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_ATTRIBUTES = 536906811
Public Const TCODE_VIEW_ATTRIBUTES As UInteger = 536906811
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace