RhinoCommon SDK
File3dmTypeCodes.TCODE_DICTIONARY_END Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DICTIONARY_END"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_DICTIONARY_END = 3221225491
Public Const TCODE_DICTIONARY_END As UInteger = 3221225491
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace