RhinoCommon API
File3dmTypeCodes.TCODE_OPENNURBS_CLASS_USERDATA_HEADER Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OPENNURBS_CLASS_USERDATA_HEADER"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OPENNURBS_CLASS_USERDATA_HEADER = 196601
Public Const TCODE_OPENNURBS_CLASS_USERDATA_HEADER As UInteger = 196601
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace