RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEW_VIEWPORT Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_VIEWPORT"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_VIEWPORT = 536904251
Public Const TCODE_VIEW_VIEWPORT As UInteger = 536904251
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace