RhinoCommon SDK
File3dmTypeCodes.TCODE_LEGACY_PNT Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LEGACY_PNT"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LEGACY_PNT = 65546
Public Const TCODE_LEGACY_PNT As UInteger = 65546
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace