RhinoCommon API
File3dmTypeCodes.TCODE_DICTIONARY_ENTRY Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_DICTIONARY_ENTRY"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_DICTIONARY_ENTRY = 1073774610
Public Const TCODE_DICTIONARY_ENTRY As UInteger = 1073774610
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace