RhinoCommon API
File3dmTypeCodes.TCODE_LAYERINDEX Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_LAYERINDEX"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LAYERINDEX = 2151678004
Public Const TCODE_LAYERINDEX As UInteger = 2151678004
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace