RhinoCommon API
Curve.DivideEquidistant Method
 Calculates 3d points on a curve where the linear distance between the points is equal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] DivideEquidistant(
	double distance
)
Public Function DivideEquidistant (
	distance As Double
) As Point3d()
Parameters
distance
Type: System.Double
The distance betwen division points.
Return Value
Type: Point3d[]
An array of equidistant points, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Curve Class
Rhino.Geometry Namespace