RhinoCommon SDK
GetInteger.Get Method
 Call to get an integer.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetResult Get()
Public Function Get As GetResult
Return Value
Type: GetResult
If the user chose a number, then Number; another enumeration value otherwise.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
GetInteger Class
Rhino.Input.Custom Namespace