RhinoCommon API
Point3d.Subtraction Operator (Point3d, Vector3d)
 Subtracts a vector from a point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point3d operator -(
	Point3d point,
	Vector3d vector
)
Public Shared Operator - (
	point As Point3d,
	vector As Vector3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
vector
Type: Rhino.Geometry.Vector3d
A vector.
Return Value
Type: Point3d
A new point that is the difference of point minus vector.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
Point3d Structure
Subtraction Overload
Rhino.Geometry Namespace