RhinoCommon API
RhinoView.CaptureToBitmap Method (Size, DisplayModeDescription)
 Capture View contents to a bitmap using a display mode description to define how drawing is performed.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Bitmap CaptureToBitmap(
	Size size,
	DisplayModeDescription mode
)
Public Function CaptureToBitmap (
	size As Size,
	mode As DisplayModeDescription
) As Bitmap
Parameters
size
Type: System.Drawing.Size
The width and height of the returned bitmap.
mode
Type: Rhino.Display.DisplayModeDescription
The display mode.
Return Value
Type: Bitmap
A new bitmap.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
RhinoView Class
CaptureToBitmap Overload
Rhino.Display Namespace