RhinoCommon API
BrepFace.AdjacentEdges Method
 Gets the indices of all the BrepEdges that delineate this Face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] AdjacentEdges()
Public Function AdjacentEdges As Integer()
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.Geometry.BrepFace.AdjacentEdges"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace