RhinoCommon SDK
Brep.DuplicateVertices Method
 Duplicate all the corner vertices of this Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] DuplicateVertices()
Public Function DuplicateVertices As Point3d()
Return Value
Type: Point3d[]
An array or corner vertices.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Brep Class
Rhino.Geometry Namespace