RhinoCommon SDK
NameHash.Equality Operator
 Determines if two NameHash instances are equal by value.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator ==(
	NameHash left,
	NameHash right
)
Public Shared Operator = (
	left As NameHash,
	right As NameHash
) As Boolean
Parameters
left
Type: Rhino.FileIO.NameHash
The first hash.
right
Type: Rhino.FileIO.NameHash
The second hash.
Return Value
Type: Boolean
True if they are equal by value, otherwise false.
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
NameHash Class
Rhino.FileIO Namespace