RhinoCommon API
GetPoint.ConstrainDistanceFromBasePoint Method
 Sets distance constraint from base point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ConstrainDistanceFromBasePoint(
	double distance
)
Public Sub ConstrainDistanceFromBasePoint (
	distance As Double
)
Parameters
distance
Type: System.Double
 pass UnsetValue to clear this constraint. Pass 0.0 to disable the ability to set this constraint by typing a number during GetPoint.
Remarks
 If the base point is set and the distance from base point constraint is > 0, then the picked point is constrained to be this distance from the base point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace