RhinoCommon API
ObjectTable.Replace Method (ObjRef, Line)
Replaces one object with new line curve object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Replace(
	ObjRef objref,
	Line line
)
Public Function Replace (
	objref As ObjRef,
	line As Line
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
line
Type: Rhino.Geometry.Line
new line to be added. The line is copied.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace