RhinoCommon API
PersistentSettings.SetEnumValue<T> Method (String, T)
 Set an enum value in the settings using a custom key
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetEnumValue<T>(
	string key,
	T enumValue
)
where T : struct, new(), IConvertible
Public Sub SetEnumValue(Of T As {Structure, New, IConvertible}) (
	key As String,
	enumValue As T
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetEnumValue``1(System.String,``0)"]
enumValue
Type: T
[Missing <param name="enumValue"/> documentation for "M:Rhino.PersistentSettings.SetEnumValue``1(System.String,``0)"]
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.PersistentSettings.SetEnumValue``1(System.String,``0)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
PersistentSettings Class
SetEnumValue Overload
Rhino Namespace