RhinoCommon API
RealtimeDisplayMode.ShowCaptureProgress Method
 Override if you want to i.e. hide the progress dialog for capture progress.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool ShowCaptureProgress()
Public Overridable Function ShowCaptureProgress As Boolean
Return Value
Type: Boolean
Return true to show, false to hide
Version Information
Rhino for Windows
Supported in: 6.9
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace