RhinoCommon API
Vector2d.Subtraction Operator
 Subtracts the second vector from the first one.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector2d operator -(
	Vector2d vector1,
	Vector2d vector2
)
Public Shared Operator - (
	vector1 As Vector2d,
	vector2 As Vector2d
) As Vector2d
Parameters
vector1
Type: Rhino.Geometry.Vector2d
A vector.
vector2
Type: Rhino.Geometry.Vector2d
A second vector.
Return Value
Type: Vector2d
A new vector that results from the componentwise difference of vector1 - vector2.
Version Information
Rhino for Windows
Supported in: 6.10
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace