RhinoCommon SDK
MaterialTable.Add Method
 Adds a new material to the table based on the default material.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add()
Public Function Add As Integer
Return Value
Type: Int32
The position of the new material in the table.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MaterialTable Class
Add Overload
Rhino.DocObjects.Tables Namespace