RhinoCommon API
Interop.FromOnCurve Method
 Copies a Rhino_DotNet curve to a RhinoCommon curve class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Curve FromOnCurve(
	Object source
)
Public Shared Function FromOnCurve (
	source As Object
) As Curve
Parameters
source
Type: System.Object
 RMA.OpenNURBS.IOnCurve or RMA.OpenNURBS.OnCurve.
Return Value
Type: Curve
 RhinoCommon object on success. This will be an independent copy.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
Interop Class
Rhino.Runtime Namespace