RhinoCommon API
Sphere.LongitudeDegrees Method
 Computes the meridian at a specific longitude angle.
The angle is specified in degrees.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Circle LongitudeDegrees(
	double degrees
)
Public Function LongitudeDegrees (
	degrees As Double
) As Circle
Parameters
degrees
Type: System.Double
An angle in degrees.
Return Value
Type: Circle
A circle.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace