RhinoCommon SDK
LightManagerSupport.RegisterLightManager Method
 Find and register classes that derive from LightManagerSupport from the given plug-in.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void RegisterLightManager(
	PlugIn plugin
)
Public Shared Sub RegisterLightManager (
	plugin As PlugIn
)
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.LightManagerSupport.RegisterLightManager(Rhino.PlugIns.PlugIn)"]
Return Value
Type:
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace