RhinoCommon API
RhinoDoc.OpenDocuments Method
 Returns a list of currently open Rhino documents
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RhinoDoc[] OpenDocuments()
Public Shared Function OpenDocuments As RhinoDoc()
Return Value
Type: RhinoDoc[]
[Missing <returns> documentation for "M:Rhino.RhinoDoc.OpenDocuments"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
RhinoDoc Class
Rhino Namespace