RhinoCommon SDK
Particle Constructor
 Initializes a new instance of the Particle class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Particle()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Particle Class
Rhino.Geometry Namespace