RhinoCommon SDK
MeshTextureCoordinateList.GetEnumerator Method
 Gets an enumerator that yields all texture coordinates in this collection.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Point2f> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Point2f)
Return Value
Type: IEnumerator<Point2f>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace