RhinoCommon API
PythonCompiledCode Constructor
Initializes a new instance of the PythonCompiledCode class
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected PythonCompiledCode()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
PythonCompiledCode Class
Rhino.Runtime Namespace