RhinoCommon API
BinaryArchiveWriter.WriteDouble Method
 Writes a Double value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteDouble(
	double value
)
Public Sub WriteDouble (
	value As Double
)
Parameters
value
Type: System.Double
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace