RhinoCommon SDK
SnapShotsClient.SupportsObject Method
 Returns true if the client saves/restores object user data for the given object.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool SupportsObject(
	RhinoObject doc_object
)
Public MustOverride Function SupportsObject (
	doc_object As RhinoObject
) As Boolean
Parameters
doc_object
Type: Rhino.DocObjects.RhinoObject
doc_object is the given object
Return Value
Type: Boolean
 true if the client saves/restores object user data for the given object.
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace