RhinoCommon API
DisplayPipeline.DrawPointCloud Method (PointCloud, Int32, Color)
 Draws a point cloud.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawPointCloud(
	PointCloud cloud,
	int size,
	Color color
)
Public Sub DrawPointCloud (
	cloud As PointCloud,
	size As Integer,
	color As Color
)
Parameters
cloud
Type: Rhino.Geometry.PointCloud
Point cloud to draw.
size
Type: System.Int32
Size of points.
color
Type: System.Drawing.Color
Color of points in the cloud, if the cloud has a color array this setting is ignored.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
DisplayPipeline Class
DrawPointCloud Overload
Rhino.Display Namespace