RhinoCommon SDK
Brep.GetRegions Method
 Gets an array containing all regions in this brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepRegion[] GetRegions()
Public Function GetRegions As BrepRegion()
Return Value
Type: BrepRegion[]
An array of regions in this brep. This array can be empty, but not null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
Brep Class
Rhino.Geometry Namespace