RhinoCommon SDK
TwoColorRenderTexture.OnAddUserInterfaceSections Method
[Missing <summary> documentation for "M:Rhino.Render.TwoColorRenderTexture.OnAddUserInterfaceSections"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override sealed void OnAddUserInterfaceSections()
Protected Overrides NotOverridable Sub OnAddUserInterfaceSections
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace