RhinoCommon SDK
PickContext.UpdateClippingPlanes Method
 Updates the clipping plane information in pick region. The SetClippingPlanes and View fields must be called before calling UpdateClippingPlanes().
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void UpdateClippingPlanes()
Public Sub UpdateClippingPlanes
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace