RhinoCommon SDK
RhinoObject.OnTransform Method
 Called when a transformation has been applied to the geometry
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnTransform(
	Transform transform
)
Protected Overridable Sub OnTransform (
	transform As Transform
)
Parameters
transform
Type: Rhino.Geometry.Transform
[Missing <param name="transform"/> documentation for "M:Rhino.DocObjects.RhinoObject.OnTransform(Rhino.Geometry.Transform)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace