RhinoCommon API
ClassArrayObjRef.Add Method
 Adds an ObjRef to the list.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	ObjRef objref
)
Public Sub Add (
	objref As ObjRef
)
Parameters
objref
Type: Rhino.DocObjects.ObjRef
An ObjRef to add.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
ClassArrayObjRef Class
Rhino.Runtime.InteropWrappers Namespace