RhinoCommon SDK
ObjectPropertiesPage.InitializeControls Method
 Called on the active page after the selected objects list has changed to notify the page to initialize its content to reflect the new object list.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void InitializeControls(
	RhinoObject rhObj
)
Public Overridable Sub InitializeControls (
	rhObj As RhinoObject
)
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhObj"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.InitializeControls(Rhino.DocObjects.RhinoObject)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace