RhinoCommon API
LinetypeTable.GetUnusedLinetypeName Method
 Gets unused linetype name used as default when creating new linetypes.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetUnusedLinetypeName()
Public Function GetUnusedLinetypeName As String
Return Value
Type: String
The unused linetype name.
Version Information
Rhino for Windows
Supported in: 6.6
See Also
Reference
LinetypeTable Class
GetUnusedLinetypeName Overload
Rhino.DocObjects.Tables Namespace