RhinoCommon API
ColorXYZ.CreateFromCMYK Method
 Create the nearest XYZ equivalent of a CMYK color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorXYZ CreateFromCMYK(
	ColorCMYK cmyk
)
Public Shared Function CreateFromCMYK (
	cmyk As ColorCMYK
) As ColorXYZ
Parameters
cmyk
Type: Rhino.Display.ColorCMYK
Target color in CMYK space.
Return Value
Type: ColorXYZ
The XYZ equivalent of the CMYK color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace