RhinoCommon SDK
RenderPrimitiveList.GetInstanceTransform Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPrimitiveList.GetInstanceTransform(System.Int32)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform GetInstanceTransform(
	int index
)
Public Function GetInstanceTransform (
	index As Integer
) As Transform
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Render.RenderPrimitiveList.GetInstanceTransform(System.Int32)"]
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.Render.RenderPrimitiveList.GetInstanceTransform(System.Int32)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace