RhinoCommon API
CustomMeshObject Constructor
Initializes a new instance of the CustomMeshObject class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomMeshObject()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
CustomMeshObject Class
CustomMeshObject Overload
Rhino.DocObjects.Custom Namespace