RhinoCommon SDK
MeshFaceList.RemoveZeroAreaFaces Method
 Deletes or fixes mesh faces that have zero area.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int RemoveZeroAreaFaces(
	ref int fixedFaceCount
)
Public Function RemoveZeroAreaFaces (
	ByRef fixedFaceCount As Integer
) As Integer
Parameters
fixedFaceCount
Type: System.Int32
Number of fixed partially degenerate faces.
Return Value
Type: Int32
Number of removed wholly degenerate faces.
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace