RhinoCommon SDK
BinaryArchiveWriter.WritePoint3d Method
 Writes a Point3d value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WritePoint3d(
	Point3d value
)
Public Sub WritePoint3d (
	value As Point3d
)
Parameters
value
Type: Rhino.Geometry.Point3d
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace