RhinoCommon API
WaitCursor.Set Method
[Missing <summary> documentation for "M:Rhino.UI.WaitCursor.Set"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Set()
Public Sub Set
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
WaitCursor Class
Rhino.UI Namespace