RhinoCommon API
CustomDisplay.AddText Method (String, Plane, Double, Color)
 Adds a new, colored 3D text object to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddText(
	string text,
	Plane plane,
	double size,
	Color color
)
Public Sub AddText (
	text As String,
	plane As Plane,
	size As Double,
	color As Color
)
Parameters
text
Type: System.String
Text to add.
plane
Type: Rhino.Geometry.Plane
Plane for text orientation.
size
Type: System.Double
Height (in units) of font.
color
Type: System.Drawing.Color
Color of text.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
CustomDisplay Class
AddText Overload
Rhino.Display Namespace