RhinoCommon API
RhinoApp.Write Method (String)
Print formatted text in the command window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void Write(
	string message
)
Public Shared Sub Write (
	message As String
)
Parameters
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.RhinoApp.Write(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
RhinoApp Class
Write Overload
Rhino Namespace