RhinoCommon SDK
GumballObject.Dispose Method
Releases all resources used by the GumballObject
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GumballObject Class
Dispose Overload
Rhino.UI.Gumball Namespace