RhinoCommon SDK
ObjectTable.AddTextDot Method (TextDot)
Adds a text dot object to Rhino.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddTextDot(
	TextDot dot
)
Public Function AddTextDot (
	dot As TextDot
) As Guid
Parameters
dot
Type: Rhino.Geometry.TextDot
A text dot that will be copied.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectTable Class
AddTextDot Overload
Rhino.DocObjects.Tables Namespace