RhinoCommon API
Rectangle3d.ToPolyline Method
 Constructs a polyline from this rectangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Polyline ToPolyline()
Public Function ToPolyline As Polyline
Return Value
Type: Polyline
A polyline with the same shape as this rectangle.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace