RhinoCommon API
CalculateBoundingBoxEventArgs.IncludeBoundingBox Method
 Unites a bounding box with the current display bounding box in order to ensure dynamic objects in "box" are drawn.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void IncludeBoundingBox(
	BoundingBox box
)
Public Sub IncludeBoundingBox (
	box As BoundingBox
)
Parameters
box
Type: Rhino.Geometry.BoundingBox
The box to unite.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
CalculateBoundingBoxEventArgs Class
Rhino.Display Namespace