RhinoCommon SDK
GripObject.UndoMove Method
 Undoes any grip moves made by calling Move.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void UndoMove()
Public Sub UndoMove
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace