RhinoCommon API
ObjectTable.DeleteGrip Method (Guid)
 Deletes a grip object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DeleteGrip(
	Guid gripId
)
Public Function DeleteGrip (
	gripId As Guid
) As Boolean
Parameters
gripId
Type: System.Guid
The id of the grip object to delete.
Return Value
Type: Boolean
True on success.
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
ObjectTable Class
DeleteGrip Overload
Rhino.DocObjects.Tables Namespace