RhinoCommon API
BinaryArchiveReader.ReadSizeF Method
 Reads a SizeF from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SizeF ReadSizeF()
Public Function ReadSizeF As SizeF
Return Value
Type: SizeF
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace