RhinoCommon SDK
GeometryBase.NonConstOperation Method
 Destroy cache handle
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void NonConstOperation()
Protected Overrides Sub NonConstOperation
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace