RhinoCommon SDK
TransformObjectList.Add Method (ObjRef)
 Add an ObjRef to this list. Use this to add Polyedges so the references are properly counted
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	ObjRef objref
)
Public Sub Add (
	objref As ObjRef
)
Parameters
objref
Type: Rhino.DocObjects.ObjRef
[Missing <param name="objref"/> documentation for "M:Rhino.Collections.TransformObjectList.Add(Rhino.DocObjects.ObjRef)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TransformObjectList Class
Add Overload
Rhino.Collections Namespace