RhinoCommon API
TransformObjectList.Clear Method
 Remove all elements from this list
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace