RhinoCommon SDK
ArchivableDictionary.Set Method (String, Vector3d)
 Sets a Vector3d.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Set(
	string key,
	Vector3d val
)
Public Function Set (
	key As String,
	val As Vector3d
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.Vector3d
A value for that key.
Because Vector3d has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Vector3d)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace