RhinoCommon SDK
Ray3d.GetHashCode Method
 Computes a hashing number that represents the current ray.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A signed integer that represents both postion and direction, but is not unique.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace