RhinoCommon SDK
ConstructionPlane Constructor
 Initializes a new instance of ConstructionPlane.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ConstructionPlane()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace