RhinoCommon API
StringHolder.Dispose Method
 IDispose implementation
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
StringHolder Class
Dispose Overload
Rhino.Runtime.InteropWrappers Namespace