RhinoCommon SDK
BinaryArchiveWriter.WriteInt Method
 Writes a Int32 value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteInt(
	int value
)
Public Sub WriteInt (
	value As Integer
)
Parameters
value
Type: System.Int32
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace