RhinoCommon API
Vector3d.Multiply Method (Vector3d, Double)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3d Multiply(
	Vector3d vector,
	double t
)
Public Shared Function Multiply (
	vector As Vector3d,
	t As Double
) As Vector3d
Parameters
vector
Type: Rhino.Geometry.Vector3d
A vector.
t
Type: System.Double
A number.
Return Value
Type: Vector3d
A new vector that is the original vector coordinatewise multiplied by t.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
Vector3d Structure
Multiply Overload
Rhino.Geometry Namespace