RhinoCommon SDK
RenderTexture.GetMappingChannel Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetMappingChannel"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual int GetMappingChannel()
Public Overridable Function GetMappingChannel As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetMappingChannel"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderTexture Class
Rhino.Render Namespace