RhinoCommon SDK
BrepFaceList.RemoveSlits Method
 Remove slit trims and slit boundaries from each face.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RemoveSlits()
Public Function RemoveSlits As Boolean
Return Value
Type: Boolean
true if any slits were removed
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace