RhinoCommon API
StatusBar.SetPointPane Method
 Sets the point pane to a point value.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetPointPane(
	Point3d point
)
Public Shared Sub SetPointPane (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
The point value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
StatusBar Class
Rhino.UI Namespace