RhinoCommon API
MaterialTable.Add Method (Material, Boolean)
 Adds a new material to the table based on a given material.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add(
	Material material,
	bool reference
)
Public Function Add (
	material As Material,
	reference As Boolean
) As Integer
Parameters
material
Type: Rhino.DocObjects.Material
A model of the material to be added.
reference
Type: System.Boolean
 true if this material is supposed to be a reference material. Reference materials are not saved in the file.
Return Value
Type: Int32
The position of the new material in the table.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
MaterialTable Class
Add Overload
Rhino.DocObjects.Tables Namespace