RhinoCommon SDK
Command.InCommand Method
 Determines if Rhino is currently running a command.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool InCommand()
Public Shared Function InCommand As Boolean
Return Value
Type: Boolean
true if a command is currently running, false if no commands are currently running.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Command Class
Rhino.Commands Namespace