RhinoCommon API
PolyCurve.PolyCurveParameter Method
 Converts a segment curve parameter to a polycurve parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PolyCurveParameter(
	int segmentIndex,
	double segmentCurveParameter
)
Public Function PolyCurveParameter (
	segmentIndex As Integer,
	segmentCurveParameter As Double
) As Double
Parameters
segmentIndex
Type: System.Int32
Index of segment.
segmentCurveParameter
Type: System.Double
Parameter on segment.
Return Value
Type: Double
 Polycurve evaluation parameter or UnsetValue if the polycurve curve parameter could not be computed.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace