RhinoCommon API
OptionInteger.Finalize Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.OptionInteger.Finalize"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
OptionInteger Class
Rhino.Input.Custom Namespace