RhinoCommon API
LineCurve Constructor (Line)
 Initializes a new instance of the LineCurve class, by retrieving its value from a line.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LineCurve(
	Line line
)
Public Sub New (
	line As Line
)
Parameters
line
Type: Rhino.Geometry.Line
A line to use as model.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
LineCurve Class
LineCurve Overload
Rhino.Geometry Namespace