RhinoCommon API
RhinoList<T>.Clear Method
 Removes all elements from the List.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Implements
IList.Clear()
ICollection<T>.Clear()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace