RhinoCommon API
SimpleArrayGuid.ToArray Method
 Returns the managed counterpart of the unmanaged array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid[] ToArray()
Public Function ToArray As Guid()
Return Value
Type: Guid[]
The managed array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
SimpleArrayGuid Class
Rhino.Runtime.InteropWrappers Namespace