RhinoCommon SDK
RhinoObject.GetHighlightedSubObjects Method
 Gets a list of all highlighted subobjects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ComponentIndex[] GetHighlightedSubObjects()
Public Function GetHighlightedSubObjects As ComponentIndex()
Return Value
Type: ComponentIndex[]
An array of all highlighted subobjects; or null is there are none.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace