RhinoCommon API
MeshObject.DuplicateMeshGeometry Method
[Missing <summary> documentation for "M:Rhino.DocObjects.MeshObject.DuplicateMeshGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh DuplicateMeshGeometry()
Public Function DuplicateMeshGeometry As Mesh
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.DocObjects.MeshObject.DuplicateMeshGeometry"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
MeshObject Class
Rhino.DocObjects Namespace