RhinoCommon API
RhinoViewport Constructor (RhinoViewport)
Initializes a new instance of the RhinoViewport class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoViewport(
	RhinoViewport other
)
Public Sub New (
	other As RhinoViewport
)
Parameters
other
Type: Rhino.Display.RhinoViewport
[Missing <param name="other"/> documentation for "M:Rhino.Display.RhinoViewport.#ctor(Rhino.Display.RhinoViewport)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
RhinoViewport Class
RhinoViewport Overload
Rhino.Display Namespace