RhinoCommon SDK
GetPoint.Constrain Method (Plane, Boolean)
constrain the picked point to lie on a plane.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Constrain(
	Plane plane,
	bool allowElevator
)
Public Function Constrain (
	plane As Plane,
	allowElevator As Boolean
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
A plane to use as constraint.
allowElevator
Type: System.Boolean
true if elevator mode should be allowed at user request.
Return Value
Type: Boolean
true if constraint could be applied.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetPoint Class
Constrain Overload
Rhino.Input.Custom Namespace