RhinoCommon SDK
Surface.IsCone Method
 Determines if the surface is a portion of a cone within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCone()
Public Function IsCone As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a cone.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Surface Class
IsCone Overload
Rhino.Geometry Namespace