RhinoCommon API
ChangeQueue.OneShot Method
 Call Flush() once, after that automatically dispose the queue.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void OneShot()
Public Sub OneShot
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace