RhinoCommon SDK
ControlPoint Constructor (Point3d, Double)
 Constructs a control point from a world 3-D, or Euclidean, location and a weight. The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ControlPoint(
	Point3d pt,
	double weight
)
Public Sub New (
	pt As Point3d,
	weight As Double
)
Parameters
pt
Type: Rhino.Geometry.Point3d
[Missing <param name="pt"/> documentation for "M:Rhino.Geometry.ControlPoint.#ctor(Rhino.Geometry.Point3d,System.Double)"]
weight
Type: System.Double
Weight factor of the control point. You should not use weights less than or equal to zero.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
ControlPoint Structure
ControlPoint Overload
Rhino.Geometry Namespace