RhinoCommon SDK
File3dmViewTable.Contains Method
 Returns an indication of the presence of a view in the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Contains(
	ViewInfo item
)
Public Function Contains (
	item As ViewInfo
) As Boolean
Parameters
item
Type: Rhino.DocObjects.ViewInfo
The view to check.
Return Value
Type: Boolean
true if the item is in the table; false otherwise.
Implements
ICollection<T>.Contains(T)
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace