RhinoCommon SDK
DevelopableSrf Constructor
Initializes a new instance of the DevelopableSrf class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DevelopableSrf()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
DevelopableSrf Class
Rhino.Geometry Namespace