RhinoCommon API
PhysicallyBasedMaterial Constructor
Initializes a new instance of the PhysicallyBasedMaterial class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PhysicallyBasedMaterial()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.18
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace