RhinoCommon SDK
File3dmStringTable.Delete Method (String)
 Removes a document string from the 3dm file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Delete(
	string key
)
Public Sub Delete (
	key As String
)
Parameters
key
Type: System.String
The key to remove.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmStringTable Class
Delete Overload
Rhino.FileIO Namespace