RhinoCommon SDK
CustomRenderMeshProvider.WillBuildCustomMeshes Method
 Determines if custom render meshes will be built for a particular object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool WillBuildCustomMeshes(
	ViewportInfo vp,
	RhinoObject obj,
	RhinoDoc doc,
	Guid requestingPlugIn,
	bool preview
)
Public MustOverride Function WillBuildCustomMeshes (
	vp As ViewportInfo,
	obj As RhinoObject,
	doc As RhinoDoc,
	requestingPlugIn As Guid,
	preview As Boolean
) As Boolean
Parameters
vp
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
obj
Type: Rhino.DocObjects.RhinoObject
The Rhino object of interest. This can be null in the case where document meshes (not associated with any object) are being requested.
doc
Type: Rhino.RhinoDoc
The Rhino document of interest.
requestingPlugIn
Type: System.Guid
UUID of the RDK plug-in requesting the meshes.
preview
Type: System.Boolean
Type of mesh to build.
Return Value
Type: Boolean
true if custom meshes will be built.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace