RhinoCommon API
RhinoApp.RunningOnVMWare Method
 Verifies that Rhino is running on VMWare
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool RunningOnVMWare()
Public Shared Function RunningOnVMWare As Boolean
Return Value
Type: Boolean
true if Rhino is running in Windows on VMWare, false otherwise
Version Information
Rhino for Windows
Supported in: 6.6
See Also
Reference
RhinoApp Class
Rhino Namespace