RhinoCommon SDK
Box Constructor (BoundingBox)
 Initializes a new Box that mimics a BoundingBox struct.
The orientation plane of the Box is coincident with the World XY plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Box(
	BoundingBox bbox
)
Public Sub New (
	bbox As BoundingBox
)
Parameters
bbox
Type: Rhino.Geometry.BoundingBox
BoundingBox to mimic.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Box Structure
Box Overload
Rhino.Geometry Namespace