RhinoCommon SDK
Point4d.Multiply Operator (Point4d, Double)
 Multiplies a point by a number.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point4d operator *(
	Point4d point,
	double d
)
Public Shared Operator * (
	point As Point4d,
	d As Double
) As Point4d
Parameters
point
Type: Rhino.Geometry.Point4d
A point.
d
Type: System.Double
A number.
Return Value
Type: Point4d
A new point that results from the coordinatewise multiplication of point with d.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
Point4d Structure
Multiply Overload
Rhino.Geometry Namespace