RhinoCommon SDK
MouseCallback.OnEndMouseMove Method
 Called at the end of handling of a mouse move event in Rhino. All of the default Rhino mouse move functionality has already been executed unless a MouseCallback has set Cancel to true for the event args. You can tell if this is the case by inpecting the Cancel property in the event args parameter. Base class implementation of this function does nothing.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnEndMouseMove(
	MouseCallbackEventArgs e
)
Protected Overridable Sub OnEndMouseMove (
	e As MouseCallbackEventArgs
)
Parameters
e
Type: Rhino.UI.MouseCallbackEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.UI.MouseCallback.OnEndMouseMove(Rhino.UI.MouseCallbackEventArgs)"]
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
MouseCallback Class
Rhino.UI Namespace