RhinoCommon API
Extrusion.GetProfileTransformation Method
 Gets the transformation that maps the xy profile curve to its 3d location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform GetProfileTransformation(
	double s
)
Public Function GetProfileTransformation (
	s As Double
) As Transform
Parameters
s
Type: System.Double
 0.0 = starting profile 1.0 = ending profile.
Return Value
Type: Transform
A Transformation. The transform is Invalid on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace