RhinoCommon SDK
Surface.Transpose Method
 Transposes surface parameterization (swap U and V)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Surface Transpose()
Public Function Transpose As Surface
Return Value
Type: Surface
New transposed surface on success, null on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Surface Class
Transpose Overload
Rhino.Geometry Namespace