RhinoCommon SDK
IntersectionEvent Constructor
Initializes a new instance of the IntersectionEvent class
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntersectionEvent()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace