RhinoCommon SDK
UnknownUserData Constructor
 Constructs a new unknown data entity.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UnknownUserData(
	IntPtr pointerNativeUserData
)
Public Sub New (
	pointerNativeUserData As IntPtr
)
Parameters
pointerNativeUserData
Type: System.IntPtr
A pointer to the entity.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
UnknownUserData Class
Rhino.DocObjects.Custom Namespace