RhinoCommon API
BinaryArchiveWriter.WritePointF Method
 Writes a PointF value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WritePointF(
	PointF value
)
Public Sub WritePointF (
	value As PointF
)
Parameters
value
Type: System.Drawing.PointF
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace