RhinoCommon API
SporphSpaceMorph Constructor (Surface, Surface)
 Constructs a sporph space morph.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SporphSpaceMorph(
	Surface surface0,
	Surface surface1
)
Public Sub New (
	surface0 As Surface,
	surface1 As Surface
)
Parameters
surface0
Type: Rhino.Geometry.Surface
Base surface.
surface1
Type: Rhino.Geometry.Surface
Target surface.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
SporphSpaceMorph Class
SporphSpaceMorph Overload
Rhino.Geometry.Morphs Namespace