RhinoCommon SDK
DisplayEngine Constructor
Initializes a new instance of the DisplayEngine class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected DisplayEngine()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
DisplayEngine Class
Rhino.Display Namespace