RhinoCommon SDK
ObjectTable.AddCurve Method (Curve, ObjectAttributes)
Adds a curve object to Rhino.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddCurve(
	Curve curve,
	ObjectAttributes attributes
)
Public Function AddCurve (
	curve As Curve,
	attributes As ObjectAttributes
) As Guid
Parameters
curve
Type: Rhino.Geometry.Curve
A curve. A duplicate of this curve is added to Rhino.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to curve.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectTable Class
AddCurve Overload
Rhino.DocObjects.Tables Namespace