RhinoCommon SDK
Sun.Dispose Method
Releases all resources used by the Sun
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Sun Class
Rhino.Render Namespace