RhinoCommon SDK
NamedPositionTable.Restore Method (String)
Restore a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Restore(
	string name
)
Public Function Restore (
	name As String
) As Boolean
Parameters
name
Type: System.String
 Name of the Named Position to restore.
Return Value
Type: Boolean
 True or False based on whether the Named Position was able to be restored.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NamedPositionTable Class
Restore Overload
Rhino.DocObjects.Tables Namespace