RhinoCommon API
TransformObjectList.Finalize Method
[Missing <summary> documentation for "M:Rhino.Collections.TransformObjectList.Finalize"]
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace