RhinoCommon API
Mesh.GetPartition Method
 Retrieves a partition. See CreatePartitions(Int32, Int32) for details.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshPart GetPartition(
	int which
)
Public Function GetPartition (
	which As Integer
) As MeshPart
Parameters
which
Type: System.Int32
The partition index.
Return Value
Type: MeshPart
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.GetPartition(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
Mesh Class
Rhino.Geometry Namespace