RhinoCommon SDK
BinaryArchiveWriter.WriteColor Method
 Writes a Color value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteColor(
	Color value
)
Public Sub WriteColor (
	value As Color
)
Parameters
value
Type: System.Drawing.Color
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace