RhinoCommon API
BrepObject.DuplicateBrepGeometry Method
 Constructs a new deep copy of the brep geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep DuplicateBrepGeometry()
Public Function DuplicateBrepGeometry As Brep
Return Value
Type: Brep
The copy of the geometry.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
BrepObject Class
Rhino.DocObjects Namespace