RhinoCommon SDK
NurbsCurvePointList.IndexOf Method
 Gets the index of a control point, or -1.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int IndexOf(
	ControlPoint item
)
Public Function IndexOf (
	item As ControlPoint
) As Integer
Parameters
item
Type: Rhino.Geometry.ControlPoint
The exact item to search for.
Return Value
Type: Int32
The index.
Implements
IList<T>.IndexOf(T)
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace