RhinoCommon SDK
RhinoView.Close Method
 Remove this View from Rhino. DO NOT attempt to use this instance of this class after calling Close.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Close()
Public Function Close As Boolean
Return Value
Type: Boolean
true on success
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoView Class
Rhino.Display Namespace