RhinoCommon API
LayerTable.Undelete Method
 Undeletes a layer that has been deleted by DeleteLayer().
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Undelete(
	int layerIndex
)
Public Function Undelete (
	layerIndex As Integer
) As Boolean
Parameters
layerIndex
Type: System.Int32
 zero based index of layer to undelete. This must be in the range 0 <= layerIndex < LayerTable.Count.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace