RhinoCommon SDK
Brep.CullUnusedEdges Method
Culls edges with m_edge_index == -1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CullUnusedEdges()
Public Function CullUnusedEdges As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Brep Class
Rhino.Geometry Namespace