RhinoCommon API
Box Constructor (Plane, Interval, Interval, Interval)
 Initializes a new box from a base Plane and three Intervals.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Box(
	Plane basePlane,
	Interval xSize,
	Interval ySize,
	Interval zSize
)
Public Sub New (
	basePlane As Plane,
	xSize As Interval,
	ySize As Interval,
	zSize As Interval
)
Parameters
basePlane
Type: Rhino.Geometry.Plane
Orientation plane of the box.
xSize
Type: Rhino.Geometry.Interval
Dimensions along the base plane X-Axis.
ySize
Type: Rhino.Geometry.Interval
Dimensions along the base plane Y-Axis.
zSize
Type: Rhino.Geometry.Interval
Dimensions along the base plane Z-Axis.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Box Structure
Box Overload
Rhino.Geometry Namespace