RhinoCommon API
CustomGripObject Constructor
Initializes a new instance of the CustomGripObject class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CustomGripObject()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace