RhinoCommon SDK
PolyCurve.DuplicatePolyCurve Method
 Duplicates this polycurve.
This is the same as Duplicate().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PolyCurve DuplicatePolyCurve()
Public Function DuplicatePolyCurve As PolyCurve
Return Value
Type: PolyCurve
An exact duplicate of this curve.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace