RhinoCommon SDK
Material.GetTextures Method
 Get array of textures that this material uses
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture[] GetTextures()
Public Function GetTextures As Texture()
Return Value
Type: Texture[]
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.GetTextures"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Material Class
Rhino.DocObjects Namespace