RhinoCommon API
BinaryArchiveWriter.WritePoint4d Method
 Writes a Point4d value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WritePoint4d(
	Point4d value
)
Public Sub WritePoint4d (
	value As Point4d
)
Parameters
value
Type: Rhino.Geometry.Point4d
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace