RhinoCommon API
Curve.NonConstOperation Method
 For derived classes implementers.
Defines the necessary implementation to free the instance from being const.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void NonConstOperation()
Protected Overrides Sub NonConstOperation
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
Curve Class
Rhino.Geometry Namespace