RhinoCommon SDK
RealtimeDisplayMode.HudShowMaxPasses Method
 Override to show maximum passes in HUD. By default disabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool HudShowMaxPasses()
Public Overridable Function HudShowMaxPasses As Boolean
Return Value
Type: Boolean
Return true to show maximum passes.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace