RhinoCommon API
Arc.Inequality Operator
 Determines whether two arcs have different values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator !=(
	Arc a,
	Arc b
)
Public Shared Operator <> (
	a As Arc,
	b As Arc
) As Boolean
Parameters
a
Type: Rhino.Geometry.Arc
The first arc.
b
Type: Rhino.Geometry.Arc
The second arc.
Return Value
Type: Boolean
true if any value of the two arcs differ; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
Arc Structure
Rhino.Geometry Namespace