RhinoCommon SDK
ClippingPlaneSurface.RemoveClipViewportId Method
 Removes a viewport id that this being clipped by this clipping plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RemoveClipViewportId(
	Guid viewportId
)
Public Function RemoveClipViewportId (
	viewportId As Guid
) As Boolean
Parameters
viewportId
Type: System.Guid
The id of the RhinoViewport to remove.
Return Value
Type: Boolean
true if the viewport was removed, false if the viewport was not in the list.
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace