RhinoCommon API
Line Constructor (Point3d, Vector3d, Double)
 Constructs a new line segment from start point, direction and length.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line(
	Point3d start,
	Vector3d direction,
	double length
)
Public Sub New (
	start As Point3d,
	direction As Vector3d,
	length As Double
)
Parameters
start
Type: Rhino.Geometry.Point3d
Start point of line segment.
direction
Type: Rhino.Geometry.Vector3d
Direction of line segment.
length
Type: System.Double
Length of line segment.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
Line Structure
Line Overload
Rhino.Geometry Namespace