RhinoCommon SDK
Matrix.SwapRows Method
 Exchanges two rows.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SwapRows(
	int rowA,
	int rowB
)
Public Function SwapRows (
	rowA As Integer,
	rowB As Integer
) As Boolean
Parameters
rowA
Type: System.Int32
A first row.
rowB
Type: System.Int32
Another row.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Matrix Class
Rhino.Geometry Namespace