RhinoCommon SDK
PointCloud.InsertNew Method
 Inserts a new PointCloudItem at a specific position of the point cloud.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointCloudItem InsertNew(
	int index
)
Public Function InsertNew (
	index As Integer
) As PointCloudItem
Parameters
index
Type: System.Int32
Index of new item.
Return Value
Type: PointCloudItem
The newly inserted item.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace