RhinoCommon API
SimpleArray2dex Constructor
 Initializes a new SimpleArray2dex class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArray2dex()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
SimpleArray2dex Class
SimpleArray2dex Overload
Rhino.Runtime.InteropWrappers Namespace