RhinoCommon API
HistoryRecord.SetPoint3d Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetPoint3d(System.Int32,Rhino.Geometry.Point3d)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetPoint3d(
	int id,
	Point3d value
)
Public Function SetPoint3d (
	id As Integer,
	value As Point3d
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetPoint3d(System.Int32,Rhino.Geometry.Point3d)"]
value
Type: Rhino.Geometry.Point3d
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetPoint3d(System.Int32,Rhino.Geometry.Point3d)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetPoint3d(System.Int32,Rhino.Geometry.Point3d)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace