RhinoCommon API
RenderSettings Constructor (RenderSettings)
 Initialize new instance of the RenderSettings class.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderSettings(
	RenderSettings source
)
Public Sub New (
	source As RenderSettings
)
Parameters
source
Type: Rhino.Render.RenderSettings
If not null, settings are copied from source
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
RenderSettings Class
RenderSettings Overload
Rhino.Render Namespace