RhinoCommon SDK
InstanceDefinitionGeometry Constructor
 Initializes a new block definition.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public InstanceDefinitionGeometry()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace