RhinoCommon API
ContentUndoBlocker.Dispose Method
Releases all resources used by the ContentUndoBlocker
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.18
See Also
Reference
ContentUndoBlocker Class
Dispose Overload
Rhino.Render Namespace