RhinoCommon SDK
CollapsibleSectionViewModel.UndoHelper Method
 Helper function to ease the use of undo records
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UndoRecord UndoHelper(
	string description
)
Public Function UndoHelper (
	description As String
) As UndoRecord
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionViewModel.UndoHelper(System.String)"]
Return Value
Type: UndoRecord
Return the undo record
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CollapsibleSectionViewModel Class
Rhino.UI.Controls Namespace