RhinoCommon SDK
BezierCurve.MakeNonRational Method
Make bezier non-rational
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MakeNonRational()
Public Function MakeNonRational As Boolean
Return Value
Type: Boolean
treu if successful
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace