RhinoCommon SDK
NurbsSurfacePointList.GetControlPoint Method
 Gets the control point at the given (u, v) index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ControlPoint GetControlPoint(
	int u,
	int v
)
Public Function GetControlPoint (
	u As Integer,
	v As Integer
) As ControlPoint
Parameters
u
Type: System.Int32
Index of control point in the surface U direction.
v
Type: System.Int32
Index of control point in the surface V direction.
Return Value
Type: ControlPoint
The control point at the given (u, v) index.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace