RhinoCommon SDK
GeometryBase Constructor
 Protected constructor for internal use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected GeometryBase(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
Serialization data.
context
Type: System.Runtime.Serialization.StreamingContext
Serialization stream.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace