RhinoCommon SDK
Panels.GetPanel<T> Method
Note: This API is now obsolete.
 Return an instance of a .Net panel
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Obsolete method, use GetPanel<MyClass>(RhinoDoc)")]
public static T GetPanel<T>()
where T : class
<ObsoleteAttribute("Obsolete method, use GetPanel<MyClass>(RhinoDoc)")>
Public Shared Function GetPanel(Of T As Class) As T
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.UI.Panels.GetPanel``1"]
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.UI.Panels.GetPanel``1"]
Version Information
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
Panels Class
GetPanel Overload
Rhino.UI Namespace