RhinoCommon API
Brep.Split Method (Brep, Double, Boolean)
 Splits a Brep into pieces using a Brep as a cutter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep[] Split(
	Brep splitter,
	double intersectionTolerance,
	out bool toleranceWasRaised
)
Public Function Split (
	splitter As Brep,
	intersectionTolerance As Double,
	<OutAttribute> ByRef toleranceWasRaised As Boolean
) As Brep()
Parameters
splitter
Type: Rhino.Geometry.Brep
[Missing <param name="splitter"/> documentation for "M:Rhino.Geometry.Brep.Split(Rhino.Geometry.Brep,System.Double,System.Boolean@)"]
intersectionTolerance
Type: System.Double
The tolerance with which to compute intersections.
toleranceWasRaised
Type: System.Boolean
 Set to true if the split failed at intersectionTolerance but succeeded when the tolerance was increased to twice intersectionTolerance.
Return Value
Type: Brep[]
A new array of Breps. This array can be empty.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
Brep Class
Split Overload
Rhino.Geometry Namespace