RhinoCommon SDK
Vector3d Constructor (Point3d)
 Initializes a new instance of a vector, copying the three components from the three coordinates of a point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d(
	Point3d point
)
Public Sub New (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
The point to copy from.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector3d Structure
Vector3d Overload
Rhino.Geometry Namespace