RhinoCommon API
Extrusion.AddInnerProfile Method
 Adds an inner profile.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AddInnerProfile(
	Curve innerProfile
)
Public Function AddInnerProfile (
	innerProfile As Curve
) As Boolean
Parameters
innerProfile
Type: Rhino.Geometry.Curve
Closed curve in the XY plane or a 2d curve.
Return Value
Type: Boolean
true if the profile was set.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace