RhinoCommon API
RhinoDoc.ClearRedoRecords Method
[Missing <summary> documentation for "M:Rhino.RhinoDoc.ClearRedoRecords"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearRedoRecords()
Public Sub ClearRedoRecords
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
RhinoDoc Class
Rhino Namespace