RhinoCommon SDK
File3dmHatchPatternTable.FindIndex Method
 Retrieves a HatchPattern object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HatchPattern FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As HatchPattern
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: HatchPattern
A HatchPattern object, or null if none was found.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmHatchPatternTable Class
Rhino.FileIO Namespace