RhinoCommon SDK
StringTable.Delete Method (String)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.StringTable.Delete(System.String)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Delete(
	string key
)
Public Sub Delete (
	key As String
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.DocObjects.Tables.StringTable.Delete(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
StringTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace