RhinoCommon SDK
MeshFace.ToString Method
 Returns a string representation for this MeshFace. This is to provide a meaningful visualization of this structure and is subject to change in newer releases.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The string representation.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshFace Structure
ToString Overload
Rhino.Geometry Namespace