RhinoCommon SDK
RhinoGet.InGetObject Method
Returns true if currently in a GetObject.GetObjects()
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool InGetObject(
	RhinoDoc doc
)
Public Shared Function InGetObject (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Input.RhinoGet.InGetObject(Rhino.RhinoDoc)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.InGetObject(Rhino.RhinoDoc)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoGet Class
Rhino.Input Namespace