RhinoCommon SDK
ColorXYZ.CreateFromLCH Method
 Create the nearest XYZ equivalent of an LCH color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorXYZ CreateFromLCH(
	ColorLCH lch
)
Public Shared Function CreateFromLCH (
	lch As ColorLCH
) As ColorXYZ
Parameters
lch
Type: Rhino.Display.ColorLCH
Target color in LCH space.
Return Value
Type: ColorXYZ
The XYZ equivalent of the LCH color.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace