RhinoCommon SDK
Localization.SetLanguageId Method
 Sets the Id used for Localization in RhinoCommon. Only useful for when using RhinoCommon outside of the Rhino process
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SetLanguageId(
	int id
)
Public Shared Function SetLanguageId (
	id As Integer
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.UI.Localization.SetLanguageId(System.Int32)"]
Return Value
Type: Boolean
true if the language id could be set
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Localization Class
Rhino.UI Namespace