RhinoCommon SDK
Vector3f.Unitize Method
 Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Unitize()
Public Function Unitize As Boolean
Return Value
Type: Boolean
true on success or false on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace