RhinoCommon API
ViewSettings.GetDefaultState Method
 Gets the view factory settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ViewSettingsState GetDefaultState()
Public Shared Function GetDefaultState As ViewSettingsState
Return Value
Type: ViewSettingsState
A new view state with factory settings.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace