RhinoCommon SDK
Plane.UpdateEquation Method
 Update Equations
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UpdateEquation()
Public Function UpdateEquation As Boolean
Return Value
Type: Boolean
 bool
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Plane Structure
Rhino.Geometry Namespace