RhinoCommon SDK
Point4d.GetHashCode Method
 Computes the hash code for the present point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique hash code, which uses all coordiantes of this object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace