RhinoCommon SDK
Dimension.SetDimensionLengthDisplayWithZeroSuppressionReset Method
[Missing <summary> documentation for "M:Rhino.Geometry.Dimension.SetDimensionLengthDisplayWithZeroSuppressionReset(Rhino.DocObjects.DimensionStyle.LengthDisplay)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDimensionLengthDisplayWithZeroSuppressionReset(
	DimensionStyle.LengthDisplay ld
)
Public Sub SetDimensionLengthDisplayWithZeroSuppressionReset (
	ld As DimensionStyle.LengthDisplay
)
Parameters
ld
Type: Rhino.DocObjects.DimensionStyle.LengthDisplay
[Missing <param name="ld"/> documentation for "M:Rhino.Geometry.Dimension.SetDimensionLengthDisplayWithZeroSuppressionReset(Rhino.DocObjects.DimensionStyle.LengthDisplay)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Dimension Class
Rhino.Geometry Namespace