RhinoCommon SDK
ZBufferCapture.HitCount Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.HitCount"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int HitCount()
Public Function HitCount As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.HitCount"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace