RhinoCommon SDK
MeshTopologyVertexList.IsHidden Method
 Returns true if the topological vertex is hidden. The mesh topology vertex is hidden if and only if all the ON_Mesh vertices it represents is hidden.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsHidden(
	int topologyVertexIndex
)
Public Function IsHidden (
	topologyVertexIndex As Integer
) As Boolean
Parameters
topologyVertexIndex
Type: System.Int32
index of a topology vertex in Mesh.TopologyVertices.
Return Value
Type: Boolean
true if mesh topology vertex is hidden.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace