RhinoCommon SDK
CollapsibleSectionHolderImpl Constructor
Initializes a new instance of the CollapsibleSectionHolderImpl class
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CollapsibleSectionHolderImpl(
	ICollapsibleSectionHolder client
)
Public Sub New (
	client As ICollapsibleSectionHolder
)
Parameters
client
Type: Rhino.UI.Controls.ICollapsibleSectionHolder
[Missing <param name="client"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionHolderImpl.#ctor(Rhino.UI.Controls.ICollapsibleSectionHolder)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CollapsibleSectionHolderImpl Class
Rhino.UI.Controls Namespace