RhinoCommon API
AreaMassProperties.Compute Method (Curve)
 Computes an AreaMassProperties for a closed planar curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static AreaMassProperties Compute(
	Curve closedPlanarCurve
)
Public Shared Function Compute (
	closedPlanarCurve As Curve
) As AreaMassProperties
Parameters
closedPlanarCurve
Type: Rhino.Geometry.Curve
Curve to measure.
Return Value
Type: AreaMassProperties
The AreaMassProperties for the given curve or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When closedPlanarCurve is null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace