RhinoCommon API
SimpleArrayBinaryArchiveReader Constructor
 Initializes a new SimpleArrayBinaryArchiveReader class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayBinaryArchiveReader()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.6
See Also
Reference
SimpleArrayBinaryArchiveReader Class
SimpleArrayBinaryArchiveReader Overload
Rhino.Runtime.InteropWrappers Namespace