RhinoCommon API
RhinoDoc.Undo Method
 Undo the last action
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Undo()
Public Function Undo As Boolean
Return Value
Type: Boolean
 true on success
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
RhinoDoc Class
Rhino Namespace