RhinoCommon API
RenderWindow.GetBitmap Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.GetBitmap"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Bitmap GetBitmap()
Public Function GetBitmap As Bitmap
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.GetBitmap"]
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
RenderWindow Class
Rhino.Render Namespace