RhinoCommon API
RenderContentType.Dispose Method
Releases all resources used by the RenderContentType
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.11
See Also
Reference
RenderContentType Class
Dispose Overload
Rhino.Render Namespace