RhinoCommon API
ObjectTable.AddRectangle Method (Rectangle3d)
 Adds a rectangle to the object table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddRectangle(
	Rectangle3d rectangle
)
Public Function AddRectangle (
	rectangle As Rectangle3d
) As Guid
Parameters
rectangle
Type: Rhino.Geometry.Rectangle3d
The rectangle.
Return Value
Type: Guid
The ID.
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
ObjectTable Class
AddRectangle Overload
Rhino.DocObjects.Tables Namespace