RhinoCommon SDK
BinaryArchiveWriter.WritePlane Method
 Writes a Plane value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WritePlane(
	Plane value
)
Public Sub WritePlane (
	value As Plane
)
Parameters
value
Type: Rhino.Geometry.Plane
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace