RhinoCommon API
SupportOptions.SetAutoSaveKeepAmount Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetAutoSaveKeepAmount(System.Int32)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetAutoSaveKeepAmount(
	int value
)
Public Shared Sub SetAutoSaveKeepAmount (
	value As Integer
)
Parameters
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.Render.SupportOptions.SetAutoSaveKeepAmount(System.Int32)"]
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
SupportOptions Class
Rhino.Render Namespace