RhinoCommon SDK
MeshFaceList.GetTopologicalVertices Method
 Gets the topology vertex indices of a face.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] GetTopologicalVertices(
	int faceIndex
)
Public Function GetTopologicalVertices (
	faceIndex As Integer
) As Integer()
Parameters
faceIndex
Type: System.Int32
A face index.
Return Value
Type: Int32[]
An array of integers.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace