RhinoCommon API
SHA1OpenNURBS.Initialize Method
 Resets this instance of the algorithm, so that it can be used again. It is not required to call this method after creation.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override void Initialize()
Public Overrides Sub Initialize
Version Information
Rhino for Windows
Supported in: 6.12
See Also
Reference
SHA1OpenNURBS Class
Rhino.FileIO Namespace