RhinoCommon SDK
Panels.IsPanelVisible Method (Type, Boolean)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsPanelVisible(
	Type panelType,
	bool isSelectedTab
)
Public Shared Function IsPanelVisible (
	panelType As Type,
	isSelectedTab As Boolean
) As Boolean
Parameters
panelType
Type: System.Type
 Type of panel to check for, this type must include a GUID attribute.
isSelectedTab
Type: System.Boolean
 Class Id for the panel to check.
Return Value
Type: Boolean
 Returns true if panelType is non null and the tab is visible otherwise it returns false.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Panels Class
IsPanelVisible Overload
Rhino.UI Namespace