RhinoCommon SDK
RhinoObject.MeshObjects Method (IEnumerable<RhinoObject>, MeshingParameters, Int32, Transform, Mesh[], ObjectAttributes[])
Mesh Rhino Objects
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Result MeshObjects(
	IEnumerable<RhinoObject> rhinoObjects,
	ref MeshingParameters parameters,
	ref int uiStyle,
	Transform xform,
	out Mesh[] meshes,
	out ObjectAttributes[] attributes
)
Public Shared Function MeshObjects (
	rhinoObjects As IEnumerable(Of RhinoObject),
	ByRef parameters As MeshingParameters,
	ByRef uiStyle As Integer,
	xform As Transform,
	<OutAttribute> ByRef meshes As Mesh(),
	<OutAttribute> ByRef attributes As ObjectAttributes()
) As Result
Parameters
rhinoObjects
Type: System.Collections.Generic.IEnumerable<RhinoObject>
Objects to mesh
parameters
Type: Rhino.Geometry.MeshingParameters
The parameters used to create the meshes
uiStyle
Type: System.Int32
0 = simple dialog, 1 = details dialog, 2 = script or batch mode
xform
Type: Rhino.Geometry.Transform
transform to be used for export with origin, or Z to Y up, etc.
meshes
Type: Rhino.Geometry.Mesh[]
[Missing <param name="meshes"/> documentation for "M:Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Int32@,Rhino.Geometry.Transform,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes[]
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Int32@,Rhino.Geometry.Transform,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Int32@,Rhino.Geometry.Transform,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)"]
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
RhinoObject Class
MeshObjects Overload
Rhino.DocObjects Namespace