RhinoCommon SDK
Unroller Constructor (Surface)
 Initializes a new instance of the Unroller class with surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Unroller(
	Surface surface
)
Public Sub New (
	surface As Surface
)
Parameters
surface
Type: Rhino.Geometry.Surface
A surface to be unrolled.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Unroller Class
Unroller Overload
Rhino.Geometry Namespace