RhinoCommon API
RhinoApp.ClearCommandHistoryWindow Method
 Clear the text in Rhino's command history window.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void ClearCommandHistoryWindow()
Public Shared Sub ClearCommandHistoryWindow
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
RhinoApp Class
Rhino Namespace