RhinoCommon API
GeometryBase.Scale Method
 Scales the object by the specified factor. The scale is centered at the origin.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Scale(
	double scaleFactor
)
Public Function Scale (
	scaleFactor As Double
) As Boolean
Parameters
scaleFactor
Type: System.Double
The uniform scaling factor.
Return Value
Type: Boolean
true if geometry successfully scaled.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace