RhinoCommon SDK
PreviewGeometry Constructor
 Constructor for PreviewGeometry
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PreviewGeometry(
	IntPtr pPreviewGeometry
)
Public Sub New (
	pPreviewGeometry As IntPtr
)
Parameters
pPreviewGeometry
Type: System.IntPtr
[Missing <param name="pPreviewGeometry"/> documentation for "M:Rhino.Render.PreviewGeometry.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PreviewGeometry Class
Rhino.Render Namespace