RhinoCommon API
GetBaseClass.ClearDefault Method
 Clears any defaults set using SetDefaultPoint, SetDefaultNumber, SetDefaultString, or SetCommandPromptDefault.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearDefault()
Public Sub ClearDefault
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace