RhinoCommon SDK
ColorHSV.CreateFromLAB Method
 Create the nearest HSV equivalent of a LAB color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorHSV CreateFromLAB(
	ColorLAB lab
)
Public Shared Function CreateFromLAB (
	lab As ColorLAB
) As ColorHSV
Parameters
lab
Type: Rhino.Display.ColorLAB
Target color in LAB space.
Return Value
Type: ColorHSV
The HSV equivalent of the LAB color.
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace