RhinoCommon SDK
SerializationOptions Constructor
 Initializes a new instance of the SerializationOptions class.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SerializationOptions()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SerializationOptions Class
Rhino.FileIO Namespace