RhinoCommon SDK
ColorCMYK.CreateFromHSV Method
 Constructs the nearest CMYK equivalent of an HSV color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorCMYK CreateFromHSV(
	ColorHSV hsv
)
Public Shared Function CreateFromHSV (
	hsv As ColorHSV
) As ColorCMYK
Parameters
hsv
Type: Rhino.Display.ColorHSV
Target color in HSV space.
Return Value
Type: ColorCMYK
The CMYK equivalent of the HSV color.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace