RhinoCommon API
BezierCurve.IncreaseDegree Method
Increase degree of bezier
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncreaseDegree(
	int desiredDegree
)
Public Function IncreaseDegree (
	desiredDegree As Integer
) As Boolean
Parameters
desiredDegree
Type: System.Int32
Return Value
Type: Boolean
true if successful. false if desiredDegree < current degree.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace