RhinoCommon SDK
Thumbnail.Dispose Method
 Dispose for Thumbnail
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace