RhinoCommon API
RhinoApp.InvokeAndWait Method
 Work-In-Progess. Testing this with our unit test framework
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void InvokeAndWait(
	Action action
)
Public Shared Sub InvokeAndWait (
	action As Action
)
Parameters
action
Type: System.Action
[Missing <param name="action"/> documentation for "M:Rhino.RhinoApp.InvokeAndWait(System.Action)"]
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
RhinoApp Class
Rhino Namespace