RhinoCommon SDK
StackedDialogPage Constructor
 Protected constructor
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected StackedDialogPage(
	string englishPageTitle
)
Protected Sub New (
	englishPageTitle As String
)
Parameters
englishPageTitle
Type: System.String
[Missing <param name="englishPageTitle"/> documentation for "M:Rhino.UI.StackedDialogPage.#ctor(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace