RhinoCommon API
IRhinoUiDialogService.ShowLineTypes Method
[Missing <summary> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Object ShowLineTypes(
	string title,
	string message,
	RhinoDoc doc
)
Function ShowLineTypes (
	title As String,
	message As String,
	doc As RhinoDoc
) As Object
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)"]
Version Information
Rhino for Windows
Supported in: 6.15
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace