RhinoCommon API
File3dmObjectTable.GetEnumerator Method
 Returns an enumerator that yields all objects in this document. Like in Rhino, this includes lights. Unlike in Rhino, however, all lights are returned in the end of the list.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<File3dmObject> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of File3dmObject)
Return Value
Type: IEnumerator<File3dmObject>
An enumerator that yields all objects in a document.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace