RhinoCommon API
Extrusion.GetWireframe Method
 Constructs all the Wireframe curves for this Extrusion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] GetWireframe()
Public Function GetWireframe As Curve()
Return Value
Type: Curve[]
An array of Wireframe curves.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace