RhinoCommon SDK
MeshVertexStatusList.GetEnumerator Method
 Gets an enumerator that yields all flags in this collection.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<bool> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Boolean)
Return Value
Type: IEnumerator<Boolean>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
MeshVertexStatusList Class
Rhino.Geometry.Collections Namespace