RhinoCommon API
RenderContentCollection.GetSearchPattern Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.GetSearchPattern"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetSearchPattern()
Public Function GetSearchPattern As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.RenderContentCollection.GetSearchPattern"]
Version Information
Rhino for Windows
Supported in: 6.20
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace