RhinoCommon SDK
AnnotationBase Constructor
 Protected constructor for internal use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected AnnotationBase()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AnnotationBase Class
AnnotationBase Overload
Rhino.Geometry Namespace