RhinoCommon API
GeometryBase.MemoryEstimate Method
 Computes an estimate of the number of bytes that this object is using in memory.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint MemoryEstimate()
Public Function MemoryEstimate As UInteger
Return Value
Type: UInt32
An estimated memory footprint.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace