RhinoCommon SDK
DisplayPipeline.PopModelTransform Method
 Pop a model transformation off the engine's model transform stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PopModelTransform()
Public Sub PopModelTransform
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace