RhinoCommon API
RhinoViewport.ClearTraceImage Method
 Remove trace image (background bitmap) for this viewport if one exists.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearTraceImage()
Public Sub ClearTraceImage
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace