RhinoCommon SDK
Centermark Constructor
Initializes a new instance of the Centermark class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Centermark()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
Centermark Class
Centermark Overload
Rhino.Geometry Namespace