RhinoCommon API
HostUtils.RegisterNamedCallback Method
 Register a named callback from C++ -> .NET
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void RegisterNamedCallback(
	string name,
	EventHandler<NamedParametersEventArgs> callback
)
Public Shared Sub RegisterNamedCallback (
	name As String,
	callback As EventHandler(Of NamedParametersEventArgs)
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.HostUtils.RegisterNamedCallback(System.String,System.EventHandler{Rhino.Runtime.NamedParametersEventArgs})"]
callback
Type: System.EventHandler<NamedParametersEventArgs>
[Missing <param name="callback"/> documentation for "M:Rhino.Runtime.HostUtils.RegisterNamedCallback(System.String,System.EventHandler{Rhino.Runtime.NamedParametersEventArgs})"]
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace