RhinoCommon API
CurvatureAnalysisSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static CurvatureAnalysisSettingsState GetCurrentState()
Public Shared Function GetCurrentState As CurvatureAnalysisSettingsState
Return Value
Type: CurvatureAnalysisSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.CurvatureAnalysisSettings.GetCurrentState"]
Version Information
Rhino for Windows
Supported in: 6.7
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace