RhinoCommon SDK
ObjectAttributes.Transform Method
 Apply a transformation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
The transformation.
Return Value
Type: Boolean
trueif successful, false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace