RhinoCommon API
UserInterfaceSection.GetContentList Method
 Returns a list of currently selected content items to be edited.
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent[] GetContentList()
Public Function GetContentList As RenderContent()
Return Value
Type: RenderContent[]
Returns a list of currently selected content items to be edited.
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
UserInterfaceSection Class
Rhino.Render.UI Namespace