RhinoCommon SDK
FileReadOptions.Dispose Method (Boolean)
Releases the unmanaged resources used by the FileReadOptions and optionally releases the managed resources
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
FileReadOptions Class
Dispose Overload
Rhino.FileIO Namespace