RhinoCommon API
Brep.JoinNakedEdges Method
 Joins naked edge pairs within the same brep that overlap within tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int JoinNakedEdges(
	double tolerance
)
Public Function JoinNakedEdges (
	tolerance As Double
) As Integer
Parameters
tolerance
Type: System.Double
The tolerance value.
Return Value
Type: Int32
number of joins made.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
Brep Class
Rhino.Geometry Namespace