RhinoCommon SDK
Color4f.GetHashCode Method
[Missing <summary> documentation for "M:Rhino.Display.Color4f.GetHashCode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Display.Color4f.GetHashCode"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Color4f Structure
Rhino.Display Namespace