RhinoCommon API
ViewportInfo.SetFrustumNearFar Method (BoundingBox)
 Sets the frustum near and far using a bounding box.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetFrustumNearFar(
	BoundingBox boundingBox
)
Public Function SetFrustumNearFar (
	boundingBox As BoundingBox
) As Boolean
Parameters
boundingBox
Type: Rhino.Geometry.BoundingBox
A bounding box to use.
Return Value
Type: Boolean
true if operation succeeded; otherwise, false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
ViewportInfo Class
SetFrustumNearFar Overload
Rhino.DocObjects Namespace