RhinoCommon API
DisplayPipeline.DrawBoxCorners Method (BoundingBox, Color, Double)
 Draws corner widgets of a world aligned boundingbox.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawBoxCorners(
	BoundingBox box,
	Color color,
	double size
)
Public Sub DrawBoxCorners (
	box As BoundingBox,
	color As Color,
	size As Double
)
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to draw.
color
Type: System.Drawing.Color
Color to draw with.
size
Type: System.Double
Size (in model units) of the corner widgets.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
DisplayPipeline Class
DrawBoxCorners Overload
Rhino.Display Namespace