RhinoCommon SDK
SimulatedEnvironment.ConstPointer Method
[Missing <summary> documentation for "M:Rhino.Render.SimulatedEnvironment.ConstPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Render.SimulatedEnvironment.ConstPointer"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SimulatedEnvironment Class
Rhino.Render Namespace