RhinoCommon API
Transform.DecomposeAffine Method (Vector3d, Transform)
 Decomposes an affine transformation. An affine transformation can be broken into a linear transformation and a translation. Note, a perspective transformation is not affine.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DecomposeAffine(
	out Vector3d translation,
	out Transform linear
)
Public Function DecomposeAffine (
	<OutAttribute> ByRef translation As Vector3d,
	<OutAttribute> ByRef linear As Transform
) As Boolean
Parameters
translation
Type: Rhino.Geometry.Vector3d
Translation vector.
linear
Type: Rhino.Geometry.Transform
Linear transformation.
Return Value
Type: Boolean
True if successful decomposition.
Remarks
 If X.DecomposeAffine(T, L) is true then X == Translation(T)*L. DecomposeAffine(T,L) succeeds for all affine transformations and is a simple copying of values.
Version Information
Rhino for Windows
Supported in: 6.20
See Also
Reference
Transform Structure
DecomposeAffine Overload
Rhino.Geometry Namespace