RhinoCommon API
NurbsCurvePointList.ControlPolygon Method
 Constructs a polyline through all the control points. Note that periodic curves generate a closed polyline with fewer points than control-points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Polyline ControlPolygon()
Public Function ControlPolygon As Polyline
Return Value
Type: Polyline
A polyline connecting all control points.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace