RhinoCommon SDK
DimStyleTable.Delete Method (DimensionStyle)
 Removes an annotation style.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Delete(
	DimensionStyle item
)
Public Overrides Function Delete (
	item As DimensionStyle
) As Boolean
Parameters
item
Type: Rhino.DocObjects.DimensionStyle
The item to remove.
Return Value
Type: Boolean
True if the item was removed; false otherwise.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimStyleTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace