RhinoCommon API
Surface.InterpolatedCurveOnSurfaceUV Method
 Constructs an interpolated curve on a surface, using 2D surface points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurve InterpolatedCurveOnSurfaceUV(
	IEnumerable<Point2d> points,
	double tolerance
)
Public Function InterpolatedCurveOnSurfaceUV (
	points As IEnumerable(Of Point2d),
	tolerance As Double
) As NurbsCurve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point2d>
A list, an array or any enumerable set of 2D points.
tolerance
Type: System.Double
A tolerance value.
Return Value
Type: NurbsCurve
A new nurbs curve, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
Surface Class
Rhino.Geometry Namespace