RhinoCommon SDK
RenderPrimitiveList.PrimitiveType Method
 Type of primitive object at this index.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderPrimitiveType PrimitiveType(
	int index
)
Public Function PrimitiveType (
	index As Integer
) As RenderPrimitiveType
Parameters
index
Type: System.Int32
 The zero based index of the item in the list. Valid values are greater than or equal to 0 and less than Count.
Return Value
Type: RenderPrimitiveType
 Primitive type of the item at this index.
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace