RhinoCommon API
MeshVertexNormalList.Clear Method
 Clears the vertex normal collection on the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace