RhinoCommon SDK
Dialogs.ShowComboListBox Method
 Displays Rhino's combo list box.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Object ShowComboListBox(
	string title,
	string message,
	IList items
)
Public Shared Function ShowComboListBox (
	title As String,
	message As String,
	items As IList
) As Object
Parameters
title
Type: System.String
The dialog title.
message
Type: System.String
The dialog message.
items
Type: System.Collections.IList
A list of items to show.
Return Value
Type: Object
selected item.
null if the user canceled.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
Dialogs Class
Rhino.UI Namespace