RhinoCommon API
InstanceDefinition.UsesDefinition Method
 Determines if this instance definition contains a reference to another instance definition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int UsesDefinition(
	int otherIdefIndex
)
Public Function UsesDefinition (
	otherIdefIndex As Integer
) As Integer
Parameters
otherIdefIndex
Type: System.Int32
index of another instance definition.
Return Value
Type: Int32
 0 no 1 other_idef_index is the index of this instance definition >1 This InstanceDefinition uses the instance definition and the returned value is the nesting depth.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace