RhinoCommon API
Vector3f.Subtraction Operator
 Subtracts the second vector from the first one.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3f operator -(
	Vector3f vector1,
	Vector3f vector2
)
Public Shared Operator - (
	vector1 As Vector3f,
	vector2 As Vector3f
) As Vector3f
Parameters
vector1
Type: Rhino.Geometry.Vector3f
A vector.
vector2
Type: Rhino.Geometry.Vector3f
A second vector.
Return Value
Type: Vector3f
A new vector that results from the componentwise difference of vector1 - vector2.
Version Information
Rhino for Windows
Supported in: 6.11
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace