RhinoCommon API
Surface.IsCylinder Method (Double)
Determines if the surface is a portion of a cylinder within a given tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCylinder(
	double tolerance
)
Public Function IsCylinder (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a cylinder.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
Surface Class
IsCylinder Overload
Rhino.Geometry Namespace