RhinoCommon API
PythonScript.ContainsVariable Method
 Determines if the main scripting context has a variable with a name.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool ContainsVariable(
	string name
)
Public MustOverride Function ContainsVariable (
	name As String
) As Boolean
Parameters
name
Type: System.String
The variable name.
Return Value
Type: Boolean
true if the variable is present.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace