RhinoCommon API
IRhRdkThumbnailList.ShowLabels Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.ShowLabels"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool ShowLabels()
Function ShowLabels As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.ShowLabels"]
Version Information
Rhino for Windows
Supported in: 6.12
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace