RhinoCommon API
LicenseUtils.LicenseOptionsHandler Method (Guid, String, Boolean)
[Missing <summary> documentation for "M:Rhino.PlugIns.LicenseUtils.LicenseOptionsHandler(System.Guid,System.String,System.Boolean)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool LicenseOptionsHandler(
	Guid productId,
	string productTitle,
	bool bStandalone
)
Public Shared Function LicenseOptionsHandler (
	productId As Guid,
	productTitle As String,
	bStandalone As Boolean
) As Boolean
Parameters
productId
Type: System.Guid
[Missing <param name="productId"/> documentation for "M:Rhino.PlugIns.LicenseUtils.LicenseOptionsHandler(System.Guid,System.String,System.Boolean)"]
productTitle
Type: System.String
[Missing <param name="productTitle"/> documentation for "M:Rhino.PlugIns.LicenseUtils.LicenseOptionsHandler(System.Guid,System.String,System.Boolean)"]
bStandalone
Type: System.Boolean
[Missing <param name="bStandalone"/> documentation for "M:Rhino.PlugIns.LicenseUtils.LicenseOptionsHandler(System.Guid,System.String,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.LicenseOptionsHandler(System.Guid,System.String,System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
LicenseUtils Class
LicenseOptionsHandler Overload
Rhino.PlugIns Namespace