RhinoCommon SDK
BinaryArchiveWriter.WriteBool Method
 Writes a Boolean value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteBool(
	bool value
)
Public Sub WriteBool (
	value As Boolean
)
Parameters
value
Type: System.Boolean
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace