RhinoCommon API
MeshVertexColorList.Destroy Method
 Releases all memory allocated to store vertex colors. The list capacity will be 0 after this call.
Subsequent calls can add new items.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Destroy()
Public Sub Destroy
Version Information
Rhino for Windows
Supported in: 6.6
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace