RhinoCommon API
Polyline.SegmentAt Method
 Gets the line segment at the given index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line SegmentAt(
	int index
)
Public Function SegmentAt (
	index As Integer
) As Line
Parameters
index
Type: System.Int32
Index of segment to retrieve.
Return Value
Type: Line
Line segment at index or Line.Unset on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
Polyline Class
Rhino.Geometry Namespace