RhinoCommon API
Brep.CreateFromSurface Method
 Constructs a Brep from a surface. The resulting Brep has an outer boundary made from four trims. The trims are ordered so that they run along the south, east, north, and then west side of the surface's parameter space.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Brep CreateFromSurface(
	Surface surface
)
Public Shared Function CreateFromSurface (
	surface As Surface
) As Brep
Parameters
surface
Type: Rhino.Geometry.Surface
A surface to convert.
Return Value
Type: Brep
Resulting brep or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
Brep Class
Rhino.Geometry Namespace