RhinoCommon API
NurbsSurface.CreateFromCylinder Method
 Constructs a new NURBS surfaces from cylinder data.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static NurbsSurface CreateFromCylinder(
	Cylinder cylinder
)
Public Shared Function CreateFromCylinder (
	cylinder As Cylinder
) As NurbsSurface
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
A cylinder value.
Return Value
Type: NurbsSurface
A new NURBS surface, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace