RhinoCommon SDK
TransformCommand.SelectObjects Method (String, TransformObjectList)
 Selects objects within the command.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Result SelectObjects(
	string prompt,
	TransformObjectList list
)
Protected Function SelectObjects (
	prompt As String,
	list As TransformObjectList
) As Result
Parameters
prompt
Type: System.String
The selection prompt.
list
Type: Rhino.Collections.TransformObjectList
A list of objects to transform. This is a special list type.
Return Value
Type: Result
The operation result.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TransformCommand Class
SelectObjects Overload
Rhino.Commands Namespace