RhinoCommon SDK
CustomPointObject Constructor
Initializes a new instance of the CustomPointObject class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomPointObject()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomPointObject Class
CustomPointObject Overload
Rhino.DocObjects.Custom Namespace