RhinoCommon API
Polyline.ReduceSegments Method
 Constructs a reduction of this polyline by recursively removing the least significant segments.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ReduceSegments(
	double tolerance
)
Public Function ReduceSegments (
	tolerance As Double
) As Integer
Parameters
tolerance
Type: System.Double
Tolerance for reduction. Whenever a vertex of the polyline is more significant than tolerance, it will be included in the reduction.
Return Value
Type: Int32
The number of vertices that disappeared due to reduction.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
Polyline Class
Rhino.Geometry Namespace