RhinoCommon SDK
Brep.CreateFromCone Method
 Constructs a Brep representation of the cone with a single face for the cone, an edge along the cone seam, and vertices at the base and apex ends of this seam edge. The optional cap is a single face with one circular edge starting and ending at the base vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Brep CreateFromCone(
	Cone cone,
	bool capBottom
)
Public Shared Function CreateFromCone (
	cone As Cone,
	capBottom As Boolean
) As Brep
Parameters
cone
Type: Rhino.Geometry.Cone
A cone value.
capBottom
Type: System.Boolean
if true the base of the cone should be capped.
Return Value
Type: Brep
A Brep if successful, null on error.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Brep Class
Rhino.Geometry Namespace