RhinoCommon API
NamedViewTable.Delete Method (String)
Remove named view from the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Delete(
	string name
)
Public Function Delete (
	name As String
) As Boolean
Parameters
name
Type: System.String
name of the view.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
NamedViewTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace