RhinoCommon SDK
Polyline Constructor
 Initializes a new empty polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Polyline()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
Polyline Class
Polyline Overload
Rhino.Geometry Namespace