RhinoCommon SDK
GetPoint.EnableSnapToCurves Method
 If you want GetPoint() to try to snap to curves when the mouse is near a curve (like the center point in the Circle command when the AroundCurve option is on), then enable the snap to curves option.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableSnapToCurves(
	bool enable
)
Public Sub EnableSnapToCurves (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
Whether points should be enabled.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace