RhinoCommon API
CustomObjectGrips.Dragging Method
 Determines if grips are currently being dragged.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool Dragging()
Public Shared Function Dragging As Boolean
Return Value
Type: Boolean
true if grips are dragged.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace