RhinoCommon API
File3dmObjectTable.AddExtrusion Method (Extrusion)
Adds an extrusion object to Rhino.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddExtrusion(
	Extrusion extrusion
)
Public Function AddExtrusion (
	extrusion As Extrusion
) As Guid
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
A duplicate of this extrusion is added to Rhino.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
File3dmObjectTable Class
AddExtrusion Overload
Rhino.FileIO Namespace