RhinoCommon API
File3dmObjectTable.AddBrep Method (Brep)
Adds a brep object to Rhino.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddBrep(
	Brep brep
)
Public Function AddBrep (
	brep As Brep
) As Guid
Parameters
brep
Type: Rhino.Geometry.Brep
A duplicate of this brep is added to Rhino.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
File3dmObjectTable Class
AddBrep Overload
Rhino.FileIO Namespace