RhinoCommon API
GetBaseClass.CustomMessage Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.CustomMessage"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Object CustomMessage()
Public Function CustomMessage As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetBaseClass.CustomMessage"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace