RhinoCommon SDK
DisplayPipeline.Draw3dText Method (Text3d, Color, Plane)
 Draws 3d text with a different plane than what is defined in the Text3d class.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Draw3dText(
	Text3d text,
	Color color,
	Plane textPlane
)
Public Sub Draw3dText (
	text As Text3d,
	color As Color,
	textPlane As Plane
)
Parameters
text
Type: Rhino.Display.Text3d
The string to draw.
color
Type: System.Drawing.Color
Text color.
textPlane
Type: Rhino.Geometry.Plane
The plane for the text object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
Draw3dText Overload
Rhino.Display Namespace