RhinoCommon API
ContentFactory.ContentTypeId Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.ContentFactory.ContentTypeId"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ContentTypeId()
Public Function ContentTypeId As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.DataSources.ContentFactory.ContentTypeId"]
Version Information
Rhino for Windows
Supported in: 6.10
See Also
Reference
ContentFactory Class
Rhino.Render.DataSources Namespace