RhinoCommon API
Surface.PointAt Method
 Evaluates a point at a given parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointAt(
	double u,
	double v
)
Public Function PointAt (
	u As Double,
	v As Double
) As Point3d
Parameters
u
Type: System.Double
evaluation parameters.
v
Type: System.Double
evaluation parameters.
Return Value
Type: Point3d
Point3d.Unset on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
Surface Class
Rhino.Geometry Namespace