RhinoCommon SDK
BinaryArchiveReader.ReadLine Method
 Reads a Line from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line ReadLine()
Public Function ReadLine As Line
Return Value
Type: Line
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace