RhinoCommon API
Material.SetEnvironmentTexture Method (Texture)
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetEnvironmentTexture(Rhino.DocObjects.Texture)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetEnvironmentTexture(
	Texture texture
)
Public Function SetEnvironmentTexture (
	texture As Texture
) As Boolean
Parameters
texture
Type: Rhino.DocObjects.Texture
[Missing <param name="texture"/> documentation for "M:Rhino.DocObjects.Material.SetEnvironmentTexture(Rhino.DocObjects.Texture)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetEnvironmentTexture(Rhino.DocObjects.Texture)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
Material Class
SetEnvironmentTexture Overload
Rhino.DocObjects Namespace