RhinoCommon SDK
GripObject.GetCurveParameters Method
 Retrieves the 2d parameter space values of this GripObject from the curve it's associated with.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetCurveParameters(
	out double t
)
Public Function GetCurveParameters (
	<OutAttribute> ByRef t As Double
) As Boolean
Parameters
t
Type: System.Double
[Missing <param name="t"/> documentation for "M:Rhino.DocObjects.GripObject.GetCurveParameters(System.Double@)"]
Return Value
Type: Boolean
True on success. Output is unreliable if return is false.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace