RhinoCommon SDK
StatusBar.SetDistancePane Method
 Sets the distance pane to a distance value.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetDistancePane(
	double distance
)
Public Shared Sub SetDistancePane (
	distance As Double
)
Parameters
distance
Type: System.Double
The distance value.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
StatusBar Class
Rhino.UI Namespace