RhinoCommon API
BinaryArchiveReader.ReadObjRef Method
 Reads a ObjRef from the archive
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjRef ReadObjRef()
Public Function ReadObjRef As ObjRef
Return Value
Type: ObjRef
the element that was read
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace