RhinoCommon SDK
DisplayPipeline.PushModelTransform Method
 Push a model transformation on the engine's model transform stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PushModelTransform(
	Transform xform
)
Public Sub PushModelTransform (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to push.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace