RhinoCommon API
ClassArrayOnObjRef Constructor (IEnumerable<ObjRef>)
 Initializes a new instances from a set of ObjRefs
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ClassArrayOnObjRef(
	IEnumerable<ObjRef> objrefs
)
Public Sub New (
	objrefs As IEnumerable(Of ObjRef)
)
Parameters
objrefs
Type: System.Collections.Generic.IEnumerable<ObjRef>
An array, a list or any enumerable set of Rhino object references.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
ClassArrayOnObjRef Class
ClassArrayOnObjRef Overload
Rhino.Runtime.InteropWrappers Namespace