RhinoCommon SDK
BrepEdge.AdjacentFaces Method
 Gets the indices of all the BrepFaces that use this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] AdjacentFaces()
Public Function AdjacentFaces As Integer()
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.Geometry.BrepEdge.AdjacentFaces"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace