RhinoCommon API
UserDataList.Contains Method
 Checks for the existence of a specific type of userdata in this list Both .NET and native userdata is checked
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Contains(
	Guid userdataId
)
Public Function Contains (
	userdataId As Guid
) As Boolean
Parameters
userdataId
Type: System.Guid
[Missing <param name="userdataId"/> documentation for "M:Rhino.DocObjects.Custom.UserDataList.Contains(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Custom.UserDataList.Contains(System.Guid)"]
Version Information
Rhino for Windows
Supported in: 6.15
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace