RhinoCommon API
BinaryArchiveReader.ReadVector2d Method
 Reads a Vector2d from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector2d ReadVector2d()
Public Function ReadVector2d As Vector2d
Return Value
Type: Vector2d
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace