RhinoCommon SDK
RhinoSettings.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.Finalize"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace