RhinoCommon SDK
Ray3d.Equals Method (Ray3d)
 Determines whether the specified Ray3d has the same value as the present ray.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	Ray3d ray
)
Public Function Equals (
	ray As Ray3d
) As Boolean
Parameters
ray
Type: Rhino.Geometry.Ray3d
The specified ray.
Return Value
Type: Boolean
true if ray has the same position and direction as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Ray3d Structure
Equals Overload
Rhino.Geometry Namespace