RhinoCommon SDK
RenderTexture.GetPreviewIn3D Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetPreviewIn3D"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool GetPreviewIn3D()
Public Overridable Function GetPreviewIn3D As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetPreviewIn3D"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderTexture Class
Rhino.Render Namespace