RhinoCommon API
RhinoObject.EnableCustomGrips Method
Turns on/off the object's editing grips.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EnableCustomGrips(
	CustomObjectGrips customGrips
)
Public Function EnableCustomGrips (
	customGrips As CustomObjectGrips
) As Boolean
Parameters
customGrips
Type: Rhino.DocObjects.Custom.CustomObjectGrips
The custom object grips.
Return Value
Type: Boolean
 true if the call succeeded. If you attempt to add custom grips to an object that does not support custom grips, then false is returned.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace