RhinoCommon API
Point3d.Inequality Operator
 Determines whether two Point3d have different values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator !=(
	Point3d a,
	Point3d b
)
Public Shared Operator <> (
	a As Point3d,
	b As Point3d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point3d
The first point.
b
Type: Rhino.Geometry.Point3d
The second point.
Return Value
Type: Boolean
true if the two points differ in any coordinate; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace