RhinoCommon SDK
BezierCurve.GetControlVertex3d Method
Get location of a control vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d GetControlVertex3d(
	int index
)
Public Function GetControlVertex3d (
	index As Integer
) As Point3d
Parameters
index
Type: System.Int32
 Control vertex index (0 <= index < ControlVertexCount)
Return Value
Type: Point3d
 If the bezier is rational, the euclidean location is returned.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | when index is out of range
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace