RhinoCommon SDK
BinaryArchiveWriter.WriteShort Method
 Writes a Int16 value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteShort(
	short value
)
Public Sub WriteShort (
	value As Short
)
Parameters
value
Type: System.Int16
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace