RhinoCommon API
Dialogs.ShowTextDialog Method
 Display a text dialog similar to the dialog used for the "What" command.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void ShowTextDialog(
	string message,
	string title
)
Public Shared Sub ShowTextDialog (
	message As String,
	title As String
)
Parameters
message
Type: System.String
Text to display as the message content.
title
Type: System.String
Test to display as the form title.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
Dialogs Class
Rhino.UI Namespace