RhinoCommon API
Brep.AddEdgeCurve Method
 Add a 3d curve used by the brep edges
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AddEdgeCurve(
	Curve curve
)
Public Function AddEdgeCurve (
	curve As Curve
) As Integer
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.Geometry.Brep.AddEdgeCurve(Rhino.Geometry.Curve)"]
Return Value
Type: Int32
 Index used to reference this geometry in the edge curve list
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
Brep Class
Rhino.Geometry Namespace