RhinoCommon SDK
SnapShotsClient.ApplicationCategory Method
 Predefined application category
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string ApplicationCategory()
Public Shared Function ApplicationCategory As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.ApplicationCategory"]
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace