RhinoCommon API
Point3dList Constructor (Point3d[])
 Constructs a new point list from values in a point array.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3dList(
	params Point3d[] initialPoints
)
Public Sub New (
	ParamArray initialPoints As Point3d()
)
Parameters
initialPoints
Type: Rhino.Geometry.Point3d[]
Points to add to the list.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Point3dList Class
Point3dList Overload
Rhino.Collections Namespace