RhinoCommon SDK
RenderContent.OnAddUserInterfaceSections Method
 Override to provide UI sections to display in the editor.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnAddUserInterfaceSections()
Protected Overridable Sub OnAddUserInterfaceSections
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderContent Class
Rhino.Render Namespace