RhinoCommon SDK
RealtimeDisplayMode.ComputeViewportCrc Method
 Compute viewport CRC for the given ViewInfo
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint ComputeViewportCrc(
	ViewInfo view
)
Public Function ComputeViewportCrc (
	view As ViewInfo
) As UInteger
Parameters
view
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="view"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.ComputeViewportCrc(Rhino.DocObjects.ViewInfo)"]
Return Value
Type: UInt32
the CRC for the given view
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace