RhinoCommon API
BrepFace.SetDomain Method
 Sets the surface domain of this face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool SetDomain(
	int direction,
	Interval domain
)
Public Overrides Function SetDomain (
	direction As Integer,
	domain As Interval
) As Boolean
Parameters
direction
Type: System.Int32
Direction of face to set (0 = U, 1 = V).
domain
Type: Rhino.Geometry.Interval
Domain to apply.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace