RhinoCommon SDK
DisplayPipeline.PushClipTesting Method
 Push a ClipTesting flag on the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PushClipTesting(
	bool enable
)
Public Sub PushClipTesting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
ClipTesting flag.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace