RhinoCommon API
GetBaseClass.GetSelectedEnumValue<T> Method
 Returns the selected enum value. Use this in combination with AddOptionEnumList<T>(String, T).
This must be called directly after having called a Get method, and having obtained a Option value.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T GetSelectedEnumValue<T>()
where T : struct, new(), IConvertible
Public Function GetSelectedEnumValue(Of T As {Structure, New, IConvertible}) As T
Type Parameters
T
Return Value
Type: T
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetBaseClass.GetSelectedEnumValue``1"]
Exceptions
Exception | Condition
ArgumentException | Gets thrown if type T is not an enum type.
IndexOutOfRangeException | If 0 >= CurrentListOptionIndex or CurrentListOptionIndex > N where N is the number of enum values.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace