RhinoCommon API
MouseCallback Constructor
Initializes a new instance of the MouseCallback class
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected MouseCallback()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
MouseCallback Class
Rhino.UI Namespace