RhinoCommon SDK
Transform.PlanarProjection Method
 Constructs a projection transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Transform PlanarProjection(
	Plane plane
)
Public Shared Function PlanarProjection (
	plane As Plane
) As Transform
Parameters
plane
Type: Rhino.Geometry.Plane
Plane onto which everything will be perpendicularly projected.
Return Value
Type: Transform
A transformation matrix which projects geometry onto a specified plane.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Transform Structure
Rhino.Geometry Namespace