RhinoCommon API
MeshVertexNormalList.ToFloatArray Method
 Copies all vertex normals to a linear array of float in x,y,z order
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float[] ToFloatArray()
Public Function ToFloatArray As Single()
Return Value
Type: Single[]
The float array.
Version Information
Rhino for Windows
Supported in: 6.8
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace