RhinoCommon SDK
FactoryBase.Get Method
 Override this method to return a new instance of your class for the given ID
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual IntPtr Get(
	Guid id
)
Public Overridable Function Get (
	id As Guid
) As IntPtr
Parameters
id
Type: System.Guid
[Missing <param name="id"/> documentation for "M:Rhino.UI.Controls.FactoryBase.Get(System.Guid)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.Controls.FactoryBase.Get(System.Guid)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FactoryBase Class
Rhino.UI.Controls Namespace