RhinoCommon SDK
ViewTable.Find Method (Guid)
 Finds a view in this document with a given main viewport Id.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoView Find(
	Guid mainViewportId
)
Public Function Find (
	mainViewportId As Guid
) As RhinoView
Parameters
mainViewportId
Type: System.Guid
The ID of the main viewport looked for.
Return Value
Type: RhinoView
View on success. null if the view could not be found in this document.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
ViewTable Class
Find Overload
Rhino.DocObjects.Tables Namespace