RhinoCommon API
PythonCompiledCode.Execute Method
 Executes the script in a specific scope.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract void Execute(
	PythonScript scope
)
Public MustOverride Sub Execute (
	scope As PythonScript
)
Parameters
scope
Type: Rhino.Runtime.PythonScript
The scope where the script should be executed.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
PythonCompiledCode Class
Rhino.Runtime Namespace