RhinoCommon SDK
RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs Constructor
Initializes a new instance of the RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipelineSettingsChangedEventArgs(
	DisplayPipelineAttributes dpa
)
Public Sub New (
	dpa As DisplayPipelineAttributes
)
Parameters
dpa
Type: Rhino.Display.DisplayPipelineAttributes
[Missing <param name="dpa"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs.#ctor(Rhino.Display.DisplayPipelineAttributes)"]
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs Class
Rhino.Render Namespace