RhinoCommon SDK
Point3dList.Transform Method
 Applies a transform to all the points in the list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Transform(
	Transform xform
)
Public Sub Transform (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
Transform to apply.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point3dList Class
Rhino.Collections Namespace