RhinoCommon SDK
GumballObject.SetFromEllipse Method
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromEllipse(Rhino.Geometry.Ellipse)"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetFromEllipse(
	Ellipse ellipse
)
Public Function SetFromEllipse (
	ellipse As Ellipse
) As Boolean
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
[Missing <param name="ellipse"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromEllipse(Rhino.Geometry.Ellipse)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromEllipse(Rhino.Geometry.Ellipse)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace