RhinoCommon SDK
Plane.GetHashCode Method
 Gets a non-unique hashing code for this entity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A particular number for a specific instance of plane.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Plane Structure
Rhino.Geometry Namespace