RhinoCommon API
GetInteger Constructor
Initializes a new instance of the GetInteger class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetInteger()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
GetInteger Class
Rhino.Input.Custom Namespace