RhinoCommon SDK
Cylinder.LineAt Method
 Compute the line at the given angle parameter. This line will be degenerate if the cylinder is infite.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line LineAt(
	double angularParameter
)
Public Function LineAt (
	angularParameter As Double
) As Line
Parameters
angularParameter
Type: System.Double
Angle parameter for line section.
Return Value
Type: Line
[Missing <returns> documentation for "M:Rhino.Geometry.Cylinder.LineAt(System.Double)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace