RhinoCommon API
Vector2f.Equals Method (Vector2f)
 Determines whether the specified vector has the same values as the present vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	Vector2f vector
)
Public Function Equals (
	vector As Vector2f
) As Boolean
Parameters
vector
Type: Rhino.Geometry.Vector2f
The specified vector.
Return Value
Type: Boolean
true if obj is Vector2f and has the same coordinates as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
Vector2f Structure
Equals Overload
Rhino.Geometry Namespace