RhinoCommon SDK
MeshFaceList.GetEnumerator Method
 Gets an enumerator that yields all faces in this collection.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<MeshFace> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of MeshFace)
Return Value
Type: IEnumerator<MeshFace>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace