RhinoCommon API
SupportOptions.EnablePreviewJobLog Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.EnablePreviewJobLog"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool EnablePreviewJobLog()
Public Shared Function EnablePreviewJobLog As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.EnablePreviewJobLog"]
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
SupportOptions Class
Rhino.Render Namespace