RhinoCommon SDK
FilePdf.FirePreWriteEvent Method
 Called by the framework to fire a PreWrite event
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected void FirePreWriteEvent()
Protected Sub FirePreWriteEvent
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace