RhinoCommon SDK
MeshVertexColorList.Clear Method
 Clears the vertex color list on the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace