RhinoCommon SDK
RTree.CreatePointCloudTree Method
 Constructs a new tree with an element for each pointcloud point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RTree CreatePointCloudTree(
	PointCloud cloud
)
Public Shared Function CreatePointCloudTree (
	cloud As PointCloud
) As RTree
Parameters
cloud
Type: Rhino.Geometry.PointCloud
A pointcloud.
Return Value
Type: RTree
A new tree, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
RTree Class
Rhino.Geometry Namespace