RhinoCommon API
MeshExtruder.GetWallFaces Method
 Return list of faces that were added to connect transformed edges/faces to non-transformed edges/faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public List<int> GetWallFaces()
Public Function GetWallFaces As List(Of Integer)
Return Value
Type: List<Int32>
List of wall faces
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace