RhinoCommon SDK
DisplayConduit.PreDrawObject Method
 Called before every object in the scene is drawn.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void PreDrawObject(
	DrawObjectEventArgs e
)
Protected Overridable Sub PreDrawObject (
	e As DrawObjectEventArgs
)
Parameters
e
Type: Rhino.Display.DrawObjectEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.Display.DisplayConduit.PreDrawObject(Rhino.Display.DrawObjectEventArgs)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace