RhinoCommon SDK
GetBaseClass.Result Method
Returns result of the Get*() call.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetResult Result()
Public Function Result As GetResult
Return Value
Type: GetResult
The result of the last Get*() call.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace