RhinoCommon SDK
NamedPositionTable.Delete Method (String)
Delete a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Delete(
	string name
)
Public Function Delete (
	name As String
) As Boolean
Parameters
name
Type: System.String
 Name of the Named Position which you want to delete.
Return Value
Type: Boolean
 True or False depending on whether the Delete was successful, Null in case the id does not exist as a Named Position.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NamedPositionTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace