RhinoCommon SDK
ObjRef.Mesh Method
 Gets the mesh if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh Mesh()
Public Function Mesh As Mesh
Return Value
Type: Mesh
A mesh; or null if the referenced object is not a mesh, or on error.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace