RhinoCommon SDK
ObjectTable.Replace Method (Guid, TextDot)
Replaces one object with new textdot object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Replace(
	Guid objectId,
	TextDot dot
)
Public Function Replace (
	objectId As Guid,
	dot As TextDot
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
dot
Type: Rhino.Geometry.TextDot
new textdot to be added. The textdot is copied.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace