RhinoCommon SDK
ViewCapture.CaptureToBitmap Method (RhinoView)
[Missing <summary> documentation for "M:Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.RhinoView)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Bitmap CaptureToBitmap(
	RhinoView sourceView
)
Public Function CaptureToBitmap (
	sourceView As RhinoView
) As Bitmap
Parameters
sourceView
Type: Rhino.Display.RhinoView
[Missing <param name="sourceView"/> documentation for "M:Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.RhinoView)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.RhinoView)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewCapture Class
CaptureToBitmap Overload
Rhino.Display Namespace