RhinoCommon API
BinaryArchiveReader.ReadMeshingParameters Method
 Reads a MeshingParameters from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshingParameters ReadMeshingParameters()
Public Function ReadMeshingParameters As MeshingParameters
Return Value
Type: MeshingParameters
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace