RhinoCommon SDK
Point3f.Subtract Method
 Subtracts a point from another point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3f Subtract(
	Point3f point1,
	Point3f point2
)
Public Shared Function Subtract (
	point1 As Point3f,
	point2 As Point3f
) As Vector3f
Parameters
point1
Type: Rhino.Geometry.Point3f
A point.
point2
Type: Rhino.Geometry.Point3f
Another point.
Return Value
Type: Vector3f
A new vector that is the difference of point minus vector.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace