RhinoCommon API
PolylineCurve.SetParameter Method
 Sets a parameter at a specified index in the polyline curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetParameter(
	int index,
	double parameter
)
Public Sub SetParameter (
	index As Integer,
	parameter As Double
)
Parameters
index
Type: System.Int32
An index.
parameter
Type: System.Double
A parameter to set.
Version Information
Rhino for Windows
Supported in: 6.9
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace