RhinoCommon SDK
City.Cities Method
 Returns number of available cities.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int Cities()
Public Shared Function Cities As Integer
Return Value
Type: Int32
City count.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
City Class
Rhino.Render Namespace