RhinoCommon SDK
AreaMassProperties.Compute Method (Hatch)
 Computes an AreaMassProperties for a hatch.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static AreaMassProperties Compute(
	Hatch hatch
)
Public Shared Function Compute (
	hatch As Hatch
) As AreaMassProperties
Parameters
hatch
Type: Rhino.Geometry.Hatch
Hatch to measure.
Return Value
Type: AreaMassProperties
The AreaMassProperties for the given hatch or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When hatch is null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace