RhinoCommon SDK
ArchivableDictionary.Set Method (String, Point4d)
 Sets a Point4d.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Set(
	string key,
	Point4d val
)
Public Function Set (
	key As String,
	val As Point4d
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.Point4d
A value for that key.
Because Point4d has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Point4d)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace