RhinoCommon API
Curve.ChangeDimension Method
 Changes the dimension of a curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ChangeDimension(
	int desiredDimension
)
Public Function ChangeDimension (
	desiredDimension As Integer
) As Boolean
Parameters
desiredDimension
Type: System.Int32
The desired dimension.
Return Value
Type: Boolean
 true if the curve's dimension was already desiredDimension or if the curve's dimension was successfully changed to desiredDimension; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
Curve Class
Rhino.Geometry Namespace