RhinoCommon SDK
Vector2d.Equality Operator
 Determines whether two vectors have equal values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator ==(
	Vector2d a,
	Vector2d b
)
Public Shared Operator = (
	a As Vector2d,
	b As Vector2d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector2d
The first vector.
b
Type: Rhino.Geometry.Vector2d
The second vector.
Return Value
Type: Boolean
true if components of the two vectors are pairwise equal; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace