RhinoCommon SDK
DimensionStyle.AlternateDimensionLengthDisplayUnit Method
[Missing <summary> documentation for "M:Rhino.DocObjects.DimensionStyle.AlternateDimensionLengthDisplayUnit(System.UInt32)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UnitSystem AlternateDimensionLengthDisplayUnit(
	uint model_serial_number
)
Public Function AlternateDimensionLengthDisplayUnit (
	model_serial_number As UInteger
) As UnitSystem
Parameters
model_serial_number
Type: System.UInt32
[Missing <param name="model_serial_number"/> documentation for "M:Rhino.DocObjects.DimensionStyle.AlternateDimensionLengthDisplayUnit(System.UInt32)"]
Return Value
Type: UnitSystem
[Missing <returns> documentation for "M:Rhino.DocObjects.DimensionStyle.AlternateDimensionLengthDisplayUnit(System.UInt32)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace