RhinoCommon API
ParticleSystem Constructor
Initializes a new instance of the ParticleSystem class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ParticleSystem()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace