RhinoCommon SDK
DisplayBitmap.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayBitmap Class
Dispose Overload
Rhino.Display Namespace