RhinoCommon SDK
Brep.CreatePlanarBreps Method (IEnumerable<Curve>)
 Constructs a set of planar breps as outlines by the loops.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Brep[] CreatePlanarBreps(
	IEnumerable<Curve> inputLoops
)
Public Shared Function CreatePlanarBreps (
	inputLoops As IEnumerable(Of Curve)
) As Brep()
Parameters
inputLoops
Type: System.Collections.Generic.IEnumerable<Curve>
Curve loops that delineate the planar boundaries.
Return Value
Type: Brep[]
An array of Planar Breps.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
Brep Class
CreatePlanarBreps Overload
Rhino.Geometry Namespace