RhinoCommon API
Layer Constructor
Initializes a new instance of the Layer class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Layer()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Layer Class
Layer Overload
Rhino.DocObjects Namespace