RhinoCommon API
Brep.ClosestPoint Method (Point3d)
 Finds a point on the brep that is closest to testPoint.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ClosestPoint(
	Point3d testPoint
)
Public Function ClosestPoint (
	testPoint As Point3d
) As Point3d
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Base point to project to brep.
Return Value
Type: Point3d
The point on the Brep closest to testPoint or Point3d.Unset if the operation failed.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Brep Class
ClosestPoint Overload
Rhino.Geometry Namespace