RhinoCommon SDK
Interop.NativeNonConstPointer Method (ViewportInfo)
 Get ON_Viewport* from a ViewportInfo instance
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static IntPtr NativeNonConstPointer(
	ViewportInfo viewport
)
Public Shared Function NativeNonConstPointer (
	viewport As ViewportInfo
) As IntPtr
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
[Missing <param name="viewport"/> documentation for "M:Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.DocObjects.ViewportInfo)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.DocObjects.ViewportInfo)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Interop Class
NativeNonConstPointer Overload
Rhino.Runtime Namespace