RhinoCommon API
PersistentSettings.SetDate Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDate(System.String,System.DateTime)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDate(
	string key,
	DateTime value
)
Public Sub SetDate (
	key As String,
	value As DateTime
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDate(System.String,System.DateTime)"]
value
Type: System.DateTime
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDate(System.String,System.DateTime)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
PersistentSettings Class
Rhino Namespace