RhinoCommon SDK
LinearDimension Constructor
 Initializes a new instance of the LinearDimension class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LinearDimension()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LinearDimension Class
LinearDimension Overload
Rhino.Geometry Namespace