RhinoCommon API
MeshVertexList.HideAll Method
 Hides all vertices in the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void HideAll()
Public Sub HideAll
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace