RhinoCommon SDK
NamedPositionTable.Delete Method (Guid)
Delete a Named Position.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Delete(
	Guid id
)
Public Function Delete (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
 Guid of the Named Position which you want to delete.
Return Value
Type: Boolean
 True or False depending on whether the Delete was successful, Null in case the id does not exist as a Named Position.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NamedPositionTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace