RhinoCommon SDK
DimStyleTable.SetCurrentDimensionStyleIndex Method
 Do not use. Use the SetCurrent(Int32, Boolean) method.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetCurrentDimensionStyleIndex(
	int index,
	bool quiet
)
Public Function SetCurrentDimensionStyleIndex (
	index As Integer,
	quiet As Boolean
) As Boolean
Parameters
index
Type: System.Int32
Do not use.
quiet
Type: System.Boolean
Do not use.
Return Value
Type: Boolean
Do not use.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace