RhinoCommon API
MeshTextureCoordinateList.ToFloatArray Method
 Copies all vertices to a linear array of float in u,v order
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float[] ToFloatArray()
Public Function ToFloatArray As Single()
Return Value
Type: Single[]
The float array.
Version Information
Rhino for Windows
Supported in: 6.15
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace