RhinoCommon SDK
LayerTable.UndoModify Method (Int32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UndoModify(
	int layerIndex
)
Public Function UndoModify (
	layerIndex As Integer
) As Boolean
Parameters
layerIndex
Type: System.Int32
The layer index to be used.
Return Value
Type: Boolean
true if this layer had been modified and the modifications were undone.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LayerTable Class
UndoModify Overload
Rhino.DocObjects.Tables Namespace