RhinoCommon SDK
LightManagerSupportClient.GetLightSolo Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.GetLightSolo(Rhino.Geometry.Light)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetLightSolo(
	Light light
)
Public Function GetLightSolo (
	light As Light
) As Boolean
Parameters
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupportClient.GetLightSolo(Rhino.Geometry.Light)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.LightManagerSupportClient.GetLightSolo(Rhino.Geometry.Light)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace