RhinoCommon API
PersistentSettings.GetRectangle Method (String)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.GetRectangle(System.String)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle GetRectangle(
	string key
)
Public Function GetRectangle (
	key As String
) As Rectangle
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.GetRectangle(System.String)"]
Return Value
Type: Rectangle
[Missing <returns> documentation for "M:Rhino.PersistentSettings.GetRectangle(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
PersistentSettings Class
GetRectangle Overload
Rhino Namespace