RhinoCommon SDK
NurbsCurvePointList.MakeRational Method
 Converts the curve to a Rational NURBS curve. Rational NURBS curves have weighted control points.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MakeRational()
Public Function MakeRational As Boolean
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace