RhinoCommon SDK
ZBufferCapture.ShowIsocurves Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowIsocurves(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ShowIsocurves(
	bool on
)
Public Sub ShowIsocurves (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowIsocurves(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace