RhinoCommon API
FieldDictionary.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.FieldDictionary.GetEnumerator"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<Field> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Field)
Return Value
Type: IEnumerator<Field>
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.GetEnumerator"]
Version Information
Rhino for Windows
Supported in: 6.18
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace