RhinoCommon SDK
SweepOneRail.SetToRoadlikeRight Method
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.SetToRoadlikeRight"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetToRoadlikeRight()
Public Sub SetToRoadlikeRight
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace