RhinoCommon API
Surface.IsTorus Method (Double)
Determines if the surface is a portion of a torus within a given tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsTorus(
	double tolerance
)
Public Function IsTorus (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a torus.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
Surface Class
IsTorus Overload
Rhino.Geometry Namespace