RhinoCommon API
ColorLAB.CreateFromLCH Method
 Create the nearest LAB equivalent of an LCH color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorLAB CreateFromLCH(
	ColorLCH lch
)
Public Shared Function CreateFromLCH (
	lch As ColorLCH
) As ColorLAB
Parameters
lch
Type: Rhino.Display.ColorLCH
Target color in LCH space.
Return Value
Type: ColorLAB
The LAB equivalent of the LCH color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace