RhinoCommon SDK
LightArray Constructor (IntPtr)
Initializes a new instance of the LightArray class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LightArray(
	IntPtr pLightArray
)
Public Sub New (
	pLightArray As IntPtr
)
Parameters
pLightArray
Type: System.IntPtr
[Missing <param name="pLightArray"/> documentation for "M:Rhino.Render.LightArray.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
LightArray Class
LightArray Overload
Rhino.Render Namespace