RhinoCommon SDK
Mesh.GetNgonAndFacesEnumerable Method
 Retrieves a complete enumerable, i.e., one that provides an iterator over every face that is present, no matter if defined as a triangle, a quad, or a strictly over-four-sided ngon.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerable<MeshNgon> GetNgonAndFacesEnumerable()
Public Function GetNgonAndFacesEnumerable As IEnumerable(Of MeshNgon)
Return Value
Type: IEnumerable<MeshNgon>
The enumerator capable of enumerating through Mesh.Ngons> Mesh.Ngons and Faces
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Mesh Class
Rhino.Geometry Namespace