RhinoCommon SDK
Leader Constructor
 Constructor
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Leader()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Leader Class
Leader Overload
Rhino.Geometry Namespace