RhinoCommon SDK
RealtimeDisplayMode.UnregisterDisplayModes Method (PlugIn)
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.UnregisterDisplayModes(Rhino.PlugIns.PlugIn)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void UnregisterDisplayModes(
	PlugIn plugin
)
Public Shared Sub UnregisterDisplayModes (
	plugin As PlugIn
)
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.RealtimeDisplayMode.UnregisterDisplayModes(Rhino.PlugIns.PlugIn)"]
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
RealtimeDisplayMode Class
UnregisterDisplayModes Overload
Rhino.Render Namespace