RhinoCommon API
Quaternion.Unitize Method
 Scales the quaternion's coordinates so that a*a + b*b + c*c + d*d = 1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Unitize()
Public Function Unitize As Boolean
Return Value
Type: Boolean
 true if successful. false if the quaternion is zero and cannot be unitized.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace