RhinoCommon SDK
RTree.Remove Method (BoundingBox, IntPtr)
Removes an element from the tree.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Remove(
	BoundingBox box,
	IntPtr elementId
)
Public Function Remove (
	box As BoundingBox,
	elementId As IntPtr
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
A bounding box.
elementId
Type: System.IntPtr
A pointer.
Return Value
Type: Boolean
true if element was successfully removed.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RTree Class
Remove Overload
Rhino.Geometry Namespace