RhinoCommon API
Point2d.Subtract Method (Point2d, Point2d)
 Subtracts the second point from the first point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector2d Subtract(
	Point2d point1,
	Point2d point2
)
Public Shared Function Subtract (
	point1 As Point2d,
	point2 As Point2d
) As Vector2d
Parameters
point1
Type: Rhino.Geometry.Point2d
A point (minuend).
point2
Type: Rhino.Geometry.Point2d
A point (subtrahend).
Return Value
Type: Vector2d
A new vector that is point1 coordinatewise subtracted by point2.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
Point2d Structure
Subtract Overload
Rhino.Geometry Namespace