RhinoCommon SDK
HistoryRecord.SetString Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetString(System.Int32,System.String)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetString(
	int id,
	string value
)
Public Function SetString (
	id As Integer,
	value As String
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetString(System.Int32,System.String)"]
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetString(System.Int32,System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetString(System.Int32,System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace