RhinoCommon SDK
RenderEnvironment.SimulateEnvironment Method (Boolean)
[Missing <summary> documentation for "M:Rhino.Render.RenderEnvironment.SimulateEnvironment(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual SimulatedEnvironment SimulateEnvironment(
	bool isForDataOnly
)
Public Overridable Function SimulateEnvironment (
	isForDataOnly As Boolean
) As SimulatedEnvironment
Parameters
isForDataOnly
Type: System.Boolean
[Missing <param name="isForDataOnly"/> documentation for "M:Rhino.Render.RenderEnvironment.SimulateEnvironment(System.Boolean)"]
Return Value
Type: SimulatedEnvironment
[Missing <returns> documentation for "M:Rhino.Render.RenderEnvironment.SimulateEnvironment(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderEnvironment Class
SimulateEnvironment Overload
Rhino.Render Namespace