RhinoCommon API
InstanceDefinition.Object Method
 returns an object used as part of this definition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject Object(
	int index
)
Public Function Object (
	index As Integer
) As RhinoObject
Parameters
index
Type: System.Int32
0 <= index < ObjectCount.
Return Value
Type: RhinoObject
 Returns an object that is used to define the geometry. Does NOT return an object that references this definition.count the number of references to this instance.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace