RhinoCommon SDK
MeshFaceList.GetFace Method
 Returns the mesh face at the given index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshFace GetFace(
	int index
)
Public Function GetFace (
	index As Integer
) As MeshFace
Parameters
index
Type: System.Int32
Index of face to get. Must be larger than or equal to zero and smaller than the Face Count of the mesh.
Return Value
Type: MeshFace
The mesh face at the given index on success or MeshFace.Unset if the index is out of range.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace