RhinoCommon API
ParticleSystem.Update Method
 Calls Update on every particle in the system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void Update()
Public Overridable Sub Update
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace