RhinoCommon API
BinaryArchiveWriter.WriteUShort Method
 Writes a UInt16 value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteUShort(
	ushort value
)
Public Sub WriteUShort (
	value As UShort
)
Parameters
value
Type: System.UInt16
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace