RhinoCommon SDK
File3dmObjectTable.AddCircle Method (Circle, ObjectAttributes)
Adds a curve object to the document representing a circle.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddCircle(
	Circle circle,
	ObjectAttributes attributes
)
Public Function AddCircle (
	circle As Circle,
	attributes As ObjectAttributes
) As Guid
Parameters
circle
Type: Rhino.Geometry.Circle
A circle to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to circle.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmObjectTable Class
AddCircle Overload
Rhino.FileIO Namespace