RhinoCommon API
RhinoSettings.ActiveView Method
[Missing <summary> documentation for "M:Rhino.Render.DataSources.RhinoSettings.ActiveView"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoView ActiveView()
Public Function ActiveView As RhinoView
Return Value
Type: RhinoView
[Missing <returns> documentation for "M:Rhino.Render.DataSources.RhinoSettings.ActiveView"]
Version Information
Rhino for Windows
Supported in: 6.15
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace