RhinoCommon SDK
GetInteger.Number Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetInteger.Number"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Number()
Public Function Number As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetInteger.Number"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetInteger Class
Rhino.Input.Custom Namespace