RhinoCommon SDK
MeshNgonList.AddNgon Method
 Appends a new ngon to the end of the mesh ngon list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AddNgon(
	MeshNgon ngon
)
Public Function AddNgon (
	ngon As MeshNgon
) As Integer
Parameters
ngon
Type: Rhino.Geometry.MeshNgon
Ngon to add.
Return Value
Type: Int32
The index of the newly added ngon.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace