RhinoCommon SDK
LayerTable.FindNext Method (Int32, String, Boolean)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FindNext(
	int index,
	string layerName,
	bool ignoreDeletedLayers
)
Public Function FindNext (
	index As Integer,
	layerName As String,
	ignoreDeletedLayers As Boolean
) As Integer
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
layerName
Type: System.String
[Missing <param name="layerName"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
ignoreDeletedLayers
Type: System.Boolean
[Missing <param name="ignoreDeletedLayers"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
LayerTable Class
FindNext Overload
Rhino.DocObjects.Tables Namespace