RhinoCommon SDK
ICollapsibleSection.RunScript Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ICollapsibleSection.RunScript(Rhino.UI.Controls.IRdkViewModel)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
int RunScript(
	IRdkViewModel vm
)
Function RunScript (
	vm As IRdkViewModel
) As Integer
Parameters
vm
Type: Rhino.UI.Controls.IRdkViewModel
[Missing <param name="vm"/> documentation for "M:Rhino.UI.Controls.ICollapsibleSection.RunScript(Rhino.UI.Controls.IRdkViewModel)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.UI.Controls.ICollapsibleSection.RunScript(Rhino.UI.Controls.IRdkViewModel)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace