RhinoCommon API
File3dmGroupTable.FindIndex Method
 Retrieves a Group object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Group FindIndex(
	int index
)
Public Function FindIndex (
	index As Integer
) As Group
Parameters
index
Type: System.Int32
The index to search for.
Return Value
Type: Group
A Group object, or null if none was found.
Version Information
Rhino for Windows
Supported in: 6.18
See Also
Reference
File3dmGroupTable Class
Rhino.FileIO Namespace