RhinoCommon API
CustomCurveObject.Dispose Method (Boolean)
Releases the unmanaged resources used by the CustomCurveObject and optionally releases the managed resources
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
CustomCurveObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace