RhinoCommon SDK
Centermark.Create Method
 Create a new centermark
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Centermark Create(
	DimensionStyle dimStyle,
	Plane plane,
	Point3d centerpoint,
	double radius
)
Public Shared Function Create (
	dimStyle As DimensionStyle,
	plane As Plane,
	centerpoint As Point3d,
	radius As Double
) As Centermark
Parameters
dimStyle
Type: Rhino.DocObjects.DimensionStyle
[Missing <param name="dimStyle"/> documentation for "M:Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
centerpoint
Type: Rhino.Geometry.Point3d
[Missing <param name="centerpoint"/> documentation for "M:Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
radius
Type: System.Double
[Missing <param name="radius"/> documentation for "M:Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
Return Value
Type: Centermark
[Missing <returns> documentation for "M:Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Centermark Class
Rhino.Geometry Namespace