RhinoCommon API
PythonScript.RemoveVariable Method
 Removes a defined variable from the main scripting context.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract void RemoveVariable(
	string name
)
Public MustOverride Sub RemoveVariable (
	name As String
)
Parameters
name
Type: System.String
The variable name.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace