RhinoCommon SDK
ObjectPropertiesPage.AnySelectedObject<T> Method
 Return true if any of the selected objects match the given type
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AnySelectedObject<T>()
where T : RhinoObject
Public Function AnySelectedObject(Of T As RhinoObject) As Boolean
Type Parameters
T
[Missing <typeparam name="T"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.AnySelectedObject``1"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.AnySelectedObject``1"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace