RhinoCommon API
IRhinoDocObserver.RhinoDocClosed Method
 When a document is closed
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void RhinoDocClosed(
	RhinoDocObserverArgs e
)
Sub RhinoDocClosed (
	e As RhinoDocObserverArgs
)
Parameters
e
Type: Rhino.RhinoDocObserverArgs
[Missing <param name="e"/> documentation for "M:Rhino.IRhinoDocObserver.RhinoDocClosed(Rhino.RhinoDocObserverArgs)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
IRhinoDocObserver Interface
Rhino Namespace