RhinoCommon API
PolyCurve Constructor
 Initializes a new, empty polycurve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PolyCurve()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
PolyCurve Class
PolyCurve Overload
Rhino.Geometry Namespace