RhinoCommon SDK
ColorLAB.CreateFromHSV Method
 Constructs the nearest LAB equivalent of an HSV color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorLAB CreateFromHSV(
	ColorHSV hsv
)
Public Shared Function CreateFromHSV (
	hsv As ColorHSV
) As ColorLAB
Parameters
hsv
Type: Rhino.Display.ColorHSV
Target color in HSV space.
Return Value
Type: ColorLAB
The LAB equivalent of the HSV color.
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace