RhinoCommon API
FileObjWriteOptions.GetTransform Method
 Calculates the transform combination of ZToY and any the translation that might occur in a SavewithOrigin.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform GetTransform()
Public Function GetTransform As Transform
Return Value
Type: Transform
[Missing <returns> documentation for "M:Rhino.FileIO.FileObjWriteOptions.GetTransform"]
Version Information
Rhino for Windows
Supported in: 6.6
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace