RhinoCommon SDK
RealtimeDisplayMode.HudShow Method
 Override if you want to hide the HUD. Shown by default
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool HudShow()
Public Overridable Function HudShow As Boolean
Return Value
Type: Boolean
Return false to hide the HUD.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace