RhinoCommon SDK
GetPoint.GetSnapPoints Method
 Gets current snap points.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] GetSnapPoints()
Public Function GetSnapPoints As Point3d()
Return Value
Type: Point3d[]
An array of points.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace