RhinoCommon SDK
Field.ValueAsFloat Method
 Return field value as floating point number.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected float ValueAsFloat()
Protected Function ValueAsFloat As Single
Return Value
Type: Single
Return the field value as an floating point number.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Field Class
Rhino.Render.Fields Namespace