RhinoCommon SDK
Transform.Equals Method (Object)
 Determines if another object is a transform and its value equals this transform value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Another object.
Return Value
Type: Boolean
true if obj is a transform and has the same value as this transform; otherwise, false.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Transform Structure
Equals Overload
Rhino.Geometry Namespace