RhinoCommon API
Line.EpsilonEquals Method
 Check that all values in other are within epsilon of the values in this
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EpsilonEquals(
	Line other,
	double epsilon
)
Public Function EpsilonEquals (
	other As Line,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Line
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.Line.EpsilonEquals(Rhino.Geometry.Line,System.Double)"]
epsilon
Type: System.Double
[Missing <param name="epsilon"/> documentation for "M:Rhino.Geometry.Line.EpsilonEquals(Rhino.Geometry.Line,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Line.EpsilonEquals(Rhino.Geometry.Line,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Line Structure
Rhino.Geometry Namespace