RhinoCommon SDK
GeometryBase.Duplicate Method
 Constructs a deep (full) copy of this object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual GeometryBase Duplicate()
Public Overridable Function Duplicate As GeometryBase
Return Value
Type: GeometryBase
An object of the same type as this, with the same properties and behavior.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace