RhinoCommon SDK
RenderContent.IsCompatible Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.IsCompatible(System.Guid)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool IsCompatible(
	Guid renderEngineId
)
Public Overridable Function IsCompatible (
	renderEngineId As Guid
) As Boolean
Parameters
renderEngineId
Type: System.Guid
[Missing <param name="renderEngineId"/> documentation for "M:Rhino.Render.RenderContent.IsCompatible(System.Guid)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.IsCompatible(System.Guid)"]
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
RenderContent Class
Rhino.Render Namespace