RhinoCommon API
GetBaseClass.Rectangle2d Method
 Returns the location in the view of the 2d rectangle selected in GetPoint::Get2dRectangle(). rect.left < rect.right and rect.top < rect.bottom (0,0) = upper left corner of window.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle Rectangle2d()
Public Function Rectangle2d As Rectangle
Return Value
Type: Rectangle
The rectangle.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace