RhinoCommon SDK
DisplayPipeline.CullControlPolygon Method
 Returns a value indicating if only points on the side of the surface that face the camera are displayed.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool CullControlPolygon()
Public Shared Function CullControlPolygon As Boolean
Return Value
Type: Boolean
true if backfaces of surface and mesh control polygons are culled. This value is determined by the _CullControlPolygon command.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace