RhinoCommon API
File3dmObjectTable.AddPoint Method (Point3f, ObjectAttributes)
Adds a point object to the document.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddPoint(
	Point3f point,
	ObjectAttributes attributes
)
Public Function AddPoint (
	point As Point3f,
	attributes As ObjectAttributes
) As Guid
Parameters
point
Type: Rhino.Geometry.Point3f
location of point.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to point.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
File3dmObjectTable Class
AddPoint Overload
Rhino.FileIO Namespace