RhinoCommon API
RhinoApp.ExecuteCommand Method (String)
 Execute a Rhino command.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Result ExecuteCommand(
	string commandName
)
Public Shared Function ExecuteCommand (
	commandName As String
) As Result
Parameters
commandName
Type: System.String
Name of command to run. Use command's localized name or preface with an underscore.
Return Value
Type: Result
Returns the reult of the command.
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
RhinoApp Class
ExecuteCommand Overload
Rhino Namespace