RhinoCommon API
Vector3d.Equality Operator
 Determines whether two vectors have the same value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator ==(
	Vector3d a,
	Vector3d b
)
Public Shared Operator = (
	a As Vector3d,
	b As Vector3d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector3d
A vector.
b
Type: Rhino.Geometry.Vector3d
Another vector.
Return Value
Type: Boolean
true if all coordinates are pairwise equal; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace