RhinoCommon SDK
LightTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LightTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<LightObject> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of LightObject)
Return Value
Type: IEnumerator<LightObject>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LightTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace