RhinoCommon API
LicenseUtils.Echo Method
 Test connectivity with the Zoo.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string Echo(
	string message
)
Public Shared Function Echo (
	message As String
) As String
Parameters
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.PlugIns.LicenseUtils.Echo(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.Echo(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
LicenseUtils Class
Rhino.PlugIns Namespace