RhinoCommon SDK
GripObject.Move Method (Transform)
 Moves the grip to a new location.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Move(
	Transform xform
)
Public Sub Move (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
 Transformation appliead to the OriginalLocation point.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GripObject Class
Move Overload
Rhino.DocObjects Namespace