RhinoCommon API
Surface.GetSpanVector Method
 Gets array of span "knots".
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double[] GetSpanVector(
	int direction
)
Public Function GetSpanVector (
	direction As Integer
) As Double()
Parameters
direction
Type: System.Int32
 0 gets first parameter's domain, 1 gets second parameter's domain.
Return Value
Type: Double[]
An array with span vectors; or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Surface Class
Rhino.Geometry Namespace