RhinoCommon API
RhinoDoc.FromId Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.RhinoDoc.FromId(System.Int32)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use FromRuntimeSerialNumber")]
public static RhinoDoc FromId(
	int docId
)
<ObsoleteAttribute("Use FromRuntimeSerialNumber")>
Public Shared Function FromId (
	docId As Integer
) As RhinoDoc
Parameters
docId
Type: System.Int32
[Missing <param name="docId"/> documentation for "M:Rhino.RhinoDoc.FromId(System.Int32)"]
Return Value
Type: RhinoDoc
[Missing <returns> documentation for "M:Rhino.RhinoDoc.FromId(System.Int32)"]
Version Information
Rhino for Mac
Obsolete (compiler warning) in 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.6
See Also
Reference
RhinoDoc Class
Rhino Namespace