RhinoCommon SDK
Arrowhead Constructor (DimensionStyle.ArrowType, Guid)
 Constructor
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Arrowhead(
	DimensionStyle.ArrowType arrowType,
	Guid blockId
)
Public Sub New (
	arrowType As DimensionStyle.ArrowType,
	blockId As Guid
)
Parameters
arrowType
Type: Rhino.DocObjects.DimensionStyle.ArrowType
 type of this arrowhead
blockId
Type: System.Guid
 Guid of the block used for user defined display
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Arrowhead Class
Arrowhead Overload
Rhino.Geometry Namespace