RhinoCommon SDK
BinaryArchiveReader.ReadRectangle Method
 Reads a Rectangle from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle ReadRectangle()
Public Function ReadRectangle As Rectangle
Return Value
Type: Rectangle
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace