RhinoCommon SDK
MaterialTable.Delete Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.MaterialTable.Delete(Rhino.DocObjects.Material)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Delete(
	Material item
)
Public Overrides Function Delete (
	item As Material
) As Boolean
Parameters
item
Type: Rhino.DocObjects.Material
[Missing <param name="item"/> documentation for "M:Rhino.DocObjects.Tables.MaterialTable.Delete(Rhino.DocObjects.Material)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.MaterialTable.Delete(Rhino.DocObjects.Material)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace