RhinoCommon SDK
ColorHSV.CreateFromXYZ Method
 Create the nearest HSV equivalent of an XYZ color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorHSV CreateFromXYZ(
	ColorXYZ xyz
)
Public Shared Function CreateFromXYZ (
	xyz As ColorXYZ
) As ColorHSV
Parameters
xyz
Type: Rhino.Display.ColorXYZ
Target color in XYZ space.
Return Value
Type: ColorHSV
The HSV equivalent of the XYZ color.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace