RhinoCommon SDK
RealtimeDisplayMode.ShutdownRenderer Method
 Override to shutdown your render engine
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract void ShutdownRenderer()
Public MustOverride Sub ShutdownRenderer
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace