RhinoCommon API
MeshVertexColorList.Add Method (Color)
 Adds a new vertex color to the end of the color list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add(
	Color color
)
Public Function Add (
	color As Color
) As Integer
Parameters
color
Type: System.Drawing.Color
Color to append, Alpha channels will be ignored.
Return Value
Type: Int32
The index of the newly added color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
MeshVertexColorList Class
Add Overload
Rhino.Geometry.Collections Namespace