RhinoCommon SDK
BinaryArchiveWriter.WriteSByte Method
 Writes a SByte value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteSByte(
	sbyte value
)
Public Sub WriteSByte (
	value As SByte
)
Parameters
value
Type: System.SByte
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace