RhinoCommon API
Point2d.Inequality Operator
 Determines whether two Point2d have different values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator !=(
	Point2d a,
	Point2d b
)
Public Shared Operator <> (
	a As Point2d,
	b As Point2d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point2d
The first point.
b
Type: Rhino.Geometry.Point2d
The second point.
Return Value
Type: Boolean
true if the two points differ in any coordinate; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace