RhinoCommon SDK
ObjectTable.Duplicate Method (Guid)
 Same as TransformObject(objref, ON_Xform.Identity, false)
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Duplicate(
	Guid objectId
)
Public Function Duplicate (
	objectId As Guid
) As Guid
Parameters
objectId
Type: System.Guid
An ID to an object in the document that needs to be duplicated.
Return Value
Type: Guid
The new object ID.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectTable Class
Duplicate Overload
Rhino.DocObjects.Tables Namespace