RhinoCommon SDK
RenderContent.OpenInEditor Method
 Call this method to open the content in the relevant thumbnail editor and select it for editing by the user. The content must be in the document or the call will fail.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool OpenInEditor()
Public Function OpenInEditor As Boolean
Return Value
Type: Boolean
 Returns true on success or false on error.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderContent Class
Rhino.Render Namespace