RhinoCommon API
IndexPair Constructor
 Initializes a new instance of IndexPair with two indices.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IndexPair(
	int i,
	int j
)
Public Sub New (
	i As Integer,
	j As Integer
)
Parameters
i
Type: System.Int32
A first index.
j
Type: System.Int32
A second index.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
IndexPair Structure
Rhino Namespace