RhinoCommon API
SimpleArrayInt Constructor (IEnumerable<Int32>)
 Initializes a new SimpleArrayInt class
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayInt(
	IEnumerable<int> values
)
Public Sub New (
	values As IEnumerable(Of Integer)
)
Parameters
values
Type: System.Collections.Generic.IEnumerable<Int32>
initial set of integers to add to the array
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
SimpleArrayInt Class
SimpleArrayInt Overload
Rhino.Runtime.InteropWrappers Namespace