RhinoCommon API
File3dmObjectTable.Dump Method
Prepares a text dump of object table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Dump()
Public Function Dump As String
Return Value
Type: String
A string containing the dump.
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace