RhinoCommon SDK
AsyncRenderContext.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.AsyncRenderContext.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace