RhinoCommon API
RhinoApp.CommandLineTextWriter.write Method
 Provided to give a simple way to IronPython to call this class.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void write(
	string str
)
Public Sub write (
	str As String
)
Parameters
str
Type: System.String
The text.
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoApp.CommandLineTextWriter Class
Rhino Namespace