RhinoCommon SDK
File3dmObjectTable.AddExtrusion Method (Extrusion, ObjectAttributes)
Adds an extrusion object to Rhino.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddExtrusion(
	Extrusion extrusion,
	ObjectAttributes attributes
)
Public Function AddExtrusion (
	extrusion As Extrusion,
	attributes As ObjectAttributes
) As Guid
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
A duplicate of this extrusion is added to Rhino.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to link to the object.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmObjectTable Class
AddExtrusion Overload
Rhino.FileIO Namespace