RhinoCommon API
ClassArrayOnObjRef.NonConstPointer Method
 Gets the non-const pointer (for modification) of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr NonConstPointer()
Public Function NonConstPointer As IntPtr
Return Value
Type: IntPtr
The non-const pointer.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
ClassArrayOnObjRef Class
Rhino.Runtime.InteropWrappers Namespace