RhinoCommon SDK
Point2f Constructor (Single, Single)
 Initializes a new two-dimensional point from two components.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2f(
	float x,
	float y
)
Public Sub New (
	x As Single,
	y As Single
)
Parameters
x
Type: System.Single
X component of vector.
y
Type: System.Single
Y component of vector.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point2f Structure
Point2f Overload
Rhino.Geometry Namespace