RhinoCommon SDK
Vector2f Constructor
 Creates an instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector2f(
	float x,
	float y
)
Public Sub New (
	x As Single,
	y As Single
)
Parameters
x
Type: System.Single
X component.
y
Type: System.Single
Y component.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace