RhinoCommon API
LicenseStatus Constructor
Public constructor.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LicenseStatus()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace