RhinoCommon SDK
CustomRenderMeshProvider Constructor
 Default constructor
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomRenderMeshProvider()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace