RhinoCommon SDK
SimpleArrayGeometryPointer Constructor (IEnumerable<GeometryBase>)
 Create an ON_SimpleArray<ON_Geometry*> filled with items in geometry
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayGeometryPointer(
	IEnumerable<GeometryBase> geometry
)
Public Sub New (
	geometry As IEnumerable(Of GeometryBase)
)
Parameters
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
[Missing <param name="geometry"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SimpleArrayGeometryPointer Class
SimpleArrayGeometryPointer Overload
Rhino.Runtime.InteropWrappers Namespace