RhinoCommon API
EdgeAnalysisSettings.RestoreDefaults Method
 Commits the default settings as the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void RestoreDefaults()
Public Shared Sub RestoreDefaults
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
EdgeAnalysisSettings Class
Rhino.ApplicationSettings Namespace