RhinoCommon API
SupportOptions.MaxPreviewCacheMB Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.MaxPreviewCacheMB"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int MaxPreviewCacheMB()
Public Shared Function MaxPreviewCacheMB As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.MaxPreviewCacheMB"]
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
SupportOptions Class
Rhino.Render Namespace