RhinoCommon SDK
File3dmViewTable.IndexOf Method
 Returns the index of the current ViewInfo.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int IndexOf(
	ViewInfo item
)
Public Function IndexOf (
	item As ViewInfo
) As Integer
Parameters
item
Type: Rhino.DocObjects.ViewInfo
The item to be searched.
Return Value
Type: Int32
The index of the ViewInfo.
Implements
IList<T>.IndexOf(T)
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace