RhinoCommon SDK
Curve Constructor
 Protected constructor for internal use.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Curve()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
See Also
Reference
Curve Class
Curve Overload
Rhino.Geometry Namespace