RhinoCommon SDK
BinaryArchiveFile.Close Method
[Missing <summary> documentation for "M:Rhino.FileIO.BinaryArchiveFile.Close"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Close()
Public Sub Close
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace