RhinoCommon API
GeometryBase.OnSwitchToNonConst Method
 Is called when a non-const operation occurs.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void OnSwitchToNonConst()
Protected Overrides Sub OnSwitchToNonConst
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace