RhinoCommon SDK
IStackedDialogPageService.GetImageHandle Method
 Convert image to platform specific unmanaged pointer
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IntPtr GetImageHandle(
	Image image,
	bool canBeNull
)
Function GetImageHandle (
	image As Image,
	canBeNull As Boolean
) As IntPtr
Parameters
image
Type: System.Drawing.Image
[Missing <param name="image"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Image,System.Boolean)"]
canBeNull
Type: System.Boolean
[Missing <param name="canBeNull"/> documentation for "M:Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Image,System.Boolean)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Image,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IStackedDialogPageService Interface
Rhino.UI Namespace