RhinoCommon SDK
CurveList.Insert Method (Int32, Line)
 Inserts a line at a given index of this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Insert(
	int index,
	Line line
)
Public Sub Insert (
	index As Integer,
	line As Line
)
Parameters
index
Type: System.Int32
A 0-based position in the list.
line
Type: Rhino.Geometry.Line
The line value from which to construct the new curve.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
CurveList Class
Insert Overload
Rhino.Collections Namespace