RhinoCommon SDK
Layer.UnsetPersistentVisibility Method
 Remove any explicit persistent visibility setting from this layer
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void UnsetPersistentVisibility()
Public Sub UnsetPersistentVisibility
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Layer Class
Rhino.DocObjects Namespace