RhinoCommon API
ObjectTable.MostRecentObject Method
 Gets the most recently added object that is still in the Document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject MostRecentObject()
Public Function MostRecentObject As RhinoObject
Return Value
Type: RhinoObject
The most recent (non-deleted) object in the document, or null if no such object exists.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace