RhinoCommon API
Rectangle3d.Transform Method
 Transforms this rectangle. Note that rectangles cannot be skewed or tapered.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Rectangle3d.Transform(Rhino.Geometry.Transform)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace