RhinoCommon SDK
ChangeQueue.GetQueueSceneBoundingBox Method
 Get the scene bounding box
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox GetQueueSceneBoundingBox()
Public Function GetQueueSceneBoundingBox As BoundingBox
Return Value
Type: BoundingBox
Scene bounding box
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace