RhinoCommon SDK
Curve.CreatePeriodicCurve Method (Curve)
 Removes kinks from a curve. Periodic curves deform smoothly without kinks.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Curve CreatePeriodicCurve(
	Curve curve
)
Public Shared Function CreatePeriodicCurve (
	curve As Curve
) As Curve
Parameters
curve
Type: Rhino.Geometry.Curve
The curve to make periodic. Curve must have degree >= 2.
Return Value
Type: Curve
The resulting curve if successful, null otherwise.
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Curve Class
CreatePeriodicCurve Overload
Rhino.Geometry Namespace