RhinoCommon SDK
BinaryArchiveWriter.WriteTransform Method
 Writes a Transform value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteTransform(
	Transform value
)
Public Sub WriteTransform (
	value As Transform
)
Parameters
value
Type: Rhino.Geometry.Transform
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace