RhinoCommon API
CustomDisplay.AddCircle Method (Circle)
 Adds a new, black circle to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddCircle(
	Circle circle
)
Public Sub AddCircle (
	circle As Circle
)
Parameters
circle
Type: Rhino.Geometry.Circle
Circle to add.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
CustomDisplay Class
AddCircle Overload
Rhino.Display Namespace