RhinoCommon SDK
FileObjWriteOptions Constructor
Initializes a new instance of the FileObjWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileObjWriteOptions(
	FileWriteOptions writeOptions
)
Public Sub New (
	writeOptions As FileWriteOptions
)
Parameters
writeOptions
Type: Rhino.FileIO.FileWriteOptions
[Missing <param name="writeOptions"/> documentation for "M:Rhino.FileIO.FileObjWriteOptions.#ctor(Rhino.FileIO.FileWriteOptions)"]
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace