RhinoCommon SDK
Matrix.Duplicate Method
 Create a duplicate of this matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Matrix Duplicate()
Public Function Duplicate As Matrix
Return Value
Type: Matrix
An exact duplicate of this matrix.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Matrix Class
Rhino.Geometry Namespace