RhinoCommon SDK
PreviewNotification.NotifyIntermediateUpdate Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PreviewNotification.NotifyIntermediateUpdate(Rhino.Render.RenderWindow)"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void NotifyIntermediateUpdate(
	RenderWindow rw
)
Public Sub NotifyIntermediateUpdate (
	rw As RenderWindow
)
Parameters
rw
Type: Rhino.Render.RenderWindow
[Missing <param name="rw"/> documentation for "M:Rhino.PlugIns.PreviewNotification.NotifyIntermediateUpdate(Rhino.Render.RenderWindow)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PreviewNotification Class
Rhino.PlugIns Namespace