RhinoCommon API
RealtimeDisplayMode.LastRenderedPass Method
 Implement to communicate last completed pass to the underlying system.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual int LastRenderedPass()
Public Overridable Function LastRenderedPass As Integer
Return Value
Type: Int32
the last completed pass
Version Information
Rhino for Windows
Supported in: 6.15
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace