RhinoCommon SDK
IRhRdkThumbnailList.Mode Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Mode"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IRhRdkThumbnailList_Modes Mode()
Function Mode As IRhRdkThumbnailList_Modes
Return Value
Type: IRhRdkThumbnailList_Modes
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Mode"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace