RhinoCommon SDK
IRhRdkThumbnailList.Get Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Get(System.Guid@)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IRhRdkThumbnail Get(
	ref Guid u
)
Function Get (
	ByRef u As Guid
) As IRhRdkThumbnail
Parameters
u
Type: System.Guid
[Missing <param name="u"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Get(System.Guid@)"]
Return Value
Type: IRhRdkThumbnail
[Missing <returns> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Get(System.Guid@)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace