RhinoCommon SDK
File3dmViewTable.Delete Method (ViewInfo)
 Deletes an item.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Delete(
	ViewInfo item
)
Public Function Delete (
	item As ViewInfo
) As Boolean
Parameters
item
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="item"/> documentation for "M:Rhino.FileIO.File3dmViewTable.Delete(Rhino.DocObjects.ViewInfo)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.File3dmViewTable.Delete(Rhino.DocObjects.ViewInfo)"]
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
File3dmViewTable Class
Delete Overload
Rhino.FileIO Namespace