RhinoCommon API
Material.SetTransparencyTexture Method (Texture)
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetTransparencyTexture(Rhino.DocObjects.Texture)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetTransparencyTexture(
	Texture texture
)
Public Function SetTransparencyTexture (
	texture As Texture
) As Boolean
Parameters
texture
Type: Rhino.DocObjects.Texture
[Missing <param name="texture"/> documentation for "M:Rhino.DocObjects.Material.SetTransparencyTexture(Rhino.DocObjects.Texture)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetTransparencyTexture(Rhino.DocObjects.Texture)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
Material Class
SetTransparencyTexture Overload
Rhino.DocObjects Namespace