RhinoCommon SDK
HistoryRecord.SetInt Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInt(System.Int32,System.Int32)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetInt(
	int id,
	int value
)
Public Function SetInt (
	id As Integer,
	value As Integer
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInt(System.Int32,System.Int32)"]
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInt(System.Int32,System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInt(System.Int32,System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace