RhinoCommon SDK
Extrusion Constructor (SerializationInfo, StreamingContext)
 Protected serialization constructor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Extrusion(
	SerializationInfo info,
	StreamingContext context
)
Protected Sub New (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
The serialization data.
context
Type: System.Runtime.Serialization.StreamingContext
The serialization context stream.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Extrusion Class
Extrusion Overload
Rhino.Geometry Namespace