RhinoCommon API
RhinoApp.ChangeLicenseKey Method
 Display UI asking the user to enter a license for the product specified by licenseId.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ChangeLicenseKey(
	Guid pluginId
)
Public Shared Function ChangeLicenseKey (
	pluginId As Guid
) As Boolean
Parameters
pluginId
Type: System.Guid
Guid identifying the plugin that is requesting a change of license key
Return Value
Type: Boolean
true on success, false otherwise
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoApp Class
Rhino Namespace