RhinoCommon API
TextDot Constructor (String, Point3d)
 Initializes a new textdot based on the text and the location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextDot(
	string text,
	Point3d location
)
Public Sub New (
	text As String,
	location As Point3d
)
Parameters
text
Type: System.String
Text.
location
Type: Rhino.Geometry.Point3d
A position.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
TextDot Class
TextDot Overload
Rhino.Geometry Namespace