RhinoCommon SDK
Circle.ClosestParameter Method
 Gets the parameter on the circle which is closest to a test point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ClosestParameter(
	Point3d testPoint,
	out double t
)
Public Function ClosestParameter (
	testPoint As Point3d,
	<OutAttribute> ByRef t As Double
) As Boolean
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to project onto the circle.
t
Type: System.Double
Parameter on circle closes to testPoint.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Circle Structure
Rhino.Geometry Namespace