RhinoCommon SDK
IRhRdkThumbnail.GetDisplayRect Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.GetDisplayRect(System.Drawing.RectangleF@)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void GetDisplayRect(
	ref RectangleF rectOut
)
Sub GetDisplayRect (
	ByRef rectOut As RectangleF
)
Parameters
rectOut
Type: System.Drawing.RectangleF
[Missing <param name="rectOut"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.GetDisplayRect(System.Drawing.RectangleF@)"]
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
IRhRdkThumbnail Interface
Rhino.UI.Controls.ThumbnailUI Namespace