RhinoCommon SDK
StringTable.GetValue Method (Int32)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.StringTable.GetValue(System.Int32)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetValue(
	int i
)
Public Function GetValue (
	i As Integer
) As String
Parameters
i
Type: System.Int32
[Missing <param name="i"/> documentation for "M:Rhino.DocObjects.Tables.StringTable.GetValue(System.Int32)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.StringTable.GetValue(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
StringTable Class
GetValue Overload
Rhino.DocObjects.Tables Namespace