RhinoCommon SDK
Layer.PerViewportIsVisible Method
 Gets the per viewport visibility of this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool PerViewportIsVisible(
	Guid viewportId
)
Public Function PerViewportIsVisible (
	viewportId As Guid
) As Boolean
Parameters
viewportId
Type: System.Guid
 If not Guid.Empty, then the visibility setting for that viewport is returned. If Guid.Empty, the IsVisible property is returned.
Return Value
Type: Boolean
Returns true if objects on layer are visible.
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Layer Class
Rhino.DocObjects Namespace