RhinoCommon SDK
Field.ValueAsPoint3d Method
 Return field as a Rhino.Geometry.Point3d color value.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Point3d ValueAsPoint3d()
Protected Function ValueAsPoint3d As Point3d
Return Value
Type: Point3d
Return field as a Rhino.Geometry.Point3d color value.
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Field Class
Rhino.Render.Fields Namespace