RhinoCommon API
ArchivableDictionary.Set Method (String, UInt16)
 Sets a UInt16.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Set(
	string key,
	ushort val
)
Public Function Set (
	key As String,
	val As UShort
) As Boolean
Parameters
key
Type: System.String
The text key.
val
Type: System.UInt16
A UInt16.
Because UInt16 has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
true if set operation succeeded, otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace