RhinoCommon SDK
MappingTag Constructor
Initializes a new instance of the MappingTag class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MappingTag()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
MappingTag Class
Rhino.Render Namespace