RhinoCommon API
GetPoint.EnableCurveSnapPerpBar Method
 Controls display of the curve snap perpendicular bar icon.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableCurveSnapPerpBar(
	bool drawPerpBarAtSnapPoint,
	bool drawEndPoints
)
Public Sub EnableCurveSnapPerpBar (
	drawPerpBarAtSnapPoint As Boolean,
	drawEndPoints As Boolean
)
Parameters
drawPerpBarAtSnapPoint
Type: System.Boolean
 true to draw a tangent bar icon whenever GetPoint snaps to a curve.
drawEndPoints
Type: System.Boolean
 true to draw points at the end of the tangent bar.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace