RhinoCommon SDK
RealtimeDisplayMode.HudStartTime Method
[Missing <summary> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudStartTime"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual DateTime HudStartTime()
Public Overridable Function HudStartTime As DateTime
Return Value
Type: DateTime
[Missing <returns> documentation for "M:Rhino.Render.RealtimeDisplayMode.HudStartTime"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace