RhinoCommon SDK
PreviewAppearance.FromMetaData Method
 Copy data from MetaData to PreviewAppearance
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void FromMetaData(
	MetaData md
)
Public Sub FromMetaData (
	md As MetaData
)
Parameters
md
Type: Rhino.Render.DataSources.MetaData
[Missing <param name="md"/> documentation for "M:Rhino.Render.PreviewAppearance.FromMetaData(Rhino.Render.DataSources.MetaData)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace