RhinoCommon API
Cylinder.ToNurbsSurface Method
 Constructs a Nurbs surface representation of this cylinder. This is synonymous with calling NurbsSurface.CreateFromCylinder().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsSurface ToNurbsSurface()
Public Function ToNurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
A Nurbs surface representation of the cylinder or null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace