RhinoCommon API
Particle.Update Method
 Base class implementation does nothing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void Update()
Public Overridable Sub Update
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
Particle Class
Rhino.Geometry Namespace