RhinoCommon SDK
DisplayMaterial Constructor
 Constructs a default material.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayMaterial()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayMaterial Class
DisplayMaterial Overload
Rhino.Display Namespace