RhinoCommon SDK
NurbsSurface.MakeNonRational Method
 Makes this surface non-rational.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MakeNonRational()
Public Function MakeNonRational As Boolean
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace