RhinoCommon SDK
RhinoObject.EnableVisualAnalysisMode Method
 Used to turn analysis modes on and off.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EnableVisualAnalysisMode(
	VisualAnalysisMode mode,
	bool enable
)
Public Function EnableVisualAnalysisMode (
	mode As VisualAnalysisMode,
	enable As Boolean
) As Boolean
Parameters
mode
Type: Rhino.Display.VisualAnalysisMode
A visual analysis mode.
enable
Type: System.Boolean
true if the mode should be activated; false otherwise.
Return Value
Type: Boolean
true if this object supports the analysis mode.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace