RhinoCommon SDK
RenderMaterialTable.Remove Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterialTable.Remove(Rhino.Render.RenderMaterial)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Remove(
	RenderMaterial c
)
Public Function Remove (
	c As RenderMaterial
) As Boolean
Parameters
c
Type: Rhino.Render.RenderMaterial
[Missing <param name="c"/> documentation for "M:Rhino.Render.RenderMaterialTable.Remove(Rhino.Render.RenderMaterial)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterialTable.Remove(Rhino.Render.RenderMaterial)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderMaterialTable Class
Rhino.Render Namespace