RhinoCommon API
PersistentSettings.SetByte Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetByte(System.String,System.Byte)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetByte(
	string key,
	byte value
)
Public Sub SetByte (
	key As String,
	value As Byte
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetByte(System.String,System.Byte)"]
value
Type: System.Byte
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetByte(System.String,System.Byte)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
PersistentSettings Class
Rhino Namespace