RhinoCommon API
MaterialRefs.Add Method (KeyValuePair<Guid, MaterialRef>)
 Adds an item to this dictionary.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	KeyValuePair<Guid, MaterialRef> item
)
Public Sub Add (
	item As KeyValuePair(Of Guid, MaterialRef)
)
Parameters
item
Type: System.Collections.Generic.KeyValuePair<Guid, MaterialRef>
 The object to add to this dictionary
Implements
ICollection<T>.Add(T)
Exceptions
Exception | Condition
ArgumentNullException |  value is null.
ArgumentException |  key is empty.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
MaterialRefs Class
Add Overload
Rhino.DocObjects Namespace