RhinoCommon API
DisplayPipeline.DrawArc Method (Arc, Color)
 Draw a single arc object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawArc(
	Arc arc,
	Color color
)
Public Sub DrawArc (
	arc As Arc,
	color As Color
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc to draw.
color
Type: System.Drawing.Color
Color to draw with.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
DisplayPipeline Class
DrawArc Overload
Rhino.Display Namespace