RhinoCommon SDK
GetObject.DisablePreSelect Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetObject.DisablePreSelect"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DisablePreSelect()
Public Sub DisablePreSelect
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace