RhinoCommon SDK
Curve.ExtendOnSurface Method (CurveEnd, Surface)
 Extends a curve on a surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve ExtendOnSurface(
	CurveEnd side,
	Surface surface
)
Public Function ExtendOnSurface (
	side As CurveEnd,
	surface As Surface
) As Curve
Parameters
side
Type: Rhino.Geometry.CurveEnd
The end of the curve to extend.
surface
Type: Rhino.Geometry.Surface
Surface that contains the curve.
Return Value
Type: Curve
New extended curve result on success, null on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Curve Class
ExtendOnSurface Overload
Rhino.Geometry Namespace