RhinoCommon API
DisplayPipeline.PushDepthTesting Method
 Push a DepthTesting flag on the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PushDepthTesting(
	bool enable
)
Public Sub PushDepthTesting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
DepthTesting flag.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace