RhinoCommon SDK
CollapsibleSectionImpl.GetSiblings Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.GetSiblings(Rhino.UI.Controls.ICollapsibleSection)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ICollapsibleSection[] GetSiblings(
	ICollapsibleSection section
)
Public Shared Function GetSiblings (
	section As ICollapsibleSection
) As ICollapsibleSection()
Parameters
section
Type: Rhino.UI.Controls.ICollapsibleSection
[Missing <param name="section"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.GetSiblings(Rhino.UI.Controls.ICollapsibleSection)"]
Return Value
Type: ICollapsibleSection[]
[Missing <returns> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.GetSiblings(Rhino.UI.Controls.ICollapsibleSection)"]
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace