RhinoCommon SDK
InstanceDefinition.InUse Method
 Determines whether the instance definition is referenced.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool InUse(
	int wheretoLook
)
Public Function InUse (
	wheretoLook As Integer
) As Boolean
Parameters
wheretoLook
Type: System.Int32
0 = check for top level references in active document.
1 = check for top level and nested references in active document.
2 = check for references in other instance definitions.
Return Value
Type: Boolean
true if the instance definition is used; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace