RhinoCommon API
DisplayPipeline.DrawSphere Method (Sphere, Color)
 Draw a wireframe sphere.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawSphere(
	Sphere sphere,
	Color color
)
Public Sub DrawSphere (
	sphere As Sphere,
	color As Color
)
Parameters
sphere
Type: Rhino.Geometry.Sphere
Sphere to draw.
color
Type: System.Drawing.Color
Color to draw with.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
DisplayPipeline Class
DrawSphere Overload
Rhino.Display Namespace