RhinoCommon SDK
BinaryArchiveReader.ReadPoint3d Method
 Reads a Point3d from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ReadPoint3d()
Public Function ReadPoint3d As Point3d
Return Value
Type: Point3d
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace