RhinoCommon SDK
HiddenLineDrawingObjectCurve.Curve Method (Double)
 Returns the HiddenLineDrawingCurve object containing parameter 't'.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HiddenLineDrawingSegment Curve(
	double t
)
Public Function Curve (
	t As Double
) As HiddenLineDrawingSegment
Parameters
t
Type: System.Double
The parameter.
Return Value
Type: HiddenLineDrawingSegment
The HiddenLineDrawingCurve object if successful.
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
HiddenLineDrawingObjectCurve Class
Curve Overload
Rhino.Geometry Namespace