RhinoCommon API
Dialogs.ShowAboutDialog Method
[Missing <summary> documentation for "M:Rhino.UI.Dialogs.ShowAboutDialog(System.Boolean)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void ShowAboutDialog(
	bool forceSimpleDialog
)
Public Shared Sub ShowAboutDialog (
	forceSimpleDialog As Boolean
)
Parameters
forceSimpleDialog
Type: System.Boolean
[Missing <param name="forceSimpleDialog"/> documentation for "M:Rhino.UI.Dialogs.ShowAboutDialog(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 6.18
See Also
Reference
Dialogs Class
Rhino.UI Namespace