RhinoCommon SDK
RenderPrimitive.Dispose Method
Releases all resources used by the RenderPrimitive
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderPrimitive Class
Dispose Overload
Rhino.Render Namespace