RhinoCommon SDK
HistoryRecord.SetCurve Method
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetCurve(System.Int32,Rhino.Geometry.Curve)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetCurve(
	int id,
	Curve value
)
Public Function SetCurve (
	id As Integer,
	value As Curve
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetCurve(System.Int32,Rhino.Geometry.Curve)"]
value
Type: Rhino.Geometry.Curve
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetCurve(System.Int32,Rhino.Geometry.Curve)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetCurve(System.Int32,Rhino.Geometry.Curve)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace