RhinoCommon SDK
GumballDisplayConduit Constructor
Initializes a new instance of the GumballDisplayConduit class
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GumballDisplayConduit()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace