RhinoCommon API
PythonScript.GetVariableNames Method
 Retrieves all variable names in the script.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract IEnumerable<string> GetVariableNames()
Public MustOverride Function GetVariableNames As IEnumerable(Of String)
Return Value
Type: IEnumerable<String>
An enumerable set with all names of the variables.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace