RhinoCommon API
CustomMeshObject Constructor (Mesh)
Initializes a new instance of the CustomMeshObject class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomMeshObject(
	Mesh mesh
)
Protected Sub New (
	mesh As Mesh
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.DocObjects.Custom.CustomMeshObject.#ctor(Rhino.Geometry.Mesh)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
CustomMeshObject Class
CustomMeshObject Overload
Rhino.DocObjects.Custom Namespace