RhinoCommon SDK
RhinoSettings Constructor
Initializes a new instance of the RhinoSettings class
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoSettings(
	IntPtr pRhinoSettings
)
Public Sub New (
	pRhinoSettings As IntPtr
)
Parameters
pRhinoSettings
Type: System.IntPtr
[Missing <param name="pRhinoSettings"/> documentation for "M:Rhino.Render.DataSources.RhinoSettings.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace