RhinoCommon SDK
DisplayPipeline.DrawObject Method (RhinoObject)
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawObject(Rhino.DocObjects.RhinoObject)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawObject(
	RhinoObject rhinoObject
)
Public Sub DrawObject (
	rhinoObject As RhinoObject
)
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhinoObject"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawObject(Rhino.DocObjects.RhinoObject)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
DisplayPipeline Class
DrawObject Overload
Rhino.Display Namespace