RhinoCommon SDK
Quaternion.Product Method
 The quaternion product of p and q. This is the same value as p*q.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Quaternion Product(
	Quaternion p,
	Quaternion q
)
Public Shared Function Product (
	p As Quaternion,
	q As Quaternion
) As Quaternion
Parameters
p
Type: Rhino.Geometry.Quaternion
The first trasform.
q
Type: Rhino.Geometry.Quaternion
The second trasform.
Return Value
Type: Quaternion
A transform value.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace