RhinoCommon SDK
GetPoint.ClearSnapPoints Method
 Remove all snap points.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearSnapPoints()
Public Sub ClearSnapPoints
Remarks
 When point osnap is enabled, GetPoint will snap to points in the Rhino model. If you want the user to be able to snap to additional points, then use GetPoint::AddSnapPoints tp specify the locations of these additional points.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace