RhinoCommon API
Interval.ParameterAt Method
Converts normalized parameter to interval value, or pair of values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ParameterAt(
	double normalizedParameter
)
Public Function ParameterAt (
	normalizedParameter As Double
) As Double
Parameters
normalizedParameter
Type: System.Double
[Missing <param name="normalizedParameter"/> documentation for "M:Rhino.Geometry.Interval.ParameterAt(System.Double)"]
Return Value
Type: Double
Interval parameter min*(1.0-normalizedParameter) + max*normalizedParameter.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
Interval Structure
Rhino.Geometry Namespace
NormalizedParameterAt