RhinoCommon SDK
Vector2d.Negate Method
 Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector2d Negate(
	Vector2d vector
)
Public Shared Function Negate (
	vector As Vector2d
) As Vector2d
Parameters
vector
Type: Rhino.Geometry.Vector2d
A vector to negate.
Return Value
Type: Vector2d
A new vector where all components were multiplied by -1.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace