RhinoCommon SDK
ObjectTable.AddBox Method (Box, ObjectAttributes)
 Adds a box to the object table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddBox(
	Box box,
	ObjectAttributes attributes
)
Public Function AddBox (
	box As Box,
	attributes As ObjectAttributes
) As Guid
Parameters
box
Type: Rhino.Geometry.Box
The box.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes that will be linked with the surface object.
Return Value
Type: Guid
The ID.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectTable Class
AddBox Overload
Rhino.DocObjects.Tables Namespace