RhinoCommon API
Brep.CullUnusedSurfaces Method
Culls surfaces not referenced by a face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CullUnusedSurfaces()
Public Function CullUnusedSurfaces As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
Brep Class
Rhino.Geometry Namespace