RhinoCommon SDK
ComponentStatus.ToString Method
 Provides a string representation of this ComponentStatus.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The representation in English.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace