RhinoCommon API
CustomBrepObject.Dispose Method
Releases all resources used by the CustomBrepObject
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
CustomBrepObject Class
Dispose Overload
Rhino.DocObjects.Custom Namespace