RhinoCommon API
GripObject.Move Method (Point3d)
 Moves the grip to a new location.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Move(
	Point3d newLocation
)
Public Sub Move (
	newLocation As Point3d
)
Parameters
newLocation
Type: Rhino.Geometry.Point3d
 New location for grip.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
GripObject Class
Move Overload
Rhino.DocObjects Namespace