RhinoCommon API
StackedDialogPage.OnCreateParent Method
 Called when the parent window has been created on Windows platforms only.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void OnCreateParent(
	IntPtr hwndParent
)
Public Overridable Sub OnCreateParent (
	hwndParent As IntPtr
)
Parameters
hwndParent
Type: System.IntPtr
[Missing <param name="hwndParent"/> documentation for "M:Rhino.UI.StackedDialogPage.OnCreateParent(System.IntPtr)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace