RhinoCommon SDK
RhinoViewport.GetConstructionPlane Method
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.GetConstructionPlane"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ConstructionPlane GetConstructionPlane()
Public Function GetConstructionPlane As ConstructionPlane
Return Value
Type: ConstructionPlane
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.GetConstructionPlane"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace