RhinoCommon SDK
RenderEnvironmentTable.Remove Method
[Missing <summary> documentation for "M:Rhino.Render.RenderEnvironmentTable.Remove(Rhino.Render.RenderEnvironment)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Remove(
	RenderEnvironment c
)
Public Function Remove (
	c As RenderEnvironment
) As Boolean
Parameters
c
Type: Rhino.Render.RenderEnvironment
[Missing <param name="c"/> documentation for "M:Rhino.Render.RenderEnvironmentTable.Remove(Rhino.Render.RenderEnvironment)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderEnvironmentTable.Remove(Rhino.Render.RenderEnvironment)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderEnvironmentTable Class
Rhino.Render Namespace