RhinoCommon SDK
ObjRef.SelectionMethod Method
 Gets the method used to select this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SelectionMethod SelectionMethod()
Public Function SelectionMethod As SelectionMethod
Return Value
Type: SelectionMethod
The method used to select this object.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace