RhinoCommon API
Box Constructor (Plane, BoundingBox)
 Initializes a world aligned box from a base plane and a boundingbox.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Box(
	Plane basePlane,
	BoundingBox boundingbox
)
Public Sub New (
	basePlane As Plane,
	boundingbox As BoundingBox
)
Parameters
basePlane
Type: Rhino.Geometry.Plane
Base plane of bounging box.
boundingbox
Type: Rhino.Geometry.BoundingBox
Bounding Box in plane coordinates.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
Box Structure
Box Overload
Rhino.Geometry Namespace