RhinoCommon SDK
RdkSelectionNavigator Constructor
Initializes a new instance of the RdkSelectionNavigator class
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RdkSelectionNavigator(
	IntPtr pRhinoSettings
)
Public Sub New (
	pRhinoSettings As IntPtr
)
Parameters
pRhinoSettings
Type: System.IntPtr
[Missing <param name="pRhinoSettings"/> documentation for "M:Rhino.Render.DataSources.RdkSelectionNavigator.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace