RhinoCommon API
ObjectTable.AddRhinoObject Method (CustomPointObject)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomPointObject)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddRhinoObject(
	CustomPointObject pointObject
)
Public Sub AddRhinoObject (
	pointObject As CustomPointObject
)
Parameters
pointObject
Type: Rhino.DocObjects.Custom.CustomPointObject
[Missing <param name="pointObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomPointObject)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ObjectTable Class
AddRhinoObject Overload
Rhino.DocObjects.Tables Namespace