RhinoCommon SDK
CustomDisplay.AddLine Method (Line)
 Adds a new, black line to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddLine(
	Line line
)
Public Sub AddLine (
	line As Line
)
Parameters
line
Type: Rhino.Geometry.Line
Line to add.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomDisplay Class
AddLine Overload
Rhino.Display Namespace