RhinoCommon API
ViewCaptureWriter.Draw Method
[Missing <summary> documentation for "M:Rhino.Runtime.ViewCaptureWriter.Draw(System.IntPtr)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Draw(
	IntPtr constPtrPrintInfo
)
Public Sub Draw (
	constPtrPrintInfo As IntPtr
)
Parameters
constPtrPrintInfo
Type: System.IntPtr
[Missing <param name="constPtrPrintInfo"/> documentation for "M:Rhino.Runtime.ViewCaptureWriter.Draw(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
ViewCaptureWriter Class
Rhino.Runtime Namespace