RhinoCommon SDK
RenderPipeline.RenderPreCreateWindow Method
[Missing <summary> documentation for "M:Rhino.Render.RenderPipeline.RenderPreCreateWindow"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual bool RenderPreCreateWindow()
Protected Overridable Function RenderPreCreateWindow As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderPipeline.RenderPreCreateWindow"]
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace