RhinoCommon SDK
Thumbnail.GetDisplayRect Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.GetDisplayRect(System.Drawing.RectangleF@)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void GetDisplayRect(
	ref RectangleF rectOut
)
Public Sub GetDisplayRect (
	ByRef rectOut As RectangleF
)
Parameters
rectOut
Type: System.Drawing.RectangleF
[Missing <param name="rectOut"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.GetDisplayRect(System.Drawing.RectangleF@)"]
Implements
IRhRdkThumbnail.GetDisplayRect(RectangleF)
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace