RhinoCommon SDK
File3dmNotes Constructor
 Creates empty default notes
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmNotes()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace