RhinoCommon API
Material Constructor
Initializes a new instance of the Material class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Material()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Material Class
Material Overload
Rhino.DocObjects Namespace