RhinoCommon API
Vector3d.Equals Method (Vector3d)
 Determines whether the specified vector has the same value as the present vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Equals(
	Vector3d vector
)
Public Function Equals (
	vector As Vector3d
) As Boolean
Parameters
vector
Type: Rhino.Geometry.Vector3d
The specified vector.
Return Value
Type: Boolean
true if vector has the same coordinates as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
Vector3d Structure
Equals Overload
Rhino.Geometry Namespace