RhinoCommon API
MeshVertexList.Clear Method
 Clears the Vertex list on the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace