RhinoCommon SDK
CustomDisplay.AddPoint Method (Point3d)
 Adds a new, black point to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddPoint(
	Point3d point
)
Public Sub AddPoint (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to add.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomDisplay Class
AddPoint Overload
Rhino.Display Namespace