RhinoCommon SDK
DisplayEngine.Dispose Method
Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
DisplayEngine Class
Rhino.Display Namespace