RhinoCommon SDK
MeshNgon.Inequality Operator
 Determines whether two MeshNgon structures have different values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator !=(
	MeshNgon a,
	MeshNgon b
)
Public Shared Operator <> (
	a As MeshNgon,
	b As MeshNgon
) As Boolean
Parameters
a
Type: Rhino.Geometry.MeshNgon
The first MeshNgon.
b
Type: Rhino.Geometry.MeshNgon
The second MeshNgon.
Return Value
Type: Boolean
true if the vertex or face index lists are different in any way; otherwise false.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace