RhinoCommon SDK
MeshVertexList.ToPoint3dArray Method
 Copies all vertices to a new array of Point3d.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] ToPoint3dArray()
Public Function ToPoint3dArray As Point3d()
Return Value
Type: Point3d[]
A new array.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace