RhinoCommon SDK
MeshFaceNormalList.UnitizeFaceNormals Method
 Unitizes all the existing face normals.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UnitizeFaceNormals()
Public Function UnitizeFaceNormals As Boolean
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace