RhinoCommon SDK
LayerTable.Add Method
 Adds a new layer with default definition to the layer table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add()
Public Function Add As Integer
Return Value
Type: Int32
index of new layer.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LayerTable Class
Add Overload
Rhino.DocObjects.Tables Namespace