RhinoCommon SDK
Quaternion.DistanceTo Method
 Computes the distance or norm of the difference between this and another quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double DistanceTo(
	Quaternion q
)
Public Function DistanceTo (
	q As Quaternion
) As Double
Parameters
q
Type: Rhino.Geometry.Quaternion
Another quaternion.
Return Value
Type: Double
(this - q).Length.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace