RhinoCommon SDK
RhinoDoc.SetCustomMeshingParameters Method
 Set the custom meshing parameters that this document will use. You must also modify the MeshingParameterStyle property on the document to Custom if you want these meshing parameters to be used
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetCustomMeshingParameters(
	MeshingParameters mp
)
Public Sub SetCustomMeshingParameters (
	mp As MeshingParameters
)
Parameters
mp
Type: Rhino.Geometry.MeshingParameters
[Missing <param name="mp"/> documentation for "M:Rhino.RhinoDoc.SetCustomMeshingParameters(Rhino.Geometry.MeshingParameters)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoDoc Class
Rhino Namespace