RhinoCommon API
Curve.Duplicate Method
 Constructs an exact duplicate of this Curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override GeometryBase Duplicate()
Public Overrides Function Duplicate As GeometryBase
Return Value
Type: GeometryBase
[Missing <returns> documentation for "M:Rhino.Geometry.Curve.Duplicate"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
Curve Class
Rhino.Geometry Namespace
Curve.DuplicateCurve()