RhinoCommon SDK
Interval.Equals Method (Object)
 Determines whether the specified Object is equal to the current Interval, comparing by value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The other object to compare with.
Return Value
Type: Boolean
true if obj is an Interval and has the same bounds; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Interval Structure
Equals Overload
Rhino.Geometry Namespace