RhinoCommon SDK
VisualAnalysisMode.ObjectSupportsAnalysisMode Method
 Gets a value indicating if this visual analysis mode can be used on a given Rhino object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool ObjectSupportsAnalysisMode(
	RhinoObject obj
)
Public Overridable Function ObjectSupportsAnalysisMode (
	obj As RhinoObject
) As Boolean
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
The object to be tested.
Return Value
Type: Boolean
true if this mode can indeed be used on the object; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace