RhinoCommon API
Mesh.ClearTextureData Method
 Removes all texture coordinate information from this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearTextureData()
Public Sub ClearTextureData
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
Mesh Class
Rhino.Geometry Namespace