RhinoCommon API
BinaryArchiveWriter.WriteGuid Method
 Writes a Guid value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteGuid(
	Guid value
)
Public Sub WriteGuid (
	value As Guid
)
Parameters
value
Type: System.Guid
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace