RhinoCommon SDK
SimpleArrayCurvePointer Constructor (IEnumerable<Curve>)
 Initializes a new SimpleArrayCurvePointer instance, from a set of input curves.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayCurvePointer(
	IEnumerable<Curve> curves
)
Public Sub New (
	curves As IEnumerable(Of Curve)
)
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
A list, an array or any collection of curves that implements the enumerable interface.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SimpleArrayCurvePointer Class
SimpleArrayCurvePointer Overload
Rhino.Runtime.InteropWrappers Namespace