RhinoCommon API
ViewCaptureSettings.SetViewport Method
[Missing <summary> documentation for "M:Rhino.Display.ViewCaptureSettings.SetViewport(Rhino.Display.RhinoViewport)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetViewport(
	RhinoViewport viewport
)
Public Sub SetViewport (
	viewport As RhinoViewport
)
Parameters
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.Display.ViewCaptureSettings.SetViewport(Rhino.Display.RhinoViewport)"]
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace