RhinoCommon SDK
WorldMapDayNight.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.UI.WorldMapDayNight.Finalize"]
 Namespace: Rhino.Render.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
WorldMapDayNight Class
Rhino.Render.UI Namespace