RhinoCommon SDK
CollapsibleSectionImpl.Find Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.Find(System.IntPtr)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ICollapsibleSection Find(
	IntPtr cpp
)
Public Shared Function Find (
	cpp As IntPtr
) As ICollapsibleSection
Parameters
cpp
Type: System.IntPtr
[Missing <param name="cpp"/> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.Find(System.IntPtr)"]
Return Value
Type: ICollapsibleSection
[Missing <returns> documentation for "M:Rhino.UI.Controls.CollapsibleSectionImpl.Find(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace