RhinoCommon API
CollapsibleSectionImpl.Dispose Method
Releases all resources used by the CollapsibleSectionImpl
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace