RhinoCommon API
GetObject.EnableClearObjectsOnEntry Method
 By default the picked object list is cleared when GetObject.GetObjects() is called. If you are reusing a GetObject class and do not want the existing object list cleared when you call Input, then call EnableClearObjectsOnEntry(false) before calling GetObjects().
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableClearObjectsOnEntry(
	bool enable
)
Public Sub EnableClearObjectsOnEntry (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
The state to set.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace