RhinoCommon API
PreviewSceneServer.Finalize Method
 Destructor for PreviewSceneServer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
PreviewSceneServer Class
Rhino.Render Namespace