RhinoCommon API
RhinoObject.Description Method
 Get a brief description of a object, including it's attributes and geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Description(
	TextLog textLog
)
Public Sub Description (
	textLog As TextLog
)
Parameters
textLog
Type: Rhino.FileIO.TextLog
A textlog for collecting the description.
Version Information
Rhino for Windows
Supported in: 6.20
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace