RhinoCommon SDK
Linetype.CommitChanges Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Linetype.CommitChanges"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CommitChanges()
Public Function CommitChanges As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Linetype.CommitChanges"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace