RhinoCommon API
DisplayPipeline.EnableLighting Method
 Enable or disable the Lighting logic of the engine.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableLighting(
	bool enable
)
Public Sub EnableLighting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable Lighting, false to disable.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace