RhinoCommon API
ObjRef.ClippingPlaneSurface Method
 Gets the clipping plane surface if this reference targeted one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ClippingPlaneSurface ClippingPlaneSurface()
Public Function ClippingPlaneSurface As ClippingPlaneSurface
Return Value
Type: ClippingPlaneSurface
A clipping plane surface, or null if this reference targeted something else.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace