RhinoCommon SDK
MeshTopologyVertexList.TopologyVertexIndex Method
 Gets the topology vertex index for an existing mesh vertex in the mesh's VertexList.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int TopologyVertexIndex(
	int vertexIndex
)
Public Function TopologyVertexIndex (
	vertexIndex As Integer
) As Integer
Parameters
vertexIndex
Type: System.Int32
Index of a vertex in the Mesh.Vertices.
Return Value
Type: Int32
Index of a topology vertex in the Mesh.TopologyVertices.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace