RhinoCommon API
DisplayPipeline.EnableClippingPlanes Method
 Enable or disable the Clipping Plane logic of the engine.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableClippingPlanes(
	bool enable
)
Public Sub EnableClippingPlanes (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable Clipping Planes, false to disable.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace