RhinoCommon API
SimpleArrayLinetypePointer.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Linetype[] ToNonConstArray()
Public Function ToNonConstArray As Linetype()
Return Value
Type: Linetype[]
The managed array.
Version Information
Rhino for Windows
Supported in: 6.9
See Also
Reference
SimpleArrayLinetypePointer Class
Rhino.Runtime.InteropWrappers Namespace