RhinoCommon SDK
Vector3f.Subtract Method
 Subtracts the second vector from the first one.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3f Subtract(
	Vector3f vector1,
	Vector3f vector2
)
Public Shared Function Subtract (
	vector1 As Vector3f,
	vector2 As Vector3f
) As Vector3f
Parameters
vector1
Type: Rhino.Geometry.Vector3f
A vector.
vector2
Type: Rhino.Geometry.Vector3f
A second vector.
Return Value
Type: Vector3f
A new vector that results from the componentwise difference of vector1 - vector2.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace