RhinoCommon SDK
BinaryArchiveWriter.WriteUInt Method
 Writes a UInt32 value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteUInt(
	uint value
)
Public Sub WriteUInt (
	value As UInteger
)
Parameters
value
Type: System.UInt32
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace