RhinoCommon API
RenderTexture.IsImageBased Method
 Query if the texture is image based.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool IsImageBased()
Public Overridable Function IsImageBased As Boolean
Return Value
Type: Boolean
true if the texture is image-based.
Version Information
Rhino for Windows
Supported in: 6.8
See Also
Reference
RenderTexture Class
Rhino.Render Namespace