RhinoCommon API
Point3dList.SetAllX Method
 Set all the X values for the points to a single value
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetAllX(
	double xValue
)
Public Sub SetAllX (
	xValue As Double
)
Parameters
xValue
Type: System.Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
Point3dList Class
Rhino.Collections Namespace