RhinoCommon API
StringWrapper Constructor (String)
 Initializes a new unmanaged string with an initial value. The string s can be null.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public StringWrapper(
	string s
)
Public Sub New (
	s As String
)
Parameters
s
Type: System.String
The initial value, or null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
StringWrapper Class
StringWrapper Overload
Rhino.Runtime.InteropWrappers Namespace