RhinoCommon API
DisplayPipeline.PushDepthWriting Method
 Push a DepthWriting flag on the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PushDepthWriting(
	bool enable
)
Public Sub PushDepthWriting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
DepthWriting flag.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace