RhinoCommon SDK
RhinoObject.GetSubObjects Method
 Gets an array of sub-objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject[] GetSubObjects()
Public Function GetSubObjects As RhinoObject()
Return Value
Type: RhinoObject[]
An array of subobjects, or null if there are none.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace