RhinoCommon API
DisplayPipeline.EnableDepthWriting Method
 Enable or disable the DepthWriting behaviour of the engine. When DepthWriting is disabled, drawn geometry does not affect the Z-Buffer.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableDepthWriting(
	bool enable
)
Public Sub EnableDepthWriting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable DepthWriting, false to disable.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace