RhinoCommon SDK
MeshFaceNormalList.AddFaceNormal Method (Vector3f)
 Appends a face normal to the list of mesh face normals.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AddFaceNormal(
	Vector3f normal
)
Public Function AddFaceNormal (
	normal As Vector3f
) As Integer
Parameters
normal
Type: Rhino.Geometry.Vector3f
New face normal.
Return Value
Type: Int32
The index of the newly added face normal.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshFaceNormalList Class
AddFaceNormal Overload
Rhino.Geometry.Collections Namespace