RhinoCommon API
BinaryArchiveWriter.EndWrite3dmChunk Method
 updates length in chunk header
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EndWrite3dmChunk()
Public Function EndWrite3dmChunk As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveWriter.EndWrite3dmChunk"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace