RhinoCommon API
Point3f Constructor
 Initializes a new two-dimensional vector from two components.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3f(
	float x,
	float y,
	float z
)
Public Sub New (
	x As Single,
	y As Single,
	z As Single
)
Parameters
x
Type: System.Single
X component of vector.
y
Type: System.Single
Y component of vector.
z
Type: System.Single
Z component of vector.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace