RhinoCommon API
GetPoint.OnMouseMove Method
Calls the MouseMove event and can/should be called by overriding implementation.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnMouseMove(
	GetPointMouseEventArgs e
)
Protected Overridable Sub OnMouseMove (
	e As GetPointMouseEventArgs
)
Parameters
e
Type: Rhino.Input.Custom.GetPointMouseEventArgs
Current argument for the event.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace