RhinoCommon SDK
Decal.ConstPointer Method
[Missing <summary> documentation for "M:Rhino.Render.Decal.ConstPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Render.Decal.ConstPointer"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Decal Class
Rhino.Render Namespace