RhinoCommon API
BinaryArchiveWriter.WriteRectangleF Method
 Writes a RectangleF value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteRectangleF(
	RectangleF value
)
Public Sub WriteRectangleF (
	value As RectangleF
)
Parameters
value
Type: System.Drawing.RectangleF
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace