RhinoCommon SDK
BrepVertexList.Add Method
 Create and add a new vertex to this list
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepVertex Add()
Public Function Add As BrepVertex
Return Value
Type: BrepVertex
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.BrepVertexList.Add"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepVertexList Class
Add Overload
Rhino.Geometry.Collections Namespace