RhinoCommon SDK
ObjectTable.AddMorphControl Method (MorphControl)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddMorphControl(
	MorphControl morphControl
)
Public Function AddMorphControl (
	morphControl As MorphControl
) As Guid
Parameters
morphControl
Type: Rhino.Geometry.MorphControl
[Missing <param name="morphControl"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectTable Class
AddMorphControl Overload
Rhino.DocObjects.Tables Namespace