RhinoCommon SDK
LightArray Constructor
Initializes a new instance of the LightArray class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LightArray()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LightArray Class
LightArray Overload
Rhino.Render Namespace