RhinoCommon SDK
PreviewAppearance.Finalize Method
 Destructor for previewappearance
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace