RhinoCommon SDK
CustomObjectGrips Constructor
Initializes a new instance of the CustomObjectGrips class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected CustomObjectGrips()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace