RhinoCommon API
Curve.FrameAt Method
Returns a 3d frame at a parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool FrameAt(
	double t,
	out Plane plane
)
Public Function FrameAt (
	t As Double,
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
t
Type: System.Double
Evaluation parameter.
plane
Type: Rhino.Geometry.Plane
The frame is returned here.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Curve Class
Rhino.Geometry Namespace