RhinoCommon API
NurbsCurve.GrevillePoints Method (Boolean)
 Gets Greville points for this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3dList GrevillePoints(
	bool all
)
Public Function GrevillePoints (
	all As Boolean
) As Point3dList
Parameters
all
Type: System.Boolean
If true, then all Greville points are returnd. If false, only edit points are returned.
Return Value
Type: Point3dList
A list of points if successful, null otherwise.
Version Information
Rhino for Windows
Supported in: 6.20
See Also
Reference
NurbsCurve Class
GrevillePoints Overload
Rhino.Geometry Namespace