RhinoCommon API
TextureGraphInfo.ActiveAxis Method
[Missing <summary> documentation for "M:Rhino.Render.TextureGraphInfo.ActiveAxis"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureGraphInfo.Axis ActiveAxis()
Public Function ActiveAxis As TextureGraphInfo.Axis
Return Value
Type: TextureGraphInfo.Axis
[Missing <returns> documentation for "M:Rhino.Render.TextureGraphInfo.ActiveAxis"]
Version Information
Rhino for Windows
Supported in: 6.8
See Also
Reference
TextureGraphInfo Class
Rhino.Render Namespace