RhinoCommon SDK
Mesh.EvaluateMeshGeometry Method
 If the mesh has SurfaceParameters, the surface is evaluated at these parameters and the mesh geometry is updated.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EvaluateMeshGeometry(
	Surface surface
)
Public Function EvaluateMeshGeometry (
	surface As Surface
) As Boolean
Parameters
surface
Type: Rhino.Geometry.Surface
An input surface.
Return Value
Type: Boolean
true if the operation succceeded; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Mesh Class
Rhino.Geometry Namespace