RhinoCommon SDK
LightManagerSupportClient.ObjectFromLight Method
[Missing <summary> documentation for "M:Rhino.Render.LightManagerSupportClient.ObjectFromLight(Rhino.Geometry.Light)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject ObjectFromLight(
	Light light
)
Public Function ObjectFromLight (
	light As Light
) As RhinoObject
Parameters
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightManagerSupportClient.ObjectFromLight(Rhino.Geometry.Light)"]
Return Value
Type: RhinoObject
[Missing <returns> documentation for "M:Rhino.Render.LightManagerSupportClient.ObjectFromLight(Rhino.Geometry.Light)"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LightManagerSupportClient Class
Rhino.Render Namespace