RhinoCommon API
BoundingBox.GetEdges Method
 Gets an array of the 12 edges of this box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line[] GetEdges()
Public Function GetEdges As Line()
Return Value
Type: Line[]
If the boundingbox IsValid, the 12 edges; otherwise, null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace