RhinoCommon SDK
MeshNgonList.AddPlanarNgons Method (Double)
 Add an ngon for each group of connected coplanar faces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AddPlanarNgons(
	double planarTolerance
)
Public Function AddPlanarNgons (
	planarTolerance As Double
) As Integer
Parameters
planarTolerance
Type: System.Double
3d distance tolerance for coplanar test.
Return Value
Type: Int32
Number of ngons added to the mesh.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshNgonList Class
AddPlanarNgons Overload
Rhino.Geometry.Collections Namespace