RhinoCommon API
Skin Constructor
 Initializes a new instance of the Skin class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected Skin()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
Skin Class
Rhino.Runtime Namespace