RhinoCommon SDK
GetArc.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
GetArc Class
Dispose Overload
Rhino.Input.Custom Namespace