RhinoCommon API
LightArray.Append Method
[Missing <summary> documentation for "M:Rhino.Render.LightArray.Append(Rhino.Geometry.Light)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Append(
	Light light
)
Public Sub Append (
	light As Light
)
Parameters
light
Type: Rhino.Geometry.Light
[Missing <param name="light"/> documentation for "M:Rhino.Render.LightArray.Append(Rhino.Geometry.Light)"]
Version Information
Rhino for Windows
Supported in: 6.6
See Also
Reference
LightArray Class
Rhino.Render Namespace