RhinoCommon API
CustomGripObject.Finalize Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomGripObject.Finalize"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace