RhinoCommon API
FilePdf Constructor
Initializes a new instance of the FilePdf class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected FilePdf()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.7
See Also
Reference
FilePdf Class
Rhino.FileIO Namespace