RhinoCommon API
ZBufferCapture.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
ZBufferCapture Class
Dispose Overload
Rhino.Display Namespace