RhinoCommon SDK
PointCloud.AsReadOnlyListOfPoints Method
 Returns an enumerator and list indexer over point cloud locations.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IReadOnlyList<Point3d> AsReadOnlyListOfPoints()
Public Function AsReadOnlyListOfPoints As IReadOnlyList(Of Point3d)
Return Value
Type: IReadOnlyList<Point3d>
The read-only list. This is a reference to the present point cloud.
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace