RhinoCommon SDK
FileReadOptions Constructor
Initializes a new instance of the FileReadOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileReadOptions()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace