RhinoCommon API
ToolbarFile.SaveAs Method
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFile.SaveAs(System.String)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SaveAs(
	string path
)
Public Function SaveAs (
	path As String
) As Boolean
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.UI.ToolbarFile.SaveAs(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFile.SaveAs(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace