RhinoCommon SDK
MeshNgonList.Insert Method
 Inserts a mesh ngon at a defined index in this list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Insert(
	int index,
	MeshNgon ngon
)
Public Sub Insert (
	index As Integer,
	ngon As MeshNgon
)
Parameters
index
Type: System.Int32
An ngon index.
ngon
Type: Rhino.Geometry.MeshNgon
An ngon.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | If index is negative or >= Count.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace