RhinoCommon API
NurbsCurve.SetGrevillePoints Method
 Sets all Greville (Edit) points for this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetGrevillePoints(
	IEnumerable<Point3d> points
)
Public Function SetGrevillePoints (
	points As IEnumerable(Of Point3d)
) As Boolean
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
 The new point locations. The number of points should match the number of point returned by NurbsCurve.GrevillePoints().
Return Value
Type: Boolean
true if successful, false otherwise.
Version Information
Rhino for Windows
Supported in: 6.9
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace