RhinoCommon API
CurveList.Add Method (Ellipse)
 Adds an ellipse to this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	Ellipse ellipse
)
Public Sub Add (
	ellipse As Ellipse
)
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
An ellipse that will be the model of the new internal curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
CurveList Class
Add Overload
Rhino.Collections Namespace