RhinoCommon SDK
LocalizeStringPair.ToString Method
[Missing <summary> documentation for "M:Rhino.UI.LocalizeStringPair.ToString"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.LocalizeStringPair.ToString"]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LocalizeStringPair Class
ToString Overload
Rhino.UI Namespace