RhinoCommon SDK
NameHash Constructor (String, Guid, Boolean)
 Creates a new NameHash, representing a piece of text.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NameHash(
	string name,
	Guid parentId,
	bool ignoreCase
)
Public Sub New (
	name As String,
	parentId As Guid,
	ignoreCase As Boolean
)
Parameters
name
Type: System.String
A name. This can be null and can refer to a nonexisting path.
parentId
Type: System.Guid
The id of the parent layer. This is only useful with layers.
ignoreCase
Type: System.Boolean
All manifest searches currently ignore case, except for groups.
Return Value
Type:
A new hash
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NameHash Class
NameHash Overload
Rhino.FileIO Namespace