RhinoCommon API
CustomDisplay.AddCurve Method (Curve, Color, Int32)
 Adds a new, colored curve to the display list. The curve will be duplicated so changes to the original will not affect the display.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddCurve(
	Curve curve,
	Color color,
	int thickness
)
Public Sub AddCurve (
	curve As Curve,
	color As Color,
	thickness As Integer
)
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to add.
color
Type: System.Drawing.Color
Color of curve.
thickness
Type: System.Int32
Thickness of curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
CustomDisplay Class
AddCurve Overload
Rhino.Display Namespace