RhinoCommon API
LineCurve Constructor
 Initializes a new instance of the LineCurve class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LineCurve()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
LineCurve Class
LineCurve Overload
Rhino.Geometry Namespace