RhinoCommon API
ObjectTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<RhinoObject> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of RhinoObject)
Return Value
Type: IEnumerator<RhinoObject>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace