RhinoCommon SDK
DimStyleTable.Find Method (String, Boolean)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle Find(
	string name,
	bool ignoreDeletedDimensionStyles
)
Public Function Find (
	name As String,
	ignoreDeletedDimensionStyles As Boolean
) As DimensionStyle
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
ignoreDeletedDimensionStyles
Type: System.Boolean
[Missing <param name="ignoreDeletedDimensionStyles"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
Return Value
Type: DimensionStyle
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
DimStyleTable Class
Find Overload
Rhino.DocObjects.Tables Namespace