RhinoCommon API
PersistentSettings.SetDefault Method (String, Size)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Size)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDefault(
	string key,
	Size value
)
Public Sub SetDefault (
	key As String,
	value As Size
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Size)"]
value
Type: System.Drawing.Size
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Size)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace