RhinoCommon SDK
GroundPlane Constructor
 Create an utility object not associated with any document
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GroundPlane()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
GroundPlane Class
GroundPlane Overload
Rhino.Render Namespace