RhinoCommon SDK
Panels.IsPanelVisible Method (Guid, Boolean)
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsPanelVisible(
	Guid panelId,
	bool isSelectedTab
)
Public Shared Function IsPanelVisible (
	panelId As Guid,
	isSelectedTab As Boolean
) As Boolean
Parameters
panelId
Type: System.Guid
 Class Id for the panel to check.
isSelectedTab
Type: System.Boolean
 Is the currently selected tab.
Return Value
Type: Boolean
 Returns true if the tab is visible otherwise it returns false.
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Panels Class
IsPanelVisible Overload
Rhino.UI Namespace