RhinoCommon SDK
NurbsCurveKnotList.IndexOf Method
 Returns the first item in the list.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int IndexOf(
	double item
)
Public Function IndexOf (
	item As Double
) As Integer
Parameters
item
Type: System.Double
The value.
Return Value
Type: Int32
The index, or -1 if no index is found.
Implements
IList<T>.IndexOf(T)
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace