RhinoCommon API
GumballObject.SetFromCircle Method
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromCircle(Rhino.Geometry.Circle)"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetFromCircle(
	Circle circle
)
Public Function SetFromCircle (
	circle As Circle
) As Boolean
Parameters
circle
Type: Rhino.Geometry.Circle
[Missing <param name="circle"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromCircle(Rhino.Geometry.Circle)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromCircle(Rhino.Geometry.Circle)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace