RhinoCommon API
ClassArrayObjRef.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjRef[] ToNonConstArray()
Public Function ToNonConstArray As ObjRef()
Return Value
Type: ObjRef[]
The managed array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
ClassArrayObjRef Class
Rhino.Runtime.InteropWrappers Namespace