RhinoCommon SDK
BinaryArchiveReader.ReadStringArray Method
 Reads an array of String from the archive.
An array is returned even if the input was another enumerable type.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] ReadStringArray()
Public Function ReadStringArray As String()
Return Value
Type: String[]
The array that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace