RhinoCommon API
PolylineCurve Constructor
 Initializes a new empty polyline curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PolylineCurve()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
PolylineCurve Class
PolylineCurve Overload
Rhino.Geometry Namespace