RhinoCommon API
PreviewAppearance.Lighting Method
 Lighting
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PreviewLighting Lighting()
Public Function Lighting As PreviewLighting
Return Value
Type: PreviewLighting
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.Lighting"]
Version Information
Rhino for Windows
Supported in: 6.6
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace