RhinoCommon API
SimpleArrayGeometryPointer Constructor (IEnumerable)
 Expects all of the items in the IEnumerable to be GeometryBase types
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayGeometryPointer(
	IEnumerable geometry
)
Public Sub New (
	geometry As IEnumerable
)
Parameters
geometry
Type: System.Collections.IEnumerable
[Missing <param name="geometry"/> documentation for "M:Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.#ctor(System.Collections.IEnumerable)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
SimpleArrayGeometryPointer Class
SimpleArrayGeometryPointer Overload
Rhino.Runtime.InteropWrappers Namespace