RhinoCommon API
MetaDataProxy Constructor
 Constructor for MetaDataProxy
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MetaDataProxy()
Public Sub New
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
MetaDataProxy Class
Rhino.Render Namespace