RhinoCommon SDK
SupportOptions.AutoSaveRenderings Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.AutoSaveRenderings"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool AutoSaveRenderings()
Public Shared Function AutoSaveRenderings As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.AutoSaveRenderings"]
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
SupportOptions Class
Rhino.Render Namespace