RhinoCommon SDK
BinaryArchiveWriter.WriteVector3d Method
 Writes a Vector3d value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteVector3d(
	Vector3d value
)
Public Sub WriteVector3d (
	value As Vector3d
)
Parameters
value
Type: Rhino.Geometry.Vector3d
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace