RhinoCommon SDK
MeshFaceList.DeleteFaces Method
 Removes a collection of faces from the mesh without affecting the remaining geometry.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DeleteFaces(
	IEnumerable<int> faceIndexes
)
Public Function DeleteFaces (
	faceIndexes As IEnumerable(Of Integer)
) As Integer
Parameters
faceIndexes
Type: System.Collections.Generic.IEnumerable<Int32>
An array containing all the face indices to be removed.
Return Value
Type: Int32
The number of faces deleted on success.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace