RhinoCommon SDK
UserDictionary Constructor
Initializes a new instance of the UserDictionary class
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UserDictionary()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace