RhinoCommon API
Surface.Degree Method
 Returns the maximum algebraic degree of any span (or a good estimate if curve spans are not algebraic).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Degree(
	int direction
)
Public Function Degree (
	direction As Integer
) As Integer
Parameters
direction
Type: System.Int32
 0 gets first parameter's domain, 1 gets second parameter's domain.
Return Value
Type: Int32
The maximum degree.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
Surface Class
Rhino.Geometry Namespace