RhinoCommon SDK
Surface.TryGetCone Method (Cone)
Tests a surface to see if it is a portion of a cone within RhinoMath.ZeroTolerance and return the cone.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetCone(
	out Cone cone
)
Public Function TryGetCone (
	<OutAttribute> ByRef cone As Cone
) As Boolean
Parameters
cone
Type: Rhino.Geometry.Cone
On success, the cone parameters are filled in.
Return Value
Type: Boolean
true if the surface is a portion of a cone.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Surface Class
TryGetCone Overload
Rhino.Geometry Namespace