RhinoCommon API
ToolbarFile.Save Method
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFile.Save"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Save()
Public Function Save As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFile.Save"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace