RhinoCommon SDK
BinaryArchiveWriter.WritePoint Method
 Writes a Point value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WritePoint(
	Point value
)
Public Sub WritePoint (
	value As Point
)
Parameters
value
Type: System.Drawing.Point
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace