RhinoCommon API
Vector3d.IsTiny Method
 Uses RhinoMath.ZeroTolerance for IsTiny calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsTiny()
Public Function IsTiny As Boolean
Return Value
Type: Boolean
true if vector is very small, otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
Vector3d Structure
IsTiny Overload
Rhino.Geometry Namespace