RhinoCommon SDK
AsyncRenderContext Constructor
Initializes a new instance of the AsyncRenderContext class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected AsyncRenderContext()
Protected Sub New
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace