RhinoCommon SDK
ViewportInfo.GetXform Method
 Computes a transform from a coordinate system to another.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform GetXform(
	CoordinateSystem sourceSystem,
	CoordinateSystem destinationSystem
)
Public Function GetXform (
	sourceSystem As CoordinateSystem,
	destinationSystem As CoordinateSystem
) As Transform
Parameters
sourceSystem
Type: Rhino.DocObjects.CoordinateSystem
The coordinate system to map from.
destinationSystem
Type: Rhino.DocObjects.CoordinateSystem
The coordinate system to map into.
Return Value
Type: Transform
The 4x4 transformation matrix (acts on the left).
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace