RhinoCommon SDK
BrepFaceList.StandardizeFaceSurfaces Method
Standardize all faces in the brep.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void StandardizeFaceSurfaces()
Public Sub StandardizeFaceSurfaces
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace