RhinoCommon API
RhinoApp.LoginToCloudZoo Method
 Logs in to the cloud zoo.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool LoginToCloudZoo()
Public Shared Function LoginToCloudZoo As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoApp.LoginToCloudZoo"]
Version Information
Rhino for Windows
Supported in: 6.10
See Also
Reference
RhinoApp Class
Rhino Namespace