RhinoCommon SDK
ContentUndoHelper.ModifyContent Method
 Call this before modifying or deleting a content. Undo will cause the content to be restored.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ModifyContent(
	RenderContent content
)
Public Function ModifyContent (
	content As RenderContent
) As Boolean
Parameters
content
Type: Rhino.Render.RenderContent
Content you are about to modify.
Return Value
Type: Boolean
true if the content was modified.
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
ContentUndoHelper Class
Rhino.Render Namespace