RhinoCommon SDK
Thumbnail.Dib Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.Dib(System.Drawing.Bitmap@)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dib(
	ref Bitmap dibOut
)
Public Sub Dib (
	ByRef dibOut As Bitmap
)
Parameters
dibOut
Type: System.Drawing.Bitmap
[Missing <param name="dibOut"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.Thumbnail.Dib(System.Drawing.Bitmap@)"]
Implements
IRhRdkThumbnail.Dib(Bitmap)
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace