RhinoCommon SDK
ArchivableDictionary Constructor (UserData)
Initializes an instance of a dictionary for writing to a 3dm archive
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ArchivableDictionary(
	UserData parentUserData
)
Public Sub New (
	parentUserData As UserData
)
Parameters
parentUserData
Type: Rhino.DocObjects.Custom.UserData
 parent user data if this dictionary is associated with user data
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ArchivableDictionary Class
ArchivableDictionary Overload
Rhino.Collections Namespace