RhinoCommon SDK
LinearDimension Methods
The LinearDimension type exposes the following members.
Methods
Name | Description
Create
 Initialize Dimension parameters
In Rhino for Windows, this member is overridden by Dispose(Boolean).
FromPoints
 Initializes a new instance of the LinearDimension class, based on three points.
Get3dPoints
 Get locations of dimension's 3d points
GetDisplayLines
GetDistanceDisplayText
GetTextRectangle
In Rhino for Windows, this member is overridden by NonConstOperation().
SetLocations
 Sets the three locations of the point, using two-dimensional points that refer to the plane of the annotation.
Top
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace