RhinoCommon SDK
IPanelsService Methods
The IPanelsService type exposes the following members.
Methods
Name | Description
ChangePanelIcon
ClosePanel
GetOpenPanelIds
GetPanel(Guid)
GetPanel(Guid, UInt32)
IsPanelVisible(Guid)
IsPanelVisible(Guid, Boolean)
OpenPanel(Guid)
OpenPanel(Guid, Guid)
OpenPanel(Guid, Boolean)
OpenPanel(Guid, Guid, Boolean)
OpenPanelAsSibling(Guid, Guid)
OpenPanelAsSibling(Guid, Guid, Boolean)
PanelDockBar
RegisterPanel
Top
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace