RhinoCommon SDK
CustomRenderMeshProvider2 Methods
The CustomRenderMeshProvider2 type exposes the following members.
Methods
Name | Description
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes)
BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean) |  (Overrides CustomRenderMeshProvider.BoundingBox(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean).)
BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, DisplayPipelineAttributes)
BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, Boolean) |  (Overrides CustomRenderMeshProvider.BuildCustomMeshes(ViewportInfo, RhinoDoc, RenderPrimitiveList, Guid, Boolean).)
WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, DisplayPipelineAttributes)
WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean) |  (Overrides CustomRenderMeshProvider.WillBuildCustomMeshes(ViewportInfo, RhinoObject, RhinoDoc, Guid, Boolean).)
Top
See Also
Reference
CustomRenderMeshProvider2 Class
Rhino.Render Namespace