RhinoCommon API
OrdinateDimension Methods
The OrdinateDimension type exposes the following members.
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
In Rhino for Windows, this member is overridden by Dispose(Boolean).
Get3dPoints
 Get locations of dimension's 3d points
In Rhino for Windows, this member is overridden by GetBoundingBox(Transform).
GetDisplayLines
GetDistanceDisplayText
GetTextRectangle
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace