RhinoCommon SDK
ClippingPlaneSurface Methods
The ClippingPlaneSurface type exposes the following members.
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
ViewportIds
 Returns Ids of viewports that this clipping plane is supposed to clip.
Top
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace