RhinoCommon API
ComponentFunctionInfo Methods
The ComponentFunctionInfo type exposes the following members.
Methods
Name | Description
Evaluate
 Evaluates the component with a set of arguments. There needs to be an argument for each input param, and each output param gives an entry in the output array.
EvaluateSilenceWarnings
 Infrastructure method that simplifies output and performs warning checks.
EvaluateTreeSilenceWarnings
 Infrastructure method that simplifies output and performs warning checks.
EvaluateTreeWithWarningsAsErrors
 Infrastructure method that simplifies output and performs warning checks.
EvaluateWithWarningsAsErrors
 Infrastructure method that simplifies output and performs warning checks.
SimplifyTreeOutput
 Performs list logical reduction when trees are not used.
ToString
 Returns a string representing this function.
 (Overrides Object.ToString().)
Top
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace