RhinoCommon SDK
IRhinoUiDialogService Methods
The IRhinoUiDialogService type exposes the following members.
Methods
Name | Description
ShowCheckListBox
ShowComboListBox
ShowEditBox
ShowListBox
ShowNumberBox
Top
See Also
Reference
IRhinoUiDialogService Interface
Rhino.UI Namespace