RhinoCommon SDK
SurfaceProxy Methods
The SurfaceProxy type exposes the following members.
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
See Also
Reference
SurfaceProxy Class
Rhino.Geometry Namespace