RhinoCommon SDK
LengthValue Methods
The LengthValue type exposes the following members.
Methods
Name | Description
ChangeLength
 Changes the numeric value in a LengthValue and leaves all of the other info unchanged UnitSystem, ParseSettings and StringFormat stay as they were
ChangeUnitSystem
 Change the UnitSystem of a LengthValue The numeric value of Length is scaled by new_us / current unit system so that the absolute length stays the same
Create(Double, UnitSystem, LengthValue.StringFormat)
Create from Length and UnitSystem
Create(String, StringParserSettings, Boolean)
 Create from string
Create(Double, UnitSystem, LengthValue.StringFormat, UInt32)
Create from Length and UnitSystem
Dispose
actively reclaim native allocated ON_LenghtValue*
Finalize
passively reclaim native allocated ON_LenghtValue*
 (Overrides Object.Finalize().)
IsUnset
 Test IsUnset
Length()
 Length value in this instance's current unit system
Length(UnitSystem)
 Length value in a given unit system
Top
See Also
Reference
LengthValue Class
Rhino Namespace