RhinoCommon SDK
AngularDimension Methods
The AngularDimension type exposes the following members.
Methods
Name | Description
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
Create(Guid, Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
Create(DimensionStyle, Plane, Vector3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
In Rhino for Windows, this member is overridden by Dispose(Boolean).
Get3dPoints
 Get locations of dimension's 3d points
GetAngleDisplayText
GetDisplayLines
GetTextRectangle
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace