RhinoCommon API
InstanceDefinition.CreatePreviewBitmap Method
Overload List
Name | Description
CreatePreviewBitmap(DefinedViewportProjection, Size)
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size)
CreatePreviewBitmap(DefinedViewportProjection, Size, Boolean)
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size, Boolean)
Top
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace