RhinoCommon SDK
ObjectTable.AddInstanceObject Method
Overload List
Name | Description
AddInstanceObject(Int32, Transform)
AddInstanceObject(Int32, Transform, ObjectAttributes)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace