RhinoCommon SDK
Material Constructor
Overload List
Name | Description
Material()
Initializes a new instance of the Material class
Material(Material)
Initializes a new instance of the Material class
Material(SerializationInfo, StreamingContext)
Initializes a new instance of the Material class
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace