RhinoCommon SDK
File3dmNamedConstructionPlanes.Delete Method
Overload List
Name | Description
Delete(Int32)
 Remove a named construction plane from the table.
Delete(ConstructionPlane)
 Deletes a named construction plane from the table.
Top
See Also
Reference
File3dmNamedConstructionPlanes Class
Rhino.FileIO Namespace