RhinoCommon SDK
LinetypeTable.Find Method
Overload List
Name | Description
Find(String)
Finds the linetype with a given name.
Find(Guid, Boolean)
Finds a linetype with a matching ID.
Find(String, Boolean)
Obsolete. Use the other overload.
Top
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace