RhinoCommon API
Mesh.CreatePatch Method
Overload List
Name | Description
CreatePatch(Curve, Double, Surface, IEnumerable<Curve>, IEnumerable<Curve>, IEnumerable<Point3d>, Boolean, Int32)
 Construct a mesh patch from a variety of input geometry.
CreatePatch(Polyline, Double, Surface, IEnumerable<Curve>, IEnumerable<Curve>, IEnumerable<Point3d>, Boolean, Int32)
 Construct a mesh patch from a variety of input geometry.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace