RhinoCommon SDK
SweepOneRail.IsRoadlikeTop Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsRoadlikeTop"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsRoadlikeTop { get; }
Public ReadOnly Property IsRoadlikeTop As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace