RhinoCommon API
CommandLineOption.Index Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.CommandLineOption.Index"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace