RhinoCommon SDK
Point4d.Z Property
 Gets or sets the Z (third) coordinate of this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Z { get; set; }
Public Property Z As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace