RhinoCommon API
AnimationProperties.StartHour Property
 Gets or sets the start hour for seasonal/one day sun animation in the range 0 to 23.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int StartHour { get; set; }
Public Property StartHour As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace