RhinoCommon API
AnnotationBase.RichText Property
 Text including additional RTF formatting information
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string RichText { get; set; }
Public Property RichText As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.15
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace