RhinoCommon API
MaterialRef.PlugInId Property
 Identifies a rendering plug-in
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid PlugInId { get; }
Public ReadOnly Property PlugInId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace