RhinoCommon API
DisplayPipelineAttributes.LockedObjectsDrawBehindOthers Property
Locked object are drawn behind other objects
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool LockedObjectsDrawBehindOthers { get; set; }
Public Property LockedObjectsDrawBehindOthers As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace