RhinoCommon API
File3dmSettings.ModelBasepoint Property
 Gets or sets the model basepoint that is used when the file is read as an instance definition.
This point is mapped to the origin in the instance definition.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ModelBasepoint { get; set; }
Public Property ModelBasepoint As Point3d
	Get
	Set
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace