RhinoCommon SDK
StackedDialogPage.NavigationTextColor Property
 Currently only used by Windows Rhino. If this is set to true then the tree control item text be drawn using this color. Set the color to System.Drawing.Color.Empty to use the default color.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color NavigationTextColor { get; set; }
Public Property NavigationTextColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace