RhinoCommon API
RhinoDoc.TemplateFileUsed Property
 name of the template file used to create this document. This is a runtime value only present if the document was newly created.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string TemplateFileUsed { get; }
Public ReadOnly Property TemplateFileUsed As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
RhinoDoc Class
Rhino Namespace