RhinoCommon API
OptionColor.InitialValue Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionColor.InitialValue"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color InitialValue { get; }
Public ReadOnly Property InitialValue As Color
	Get
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace