RhinoCommon SDK
Transform.Unset Property
 Gets an XForm filled with RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Transform Unset { get; }
Public Shared ReadOnly Property Unset As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Transform Structure
Rhino.Geometry Namespace