RhinoCommon API
TwoColorRenderTexture.Color2 Property
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.Color2"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color4f Color2 { get; set; }
Public Property Color2 As Color4f
	Get
	Set
Property Value
Type: Color4f
Version Information
Rhino for Windows
Supported in: 6.20
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace