RhinoCommon API
File3dm.HatchPatterns Property
 Hatch patterns in this file
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IList<HatchPattern> HatchPatterns { get; }
Public ReadOnly Property HatchPatterns As IList(Of HatchPattern)
	Get
Property Value
Type: IList<HatchPattern>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.9
See Also
Reference
File3dm Class
Rhino.FileIO Namespace