RhinoCommon API
Transform.M12 Property
Gets or sets this[1,2].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M12 { get; set; }
Public Property M12 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Transform Structure
Rhino.Geometry Namespace