RhinoCommon API
ModelAidSettings.MousePickboxRadius Property
radius of mouse pick box in pixels.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int MousePickboxRadius { get; set; }
Public Shared Property MousePickboxRadius As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace