RhinoCommon SDK
File3dm.Objects Property
 Gets access to the File3dmObjectTable class associated with this file, which contains all objects.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmObjectTable Objects { get; }
Public ReadOnly Property Objects As File3dmObjectTable
	Get
Property Value
Type: File3dmObjectTable
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace