RhinoCommon SDK
RealtimeDisplayModeClassInfo.Name Property
 Get human-facing class description for RealtimeDisplayMode implementation. This string might show up in the Rhino UI.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract string Name { get; }
Public MustOverride ReadOnly Property Name As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace