RhinoCommon SDK
GumballAppearanceSettings.MenuSize Property
Radius of menu circle.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MenuSize { get; set; }
Public Property MenuSize As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace