RhinoCommon SDK
RenderWindow.ImageAdjust.Gamma Property
 Set the gamma value. The inverse of this will be used to apply gamma correction to the RenderWindow RGBA channel when necessary.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float Gamma { get; set; }
Public Property Gamma As Single
	Get
	Set
Property Value
Type: Single
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderWindow.ImageAdjust Class
Rhino.Render Namespace