RhinoCommon API
ModelAidSettings.NudgeKeyStep Property
Gets or sets the nudge step amount.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double NudgeKeyStep { get; set; }
Public Shared Property NudgeKeyStep As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace