RhinoCommon SDK
Light.IsEnabled Property
 Gets or sets a value that defines if the light is turned on (true) or off (false).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsEnabled { get; set; }
Public Property IsEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Light Class
Rhino.Geometry Namespace