RhinoCommon API
ObjectEnumeratorSettings.ClassTypeFilter Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.ClassTypeFilter"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Type ClassTypeFilter { get; set; }
Public Property ClassTypeFilter As Type
	Get
	Set
Property Value
Type: Type
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace