RhinoCommon SDK
DisplayPipelineAttributes.XrayAllObjects Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.XrayAllObjects"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool XrayAllObjects { get; set; }
Public Property XrayAllObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace