RhinoCommon API
MeshPoint.Mesh Property
 The mesh that is ralated to this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh Mesh { get; }
Public ReadOnly Property Mesh As Mesh
	Get
Property Value
Type: Mesh
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace