RhinoCommon API
RhinoApp.ExeVersion Property
 Major version of Rhino executable 4, 5, ...
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int ExeVersion { get; }
Public Shared ReadOnly Property ExeVersion As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
RhinoApp Class
Rhino Namespace