RhinoCommon API
ComponentFunctionInfo.Namespace Property
 The function namespace.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Namespace { get; }
Public ReadOnly Property Namespace As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.10
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace