RhinoCommon API
ObjectPropertiesPage.EnglishPageTitle Property
 English string used to describe this page
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract string EnglishPageTitle { get; }
Public MustOverride ReadOnly Property EnglishPageTitle As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace