RhinoCommon API
Light.PowerLumens Property
 Gets or sets the light power in lumens (lm).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PowerLumens { get; set; }
Public Property PowerLumens As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
Light Class
Rhino.Geometry Namespace