RhinoCommon API
DimensionStyle.TextMoveLeader Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextMoveLeader"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int TextMoveLeader { get; set; }
Public Property TextMoveLeader As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.8
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace