RhinoCommon API
ArchivableDictionary.Item Property
 Gets the value associated with the specified key.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Object this[
	string key
] { get; }
Public ReadOnly Default Property Item (
	key As String
) As Object
	Get
Parameters
key
Type: System.String
The key of the value to get or set.
Return Value
Type: Object
 The value associated with the specified key. If the specified key is not found, a get operation throws a KeyNotFoundException.
Exceptions
Exception | Condition
ArgumentNullException | If the key is null.
KeyNotFoundException | If the key is not found.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace