RhinoCommon API
FileSettingsState.FileLockingEnabled Property
Ensures that only one person at a time can have a file open for saving.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool FileLockingEnabled { get; set; }
Public Property FileLockingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace