RhinoCommon SDK
Arc.EndAngleDegrees Property
 Gets or sets the end angle (in Radians) for this arc segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double EndAngleDegrees { get; set; }
Public Property EndAngleDegrees As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Arc Structure
Rhino.Geometry Namespace