RhinoCommon SDK
DimensionStyle.ToleranceResolution Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ToleranceResolution"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ToleranceResolution { get; set; }
Public Property ToleranceResolution As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace