RhinoCommon API
RhinoViewport.CameraDirection Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.CameraDirection"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CameraDirection { get; }
Public ReadOnly Property CameraDirection As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace