RhinoCommon SDK
BinaryArchiveWriter.WriteErrorOccured Property
 Gets or sets whether an error occurred.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WriteErrorOccured { get; set; }
Public Property WriteErrorOccured As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace