RhinoCommon SDK
UndoRedoEventArgs.UndoSerialNumber Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.UndoSerialNumber"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint UndoSerialNumber { get; }
Public ReadOnly Property UndoSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace