RhinoCommon SDK
MeshPart.TriangleCount Property
[Missing <summary> documentation for "P:Rhino.Geometry.MeshPart.TriangleCount"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int TriangleCount { get; }
Public ReadOnly Property TriangleCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace