RhinoCommon API
AnimationProperties.StartMonth Property
 Gets or sets the start month for seasonal/one day sun animation in the range 1 to 12.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int StartMonth { get; set; }
Public Property StartMonth As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace