RhinoCommon API
SimpleArrayExtrusionPointer.Count Property
 Gets the amount of Extrusions in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.11
See Also
Reference
SimpleArrayExtrusionPointer Class
Rhino.Runtime.InteropWrappers Namespace