RhinoCommon API
ViewportInfo.FrustumMaximumDiameter Property
 Gets the frustum maximum diameter, or the maximum between FrustumWidth and FrustumHeight.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FrustumMaximumDiameter { get; }
Public ReadOnly Property FrustumMaximumDiameter As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace