RhinoCommon API
FileSettingsState.FileLockingOpenWarning Property
Displays an information dialog which identifies computer file is open on.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool FileLockingOpenWarning { get; set; }
Public Property FileLockingOpenWarning As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace