RhinoCommon SDK
RenderSettings.UseHiddenLights Property
 Gets or sets a value indicating whether to render using lights that are on layers that are off.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseHiddenLights { get; set; }
Public Property UseHiddenLights As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderSettings Class
Rhino.Render Namespace