RhinoCommon API
Cylinder.BasePlane Property
 Gets or sets the base plane of the cylinder.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane BasePlane { get; set; }
Public Property BasePlane As Plane
	Get
	Set
Property Value
Type: Plane
Version Information
Rhino for Windows
Supported in: 6.12
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace