RhinoCommon SDK
Extrusion.IsSolid Property
 Gets a value indicating whether there is no gap among all surfaces constructing this object.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool IsSolid { get; }
Public Overrides ReadOnly Property IsSolid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace