RhinoCommon SDK
DisplayPipelineAttributes.ObjectColor Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ObjectColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ObjectColor { get; set; }
Public Property ObjectColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace