RhinoCommon SDK
DimensionStyle.ScaleLeftLengthMillimeters Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ScaleLeftLengthMillimeters"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ScaleLeftLengthMillimeters { get; set; }
Public Property ScaleLeftLengthMillimeters As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace