RhinoCommon SDK
ReduceMeshParameters.CancelToken Property
[Missing <summary> documentation for "P:Rhino.Geometry.ReduceMeshParameters.CancelToken"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CancellationToken CancelToken { get; set; }
Public Property CancelToken As CancellationToken
	Get
	Set
Property Value
Type: CancellationToken
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace