RhinoCommon API
SmartTrackSettings.TanPerpLineColor Property
Gets or sets the tangent and perpendicular line color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color TanPerpLineColor { get; set; }
Public Shared Property TanPerpLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace