RhinoCommon API
ZooClientParameters.OnLeaseChanged Property
 Delegate called by ZooClient when a cloud zoo lease is changed
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public OnLeaseChangedDelegate OnLeaseChanged { get; }
Public ReadOnly Property OnLeaseChanged As OnLeaseChangedDelegate
	Get
Property Value
Type: OnLeaseChangedDelegate
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
ZooClientParameters Class
Rhino.Runtime Namespace