RhinoCommon API
IWindow.Created Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IWindow.Created"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool Created { get; }
ReadOnly Property Created As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.9
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace