RhinoCommon SDK
ViewCapture.Width Property
 Width of capture in Pixels
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Width { get; set; }
Public Property Width As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewCapture Class
Rhino.Display Namespace