RhinoCommon API
AppearanceSettingsState.GridThinLineColor Property
Gets or sets the color of the thin line in the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color GridThinLineColor { get; set; }
Public Property GridThinLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace