RhinoCommon SDK
Vector3d.YAxis Property
 Gets the value of the vector with components 0,1,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3d YAxis { get; }
Public Shared ReadOnly Property YAxis As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace