RhinoCommon API
ComponentFunctionInfo.Name Property
 The function name.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.8
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace