RhinoCommon SDK
ViewportInfo.CameraAngle Property
 Gets or sets the 1/2 smallest angle. See GetCameraAngles(Double, Double, Double) for more information.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double CameraAngle { get; set; }
Public Property CameraAngle As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace