RhinoCommon SDK
LinetypeTable.Count Property
 Returns number of linetypes in the linetypes table, including deleted linetypes.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace