RhinoCommon API
Quaternion.C Property
 Gets or sets the second imaginary coefficient of the quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double C { get; set; }
Public Property C As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace