RhinoCommon SDK
DimensionStyle.TextOrientation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextOrientation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextOrientation TextOrientation { get; set; }
Public Property TextOrientation As TextOrientation
	Get
	Set
Property Value
Type: TextOrientation
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace