RhinoCommon API
ObjectEnumeratorSettings.IdefObjects Property
 When true, ONLY Instance Definitions will be returned
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IdefObjects { get; set; }
Public Property IdefObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace