RhinoCommon SDK
ReduceMeshParameters.FaceTags Property
[Missing <summary> documentation for "P:Rhino.Geometry.ReduceMeshParameters.FaceTags"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] FaceTags { get; set; }
Public Property FaceTags As Integer()
	Get
	Set
Property Value
Type: Int32[]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace