RhinoCommon API
DisplayModeDescription.TechId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.TechId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid TechId { get; }
Public Shared ReadOnly Property TechId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.7
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace