RhinoCommon API
ViewSettings.SingleClickMaximize Property
 Gets or sets the 'single-click maximize' value.
When true, maximizing a viewport needs a single click on the viewport title rather than a double-click.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SingleClickMaximize { get; set; }
Public Shared Property SingleClickMaximize As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace