RhinoCommon SDK
MaterialRefCreateParams.PlugInId Property
 Identifies a rendering plug-in
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid PlugInId { get; set; }
Public Property PlugInId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace