RhinoCommon SDK
RenderContent.Parent Property
 Returns the top content in this parent/child chain.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent Parent { get; }
Public ReadOnly Property Parent As RenderContent
	Get
Property Value
Type: RenderContent
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderContent Class
Rhino.Render Namespace