RhinoCommon SDK
FileObjReadOptions.MapYtoZ Property
 Setting to transform OBJ's Y axis to Rhino's Z axis
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MapYtoZ { get; set; }
Public Property MapYtoZ As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace