RhinoCommon API
Vector3d.Zero Property
 Gets the value of the vector with components 0,0,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3d Zero { get; }
Public Shared ReadOnly Property Zero As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace