RhinoCommon API
Command.CommandContextHelpUrl Property
 Gets the URL of the command contextual help. This is usually a location of a local CHM file.
The default implementation return an empty string.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual string CommandContextHelpUrl { get; }
Protected Overridable ReadOnly Property CommandContextHelpUrl As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Command Class
Rhino.Commands Namespace