RhinoCommon SDK
Point3d.IsValid Property
 Each coordinate of the point must pass the IsValidDouble(Double) test.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace