RhinoCommon SDK
GripObject.CurrentLocation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.GripObject.CurrentLocation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d CurrentLocation { get; set; }
Public Property CurrentLocation As Point3d
	Get
	Set
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace