RhinoCommon SDK
BoundingBox.Empty Property
 Gets an [Empty] boundingbox. An Empty box is an invalid structure that has negative width.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static BoundingBox Empty { get; }
Public Shared ReadOnly Property Empty As BoundingBox
	Get
Property Value
Type: BoundingBox
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace