RhinoCommon SDK
SimulatedTexture.Rotation Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.Rotation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Rotation { get; set; }
Public Property Rotation As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace