RhinoCommon API
Font.IsEngravingFont Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.IsEngravingFont"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsEngravingFont { get; }
Public ReadOnly Property IsEngravingFont As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
Font Class
Rhino.DocObjects Namespace