RhinoCommon SDK
RealtimeDisplayMode.InitFramebufferEventArgs.Pipeline Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.InitFramebufferEventArgs.Pipeline"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipeline Pipeline { get; }
Public ReadOnly Property Pipeline As DisplayPipeline
	Get
Property Value
Type: DisplayPipeline
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RealtimeDisplayMode.InitFramebufferEventArgs Class
Rhino.Render Namespace