RhinoCommon SDK
FilePdfEventArgs.Pdf Property
 The document that is about to be written
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FilePdf Pdf { get; }
Public ReadOnly Property Pdf As FilePdf
	Get
Property Value
Type: FilePdf
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FilePdfEventArgs Class
Rhino.FileIO Namespace