RhinoCommon SDK
CustomRenderContentAttribute.IsElevated Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.IsElevated"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsElevated { get; set; }
Public Property IsElevated As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace