RhinoCommon SDK
Vector3f.ZAxis Property
 Gets the value of the vector with components 0,0,1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3f ZAxis { get; }
Public Shared ReadOnly Property ZAxis As Vector3f
	Get
Property Value
Type: Vector3f
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace