RhinoCommon SDK
GumballAppearanceSettings.PlanarTranslationGripSize Property
in pixels.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int PlanarTranslationGripSize { get; set; }
Public Property PlanarTranslationGripSize As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace