RhinoCommon API
AnnotationBase.TextRotationRadians Property
 Rotation of text in radians
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TextRotationRadians { get; set; }
Public Property TextRotationRadians As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace