RhinoCommon SDK
DrawEventArgs.RhinoDoc Property
[Missing <summary> documentation for "P:Rhino.Display.DrawEventArgs.RhinoDoc"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc RhinoDoc { get; }
Public ReadOnly Property RhinoDoc As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DrawEventArgs Class
Rhino.Display Namespace