RhinoCommon SDK
PanelEventArgs.PanelId Property
 Class Id for panel being shown or hidden
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid PanelId { get; }
Public ReadOnly Property PanelId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PanelEventArgs Class
Rhino.UI Namespace