RhinoCommon SDK
RhinoViewport.WallpaperVisible Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.WallpaperVisible"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WallpaperVisible { get; }
Public ReadOnly Property WallpaperVisible As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace