RhinoCommon SDK
EarthAnchorPoint.Name Property
 Gets or sets the short form of the identifying information about this location.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace