RhinoCommon API
BezierCurve.Dimension Property
 Dimension of Bezier
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Dimension { get; }
Public ReadOnly Property Dimension As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.12
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace