RhinoCommon SDK
Extrusion.IsCappedAtTop Property
 Gets a value indicating whether the surface that fills the top profile is existing.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCappedAtTop { get; }
Public ReadOnly Property IsCappedAtTop As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace