RhinoCommon API
OpenFileDialog.DefaultExt Property
 The default file name extension. The returned string does not include the period.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string DefaultExt { get; set; }
Public Property DefaultExt As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace