RhinoCommon API
PointCloud.ContainsColors Property
 Gets a value indicating whether or not the points in this pointcloud have colors assigned to them.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ContainsColors { get; }
Public ReadOnly Property ContainsColors As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace