RhinoCommon SDK
ViewportInfo.FrustumNear Property
 Gets the frustum near-cutting value.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FrustumNear { get; }
Public ReadOnly Property FrustumNear As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace