RhinoCommon SDK
Light.IsSunLight Property
 Gets a value indicating whether this object is a Sun light.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSunLight { get; }
Public ReadOnly Property IsSunLight As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Light Class
Rhino.Geometry Namespace