RhinoCommon SDK
SweepOneRail.IsRoadlike Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsRoadlike"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsRoadlike { get; }
Public ReadOnly Property IsRoadlike As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace