RhinoCommon SDK
RenderSettings.FlatShade Property
 Gets or sets a value indicating whether to render using flat shading.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool FlatShade { get; set; }
Public Property FlatShade As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderSettings Class
Rhino.Render Namespace