RhinoCommon API
Texture.UvwTransform Property
 Transform to be applied to each instance of this texture if ApplyUvw is true
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform UvwTransform { get; set; }
Public Property UvwTransform As Transform
	Get
	Set
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
Texture Class
Rhino.DocObjects Namespace