RhinoCommon SDK
ObjectPropertiesPage.LocalPageTitle Property
 Localized page description string, returns the EnglishPageTitle by default.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual string LocalPageTitle { get; }
Public Overridable ReadOnly Property LocalPageTitle As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace