RhinoCommon API
ConstructionPlane.Plane Property
 Gets or sets the geometric plane to use for construction.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace