RhinoCommon API
GumballDisplayConduit.InRelocate Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballDisplayConduit.InRelocate"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool InRelocate { get; }
Public ReadOnly Property InRelocate As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace