RhinoCommon SDK
CustomObjectGrips.GripCount Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.CustomObjectGrips.GripCount"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GripCount { get; }
Public ReadOnly Property GripCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace