RhinoCommon SDK
AnnotationBase.MaskColor Property
 Color to use for drawing a text mask when it is enabled. If the mask is enabled and MaskColor is System.Drawing.Color.Transparent, then the viewport's color will be used for the MaskColor
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color MaskColor { get; set; }
Public Property MaskColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace