RhinoCommon API
StackedDialogPage.ShowDefaultsButton Property
Called when this page is activated.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool ShowDefaultsButton { get; }
Public Overridable ReadOnly Property ShowDefaultsButton As Boolean
	Get
Return Value
Type: Boolean
 true : if the page wants the "Defaults" button to appear. false : if the page does not want the "Defaults" button to appear. Default returns false Note: returning false implies that OnDefaults() method will never get called.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace