RhinoCommon SDK
FileWriteOptions.Xform Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.Xform"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform Xform { get; set; }
Public Property Xform As Transform
	Get
	Set
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace