RhinoCommon SDK
PreviewLighting.CppPointer Property
 CppPointer for PreivewLighting
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PreviewLighting Class
Rhino.Render Namespace