RhinoCommon API
SmartTrackSettings.SmartTangents Property
Gets or sets a value indicating if the 'Smart Tangents' feature is active.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SmartTangents { get; set; }
Public Shared Property SmartTangents As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
SmartTrackSettings Class
Rhino.ApplicationSettings Namespace