RhinoCommon SDK
Point2d.MaximumCoordinate Property
 Gets the largest valid coordinate, or RhinoMath.UnsetValue if no coordinate is valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MaximumCoordinate { get; }
Public ReadOnly Property MaximumCoordinate As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace