RhinoCommon API
Toolbar.Name Property
[Missing <summary> documentation for "P:Rhino.UI.Toolbar.Name"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
Toolbar Class
Rhino.UI Namespace