RhinoCommon API
LinearDimension.ExtensionLine1End Property
 End of the first extension line.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d ExtensionLine1End { get; }
Public ReadOnly Property ExtensionLine1End As Point2d
	Get
Property Value
Type: Point2d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace