RhinoCommon API
DisplayPipelineAttributes.ContextForDraw Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ContextForDraw"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipelineAttributes.ContextsForDraw ContextForDraw { get; }
Public ReadOnly Property ContextForDraw As DisplayPipelineAttributes.ContextsForDraw
	Get
Property Value
Type: DisplayPipelineAttributes.ContextsForDraw
Version Information
Rhino for Windows
Supported in: 6.6
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace