RhinoCommon SDK
Box.Unset Property
 Gets a Box whose base plane and axis dimensions are all Unset.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Box Unset { get; }
Public Shared ReadOnly Property Unset As Box
	Get
Property Value
Type: Box
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Box Structure
Rhino.Geometry Namespace