RhinoCommon SDK
Point2d.Origin Property
 Gets a point at 0,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point2d Origin { get; }
Public Shared ReadOnly Property Origin As Point2d
	Get
Property Value
Type: Point2d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace