RhinoCommon API
ViewportInfo.CameraZ Property
 Gets the unit vector in -CameraDirection.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CameraZ { get; }
Public ReadOnly Property CameraZ As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace