RhinoCommon API
ColorHSV.V Property
 Gets or sets the value (brightness) channel value. Value channels are limited to a 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double V { get; set; }
Public Property V As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.8
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace