RhinoCommon API
MeshExtruder.FaceDirectionMode Property
 Face direction mode determines how faces are oriented
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshExtruderFaceDirectionMode FaceDirectionMode { get; set; }
Public Property FaceDirectionMode As MeshExtruderFaceDirectionMode
	Get
	Set
Property Value
Type: MeshExtruderFaceDirectionMode
Version Information
Rhino for Windows
Supported in: 6.8
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace