RhinoCommon API
Extrusion.IsMiteredAtEnd Property
 Gets a value indicating whether a miter plane at the end is defined.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsMiteredAtEnd { get; }
Public ReadOnly Property IsMiteredAtEnd As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace