RhinoCommon SDK
ShutLiningCurveInfo.Pull Property
 True if the curve should be pulled.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Pull { get; }
Public ReadOnly Property Pull As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace