RhinoCommon API
CursorTooltipSettingsState.PointPane Property
 Displays the current construction plane coordinates.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool PointPane { get; set; }
Public Property PointPane As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace