RhinoCommon SDK
DimensionStyle.AlternateSuffix Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateSuffix"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string AlternateSuffix { get; set; }
Public Property AlternateSuffix As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace