RhinoCommon SDK
GumballDisplayConduit.TotalTransform Property
 The total transformation is GumballTransform * PreTransform.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform TotalTransform { get; }
Public ReadOnly Property TotalTransform As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace