RhinoCommon API
RefinementSettings.Level Property
 The level of subdivision to achieve.
 Namespace: Rhino.Geometry.MeshRefinements
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Level { get; set; }
Public Property Level As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.6
See Also
Reference
RefinementSettings Class
Rhino.Geometry.MeshRefinements Namespace