RhinoCommon API
DimensionStyle.CentermarkSize Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.CentermarkSize"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double CentermarkSize { get; set; }
Public Property CentermarkSize As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.12
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace