RhinoCommon SDK
Dimension.SuppressExtension2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.SuppressExtension2"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SuppressExtension2 { get; set; }
Public Property SuppressExtension2 As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Dimension Class
Rhino.Geometry Namespace