RhinoCommon SDK
CollapsibleSectionImpl.CppPointer Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.CollapsibleSectionImpl.CppPointer"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace