RhinoCommon API
DimensionStyle.TextHeight Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextHeight"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TextHeight { get; set; }
Public Property TextHeight As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace