RhinoCommon SDK
EarthAnchorPoint.ModelBasePoint Property
Corresponding model point in model coordinates.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ModelBasePoint { get; set; }
Public Property ModelBasePoint As Point3d
	Get
	Set
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace