RhinoCommon API
NameHash.Sha1Hash Property
 Gets the 20-bytes long SHA-1 hash of ordinal minimum mapped unicode (UTF-32) code points.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public byte[] Sha1Hash { get; }
Public ReadOnly Property Sha1Hash As Byte()
	Get
Property Value
Type: Byte[]
Version Information
Rhino for Windows
Supported in: 6.12
See Also
Reference
NameHash Class
Rhino.FileIO Namespace