RhinoCommon SDK
LocalizeStringPair.Local Property
[Missing <summary> documentation for "P:Rhino.UI.LocalizeStringPair.Local"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Local { get; }
Public ReadOnly Property Local As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
LocalizeStringPair Class
Rhino.UI Namespace