RhinoCommon API
DetailView.IsParallelProjection Property
 Gets or sets whether the view is parallel.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsParallelProjection { get; set; }
Public Property IsParallelProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
DetailView Class
Rhino.Geometry Namespace