RhinoCommon SDK
MeshPart.StartFaceIndex Property
Start of subinterval of parent mesh face array
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int StartFaceIndex { get; }
Public ReadOnly Property StartFaceIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace