RhinoCommon API
Brep.Curves3D Property
 Pointers to 3d curves (used by edges)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepCurveList Curves3D { get; }
Public ReadOnly Property Curves3D As BrepCurveList
	Get
Property Value
Type: BrepCurveList
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
Brep Class
Rhino.Geometry Namespace