RhinoCommon API
File3dmLinetypeTable.ComponentType Property
 Returns LinePattern.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
Version Information
Rhino for Windows
Supported in: 6.9
See Also
Reference
File3dmLinetypeTable Class
Rhino.FileIO Namespace