RhinoCommon API
AngularDimension.DefPoint2 Property
[Missing <summary> documentation for "P:Rhino.Geometry.AngularDimension.DefPoint2"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d DefPoint2 { get; set; }
Public Property DefPoint2 As Point2d
	Get
	Set
Property Value
Type: Point2d
Version Information
Rhino for Windows
Supported in: 6.11
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace