RhinoCommon API
ICollapsibleSectionHolder.Sections Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSectionHolder.Sections"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IEnumerable<ICollapsibleSection> Sections { get; }
ReadOnly Property Sections As IEnumerable(Of ICollapsibleSection)
	Get
Property Value
Type: IEnumerable<ICollapsibleSection>
Version Information
Rhino for Windows
Supported in: 6.15
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace