RhinoCommon API
AnimationProperties.Images Property
 Gets or sets the full path to the saved frames of an animation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] Images { get; set; }
Public Property Images As String()
	Get
	Set
Property Value
Type: String[]
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace