RhinoCommon API
Material.DiffuseColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.DiffuseColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color DiffuseColor { get; set; }
Public Property DiffuseColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Material Class
Rhino.DocObjects Namespace