RhinoCommon SDK
Torus.MajorRadius Property
 Gets or sets the radius of the circle that lies at the heart of the torus.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MajorRadius { get; set; }
Public Property MajorRadius As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Torus Structure
Rhino.Geometry Namespace