RhinoCommon SDK
ObjectAttributes.PlotWeightSource Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectAttributes.PlotWeightSource"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectPlotWeightSource PlotWeightSource { get; set; }
Public Property PlotWeightSource As ObjectPlotWeightSource
	Get
	Set
Property Value
Type: ObjectPlotWeightSource
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace