RhinoCommon API
SimulatedTexture.ProjectionMode Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.ProjectionMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimulatedTexture.ProjectionModes ProjectionMode { get; set; }
Public Property ProjectionMode As SimulatedTexture.ProjectionModes
	Get
	Set
Property Value
Type: SimulatedTexture.ProjectionModes
Version Information
Rhino for Windows
Supported in: 6.9
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace