RhinoCommon API
AnimationProperties.CaptureMethod Property
 Gets or sets the capture method of the animation which is either preview or full.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string CaptureMethod { get; set; }
Public Property CaptureMethod As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace