RhinoCommon API
DimensionStyle.FixedExtensionOn Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.FixedExtensionOn"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool FixedExtensionOn { get; set; }
Public Property FixedExtensionOn As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace