RhinoCommon SDK
CustomUndoEventArgs.CreatedByRedo Property
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.CreatedByRedo"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CreatedByRedo { get; }
Public ReadOnly Property CreatedByRedo As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace