RhinoCommon API
MeshPoint.ComponentIndex Property
 Gets the component index of the intersecting element in the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ComponentIndex ComponentIndex { get; }
Public ReadOnly Property ComponentIndex As ComponentIndex
	Get
Property Value
Type: ComponentIndex
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace