RhinoCommon API
AnimationProperties.EndHour Property
 Gets or sets the end hour for one day sun animation in the range 0 to 23.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int EndHour { get; set; }
Public Property EndHour As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace