RhinoCommon SDK
MaterialRef.BackFaceMaterialIndex Property
 The index of the material used to render the back of an object
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int BackFaceMaterialIndex { get; }
Public ReadOnly Property BackFaceMaterialIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace