RhinoCommon SDK
DrawObjectEventArgs.RhinoObject Property
[Missing <summary> documentation for "P:Rhino.Display.DrawObjectEventArgs.RhinoObject"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject RhinoObject { get; }
Public ReadOnly Property RhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DrawObjectEventArgs Class
Rhino.Display Namespace