RhinoCommon SDK
GetTransform.Transform Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetTransform.Transform"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform Transform { get; set; }
Public Property Transform As Transform
	Get
	Set
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace