RhinoCommon SDK
ViewportInfo.CameraDirection Property
 Gets the direction that the camera faces.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CameraDirection { get; }
Public ReadOnly Property CameraDirection As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace