RhinoCommon API
Command.EnglishName Property
 Gets the name of the command. This method is abstract.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract string EnglishName { get; }
Public MustOverride ReadOnly Property EnglishName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
Command Class
Rhino.Commands Namespace