RhinoCommon SDK
ConstructionPlane.ShowGrid Property
 Gets or sets whether the grid itself should be visible.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowGrid { get; set; }
Public Property ShowGrid As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace