RhinoCommon SDK
BrepEdge.Tolerance Property
 Gets or sets the accuracy of the edge curve (>=0.0 or RhinoMath.UnsetValue) A value of UnsetValue indicates that the tolerance should be computed. The maximum distance from the edge's 3d curve to any surface of a face that has this edge as a portion of its boundary must be <= this tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Tolerance { get; set; }
Public Property Tolerance As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace