RhinoCommon API
CommandStyleAttribute.Styles Property
 Gets the associated style.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Style Styles { get; }
Public ReadOnly Property Styles As Style
	Get
Property Value
Type: Style
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
CommandStyleAttribute Class
Rhino.Commands Namespace