RhinoCommon API
MeshingParameters.MinimumEdgeLength Property
 Gets or sets the minimum allowed mesh edge length.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MinimumEdgeLength { get; set; }
Public Property MinimumEdgeLength As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace