RhinoCommon API
RhinoDoc.NextUndoRecordSerialNumber Property
 The serial number that will be assigned to the next undo record that is constructed.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint NextUndoRecordSerialNumber { get; }
Public ReadOnly Property NextUndoRecordSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoDoc Class
Rhino Namespace