RhinoCommon API
InstanceDefinitionTable.Count Property
Number of items in the instance definitions table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace