RhinoCommon API
RhinoView.ClientRectangle Property
 Gets the rectangle that represents the client area of the view.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle ClientRectangle { get; }
Public ReadOnly Property ClientRectangle As Rectangle
	Get
Property Value
Type: Rectangle
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
RhinoView Class
Rhino.Display Namespace