RhinoCommon SDK
VolumeMassProperties.Centroid Property
 Gets the volume centroid in the world coordinate system.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Centroid { get; }
Public ReadOnly Property Centroid As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace