RhinoCommon API
LicenseLease.UserName Property
 Name of Rhino Accounts user that was logged in when this lease was obtained
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string UserName { get; }
Public ReadOnly Property UserName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.15
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace