RhinoCommon API
SweepOneRail.IsRoadlineRight Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsRoadlineRight"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsRoadlineRight { get; }
Public ReadOnly Property IsRoadlineRight As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace