RhinoCommon API
Leader.LeaderLandingLength Property
 Gets or sets the length of the landing line
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double LeaderLandingLength { get; set; }
Public Property LeaderLandingLength As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.10
See Also
Reference
Leader Class
Rhino.Geometry Namespace