RhinoCommon SDK
Mesh.Attributes Property
 Get object attributes of object associated to this mesh. This will be possible only after returning true from ChangeQueue.ProvideOriginalObject()
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectAttributes Attributes { get; }
Public ReadOnly Property Attributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace