RhinoCommon SDK
CullObjectEventArgs.CullObject Property
[Missing <summary> documentation for "P:Rhino.Display.CullObjectEventArgs.CullObject"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CullObject { get; set; }
Public Property CullObject As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CullObjectEventArgs Class
Rhino.Display Namespace