RhinoCommon API
ViewportInfo.FrustumRightPlane Property
 Gets the frustum right plane that separates visibile from off-screen.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane FrustumRightPlane { get; }
Public ReadOnly Property FrustumRightPlane As Plane
	Get
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace