RhinoCommon SDK
Leader.LeaderArrowType Property
 The arrowhead type for the leader
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ArrowType LeaderArrowType { get; set; }
Public Property LeaderArrowType As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Leader Class
Rhino.Geometry Namespace