RhinoCommon API
PolyCurve.IsNested Property
 Gets a value indicating whether or not a PolyCurve contains nested PolyCurves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsNested { get; }
Public ReadOnly Property IsNested As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace
PolyCurve.RemoveNesting()