RhinoCommon SDK
Box.Center Property
 Gets the point that is in the center of the box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Center { get; }
Public ReadOnly Property Center As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Box Structure
Rhino.Geometry Namespace