RhinoCommon API
Leader.LeaderArrowSize Property
 The size of the leader arrow
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double LeaderArrowSize { get; set; }
Public Property LeaderArrowSize As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.6
See Also
Reference
Leader Class
Rhino.Geometry Namespace