RhinoCommon API
DisplayPipeline.ActiveObjectNestingStack Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipeline.ActiveObjectNestingStack"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject[] ActiveObjectNestingStack { get; }
Public ReadOnly Property ActiveObjectNestingStack As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
Version Information
Rhino for Windows
Supported in: 6.7
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace