RhinoCommon API
ComponentFunctionInfo.FullName Property
 Returns the name of the component prefixed by, if existing, the namespace.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FullName { get; }
Public ReadOnly Property FullName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.9
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace