RhinoCommon API
ModelAidSettingsState.SnapToLocked Property
Gets or sets the locked state of the snap modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SnapToLocked { get; set; }
Public Property SnapToLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace