RhinoCommon API
Analytics.AppPlatform Property
 Platform application is running on. For example "Mac", "Windows". Again, don't include version numbers. Maps to Google Analytics parameter 'ai'
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string AppPlatform { get; set; }
Public Property AppPlatform As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.7
See Also
Reference
Analytics Class
Rhino.Runtime Namespace