RhinoCommon API
MeshingParameters.GridAspectRatio Property
 Gets or sets the maximum allowed aspect ratio of sampling quads.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double GridAspectRatio { get; set; }
Public Property GridAspectRatio As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace