RhinoCommon API
RhinoDoc.IsInitializing Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.IsInitializing"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsInitializing { get; }
Public ReadOnly Property IsInitializing As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.20
See Also
Reference
RhinoDoc Class
Rhino Namespace