RhinoCommon SDK
DimensionStyle.TextGap Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.TextGap"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TextGap { get; set; }
Public Property TextGap As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace