RhinoCommon API
GetPolyline.MinPointCount Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPolyline.MinPointCount"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MinPointCount { get; set; }
Public Property MinPointCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.8
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace