RhinoCommon API
City.Longitude Property
 Gets longitude of city.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Longitude { get; }
Public ReadOnly Property Longitude As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.18
See Also
Reference
City Class
Rhino.Render Namespace