RhinoCommon SDK
Sphere.Unset Property
 Gets a sphere with invalid members.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Sphere Unset { get; }
Public Shared ReadOnly Property Unset As Sphere
	Get
Property Value
Type: Sphere
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace