RhinoCommon API
DimensionStyle.AlternateZeroSuppress Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateZeroSuppress"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ZeroSuppression AlternateZeroSuppress { get; set; }
Public Property AlternateZeroSuppress As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace