RhinoCommon API
InstanceDefinition.LayerStyle Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.LayerStyle"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public InstanceDefinitionLayerStyle LayerStyle { get; }
Public ReadOnly Property LayerStyle As InstanceDefinitionLayerStyle
	Get
Property Value
Type: InstanceDefinitionLayerStyle
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace