RhinoCommon API
DetailView.PageToModelRatio Property
 Gets the page units/model units quotient.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PageToModelRatio { get; }
Public ReadOnly Property PageToModelRatio As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DetailView Class
Rhino.Geometry Namespace