RhinoCommon API
PickContext.SubObjectSelectionEnabled Property
 True if the user had activated subobject selection
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SubObjectSelectionEnabled { get; set; }
Public Property SubObjectSelectionEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace