RhinoCommon SDK
Point2d.Item Property
 Accesses the coordinates of this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Double
	Get
	Set
Parameters
index
Type: System.Int32
Either 0 or 1.
Return Value
Type: Double
If index is 0, the X (first) coordinate. If index is 1, the Y (second) coordinate.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace