RhinoCommon SDK
ICollapsibleSection.ViewModelId Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSection.ViewModelId"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Guid ViewModelId { get; }
ReadOnly Property ViewModelId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ICollapsibleSection Interface
Rhino.UI.Controls Namespace