RhinoCommon API
LicenseStatus.RegisteredOwner Property
The registered owner of the product. (e.g. "Dale Fugier")
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string RegisteredOwner { get; set; }
Public Property RegisteredOwner As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace