RhinoCommon API
ContentUuids.EXRTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.EXRTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid EXRTextureType { get; }
Public Shared ReadOnly Property EXRTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.18
See Also
Reference
ContentUuids Class
Rhino.Render Namespace