RhinoCommon SDK
StringParserSettings.ParseSignificandIntegerPart Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseSignificandIntegerPart"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseSignificandIntegerPart { get; set; }
Public Property ParseSignificandIntegerPart As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace