RhinoCommon API
RhinoDoc.Snapshots Property
 Collection of snapshots.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SnapshotTable Snapshots { get; }
Public ReadOnly Property Snapshots As SnapshotTable
	Get
Property Value
Type: SnapshotTable
Version Information
Rhino for Windows
Supported in: 6.15
See Also
Reference
RhinoDoc Class
Rhino Namespace