RhinoCommon SDK
FileReadOptions.BatchMode Property
 true means you cannot ask questions during reading. (no dialogs, no "getters", etc.)
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool BatchMode { get; set; }
Public Property BatchMode As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace