RhinoCommon SDK
GetColorEventArgs.IncludeButtonColors Property
[Missing <summary> documentation for "P:Rhino.UI.GetColorEventArgs.IncludeButtonColors"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludeButtonColors { get; }
Public ReadOnly Property IncludeButtonColors As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace