RhinoCommon SDK
File3dm.Views Property
 Views that represent the RhinoViews which are displayed when Rhino loads this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IList<ViewInfo> Views { get; }
Public ReadOnly Property Views As IList(Of ViewInfo)
	Get
Property Value
Type: IList<ViewInfo>
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace