RhinoCommon API
RenderWindow.ImageAdjust.Dither Property
 Set the Dithering method to use when adjusting the RenderWindow content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Dithering.Methods Dither { get; set; }
Public Property Dither As Dithering.Methods
	Get
	Set
Property Value
Type: Dithering.Methods
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
RenderWindow.ImageAdjust Class
Rhino.Render Namespace