RhinoCommon API
UndoRedoEventArgs.IsBeginRecording Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsBeginRecording"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsBeginRecording { get; }
Public ReadOnly Property IsBeginRecording As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace