RhinoCommon SDK
RenderPropertyChangedEvent.Document Property
 The document triggering the event.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderPropertyChangedEvent Class
Rhino.Render Namespace