RhinoCommon API
MaterialTableEventArgs.Index Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.MaterialTableEventArgs.Index"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
MaterialTableEventArgs Class
Rhino.DocObjects.Tables Namespace