RhinoCommon SDK
CustomUndoEventArgs.Tag Property
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.Tag"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Object Tag { get; }
Public ReadOnly Property Tag As Object
	Get
Property Value
Type: Object
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace