RhinoCommon API
AppearanceSettingsState.CommandPromptBackgroundColor Property
Gets or sets the comand prompt background color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color CommandPromptBackgroundColor { get; set; }
Public Property CommandPromptBackgroundColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace