RhinoCommon API
Curve.TangentAtStart Property
Evaluates the unit tangent vector at the start of the curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d TangentAtStart { get; }
Public ReadOnly Property TangentAtStart As Vector3d
	Get
Return Value
Type: Vector3d
Unit tangent vector of the curve at the start point.
Remarks
No error handling.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
Curve Class
Rhino.Geometry Namespace