RhinoCommon SDK
HatchPattern.Defaults.Hatch3 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.Defaults.Hatch3"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static HatchPattern Hatch3 { get; }
Public Shared ReadOnly Property Hatch3 As HatchPattern
	Get
Property Value
Type: HatchPattern
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
HatchPattern.Defaults Class
Rhino.DocObjects Namespace