RhinoCommon API
UserData.ShouldWrite Property
 If you want to save this user data in a 3dm file, override ShouldWrite and return true. If you do support serialization, you must also override the Read and Write functions.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool ShouldWrite { get; }
Public Overridable ReadOnly Property ShouldWrite As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace