RhinoCommon SDK
MappingTag.MappingType Property
 Gets or sets a texture mapping type: linear, cylinder, etc...
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureMappingType MappingType { get; set; }
Public Property MappingType As TextureMappingType
	Get
	Set
Property Value
Type: TextureMappingType
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MappingTag Class
Rhino.Render Namespace