RhinoCommon API
Material.FresnelReflections Property
 Gets or sets if fresnel reflections are used.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool FresnelReflections { get; set; }
Public Property FresnelReflections As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
Material Class
Rhino.DocObjects Namespace