RhinoCommon SDK
FileObjReadOptions.MorphTargetOnly Property
 TODO
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MorphTargetOnly { get; set; }
Public Property MorphTargetOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace