RhinoCommon API
ViewportInfo.IsTwoPointPerspectiveProjection Property
 Gets a value that indicates whether this projection is a two-point perspective.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsTwoPointPerspectiveProjection { get; }
Public ReadOnly Property IsTwoPointPerspectiveProjection As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace