RhinoCommon API
RhinoDoc.MeshingParameterStyle Property
 Type of MeshingParameters currently used by the document to mesh objects
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshingParameterStyle MeshingParameterStyle { get; set; }
Public Property MeshingParameterStyle As MeshingParameterStyle
	Get
	Set
Property Value
Type: MeshingParameterStyle
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoDoc Class
Rhino Namespace