RhinoCommon API
PersistentSettingsSavedEventArgs.SavedByThisRhino Property
 Will be true if this instance of Rhino is writing the settings file or false if a different instance of Rhino has modified the settings file.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SavedByThisRhino { get; }
Public ReadOnly Property SavedByThisRhino As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.9
See Also
Reference
PersistentSettingsSavedEventArgs Class
Rhino Namespace