RhinoCommon SDK
InstanceDefinition.Index Property
 Index of this instance definition in the index definition table.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace