RhinoCommon SDK
Unroller.ExplodeSpacing Property
 Gets or sets a value determining whether spacing should be exploded.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ExplodeSpacing { get; set; }
Public Property ExplodeSpacing As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Unroller Class
Rhino.Geometry Namespace