RhinoCommon SDK
CalculateBoundingBoxEventArgs.BoundingBox Property
 Gets the current bounding box.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CalculateBoundingBoxEventArgs Class
Rhino.Display Namespace