RhinoCommon SDK
Point3d.Item Property
 Gets or sets an indexed coordinate of this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Double
	Get
	Set
Parameters
index
Type: System.Int32
 The coordinate index. Valid values are:
0 = X coordinate
1 = Y coordinate
2 = Z coordinate
 .
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace