RhinoCommon API
Particle.Index Property
 Index in ParentSystem for this Particle. Can change when the particle system is modified.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
Particle Class
Rhino.Geometry Namespace