RhinoCommon SDK
Mesh.VertexColors Property
 Gets access to the (optional) vertex color collection in this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshVertexColorList VertexColors { get; }
Public ReadOnly Property VertexColors As MeshVertexColorList
	Get
Property Value
Type: MeshVertexColorList
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Mesh Class
Rhino.Geometry Namespace