RhinoCommon SDK
File3dm.InstanceDefinitions Property
 Instance definitions in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IList<InstanceDefinitionGeometry> InstanceDefinitions { get; }
Public ReadOnly Property InstanceDefinitions As IList(Of InstanceDefinitionGeometry)
	Get
Property Value
Type: IList<InstanceDefinitionGeometry>
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace