RhinoCommon SDK
PointCloud.HiddenPointCount Property
 Gets the number of points that have their Hidden flag set.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int HiddenPointCount { get; }
Public ReadOnly Property HiddenPointCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace