RhinoCommon SDK
CollapsibleSectionImpl.ViewModel Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.CollapsibleSectionImpl.ViewModel"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IRdkViewModel ViewModel { get; set; }
Public Property ViewModel As IRdkViewModel
	Get
	Set
Property Value
Type: IRdkViewModel
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CollapsibleSectionImpl Class
Rhino.UI.Controls Namespace