RhinoCommon SDK
Text3d.Height Property
 Gets or sets the height (in units) of this Text3d object. The height should be a positive number larger than zero.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Text3d Class
Rhino.Display Namespace