RhinoCommon SDK
BrepEdge.EdgeIndex Property
 Gets the index of this edge in the Brep.Edges collection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int EdgeIndex { get; }
Public ReadOnly Property EdgeIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace