RhinoCommon SDK
ColorLCH.A Property
 Gets or sets the Alpha channel. The Alpha channel is limited to the 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double A { get; set; }
Public Property A As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace