RhinoCommon API
PlugInInfo.IsDotNet Property
 Returns true if the plug-in is based on .NET, false otherwise.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsDotNet { get; }
Public ReadOnly Property IsDotNet As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.10
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace