RhinoCommon SDK
MeshThicknessMeasurement.Point Property
 Gets the location of the thickness measurement.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Point { get; }
Public ReadOnly Property Point As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace