RhinoCommon API
Command.PlugIn Property
 Gets the plug-in where this commands is placed.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PlugIn PlugIn { get; }
Public ReadOnly Property PlugIn As PlugIn
	Get
Property Value
Type: PlugIn
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
Command Class
Rhino.Commands Namespace