RhinoCommon SDK
TextEntity.TextOrientation Property
[Missing <summary> documentation for "P:Rhino.Geometry.TextEntity.TextOrientation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextOrientation TextOrientation { get; set; }
Public Property TextOrientation As TextOrientation
	Get
	Set
Property Value
Type: TextOrientation
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace