RhinoCommon SDK
EarthAnchorPoint.EarthBasepointElevation Property
 Gets or sets the point elevation on earth, in meters.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double EarthBasepointElevation { get; set; }
Public Property EarthBasepointElevation As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace