RhinoCommon API
StackedDialogPage.Handle Property
 When running on Windows return the window handle for the parent of this page otherwise; return IntPtr.Zero.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr Handle { get; }
Public ReadOnly Property Handle As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.6
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace