RhinoCommon SDK
CreatePreviewEventArgs.ContentKind Property
 Description of content that preview is being generated for.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContentKind ContentKind { get; }
Public ReadOnly Property ContentKind As RenderContentKind
	Get
Property Value
Type: RenderContentKind
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace