RhinoCommon SDK
CustomUndoEventArgs.ActionDescription Property
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.ActionDescription"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ActionDescription { get; }
Public ReadOnly Property ActionDescription As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace