RhinoCommon SDK
FileType.Description Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileType.Description"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileType Class
Rhino.FileIO Namespace