RhinoCommon SDK
Dimension.ExtensionLineExtension Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ExtensionLineExtension"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ExtensionLineExtension { get; set; }
Public Property ExtensionLineExtension As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Dimension Class
Rhino.Geometry Namespace