RhinoCommon API
CorruptGeometryException.CommonObject Property
 Corrupt geometry .NET class
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CommonObject CommonObject { get; }
Public ReadOnly Property CommonObject As CommonObject
	Get
Property Value
Type: CommonObject
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
CorruptGeometryException Class
Rhino.Runtime Namespace