RhinoCommon SDK
TextEntity.TextHorizontalAlignment Property
[Missing <summary> documentation for "P:Rhino.Geometry.TextEntity.TextHorizontalAlignment"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextHorizontalAlignment TextHorizontalAlignment { get; set; }
Public Property TextHorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace