RhinoCommon API
RhinoViewport.CameraLocation Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.CameraLocation"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d CameraLocation { get; }
Public ReadOnly Property CameraLocation As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace