RhinoCommon SDK
Cone.IsValid Property
 true if plane is valid, height is not zero and radius is not zero.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Cone Structure
Rhino.Geometry Namespace