RhinoCommon SDK
StringParserSettings.ParseSettingsDoubleNumber Property
 - The double number settings parse and optional unary + or unary - and then parse a number that can be integer, decimal, or scientific e notation.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static StringParserSettings ParseSettingsDoubleNumber { get; }
Public Shared ReadOnly Property ParseSettingsDoubleNumber As StringParserSettings
	Get
Property Value
Type: StringParserSettings
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace