RhinoCommon API
CustomRenderContentAttribute.IsNormalMap Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.IsNormalMap"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsNormalMap { get; set; }
Public Property IsNormalMap As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.20
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace