RhinoCommon SDK
DimensionStyle.SuppressArrow1 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.SuppressArrow1"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SuppressArrow1 { get; set; }
Public Property SuppressArrow1 As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace