RhinoCommon API
DimensionStyle.AngleZeroSuppress Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AngleZeroSuppress"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ZeroSuppression AngleZeroSuppress { get; set; }
Public Property AngleZeroSuppress As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace