RhinoCommon API
RhinoView.ScreenRectangle Property
 Gets the rectangle that represents the client area of the view in screen coordinates.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle ScreenRectangle { get; }
Public ReadOnly Property ScreenRectangle As Rectangle
	Get
Property Value
Type: Rectangle
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
RhinoView Class
Rhino.Display Namespace