RhinoCommon API
Plane.WorldZX Property
 plane coincident with the World ZX plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Plane WorldZX { get; }
Public Shared ReadOnly Property WorldZX As Plane
	Get
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
Plane Structure
Rhino.Geometry Namespace