RhinoCommon API
Linetype.IsDeleted Property
 Gets a value indicating whether this linetype has been deleted and is currently in the Undo buffer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsDeleted { get; }
Public ReadOnly Property IsDeleted As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace