RhinoCommon SDK
BrepFace.Loops Property
 Loops in this face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepLoopList Loops { get; }
Public ReadOnly Property Loops As BrepLoopList
	Get
Property Value
Type: BrepLoopList
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace