RhinoCommon SDK
RenderContent.CanBeEdited Property
 Determines if the content can be edited.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CanBeEdited { get; }
Public ReadOnly Property CanBeEdited As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderContent Class
Rhino.Render Namespace