RhinoCommon API
Linetype.SegmentCount Property
Number of segments in the pattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SegmentCount { get; }
Public ReadOnly Property SegmentCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace