RhinoCommon SDK
Material.Reflectivity Property
 Gets or sets how reflective a material is, 0f is no reflection 1f is 100% reflective.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Reflectivity { get; set; }
Public Property Reflectivity As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Material Class
Rhino.DocObjects Namespace