RhinoCommon API
CommandLineOption.EnglishName Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.CommandLineOption.EnglishName"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string EnglishName { get; }
Public ReadOnly Property EnglishName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace