RhinoCommon SDK
GetColorEventArgs.SelectedColor Property
[Missing <summary> documentation for "P:Rhino.UI.GetColorEventArgs.SelectedColor"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color SelectedColor { get; set; }
Public Property SelectedColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace