RhinoCommon API
HostUtils.RunningOnOSX Property
 Tests if this process is currently executing on the Mac OSX platform.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool RunningOnOSX { get; }
Public Shared ReadOnly Property RunningOnOSX As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace