RhinoCommon SDK
RenderPipeline.RenderSessionId Property
 Get the Id associated with this render session, this is useful when looking up Rhino.Render.RenderPanels.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid RenderSessionId { get; }
Public ReadOnly Property RenderSessionId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace