RhinoCommon API
RhinoDoc.ModelUnitSystem Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.ModelUnitSystem"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UnitSystem ModelUnitSystem { get; set; }
Public Property ModelUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
RhinoDoc Class
Rhino Namespace