RhinoCommon SDK
ToolbarFileCollection.Item Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFileCollection.Item(System.Int32)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ToolbarFile this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As ToolbarFile
	Get
Parameters
index
Type: System.Int32
Property Value
Type: ToolbarFile
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace