RhinoCommon API
BezierCurve.ControlVertexCount Property
 Number of control vertices in this curve
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ControlVertexCount { get; }
Public ReadOnly Property ControlVertexCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace