RhinoCommon SDK
RenderSettings.ScaleBackgroundToFit Property
 Gets or sets a value indicating whether to scale the wallpaper in the background or not. This is meaningful only if the viewport has a wallpaper and render settings are set to render Wallpaper into the background.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ScaleBackgroundToFit { get; set; }
Public Property ScaleBackgroundToFit As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
RenderSettings Class
Rhino.Render Namespace