RhinoCommon API
DisplayPipelineAttributes.ViewSpecificAttributes Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewSpecificAttributes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipelineAttributes.ViewDisplayAttributes ViewSpecificAttributes { get; }
Public ReadOnly Property ViewSpecificAttributes As DisplayPipelineAttributes.ViewDisplayAttributes
	Get
Property Value
Type: DisplayPipelineAttributes.ViewDisplayAttributes
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace