RhinoCommon API
Dimension.AltLengthRoundoff Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltLengthRoundoff"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double AltLengthRoundoff { get; set; }
Public Property AltLengthRoundoff As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.15
See Also
Reference
Dimension Class
Rhino.Geometry Namespace