RhinoCommon SDK
MetaData.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.DataSources.MetaData.CppPointer"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MetaData Class
Rhino.Render.DataSources Namespace