RhinoCommon API
Light.ShadowIntensity Property
 Gets or sets the shadow intensity for the light.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ShadowIntensity { get; set; }
Public Property ShadowIntensity As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.15
See Also
Reference
Light Class
Rhino.Geometry Namespace