RhinoCommon API
DimensionStyle.Suffix Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Suffix"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Suffix { get; set; }
Public Property Suffix As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace