RhinoCommon API
RhinoDoc.TextureMappingEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.TextureMappingEventArgs.Document"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
RhinoDoc.TextureMappingEventArgs Class
Rhino Namespace