RhinoCommon SDK
RhinoObject.ObjectType Property
 Gets the Rhino-based object type.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectType ObjectType { get; }
Public ReadOnly Property ObjectType As ObjectType
	Get
Property Value
Type: ObjectType
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace