RhinoCommon SDK
ComponentStatus.Selected Property
 The selection flag is checked.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ComponentStatus Selected { get; }
Public Shared ReadOnly Property Selected As ComponentStatus
	Get
Property Value
Type: ComponentStatus
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace