RhinoCommon SDK
DimensionStyle.ArrowType2 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ArrowType2"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ArrowType ArrowType2 { get; set; }
Public Property ArrowType2 As DimensionStyle.ArrowType
	Get
	Set
Property Value
Type: DimensionStyle.ArrowType
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace