RhinoCommon SDK
MeshClash.ClashPoint Property
 If valid, then the sphere centered at ClashPoint of ClashRadius distance interesects the clashing meshes.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ClashPoint { get; }
Public ReadOnly Property ClashPoint As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace