RhinoCommon SDK
RhinoView.Floating Property
 Floating state of RhinoView. if true, then the view will be in a floating frame window. Otherwise the view will be embeded in the main frame.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Floating { get; set; }
Public Property Floating As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
RhinoView Class
Rhino.Display Namespace