RhinoCommon SDK
GripsDrawEventArgs.LockedGripColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.GripsDrawEventArgs.LockedGripColor"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color LockedGripColor { get; set; }
Public Property LockedGripColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace