RhinoCommon SDK
Fonts.TitleFont Property
 Returns a font used for dialog titles. 2x the size of NormalFont, and bold.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Font TitleFont { get; }
Public Shared ReadOnly Property TitleFont As Font
	Get
Property Value
Type: Font
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Fonts Class
Rhino.UI Namespace