RhinoCommon SDK
PickContext.PickStyle Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.PickContext.PickStyle"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PickStyle PickStyle { get; set; }
Public Property PickStyle As PickStyle
	Get
	Set
Property Value
Type: PickStyle
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace