RhinoCommon API
Light.IsRectangularLight Property
 Gets a value indicating whether the light style is LightStyle WorldRectangular.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsRectangularLight { get; }
Public ReadOnly Property IsRectangularLight As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
Light Class
Rhino.Geometry Namespace