RhinoCommon API
RadialDimension.LeaderTextHorizontalAlignment Property
 Gets or sets the horizontal alignment of the radial dimension's text
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextHorizontalAlignment LeaderTextHorizontalAlignment { get; set; }
Public Property LeaderTextHorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace