RhinoCommon SDK
Circle.Diameter Property
 Gets or sets the diameter (radius * 2.0) of this circle. Diameters should be positive values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Diameter { get; set; }
Public Property Diameter As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Circle Structure
Rhino.Geometry Namespace