RhinoCommon API
PanelIds.Materials Property
 Rhino material browser
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Materials { get; }
Public Shared ReadOnly Property Materials As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
PanelIds Class
Rhino.UI Namespace