RhinoCommon API
Cylinder.Radius Property
 Gets or sets the radius of the cylinder.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.11
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace