RhinoCommon API
AppearanceSettings.GridThickLineColor Property
 Gets or sets the color of the thick line of the grid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color GridThickLineColor { get; set; }
Public Shared Property GridThickLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace