RhinoCommon API
IndexPair.Count Property
 Returns the amount of elements in this pair of indices, which is always 2.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
IReadOnlyCollection<T>.Count
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
IndexPair Structure
Rhino Namespace