RhinoCommon API
GeneralSettingsState.AutoUpdateCommandHelp Property
 Gets or sets the command help dialog auto-update feature.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AutoUpdateCommandHelp { get; set; }
Public Property AutoUpdateCommandHelp As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace