RhinoCommon API
StringParserSettings.ParseMultiplication Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseMultiplication"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseMultiplication { get; set; }
Public Property ParseMultiplication As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace