RhinoCommon API
ModelAidSettings.CtrlNudgeKeyStep Property
Gets or sets the Ctrl-key based nudge step amount.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double CtrlNudgeKeyStep { get; set; }
Public Shared Property CtrlNudgeKeyStep As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace