RhinoCommon API
Color4f.L Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.L"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float L { get; }
Public ReadOnly Property L As Single
	Get
Property Value
Type: Single
Version Information
Rhino for Windows
Supported in: 6.9
See Also
Reference
Color4f Structure
Rhino.Display Namespace