RhinoCommon SDK
ParticleSystem.DisplaySizesInWorldUnits Property
[Missing <summary> documentation for "P:Rhino.Geometry.ParticleSystem.DisplaySizesInWorldUnits"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DisplaySizesInWorldUnits { get; set; }
Public Property DisplaySizesInWorldUnits As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace