RhinoCommon API
FileWriteOptions.WriteSelectedObjectsOnly Property
 If true, this command should export only the objects currently selected in the Rhino model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WriteSelectedObjectsOnly { get; set; }
Public Property WriteSelectedObjectsOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace