RhinoCommon SDK
MeshingParameters.GridMinCount Property
 Gets or sets the minimum number of grid quads in the initial sampling grid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GridMinCount { get; set; }
Public Property GridMinCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace