RhinoCommon API
DisplayPipelineAttributes.EnglishName Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.EnglishName"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string EnglishName { get; set; }
Public Property EnglishName As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace