RhinoCommon SDK
MeshPoint.EdgeParameter Property
 Edge parameter when found.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double EdgeParameter { get; }
Public ReadOnly Property EdgeParameter As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace