RhinoCommon SDK
ConstructionPlane.ShowAxes Property
 Gets or sets whether the axes of the grid shuld be visible.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowAxes { get; set; }
Public Property ShowAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace