RhinoCommon API
OrdinateDimension.KinkPoint1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.OrdinateDimension.KinkPoint1"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d KinkPoint1 { get; }
Public ReadOnly Property KinkPoint1 As Point2d
	Get
Property Value
Type: Point2d
Version Information
Rhino for Windows
Supported in: 6.18
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace