RhinoCommon SDK
RhinoView.Bounds Property
 Gets the size and location of the view including its nonclient elements, in pixels, relative to the parent control.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle Bounds { get; }
Public ReadOnly Property Bounds As Rectangle
	Get
Property Value
Type: Rectangle
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoView Class
Rhino.Display Namespace