RhinoCommon API
RhinoDoc.ModelAngleToleranceRadians Property
Model space angle tolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ModelAngleToleranceRadians { get; set; }
Public Property ModelAngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
RhinoDoc Class
Rhino Namespace