RhinoCommon API
PlugInDescriptionAttribute.Value Property
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugInDescriptionAttribute.Value"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Value { get; }
Public ReadOnly Property Value As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
PlugInDescriptionAttribute Class
Rhino.PlugIns Namespace