RhinoCommon API
SimulatedTexture.Filtered Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.Filtered"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Filtered { get; set; }
Public Property Filtered As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace