RhinoCommon API
CustomUndoEventArgs.UndoSerialNumber Property
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.UndoSerialNumber"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint UndoSerialNumber { get; }
Public ReadOnly Property UndoSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace