RhinoCommon SDK
MeshFace.C Property
 Gets or sets the third corner index of the mesh face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int C { get; set; }
Public Property C As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace