RhinoCommon API
DisplayRenderSettings.CullBackFaces Property
 True if backfaces should be culled
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CullBackFaces { get; }
Public ReadOnly Property CullBackFaces As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
DisplayRenderSettings Class
Rhino.Render.ChangeQueue Namespace