RhinoCommon API
PersistentSettings.Keys Property
 Gets a collection containing the keys in the settings dictionary.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ICollection<string> Keys { get; }
Public ReadOnly Property Keys As ICollection(Of String)
	Get
Property Value
Type: ICollection<String>
Version Information
Rhino for Windows
Supported in: 6.10
See Also
Reference
PersistentSettings Class
Rhino Namespace