RhinoCommon API
CursorTooltipSettingsState.TextColor Property
Tooltip text color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color TextColor { get; set; }
Public Property TextColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace