RhinoCommon SDK
ConstructionPlane.GridSpacing Property
 Gets or sets the distance between grid lines.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double GridSpacing { get; set; }
Public Property GridSpacing As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace