RhinoCommon SDK
ObjectEnumeratorSettings.LayerIndexFilter Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.LayerIndexFilter"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int LayerIndexFilter { get; set; }
Public Property LayerIndexFilter As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace