RhinoCommon SDK
DisplayModeDescription.ShadedId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.ShadedId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid ShadedId { get; }
Public Shared ReadOnly Property ShadedId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace