RhinoCommon API
Font.PointSize Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.PointSize"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PointSize { get; }
Public ReadOnly Property PointSize As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
Font Class
Rhino.DocObjects Namespace