RhinoCommon SDK
RhinoViewport.ConstructionGridVisible Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.ConstructionGridVisible"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ConstructionGridVisible { get; set; }
Public Property ConstructionGridVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace