RhinoCommon API
Layer.IsExpanded Property
 Gets or sets a value indicating whether this layer is expanded in the Rhino Layer dialog.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsExpanded { get; set; }
Public Property IsExpanded As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
Layer Class
Rhino.DocObjects Namespace