RhinoCommon API
AnimationProperties.FileExtension Property
 Gets or sets the file extension of the saved frames created by the animation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FileExtension { get; set; }
Public Property FileExtension As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.12
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace