RhinoCommon API
Color4f.R Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.R"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float R { get; }
Public ReadOnly Property R As Single
	Get
Property Value
Type: Single
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Color4f Structure
Rhino.Display Namespace