RhinoCommon API
DimensionStyle.ToleranceFormat Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ToleranceFormat"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ToleranceDisplayFormat ToleranceFormat { get; set; }
Public Property ToleranceFormat As DimensionStyle.ToleranceDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.ToleranceDisplayFormat
Version Information
Rhino for Windows
Supported in: 6.15
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace