RhinoCommon API
Interval.Unset Property
 Gets an Interval whose limits are RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Interval Unset { get; }
Public Shared ReadOnly Property Unset As Interval
	Get
Property Value
Type: Interval
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Interval Structure
Rhino.Geometry Namespace