RhinoCommon SDK
CommandEventArgs.CommandId Property
 Gets the ID of the command that raised this event.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid CommandId { get; }
Public ReadOnly Property CommandId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace