RhinoCommon SDK
GetLine.FirstPointPrompt Property
Prompt when getting first point
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FirstPointPrompt { get; set; }
Public Property FirstPointPrompt As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace