RhinoCommon SDK
DisplayPipeline.ModelTransform Property
 Gets or sets the current model transformation that is applied to vertices when drawing.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform ModelTransform { get; set; }
Public Property ModelTransform As Transform
	Get
	Set
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace