RhinoCommon SDK
ContentUuids.NoiseTextureType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.NoiseTextureType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid NoiseTextureType { get; }
Public Shared ReadOnly Property NoiseTextureType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
ContentUuids Class
Rhino.Render Namespace