RhinoCommon SDK
Texture.Enabled Property
 If the texture is enabled then it will be visible in the rendered display otherwise it will not.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Texture Class
Rhino.DocObjects Namespace