RhinoCommon SDK
ContentUuids.DefaultMaterialInstance Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.DefaultMaterialInstance"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid DefaultMaterialInstance { get; }
Public Shared ReadOnly Property DefaultMaterialInstance As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ContentUuids Class
Rhino.Render Namespace