RhinoCommon API
RhinoViewport.WorldAxesVisible Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.WorldAxesVisible"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WorldAxesVisible { get; set; }
Public Property WorldAxesVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace