RhinoCommon SDK
Color4f.G Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.G"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float G { get; }
Public ReadOnly Property G As Single
	Get
Property Value
Type: Single
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Color4f Structure
Rhino.Display Namespace