RhinoCommon API
Analytics.UserId Property
 Returns a GUID that allows events to be aggregated by user. There is no way to determine who the end user is based on this GUID, unless the user tells you their ID.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid UserId { get; }
Public Shared ReadOnly Property UserId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
Analytics Class
Rhino.Runtime Namespace