RhinoCommon SDK
AreaMassProperties.WorldCoordinatesProductMomentsError Property
 Uncertainty in world coordinates second moments calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d WorldCoordinatesProductMomentsError { get; }
Public ReadOnly Property WorldCoordinatesProductMomentsError As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace