RhinoCommon API
BrepRegion.Index Property
Gets the index of region in the RegionTopology array.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace