RhinoCommon API
Font.EnglishQuartetName Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.EnglishQuartetName"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string EnglishQuartetName { get; }
Public ReadOnly Property EnglishQuartetName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
Font Class
Rhino.DocObjects Namespace