RhinoCommon API
LicenseData.LicenseTitle Property
 The title of the license. This is provided by the plugin that validated the license. (e.g. "Rhinoceros 6.0 Commercial")
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string LicenseTitle { get; set; }
Public Property LicenseTitle As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace