RhinoCommon SDK
Cylinder.TotalHeight Property
 Gets the height of the cylinder. Infinite cylinders have a height of zero, not Double.PositiveInfinity.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TotalHeight { get; }
Public ReadOnly Property TotalHeight As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace