RhinoCommon SDK
RenderMaterial.SmellsLikePlastic Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikePlastic"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmellsLikePlastic { get; }
Public ReadOnly Property SmellsLikePlastic As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace