RhinoCommon SDK
Brep.Surfaces Property
 Parametric surfaces used by faces
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepSurfaceList Surfaces { get; }
Public ReadOnly Property Surfaces As BrepSurfaceList
	Get
Property Value
Type: BrepSurfaceList
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Brep Class
Rhino.Geometry Namespace