RhinoCommon API
GeneralSettings.ContextMenuDelay Property
 Time to wait before permitting context menu display.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static TimeSpan ContextMenuDelay { get; set; }
Public Shared Property ContextMenuDelay As TimeSpan
	Get
	Set
Property Value
Type: TimeSpan
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace