RhinoCommon SDK
DateTimeField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DateTime Value { get; set; }
Public Property Value As DateTime
	Get
	Set
Property Value
Type: DateTime
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
DateTimeField Class
Rhino.Render.Fields Namespace