RhinoCommon SDK
DisplayMaterial.Shine Property
 Gets or sets the shine factor of the material (0.0 to 1.0)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Shine { get; set; }
Public Property Shine As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace