RhinoCommon API
GeneralSettingsState.ContextMenuDelay Property
 Gets or sets the time to wait before permitting context menu display.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TimeSpan ContextMenuDelay { get; set; }
Public Property ContextMenuDelay As TimeSpan
	Get
	Set
Property Value
Type: TimeSpan
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace