RhinoCommon SDK
StackedDialogPage.ShowApplyButton Property
Called when this page is activated
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool ShowApplyButton { get; }
Public Overridable ReadOnly Property ShowApplyButton As Boolean
	Get
Return Value
Type: Boolean
 true : if the page wants the "Apply" button to appear. false : if the page does not want the "Apply" button to appear. Default returns false Note: If true is returned OnApply will get called when the button is clicked.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace