RhinoCommon API
SmartTrackSettingsState.SmartOrtho Property
Gets or sets a value indicating if the 'Smart Ortho' feature is active.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmartOrtho { get; set; }
Public Property SmartOrtho As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace