RhinoCommon API
CurveObject.CurveGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.CurveObject.CurveGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve CurveGeometry { get; }
Public ReadOnly Property CurveGeometry As Curve
	Get
Property Value
Type: Curve
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace