RhinoCommon API
BrepLoop.LoopIndex Property
 Gets the index of this loop in the Brep.Loops collection.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int LoopIndex { get; }
Public ReadOnly Property LoopIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace