RhinoCommon SDK
StackedDialogPage.NavigationTextIsBold Property
 Currently only used by Windows Rhino. If this is set to true then the tree control item text will be bold.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool NavigationTextIsBold { get; set; }
Public Property NavigationTextIsBold As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace