RhinoCommon SDK
SurfaceObject.SurfaceGeometry Property
 Gets the surface geometry linked with this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Surface SurfaceGeometry { get; }
Public ReadOnly Property SurfaceGeometry As Surface
	Get
Property Value
Type: Surface
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SurfaceObject Class
Rhino.DocObjects Namespace