RhinoCommon SDK
Ellipse.Radius2 Property
 Gets or sets the radius of the ellipse along the base plane Y semiaxis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Radius2 { get; set; }
Public Property Radius2 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace