RhinoCommon API
BrepVertex.Brep Property
 Gets the Brep that owns this vertex.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace