RhinoCommon API
RenderContentEventArgs.Reason Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentEventArgs.Reason"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContentChangeReason Reason { get; }
Public ReadOnly Property Reason As RenderContentChangeReason
	Get
Property Value
Type: RenderContentChangeReason
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace