RhinoCommon SDK
AsyncRenderContext.Cancel Property
 If set to true rendering should be stopped. Is set to true only by StopRendering().
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected bool Cancel { get; }
Protected ReadOnly Property Cancel As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AsyncRenderContext Class
Rhino.Render Namespace