RhinoCommon SDK
DimensionStyle.DimRadialTextOrientation Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimRadialTextOrientation"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextOrientation DimRadialTextOrientation { get; set; }
Public Property DimRadialTextOrientation As TextOrientation
	Get
	Set
Property Value
Type: TextOrientation
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace