RhinoCommon SDK
StringParserSettings.ParseIntegerDashFraction Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseIntegerDashFraction"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseIntegerDashFraction { get; set; }
Public Property ParseIntegerDashFraction As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace