RhinoCommon API
RhinoReplaceObjectEventArgs.NewRhinoObject Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoReplaceObjectEventArgs.NewRhinoObject"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject NewRhinoObject { get; }
Public ReadOnly Property NewRhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace