RhinoCommon SDK
AnnotationBase.DimensionScale Property
 Gets or sets the dimension scale
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double DimensionScale { get; set; }
Public Property DimensionScale As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace