RhinoCommon SDK
Matrix.IsColumnOrthoNormal Property
 Gets a value indicating whether the matrix is column orthonormal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsColumnOrthoNormal { get; }
Public ReadOnly Property IsColumnOrthoNormal As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Matrix Class
Rhino.Geometry Namespace