RhinoCommon API
LicenseData.SerialNumber Property
 The "for display only" product license. This is provided by the plugin that validated the license.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string SerialNumber { get; set; }
Public Property SerialNumber As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace