RhinoCommon SDK
ConstructionPlane.ThickLineColor Property
 Gets or sets the color of the thicker, wider line.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ThickLineColor { get; set; }
Public Property ThickLineColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace