RhinoCommon SDK
ComponentIndex.Unset Property
 The unset value of component index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ComponentIndex Unset { get; }
Public Shared ReadOnly Property Unset As ComponentIndex
	Get
Property Value
Type: ComponentIndex
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.2
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace