RhinoCommon API
PanelIds.GroundPlane Property
 Rhino ground plane panel
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid GroundPlane { get; }
Public Shared ReadOnly Property GroundPlane As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
PanelIds Class
Rhino.UI Namespace