RhinoCommon API
Plane.ZAxis Property
 Gets or sets the Z axis vector of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d ZAxis { get; set; }
Public Property ZAxis As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Plane Structure
Rhino.Geometry Namespace