RhinoCommon API
RenderWindowClonedEventArgs.NewSessionId Property
[Missing <summary> documentation for "P:Rhino.Render.RenderWindowClonedEventArgs.NewSessionId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid NewSessionId { get; }
Public ReadOnly Property NewSessionId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.7
See Also
Reference
RenderWindowClonedEventArgs Class
Rhino.Render Namespace