RhinoCommon SDK
ColorLAB.B Property
 Gets or sets the Opponent channel. The channel is limited to 0~1.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double B { get; set; }
Public Property B As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace