RhinoCommon SDK
ViewTable.RedrawEnabled Property
Returns or sets (enable or disables) screen redrawing.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RedrawEnabled { get; set; }
Public Property RedrawEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace