RhinoCommon SDK
SaveFileDialog.DefaultExt Property
 The default file name extension. The returned string does not include the period.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string DefaultExt { get; set; }
Public Property DefaultExt As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SaveFileDialog Class
Rhino.UI Namespace