RhinoCommon API
DimensionStyle.DimensionScale Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimensionScale"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double DimensionScale { get; set; }
Public Property DimensionScale As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.10
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace