RhinoCommon API
DetailViewObject.WorldToPageTransform Property
 Gets the world coordinate to page coordinate transformation.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform WorldToPageTransform { get; }
Public ReadOnly Property WorldToPageTransform As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace