RhinoCommon API
AnimationProperties.FrameCount Property
 Gets or sets the number of frames to be captured.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FrameCount { get; set; }
Public Property FrameCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.11
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace