RhinoCommon API
ModelComponent.DeletedName Property
 Gets the name of a component that is deleted.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string DeletedName { get; }
Public ReadOnly Property DeletedName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.7
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace