RhinoCommon SDK
MeshingParameters.MaximumEdgeLength Property
 Gets or sets the maximum allowed mesh edge length.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MaximumEdgeLength { get; set; }
Public Property MaximumEdgeLength As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace