RhinoCommon API
ViewSettingsState.RotateReverseKeyboard Property
 Gets or sets the rotation direction.
If true, then Rhino rotates the camera around the scene, otherwise, rotates the scene itself.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RotateReverseKeyboard { get; set; }
Public Property RotateReverseKeyboard As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace