RhinoCommon API
BoundingBox.Min Property
 Gets or sets the point in the minimal corner.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Min { get; set; }
Public Property Min As Point3d
	Get
	Set
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace