RhinoCommon API
ModelAidSettings.HighlightControlPolygon Property
Gets or sets the enabled state of Rhino's highlight dialog modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool HighlightControlPolygon { get; set; }
Public Shared Property HighlightControlPolygon As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace