RhinoCommon SDK
File3dm.Linetypes Property
 Linetypes in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IList<Linetype> Linetypes { get; }
Public ReadOnly Property Linetypes As IList(Of Linetype)
	Get
Property Value
Type: IList<Linetype>
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace