RhinoCommon API
HatchPattern.ComponentType Property
 Returns HatchPattern.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace