RhinoCommon API
MeshFaceList.Capacity Property
 Gets or sets the total number of mesh triangles and quads the internal data structure can hold without resizing.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Capacity { get; set; }
Public Property Capacity As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace