RhinoCommon SDK
DisplayModeDescription.PipelineLocked Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.PipelineLocked"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool PipelineLocked { get; set; }
Public Property PipelineLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace