RhinoCommon SDK
RenderMaterial.SmellsLikeGem Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.SmellsLikeGem"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SmellsLikeGem { get; }
Public ReadOnly Property SmellsLikeGem As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace