RhinoCommon API
LightTable.Skylight Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTable.Skylight"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Skylight Skylight { get; }
Public ReadOnly Property Skylight As Skylight
	Get
Property Value
Type: Skylight
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace