RhinoCommon API
RadialDimension.DimlinePoint Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.DimlinePoint"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d DimlinePoint { get; set; }
Public Property DimlinePoint As Point2d
	Get
	Set
Property Value
Type: Point2d
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace