RhinoCommon API
Curve.PointAtStart Property
 Evaluates point at the start of the curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointAtStart { get; }
Public ReadOnly Property PointAtStart As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
Curve Class
Rhino.Geometry Namespace