RhinoCommon API
CursorTooltipSettings.RelativePointPane Property
 Displays the relative construction plane coordinates and angle from the last picked point.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool RelativePointPane { get; set; }
Public Shared Property RelativePointPane As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace