RhinoCommon API
RhinoApp.IsRunningAutomated Property
Is Rhino currently being executed through automation
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsRunningAutomated { get; }
Public Shared ReadOnly Property IsRunningAutomated As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
RhinoApp Class
Rhino Namespace