RhinoCommon API
Quaternion.IsScalar Property
 true if b, c, and d are all zero.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsScalar { get; }
Public ReadOnly Property IsScalar As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace