RhinoCommon API
Leader.LeaderArrowBlockId Property
 Id of the block used as the arrow for the leader when the arrow type is 'User arrow'
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid LeaderArrowBlockId { get; set; }
Public Property LeaderArrowBlockId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.10
See Also
Reference
Leader Class
Rhino.Geometry Namespace