RhinoCommon SDK
Sun.Latitude Property
[Missing <summary> documentation for "P:Rhino.Render.Sun.Latitude"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Latitude { get; }
Public ReadOnly Property Latitude As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Sun Class
Rhino.Render Namespace