RhinoCommon SDK
MeshNgon.Empty Property
 Gets an empty MeshNgon.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static MeshNgon Empty { get; }
Public Shared ReadOnly Property Empty As MeshNgon
	Get
Property Value
Type: MeshNgon
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace