RhinoCommon SDK
File3dm.CreatedBy Property
 Gets a string that names the user who created the file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string CreatedBy { get; }
Public ReadOnly Property CreatedBy As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace