RhinoCommon API
Sphere.SouthPole Property
 Gets the point at the South Pole of the sphere.
This is the parameterization singularity that can be obtained, at V value -Math.Pi/2.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d SouthPole { get; }
Public ReadOnly Property SouthPole As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace