RhinoCommon SDK
MappingTag.MeshTransform Property
 Gets or sets a 4x4 matrix transform.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform MeshTransform { get; set; }
Public Property MeshTransform As Transform
	Get
	Set
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MappingTag Class
Rhino.Render Namespace