RhinoCommon SDK
ComponentStatus.AllSet Property
 All flags are checked.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ComponentStatus AllSet { get; }
Public Shared ReadOnly Property AllSet As ComponentStatus
	Get
Property Value
Type: ComponentStatus
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace