RhinoCommon SDK
Matrix.IsRowOrthoNormal Property
 Gets a value indicating whether the matrix is row orthonormal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsRowOrthoNormal { get; }
Public ReadOnly Property IsRowOrthoNormal As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Matrix Class
Rhino.Geometry Namespace