RhinoCommon SDK
NurbsCurvePointList.Item Property
 Gets or sets the control point location at the given index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ControlPoint this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As ControlPoint
	Get
	Set
Parameters
index
Type: System.Int32
Index of control vertex to access.
Return Value
Type: ControlPoint
The control vertex at [index]
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace