RhinoCommon API
GetArc.DeformableDegree Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetArc.DeformableDegree"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DeformableDegree { get; set; }
Public Property DeformableDegree As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
GetArc Class
Rhino.Input.Custom Namespace