RhinoCommon SDK
Decal.EndLongitude Property
 Gets the end angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double EndLongitude { get; }
Public ReadOnly Property EndLongitude As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Decal Class
Rhino.Render Namespace