RhinoCommon SDK
UserDictionary.Description Property
 Gets the text "RhinoCommon UserDictionary".
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string Description { get; }
Public Overrides ReadOnly Property Description As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace