RhinoCommon API
ModelAidSettingsState.PointDisplay Property
Gets or sets the point display mode.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointDisplayMode PointDisplay { get; set; }
Public Property PointDisplay As PointDisplayMode
	Get
	Set
Property Value
Type: PointDisplayMode
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace