RhinoCommon API
RenderContent.TypeName Property
 Name for your content type. ie. "My .net Texture"
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract string TypeName { get; }
Public MustOverride ReadOnly Property TypeName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.18
See Also
Reference
RenderContent Class
Rhino.Render Namespace