RhinoCommon API
CustomRenderMeshProvider.EdgeSofteningId Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderMeshProvider.EdgeSofteningId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid EdgeSofteningId { get; }
Public Shared ReadOnly Property EdgeSofteningId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.6
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace