RhinoCommon SDK
LayerTableEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LayerTableEventArgs.Document"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LayerTableEventArgs Class
Rhino.DocObjects.Tables Namespace