RhinoCommon SDK
ColorXYZ.X Property
 Gets or set the X channel value. Channel will be limited to 0~1.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace