RhinoCommon API
HiddenLineDrawingPoint.PointVisibility Property
 Returns the point's visibility
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HiddenLineDrawingPoint.Visibility PointVisibility { get; }
Public ReadOnly Property PointVisibility As HiddenLineDrawingPoint.Visibility
	Get
Property Value
Type: HiddenLineDrawingPoint.Visibility
Version Information
Rhino for Windows
Supported in: 6.10
See Also
Reference
HiddenLineDrawingPoint Class
Rhino.Geometry Namespace