RhinoCommon SDK
ControlPoint.Z Property
 Gets or sets the Z coordinate of the control point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Z { get; set; }
Public Property Z As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace