RhinoCommon SDK
DisplayMaterial.BackTransparency Property
 Gets or sets the transparency of the back side material (0.0 = opaque to 1.0 = transparent)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double BackTransparency { get; set; }
Public Property BackTransparency As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace