RhinoCommon API
Font.Bold Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Bold"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Bold { get; }
Public ReadOnly Property Bold As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Font Class
Rhino.DocObjects Namespace