RhinoCommon SDK
ContentUuids.PlasterMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PlasterMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid PlasterMaterialType { get; }
Public Shared ReadOnly Property PlasterMaterialType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ContentUuids Class
Rhino.Render Namespace