RhinoCommon API
RealtimeDisplayMode.Paused Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.Paused"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Paused { get; set; }
Public Property Paused As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace