RhinoCommon API
GetPointMouseEventArgs.LeftButtonDown Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.LeftButtonDown"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool LeftButtonDown { get; }
Public ReadOnly Property LeftButtonDown As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace