RhinoCommon SDK
Interval.IsDecreasing Property
 Returns true if T[0] > T[1].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsDecreasing { get; }
Public ReadOnly Property IsDecreasing As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Interval Structure
Rhino.Geometry Namespace