RhinoCommon SDK
Curve.Degree Property
 Gets the maximum algebraic degree of any span or a good estimate if curve spans are not algebraic.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Degree { get; }
Public ReadOnly Property Degree As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
Curve Class
Rhino.Geometry Namespace