RhinoCommon SDK
CustomDisplay.ClippingBox Property
 Gets the clipping box of this CustomDisplay.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox ClippingBox { get; }
Public ReadOnly Property ClippingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace