RhinoCommon API
PlugInInfo.RegistryPath Property
 Returns the plug-in's Windows Registry path.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string RegistryPath { get; }
Public ReadOnly Property RegistryPath As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.7
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace