RhinoCommon API
ToolbarGroup.IsDocked Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarGroup.IsDocked"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsDocked { get; }
Public ReadOnly Property IsDocked As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace