RhinoCommon SDK
HiddenLineDrawingParameters.IncludeTangentSeams Property
 Include tangent seams in hidden line drawing (default is true)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludeTangentSeams { get; set; }
Public Property IncludeTangentSeams As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace