RhinoCommon SDK
Transform.M02 Property
Gets or sets this[0,2].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M02 { get; set; }
Public Property M02 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Transform Structure
Rhino.Geometry Namespace