RhinoCommon API
File3dmPlugInData.PlugInId Property
 Plug-in this data is associated with
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid PlugInId { get; }
Public ReadOnly Property PlugInId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
File3dmPlugInData Class
Rhino.FileIO Namespace