RhinoCommon API
FileWriteOptions.IncludeHistory Property
 The file written should include history information if your File Writing Plug-In supports it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludeHistory { get; set; }
Public Property IncludeHistory As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace