RhinoCommon SDK
DisplayPipelineAttributes.CurveColor Property
Color used for drawing curves
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color CurveColor { get; set; }
Public Property CurveColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace