RhinoCommon SDK
BrepTrim.TrimType Property
Type of trim
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepTrimType TrimType { get; set; }
Public Property TrimType As BrepTrimType
	Get
	Set
Property Value
Type: BrepTrimType
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace