RhinoCommon SDK
GumballAppearanceSettings.TranslateXEnabled Property
 TranslateXEnabled is true, the X axis translation control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TranslateXEnabled { get; set; }
Public Property TranslateXEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace