RhinoCommon SDK
ArcCurve.IsCompleteCircle Property
 Gets a value indicating whether or not this curve can be represented by a complete circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCompleteCircle { get; }
Public ReadOnly Property IsCompleteCircle As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace