RhinoCommon API
RhinoViewport.DisplayMode Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.DisplayMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayModeDescription DisplayMode { get; set; }
Public Property DisplayMode As DisplayModeDescription
	Get
	Set
Property Value
Type: DisplayModeDescription
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace