RhinoCommon SDK
RhinoViewport.WallpaperFilename Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.WallpaperFilename"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string WallpaperFilename { get; }
Public ReadOnly Property WallpaperFilename As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace