RhinoCommon SDK
Command.LastCommandResult Property
 Gets the result code of the last command.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Result LastCommandResult { get; }
Public Shared ReadOnly Property LastCommandResult As Result
	Get
Property Value
Type: Result
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Command Class
Rhino.Commands Namespace