RhinoCommon SDK
InstanceReferenceGeometry.Xform Property
Transformation for this reference.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform Xform { get; }
Public ReadOnly Property Xform As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
InstanceReferenceGeometry Class
Rhino.Geometry Namespace