RhinoCommon API
HistorySettings.RecordingEnabled Property
[Missing <summary> documentation for "P:Rhino.ApplicationSettings.HistorySettings.RecordingEnabled"]
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool RecordingEnabled { get; set; }
Public Shared Property RecordingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
HistorySettings Class
Rhino.ApplicationSettings Namespace