RhinoCommon SDK
BrepEdge.EndVertex Property
 BrepVertex at end of edge
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepVertex EndVertex { get; }
Public ReadOnly Property EndVertex As BrepVertex
	Get
Property Value
Type: BrepVertex
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace