RhinoCommon SDK
File3dmWriteOptions.SaveRenderMeshes Property
 Include Render meshes in the file. Default is true
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SaveRenderMeshes { get; set; }
Public Property SaveRenderMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Obsolete (compiler warning) in 6.0 BETA
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace