RhinoCommon API
RenderContent.Category Property
 Category for this content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Category { get; }
Public ReadOnly Property Category As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
RenderContent Class
Rhino.Render Namespace