RhinoCommon API
RhinoDoc.Fonts Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.Fonts"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FontTable Fonts { get; }
Public ReadOnly Property Fonts As FontTable
	Get
Property Value
Type: FontTable
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.9
See Also
Reference
RhinoDoc Class
Rhino Namespace