RhinoCommon API
Curve.Domain Property
 Gets or sets the domain of the curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval Domain { get; set; }
Public Property Domain As Interval
	Get
	Set
Property Value
Type: Interval
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
Curve Class
Rhino.Geometry Namespace