RhinoCommon API
Extrusion.CapCount Property
 Gets the amount of capping surfaces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CapCount { get; }
Public ReadOnly Property CapCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace