RhinoCommon API
DisplayPipelineAttributes.ShowCurves Property
Draw curves
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowCurves { get; set; }
Public Property ShowCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace