RhinoCommon API
InstanceDefinitionGeometry.Description Property
 Gets or sets the description of the definition.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace