RhinoCommon API
DisplayModeDescription.EnglishName Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.EnglishName"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string EnglishName { get; set; }
Public Property EnglishName As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace