RhinoCommon API
PlugIn.WindowPositionSettings Property
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugIn.WindowPositionSettings"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PersistentSettings WindowPositionSettings { get; }
Public ReadOnly Property WindowPositionSettings As PersistentSettings
	Get
Property Value
Type: PersistentSettings
Version Information
Rhino for Windows
Supported in: 6.11
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace