RhinoCommon SDK
VisualAnalysisMode.RhinoEmapAnalysisModeId Property
 Id for Rhino's built-in emap analysis mode. An environment map is shown on sufaces and meshes.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RhinoEmapAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoEmapAnalysisModeId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace