RhinoCommon SDK
MeshingParameters.RelativeTolerance Property
 Gets or sets the relative tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double RelativeTolerance { get; set; }
Public Property RelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace