RhinoCommon API
Extrusion.PathTangent Property
 Gets the up vector of the path.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d PathTangent { get; }
Public ReadOnly Property PathTangent As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace