RhinoCommon SDK
Point2d.IsValid Property
 If any coordinate of a point is UnsetValue, then the point is not valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace