RhinoCommon API
ViewportInfo.IsValidCamera Property
 Gets a value that indicates whether the camera is valid.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValidCamera { get; }
Public ReadOnly Property IsValidCamera As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace