RhinoCommon SDK
DisplayMaterial.Emission Property
 Gets or sets the Emissive color of the Material. The alpha component of the color will be ignored.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color Emission { get; set; }
Public Property Emission As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace