RhinoCommon SDK
Brep.Vertices Property
[Missing <summary> documentation for "P:Rhino.Geometry.Brep.Vertices"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepVertexList Vertices { get; }
Public ReadOnly Property Vertices As BrepVertexList
	Get
Property Value
Type: BrepVertexList
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Brep Class
Rhino.Geometry Namespace