RhinoCommon SDK
MeshClash.ClashRadius Property
 Gets the clash, or intersection, radius.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ClashRadius { get; }
Public ReadOnly Property ClashRadius As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace