RhinoCommon SDK
GumballAppearanceSettings.ColorZ Property
Default is Blue.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ColorZ { get; set; }
Public Property ColorZ As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace