RhinoCommon SDK
ContentUuids.GlassMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.GlassMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid GlassMaterialType { get; }
Public Shared ReadOnly Property GlassMaterialType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ContentUuids Class
Rhino.Render Namespace