RhinoCommon SDK
GetLine.HaveFeedbackColor Property
 If true, the feedback color is used to draw the dynamic line when the second point is begin picked. If false, the active layer color is used.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HaveFeedbackColor { get; }
Public ReadOnly Property HaveFeedbackColor As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace