RhinoCommon API
Mesh.FaceNormals Property
 Gets access to the face normal collection in this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshFaceNormalList FaceNormals { get; }
Public ReadOnly Property FaceNormals As MeshFaceNormalList
	Get
Property Value
Type: MeshFaceNormalList
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
Mesh Class
Rhino.Geometry Namespace