RhinoCommon SDK
Matrix.IsRowOrthogonal Property
 Gets a value indicating whether the matrix is row orthogonal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsRowOrthogonal { get; }
Public ReadOnly Property IsRowOrthogonal As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Matrix Class
Rhino.Geometry Namespace