RhinoCommon API
ICollapsibleSectionHolder.SettingsPathSubKey Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSectionHolder.SettingsPathSubKey"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
string SettingsPathSubKey { set; }
WriteOnly Property SettingsPathSubKey As String
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace