RhinoCommon API
DisplayPipelineAttributes.MeshDisplayAttributes.AllMeshWiresColor Property
 Color.Empty means that we are NOT using a single color for all mesh wires.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color AllMeshWiresColor { get; set; }
Public Property AllMeshWiresColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
DisplayPipelineAttributes.MeshDisplayAttributes Class
Rhino.Display Namespace