RhinoCommon API
DisplayPipeline.IsPrinting Property
 Gets a value that indicates whether this pipeline is currently drawing for printing purposes.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPrinting { get; }
Public ReadOnly Property IsPrinting As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace