RhinoCommon API
AppearanceSettingsState.CommandPromptTextColor Property
Gets or sets the command prompt text color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color CommandPromptTextColor { get; set; }
Public Property CommandPromptTextColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace