RhinoCommon API
GumballAppearanceSettings.RotateZEnabled Property
 When RotateZ is true, the Z rotation control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RotateZEnabled { get; set; }
Public Property RotateZEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace