RhinoCommon SDK
File3dm.NamedViews Property
 Named views in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IList<ViewInfo> NamedViews { get; }
Public ReadOnly Property NamedViews As IList(Of ViewInfo)
	Get
Property Value
Type: IList<ViewInfo>
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace