RhinoCommon SDK
RenderSettings.ShadowmapLevel Property
 0=none, 1=normal, 2=best.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ShadowmapLevel { get; set; }
Public Property ShadowmapLevel As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderSettings Class
Rhino.Render Namespace