RhinoCommon SDK
Plane.Origin Property
 Gets or sets the origin point of this plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Origin { get; set; }
Public Property Origin As Point3d
	Get
	Set
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Plane Structure
Rhino.Geometry Namespace