RhinoCommon SDK
Vector3f.YAxis Property
 Gets the value of the vector with components 0,1,0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3f YAxis { get; }
Public Shared ReadOnly Property YAxis As Vector3f
	Get
Property Value
Type: Vector3f
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace