RhinoCommon API
GeneralSettings.MinimumUndoSteps Property
 Gets or sets the minimum undo steps.
Undo records will be purged if there are more than MinimumUndoSteps and they use more than MaximumUndoMemoryMb.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int MinimumUndoSteps { get; set; }
Public Shared Property MinimumUndoSteps As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.17
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace