RhinoCommon SDK
ViewInfo.Viewport Property
 Gets the viewport, or viewing frustum, associated with this view.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewportInfo Viewport { get; }
Public ReadOnly Property Viewport As ViewportInfo
	Get
Property Value
Type: ViewportInfo
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace