RhinoCommon API
PersistentSettingsEventArgs<T>.CurrentValue Property
[Missing <summary> documentation for "P:Rhino.PersistentSettingsEventArgs`1.CurrentValue"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T CurrentValue { get; set; }
Public Property CurrentValue As T
	Get
	Set
Property Value
Type: T
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
PersistentSettingsEventArgs<T> Class
Rhino Namespace