RhinoCommon API
AppearanceSettingsState.WorldCoordIconXAxisColor Property
Gets or sets the color of the world X axis of the world coordinates icon, appearing usually bottom left in viewports.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color WorldCoordIconXAxisColor { get; set; }
Public Property WorldCoordIconXAxisColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace