RhinoCommon API
Mesh.DisjointMeshCount Property
 Gets the number of disjoint (topologically unconnected) pieces in this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DisjointMeshCount { get; }
Public ReadOnly Property DisjointMeshCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
Mesh Class
Rhino.Geometry Namespace