RhinoCommon API
CommandEventArgs.DocumentRuntimeSerialNumber Property
[Missing <summary> documentation for "P:Rhino.Commands.CommandEventArgs.DocumentRuntimeSerialNumber"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint DocumentRuntimeSerialNumber { get; }
Public ReadOnly Property DocumentRuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace