RhinoCommon API
GroundPlane.Enabled Property
 Determines whether the document ground plane is enabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.7
See Also
Reference
GroundPlane Class
Rhino.Render Namespace