RhinoCommon SDK
ArcCurve.AngleDegrees Property
 Gets the angles of this arc in degrees.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double AngleDegrees { get; }
Public ReadOnly Property AngleDegrees As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace