RhinoCommon SDK
DisplayPipelineAttributes.ShowGrips Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShowGrips"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowGrips { get; set; }
Public Property ShowGrips As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace