RhinoCommon SDK
CreatePreviewEventArgs.ContentTypeId Property
 The class Id of content that preview is being generated for.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ContentTypeId { get; }
Public ReadOnly Property ContentTypeId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace