RhinoCommon SDK
FileObjWriteOptions.ObjectType Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjWriteOptions.ObjectType"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileObjWriteOptions.GeometryType ObjectType { get; set; }
Public Property ObjectType As FileObjWriteOptions.GeometryType
	Get
	Set
Property Value
Type: FileObjWriteOptions.GeometryType
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace