RhinoCommon SDK
DetailView.IsPerspectiveProjection Property
 Gets or sets whether the view is perspective.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPerspectiveProjection { get; set; }
Public Property IsPerspectiveProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DetailView Class
Rhino.Geometry Namespace