RhinoCommon API
DimensionStyle.AngularRoundoff Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AngularRoundoff"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double AngularRoundoff { get; set; }
Public Property AngularRoundoff As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace