RhinoCommon SDK
DimensionStyle.Prefix Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Prefix"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Prefix { get; set; }
Public Property Prefix As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace