RhinoCommon SDK
MeshInstance.Transform Property
 Transform for the MeshInstance
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform Transform { get; }
Public ReadOnly Property Transform As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace