RhinoCommon SDK
MeshInstance.MeshIndex Property
 Get the mesh index for this mesh instance.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int MeshIndex { get; }
Public ReadOnly Property MeshIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace