RhinoCommon API
Vector2dField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector2d Value { get; set; }
Public Property Value As Vector2d
	Get
	Set
Property Value
Type: Vector2d
Version Information
Rhino for Windows
Supported in: 6.20
See Also
Reference
Vector2dField Class
Rhino.Render.Fields Namespace