RhinoCommon API
ModelAidSettings.ProjectSnapToCPlane Property
Gets or sets the enabled state of Rhino's Project modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ProjectSnapToCPlane { get; set; }
Public Shared Property ProjectSnapToCPlane As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace