RhinoCommon API
RenderContent.TopLevelParent Property
 Returns the top content in this parent/child chain.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContent TopLevelParent { get; }
Public ReadOnly Property TopLevelParent As RenderContent
	Get
Property Value
Type: RenderContent
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
RenderContent Class
Rhino.Render Namespace