RhinoCommon API
MeshInstance.InstanceId Property
 Get the instance identifier for this mesh instance.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint InstanceId { get; }
Public ReadOnly Property InstanceId As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace