RhinoCommon SDK
ProviderIds.SelectionNavigator Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.SelectionNavigator"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid SelectionNavigator { get; }
Public Shared ReadOnly Property SelectionNavigator As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace