RhinoCommon SDK
Quaternion.LengthSquared Property
 Gets the result of (a^2 + b^2 + c^2 + d^2).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double LengthSquared { get; }
Public ReadOnly Property LengthSquared As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace