RhinoCommon API
BrepTrim.Edge Property
 Brep edge this trim belongs to. This will be null for singular trims
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepEdge Edge { get; }
Public ReadOnly Property Edge As BrepEdge
	Get
Property Value
Type: BrepEdge
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace