RhinoCommon SDK
RhinoObject.HasDynamicTransform Property
 True if the object has a dynamic transformation
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasDynamicTransform { get; }
Public ReadOnly Property HasDynamicTransform As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace