RhinoCommon SDK
ObjectEnumeratorSettings.HiddenObjects Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.HiddenObjects"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HiddenObjects { get; set; }
Public Property HiddenObjects As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace