RhinoCommon SDK
Ellipse.Radius1 Property
 Gets or sets the radius of the ellipse along the base plane X semiaxis.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Radius1 { get; set; }
Public Property Radius1 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace