RhinoCommon API
IntField.Value Property
 Gets or sets the field value
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Value { get; set; }
Public Property Value As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.8
See Also
Reference
IntField Class
Rhino.Render.Fields Namespace