RhinoCommon SDK
CustomObjectGrips.OwnerObject Property
Owner of the grips.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject OwnerObject { get; }
Public ReadOnly Property OwnerObject As RhinoObject
	Get
Property Value
Type: RhinoObject
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace