RhinoCommon API
File3dm.AllLinetypes Property
 Linetypes in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmLinetypeTable AllLinetypes { get; }
Public ReadOnly Property AllLinetypes As File3dmLinetypeTable
	Get
Property Value
Type: File3dmLinetypeTable
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
File3dm Class
Rhino.FileIO Namespace