RhinoCommon SDK
Point4d.Unset Property
 Gets the value of a point with all coordinates set as RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point4d Unset { get; }
Public Shared ReadOnly Property Unset As Point4d
	Get
Property Value
Type: Point4d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace