RhinoCommon API
Point2f.X Property
 Gets or sets the X (first) component of the vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float X { get; set; }
Public Property X As Single
	Get
	Set
Property Value
Type: Single
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace