RhinoCommon SDK
RenderSettings.RenderCurves Property
 Gets or sets a value indicating whether to instruct the rendering engine to show curves.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RenderCurves { get; set; }
Public Property RenderCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RenderSettings Class
Rhino.Render Namespace