RhinoCommon SDK
Circle.BoundingBox Property
 Gets the circle's 3d axis aligned bounding box.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Return Value
Type: BoundingBox
3d bounding box.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Circle Structure
Rhino.Geometry Namespace