RhinoCommon API
DisplayPipelineAttributes.DisableConduits Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.DisableConduits"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DisableConduits { get; set; }
Public Property DisableConduits As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.10
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace