RhinoCommon API
DimensionStyle.AlternateToleranceResolution Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateToleranceResolution"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AlternateToleranceResolution { get; set; }
Public Property AlternateToleranceResolution As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 6.16
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace