RhinoCommon SDK
Curve.SpanCount Property
 Gets the number of non-empty smooth (c-infinity) spans in the curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SpanCount { get; }
Public ReadOnly Property SpanCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Curve Class
Rhino.Geometry Namespace