RhinoCommon API
Texture.WrapW Property
 Texture wrapping mode in the W direction
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureUvwWrapping WrapW { get; set; }
Public Property WrapW As TextureUvwWrapping
	Get
	Set
Property Value
Type: TextureUvwWrapping
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Texture Class
Rhino.DocObjects Namespace