RhinoCommon API
RhinoDoc.UndoActive Property
 Returns true if Undo is currently active.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UndoActive { get; }
Public ReadOnly Property UndoActive As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.18
See Also
Reference
RhinoDoc Class
Rhino Namespace