RhinoCommon API
ObjectPropertiesPage.Icon Property
 (OBSOLETE - Override PageIcon instead) Icon to display in the object properties tab control
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Icon Icon { get; }
Public MustOverride ReadOnly Property Icon As Icon
	Get
Property Value
Type: Icon
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.5
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace