RhinoCommon API
AnnotationBase.FirstCharFont Property
 Returns the font used by the first run of text in an annotation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Font FirstCharFont { get; }
Public ReadOnly Property FirstCharFont As Font
	Get
Return Value
Type: Font
Version Information
Rhino for Windows
Supported in: 6.11
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace