RhinoCommon SDK
Curve.TangentAtEnd Property
Evaluate unit tangent vector at the end of the curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d TangentAtEnd { get; }
Public ReadOnly Property TangentAtEnd As Vector3d
	Get
Return Value
Type: Vector3d
Unit tangent vector of the curve at the end point.
Remarks
No error handling.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Curve Class
Rhino.Geometry Namespace