RhinoCommon SDK
ViewportInfo.IsCameraLocationLocked Property
 Gets or sets a value that indicates whether the camera location is unmodifiable.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCameraLocationLocked { get; set; }
Public Property IsCameraLocationLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace