RhinoCommon SDK
DimStyleTable.Item Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTable.Item(System.Int32)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As DimensionStyle
	Get
Parameters
index
Type: System.Int32
Property Value
Type: DimensionStyle
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace