RhinoCommon SDK
GumballFrame.ScaleGripDistance Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballFrame.ScaleGripDistance"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d ScaleGripDistance { get; set; }
Public Property ScaleGripDistance As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GumballFrame Structure
Rhino.UI.Gumball Namespace