RhinoCommon SDK
ViewportInfo.FrustumLeft Property
 Gets the frustum left value. This is -right if the frustum has a vertical symmetry axis.
This number is usually negative.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FrustumLeft { get; }
Public ReadOnly Property FrustumLeft As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace