RhinoCommon SDK
Line.ToX Property
 Gets or sets the X coordinate of the line To point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ToX { get; set; }
Public Property ToX As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Line Structure
Rhino.Geometry Namespace