RhinoCommon API
RevSurface.Axis Property
 Gets the axis of revolution.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line Axis { get; }
Public ReadOnly Property Axis As Line
	Get
Property Value
Type: Line
Version Information
Rhino for Windows
Supported in: 6.11
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace