RhinoCommon API
Font.Style Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Style"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Font.FontStyle Style { get; }
Public ReadOnly Property Style As Font.FontStyle
	Get
Property Value
Type: Font.FontStyle
Version Information
Rhino for Windows
Supported in: 6.4
See Also
Reference
Font Class
Rhino.DocObjects Namespace