RhinoCommon SDK
Vector3f.Y Property
 Gets or sets the Y (second) component of this vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float Y { get; set; }
Public Property Y As Single
	Get
	Set
Property Value
Type: Single
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace