RhinoCommon SDK
MeshInstance.CastShadows Property
 Return true if mesh instance should cast shadows
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CastShadows { get; }
Public ReadOnly Property CastShadows As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace