RhinoCommon SDK
GumballAppearanceSettings.ScaleGripSize Property
in pixels.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ScaleGripSize { get; set; }
Public Property ScaleGripSize As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace