RhinoCommon API
Notification.Message Property
 The message of the notification. The message is shown only when the instance is displayed modally. It should contain details about the notification.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Message { get; set; }
Public Property Message As String
	Get
	Set
Property Value
Type: String
Exceptions
Exception | Condition
InvalidOperationException | Thrown if the calling assembly cannot modify this instance
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace