RhinoCommon API
ColorXYZ.A Property
 Gets or set the Alpha channel value. Channel will be limited to 0~1.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double A { get; set; }
Public Property A As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace