RhinoCommon API
AreaMassProperties.CentroidError Property
 Gets the uncertainty in the centroid calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CentroidError { get; }
Public ReadOnly Property CentroidError As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
AreaMassProperties Class
Rhino.Geometry Namespace