RhinoCommon API
RhinoDeselectAllObjectsEventArgs.ObjectCount Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoDeselectAllObjectsEventArgs.ObjectCount"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ObjectCount { get; }
Public ReadOnly Property ObjectCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
RhinoDeselectAllObjectsEventArgs Class
Rhino.DocObjects Namespace