RhinoCommon SDK
Point.Location Property
 Gets or sets the location (position) of this point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Location { get; set; }
Public Property Location As Point3d
	Get
	Set
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Point Class
Rhino.Geometry Namespace