RhinoCommon SDK
ColorCMYK.M Property
 Gets or sets the Magenta channel value. Magenta channels are limited to the 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M { get; set; }
Public Property M As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace