RhinoCommon SDK
Text3d.TextPlane Property
 Gets or sets the 3D aligned plane for this Text3d object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane TextPlane { get; set; }
Public Property TextPlane As Plane
	Get
	Set
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Text3d Class
Rhino.Display Namespace