RhinoCommon SDK
SweepOneRail.AngleToleranceRadians Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.AngleToleranceRadians"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double AngleToleranceRadians { get; set; }
Public Property AngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace