RhinoCommon SDK
Vector2f.X Property
 Gets or sets the X (first) component of this vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float X { get; set; }
Public Property X As Single
	Get
	Set
Property Value
Type: Single
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace