RhinoCommon API
AppearanceSettings.UsePaintColors Property
 Gets or sets a value indicating if logical paint colors should be used.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool UsePaintColors { get; set; }
Public Shared Property UsePaintColors As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 6.11
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace