RhinoCommon SDK
Transform.M11 Property
Gets or sets this[1,1].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M11 { get; set; }
Public Property M11 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Transform Structure
Rhino.Geometry Namespace