RhinoCommon API
RhinoDoc.IsOpening Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.IsOpening"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsOpening { get; }
Public ReadOnly Property IsOpening As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.14
See Also
Reference
RhinoDoc Class
Rhino Namespace