RhinoCommon API
RhinoViewport.CameraZ Property
Gets the unit vector in CameraDirection.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CameraZ { get; }
Public ReadOnly Property CameraZ As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.8
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace