RhinoCommon API
RhinoApp.CurrentRhinoId Property
Gets the current ID of Rhino.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid CurrentRhinoId { get; }
Public Shared ReadOnly Property CurrentRhinoId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.4
See Also
Reference
RhinoApp Class
Rhino Namespace