RhinoCommon SDK
ObjectPropertiesPage.PageType Property
 Override this and return the page you want to replace a specific object properties page.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual PropertyPageType PageType { get; }
Public Overridable ReadOnly Property PageType As PropertyPageType
	Get
Property Value
Type: PropertyPageType
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace