RhinoCommon API
AnimationProperties.CameraPathId Property
 Gets or sets the object ID of the camera path.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid CameraPathId { get; set; }
Public Property CameraPathId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.13
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace