RhinoCommon SDK
File3dm.Notes Property
 Gets or sets the model notes.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmNotes Notes { get; set; }
Public Property Notes As File3dmNotes
	Get
	Set
Property Value
Type: File3dmNotes
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace