RhinoCommon SDK
ViewTable.ModelSpaceIsActive Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.ViewTable.ModelSpaceIsActive"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ModelSpaceIsActive { get; }
Public ReadOnly Property ModelSpaceIsActive As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace