RhinoCommon SDK
UndoRedoEventArgs.CommandId Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.CommandId"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid CommandId { get; }
Public ReadOnly Property CommandId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace