RhinoCommon API
AnimationProperties.DisplayMode Property
 Gets or sets the ID of the view display mode (wireframe, shaded...).
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid DisplayMode { get; set; }
Public Property DisplayMode As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.12
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace