RhinoCommon API
DisplayModeChangedEventArgs.ChangedDisplayModeId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeChangedEventArgs.ChangedDisplayModeId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ChangedDisplayModeId { get; }
Public ReadOnly Property ChangedDisplayModeId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 6.18
See Also
Reference
DisplayModeChangedEventArgs Class
Rhino.Display Namespace