RhinoCommon SDK
GroupTableEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.GroupTableEventArgs.EventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GroupTableEventType EventType { get; }
Public ReadOnly Property EventType As GroupTableEventType
	Get
Property Value
Type: GroupTableEventType
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace