RhinoCommon SDK
Plane.WorldYZ Property
 plane coincident with the World YZ plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Plane WorldYZ { get; }
Public Shared ReadOnly Property WorldYZ As Plane
	Get
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Plane Structure
Rhino.Geometry Namespace