RhinoCommon SDK
Arc.Diameter Property
 Gets or sets the Diameter of this arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Diameter { get; set; }
Public Property Diameter As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Arc Structure
Rhino.Geometry Namespace