RhinoCommon SDK
GetCancel.ProgressMessage Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCancel.ProgressMessage"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ProgressMessage { get; set; }
Public Property ProgressMessage As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace