RhinoCommon API
GroundPlane.Altitude Property
 Get the altitude for ground plane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Altitude { get; }
Public ReadOnly Property Altitude As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace