RhinoCommon API
Arc.Unset Property
 Gets an Arc with Unset components.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Arc Unset { get; }
Public Shared ReadOnly Property Unset As Arc
	Get
Property Value
Type: Arc
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.13
See Also
Reference
Arc Structure
Rhino.Geometry Namespace