RhinoCommon SDK
File3dm.ApplicationName Property
 Gets or sets the name of the application that wrote this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ApplicationName { get; set; }
Public Property ApplicationName As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
File3dm Class
Rhino.FileIO Namespace