RhinoCommon SDK
PanelIds.Layers Property
 Rhino Layer panel
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid Layers { get; }
Public Shared ReadOnly Property Layers As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PanelIds Class
Rhino.UI Namespace