RhinoCommon API
ViewInfo.FocalBlurAperture Property
 Gets or sets the Focal blur aperture of the active viewport
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FocalBlurAperture { get; set; }
Public Property FocalBlurAperture As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.11
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace