RhinoCommon SDK
Quaternion.D Property
 Gets or sets the third imaginary coefficient of the quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double D { get; set; }
Public Property D As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace