RhinoCommon API
RhinoApp.Name Property
Gets the application name.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string Name { get; }
Public Shared ReadOnly Property Name As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.15
See Also
Reference
RhinoApp Class
Rhino Namespace