RhinoCommon API
TextDot.FontHeight Property
 Height of font used for displaying the dot
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int FontHeight { get; set; }
Public Property FontHeight As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.11
See Also
Reference
TextDot Class
Rhino.Geometry Namespace