RhinoCommon SDK
TextureMapping.UvwTransform Property
 Transform applied to mapping coordinate (u,v,w) to convert it into a texture coordinate.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform UvwTransform { get; set; }
Public Property UvwTransform As Transform
	Get
	Set
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
TextureMapping Class
Rhino.Render Namespace