RhinoCommon SDK
BrepFace.OuterLoop Property
 Every face has a single outer loop.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepLoop OuterLoop { get; }
Public ReadOnly Property OuterLoop As BrepLoop
	Get
Property Value
Type: BrepLoop
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace