RhinoCommon API
TaskCompleteEventArgs.Task Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.TaskCompleteEventArgs.Task"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Task Task { get; set; }
Public Property Task As Task
	Get
	Set
Property Value
Type: Task
Version Information
Rhino for Windows
Supported in: 6.7
See Also
Reference
TaskCompleteEventArgs Class
Rhino.Input.Custom Namespace