RhinoCommon API
ViewSettings.PanReverseKeyboardAction Property
Gets or sets if panning with the keyboard is reversed.
false, then Rhino pans the camera in the direction of the arrow key you press. true, then Rhino pans the scene instead.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool PanReverseKeyboardAction { get; set; }
Public Shared Property PanReverseKeyboardAction As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.18
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace