RhinoCommon SDK
City.Latitude Property
 Gets latitude of city.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Latitude { get; }
Public ReadOnly Property Latitude As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
City Class
Rhino.Render Namespace