RhinoCommon SDK
VolumeMassProperties.CentroidCoordinatesMomentsOfInertiaError Property
 Uncertainty in centroid coordinates moments of inertia calculation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CentroidCoordinatesMomentsOfInertiaError { get; }
Public ReadOnly Property CentroidCoordinatesMomentsOfInertiaError As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
VolumeMassProperties Class
Rhino.Geometry Namespace