RhinoCommon SDK
File3dmObject.Name Property
 Gets or sets the Name of the object. Equivalent to this.Attributes.Name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace