RhinoCommon API
DimensionStyle.AlternateUnitsDisplay Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternateUnitsDisplay"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AlternateUnitsDisplay { get; set; }
Public Property AlternateUnitsDisplay As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.20
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace