RhinoCommon SDK
CustomRenderContentAttribute.IsBuiltIn Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderContentAttribute.IsBuiltIn"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsBuiltIn { get; set; }
Public Property IsBuiltIn As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
CustomRenderContentAttribute Class
Rhino.Render Namespace