RhinoCommon SDK
HiddenLineDrawingObjectCurve.Segments Property
 The HiddenLineDrawingCurve objects that make up this full curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HiddenLineDrawingSegment[] Segments { get; }
Public ReadOnly Property Segments As HiddenLineDrawingSegment()
	Get
Property Value
Type: HiddenLineDrawingSegment[]
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
HiddenLineDrawingObjectCurve Class
Rhino.Geometry Namespace