RhinoCommon SDK
Brep.Trims Property
 Gets the brep trims list accessor.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepTrimList Trims { get; }
Public ReadOnly Property Trims As BrepTrimList
	Get
Property Value
Type: BrepTrimList
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Brep Class
Rhino.Geometry Namespace