RhinoCommon API
Dimension.TextPosition Property
 Gets and sets the position of text on the plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d TextPosition { get; set; }
Public Property TextPosition As Point2d
	Get
	Set
Property Value
Type: Point2d
Version Information
Rhino for Windows
Supported in: 6.5
See Also
Reference
Dimension Class
Rhino.Geometry Namespace