RhinoCommon API
TimeZone.Latitude Property
 Returns the latitude of a major city nearby
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Latitude { get; }
Public ReadOnly Property Latitude As Double
	Get
Return Value
Type: Double
Latitude
Version Information
Rhino for Windows
Supported in: 6.20
See Also
Reference
TimeZone Class
Rhino.Render Namespace