RhinoCommon SDK
PointCloud.Item Property
 Gets the item at the given index.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointCloudItem this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As PointCloudItem
	Get
Parameters
index
Type: System.Int32
Index of item to retrieve.
Return Value
Type: PointCloudItem
The item at the given index.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace