RhinoCommon SDK
RuiUpdateUi.Text Property
Menu item text
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace