RhinoCommon SDK
CachedTextureCoordinates.IsReadOnly Property
 This collection is always read-only
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsReadOnly { get; }
Public ReadOnly Property IsReadOnly As Boolean
	Get
Property Value
Type: Boolean
Implements
ICollection<T>.IsReadOnly
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace