RhinoCommon SDK
IWindow.Parent Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.IWindow.Parent"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IntPtr Parent { get; set; }
Property Parent As IntPtr
	Get
	Set
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
IWindow Interface
Rhino.UI.Controls Namespace