RhinoCommon SDK
ConstructionPlane.GridYColor Property
 Gets or sets the color of the grid Y-axis mark.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color GridYColor { get; set; }
Public Property GridYColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace