RhinoCommon SDK
LinetypeTable.ByLayerLinetypeName Property
 Returns the text name of the bylayer linetype.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ByLayerLinetypeName { get; }
Public ReadOnly Property ByLayerLinetypeName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace