RhinoCommon API
Mesh Properties
The Mesh type exposes the following members.
Properties
Name | Description
Attributes
 Get object attributes of object associated to this mesh. This will be possible only after returning true from ChangeQueue.ProvideOriginalObject()
Mapping
 Get the mapping for this mesh.
SingleMapping
 Get texture mapping info as single mapping
Top
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace