RhinoCommon SDK
LinearDimension Properties
The LinearDimension type exposes the following members.
Properties
Name | Description
Aligned
 Gets or sets a value indicating whether this annotation is aligned.
AnnotationType
Arrowhead1End
 Gets the arrow head end of the first extension line.
Arrowhead2End
 Gets the arrow head end of the second extension line.
DimensionLinePoint
 Point on annotation plane where dimension line starts
DimensionStyleIndex
 Index of DimensionStyle in document DimStyle table used by the dimension.
DistanceBetweenArrowTips
 Gets the distance between arrow tips.
ExtensionLine1End
 End of the first extension line.
ExtensionLine2End
 End of the second extension line.
In Rhino for Windows 6.0 BETA, this member is inherited from .DimensionNumericValue.
In Rhino for Windows 6.0 BETA, this member is inherited from .DimensionTextFormula.
TextPosition
 Gets and sets the position of text on the plane.
In Rhino for Windows 6.0 BETA, this member is inherited from .DimensionTextPosition.
Top
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace