RhinoCommon API
Panels Properties
The Panels type exposes the following members.
Properties
Name | Description
IconSize
 Gets the panel icon size in logical units.
ScaledIconSize
 Gets the panel icon size in pixels with DPI scaling applied.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace