RhinoCommon SDK
ObjectPropertiesPage Properties
The ObjectPropertiesPage type exposes the following members.
Properties
Name | Description
EnglishPageTitle
 English string used to describe this page
Icon
 (OBSOLETE - Override PageIcon instead) Icon to display in the object properties tab control
LocalPageTitle
 Localized page description string, returns the EnglishPageTitle by default.
PageControl
 The control that represents this page. Rhino Windows supports classes that implement the IWin32Windows interface, are derived from System.Windows.FrameworkElement or Eto.Forms.Control. Mac Rhino supports controls that are derived from NSview or Eto.Forms.Control.
PageType
 Override this and return the page you want to replace a specific object properties page.
SelectedObjects
 Return a list of Rhino objects to be processed by this object properties page
SupportedTypes
 Override to specify which objects this page supports
SupportsSubObjects
 If your object properties page supports sub-object selection, you should override this method and return true. This is ignored for view pages. The default implementation returns false.
Top
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace