RhinoCommon SDK
Material Properties
The Material type exposes the following members.
Properties
Name | Description
Id
 Get the material ID (crc)
MeshIndex
 Get mesh index
MeshInstanceId
 Get the material InstanceAncestry
Top
See Also
Reference
Material Class
Rhino.Render.ChangeQueue Namespace