RhinoCommon SDK
RhinoDeselectAllObjectsEventArgs Class
[Missing <summary> documentation for "T:Rhino.DocObjects.RhinoDeselectAllObjectsEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoDeselectAllObjectsEventArgs
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoDeselectAllObjectsEventArgs : EventArgs
Public Class RhinoDeselectAllObjectsEventArgs
	Inherits EventArgs
The RhinoDeselectAllObjectsEventArgs type exposes the following members.
Properties
Name | Description
Document
ObjectCount
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.2 BETA
See Also
Reference
Rhino.DocObjects Namespace