RhinoCommon API
RhinoObjectEventArgs Class
[Missing <summary> documentation for "T:Rhino.DocObjects.RhinoObjectEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoObjectEventArgs
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoObjectEventArgs : EventArgs
Public Class RhinoObjectEventArgs
	Inherits EventArgs
The RhinoObjectEventArgs type exposes the following members.
Properties
Name | Description
ObjectId
TheObject
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
Rhino.DocObjects Namespace