RhinoCommon API
BrepLoop Class
 Represent a single loop in a Brep object. A loop is composed of a list of trim curves.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.BrepLoop
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class BrepLoop : GeometryBase
Public Class BrepLoop
	Inherits GeometryBase
The BrepLoop type exposes the following members.
Properties
Name | Description
Brep
 Gets the Brep that owns this loop.
Face
 BrepFace this loop belongs to.
LoopIndex
 Gets the index of this loop in the Brep.Loops collection.
LoopType
 type of loop.
Trims
 List of trims for this loop
Top
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
To2dCurve
 Create a 2d curve that traces the entire loop
To3dCurve
 Create a 3D curve that approximates the loop geometry.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.20
See Also
Reference
Rhino.Geometry Namespace