RhinoCommon API
PreviewAppearance Class
 PreviewAppearance class
Inheritance Hierarchy
System.Object
 Rhino.Render.PreviewAppearance
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class PreviewAppearance : IDisposable
Public NotInheritable Class PreviewAppearance
	Implements IDisposable
The PreviewAppearance type exposes the following members.
Constructors
Name | Description
PreviewAppearance
 Constructor for previewappearance
Top
Properties
Name | Description
CppPointer
 Previewappearances c++ pointer
MetaData
 Previewappearance MetaData
Top
Methods
Name | Description
Background
 Background
Dispose
 Dispose for previewappearance
Finalize
 Destructor for previewappearance
 (Overrides Object.Finalize().)
FromMetaData
 Copy data from MetaData to PreviewAppearance
Geometry
 Geometry
Lighting
 Lighting
RotationType
 RotationType
RotationX
 RotationX
RotationY
 RotationY
SetRotationType
 SetRotationType
SetRotationX
 SetRotationX
SetRotationY
 SetRotationY
SetSize
 SetSize
Size
 Size
ToMetaData()
 Copy PreviewAppearance to MetaData
ToMetaData(MetaDataProxy)
 Copy PreviewAppearance to MetaData
Top
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
Rhino.Render Namespace