RhinoCommon SDK
TextDisplayAlignment Enumeration
 Defines enumerated values for the line alignment of text.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextDisplayAlignment
Public Enumeration TextDisplayAlignment
Members
Member name | Value | Description
Normal | 0 |  Normal alignment.
Horizontal | 1 |  Horizontal alignment.
AboveLine | 2 |  Above line alignment.
InLine | 3 |  In line alignment.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.DocObjects Namespace