RhinoCommon SDK
RenderMaterialTable Class
[Missing <summary> documentation for "T:Rhino.Render.RenderMaterialTable"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderMaterialTable
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class RenderMaterialTable : IEnumerable<RenderMaterial>,
	IEnumerable
Public NotInheritable Class RenderMaterialTable
	Implements IEnumerable(Of RenderMaterial), IEnumerable
The RenderMaterialTable type exposes the following members.
Properties
Name | Description
Count
Item
Top
Methods
Name | Description
Add
GetEnumerator
Remove
Top
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Render Namespace