RhinoCommon API
GetFileNameMode Enumeration
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetFileNameMode"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum GetFileNameMode
Public Enumeration GetFileNameMode
Members
Member name | Value | Description
Open | 0
OpenTemplate | 1
OpenImage | 2
OpenRhinoOnly | 3
OpenTextFile | 5
OpenWorksession | 6
Import | 7
Attach | 8
Save | 10
SaveSmall | 11
SaveTemplate | 12
SaveImage | 13
Export | 14
SaveTextFile | 17
SaveWorksession | 18
LoadPlugIn | 9
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.Input.Custom Namespace