RhinoCommon API
Dimension Class
 Base class for dimensions
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.AngularDimension
 Rhino.Geometry.Centermark
 Rhino.Geometry.LinearDimension
 Rhino.Geometry.OrdinateDimension
 Rhino.Geometry.RadialDimension
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public abstract class Dimension : AnnotationBase
<SerializableAttribute>
Public MustInherit Class Dimension
	Inherits AnnotationBase
The Dimension type exposes the following members.
Constructors
Name | Description
Dimension()
Initializes a new instance of the Dimension class
Dimension(SerializationInfo, StreamingContext)
Initializes a new instance of the Dimension class
Top
Properties
Name | Description
AlternateBelowLine
AltLengthFactor
AltLengthResolution
AltLengthRoundoff
AltPrefix
AltSuffix
AltToleranceResolution
AltUnitsDisplay
AltZeroSuppression
ArrowBlockId1
ArrowBlockId2
ArrowheadType1
ArrowheadType2
ArrowSize
BaselineSpacing
CentermarkSize
CentermarkStyle
DetailMeasured
DimensionLineExtension
DistanceScale
ExtensionLineExtension
ExtensionLineOffset
FixedExtensionLength
FixedLengthExtensionOn
ForceArrowPosition
ForceTextPosition
LengthFactor
LengthResolution
LengthRoundoff
NumericValue
 Gets the numeric value (or measurement), depending on geometry type.
LinearDimension: distance between arrow tips
RadialDimension: radius or diamater depending on type
AngularDimension: angle in degrees
PlainUserText
Prefix
Suffix
SuppressExtension1
SuppressExtension2
TextAngleType
TextFormula
TextLocation
TextOrientation
TextPosition
 Gets and sets the position of text on the plane.
TextRotation
ToleranceFormat
ToleranceHeightScale
ToleranceLowerValue
ToleranceResolution
ToleranceUpperValue
UseDefaultTextPoint
ZeroSuppression
Top
Methods
Name | Description
GetTextTransform
 Get the transform for this text object's text geometry
SetAltDimensionLengthDisplayWithZeroSuppressionReset
SetDimensionLengthDisplayWithZeroSuppressionReset
Top
Version Information
Rhino for Windows
Supported in: 6.18
See Also
Reference
Rhino.Geometry Namespace