RhinoCommon API
GetColorEventArgs Class
[Missing <summary> documentation for "T:Rhino.UI.GetColorEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.UI.GetColorEventArgs
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetColorEventArgs : EventArgs
Public Class GetColorEventArgs
	Inherits EventArgs
The GetColorEventArgs type exposes the following members.
Properties
Name | Description
IncludeButtonColors
InputColor
SelectedColor
Title
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.9
See Also
Reference
Rhino.UI Namespace