RhinoCommon API
RdkModalEditContentBucket Class
[Missing <summary> documentation for "T:Rhino.Render.DataSources.RdkModalEditContentBucket"]
Inheritance Hierarchy
System.Object
 Rhino.Render.DataSources.RdkModalEditContentBucket
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RdkModalEditContentBucket : IDisposable
Public Class RdkModalEditContentBucket
	Implements IDisposable
The RdkModalEditContentBucket type exposes the following members.
Constructors
Name | Description
RdkModalEditContentBucket
Initializes a new instance of the RdkModalEditContentBucket class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
ContentsIn
Dispose
Releases all resources used by the RdkModalEditContentBucket
Finalize |  (Overrides Object.Finalize().)
SetContentsOut
Top
Version Information
Rhino for Windows
Supported in: 6.12
See Also
Reference
Rhino.Render.DataSources Namespace