RhinoCommon API
UndoRedoEventArgs Class
[Missing <summary> documentation for "T:Rhino.Commands.UndoRedoEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Commands.UndoRedoEventArgs
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class UndoRedoEventArgs : EventArgs
Public Class UndoRedoEventArgs
	Inherits EventArgs
The UndoRedoEventArgs type exposes the following members.
Properties
Name | Description
CommandId
IsBeginRecording
IsBeginRedo
IsBeginUndo
IsEndRecording
IsEndRedo
IsEndUndo
IsPurgeRecord
UndoSerialNumber
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
Rhino.Commands Namespace