RhinoCommon SDK
RenderEnvironment Class
[Missing <summary> documentation for "T:Rhino.Render.RenderEnvironment"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderContent
 Rhino.Render.RenderEnvironment
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class RenderEnvironment : RenderContent
Public MustInherit Class RenderEnvironment
	Inherits RenderContent
The RenderEnvironment type exposes the following members.
Constructors
Name | Description
RenderEnvironment
Initializes a new instance of the RenderEnvironment class
Top
Properties
Name | Description
CurrentEnvironment |  Obsolete.
TextureChildSlotName
Top
Methods
Name | Description
NewBasicEnvironment
 Constructs a new RenderEnvironment from a SimulatedEnvironment.
SimulateEnvironment(Boolean)
SimulateEnvironment(SimulatedEnvironment, Boolean)
Top
Version Information
Rhino for Windows
Supported in: 6.2
See Also
Reference
Rhino.Render Namespace