RhinoCommon SDK
HatchPatternFillType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.HatchPatternFillType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum HatchPatternFillType
Public Enumeration HatchPatternFillType
Members
Member name | Value | Description
Solid | 0
Lines | 1
Gradient | 2
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.DocObjects Namespace