RhinoCommon API
Dimension.ForceText Enumeration
 Text forced Inside, Right or Left of extension lines, or moved to fit (Auto).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ForceText
Public Enumeration ForceText
Members
Member name | Value | Description
Auto | 0
Inside | 1
Right | 2
Left | 3
HintRight | 4 |  If override isn't specified and text doesn't fit, move it right
HintLeft | 5 |  If override isn't specified and text doesn't fit, move it left
Version Information
Rhino for Windows
Supported in: 6.12
See Also
Reference
Rhino.Geometry Namespace