RhinoCommon SDK
CurveExtensionStyle Enumeration
 Defines enumerated values for styles to use during curve extension, such as "Line", "Arc" or "Smooth".
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CurveExtensionStyle
Public Enumeration CurveExtensionStyle
Members
Member name | Value | Description
Line | 0 |  Curve ends will be propagated linearly according to tangents.
Arc | 1 |  Curve ends will be propagated arc-wise according to curvature.
Smooth | 2 |  Curve ends will be propagated smoothly according to curvature.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Geometry Namespace