RhinoCommon SDK
LineSphereIntersection Enumeration
 Represents all possible cases of a Line|Sphere intersection event.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LineSphereIntersection
Public Enumeration LineSphereIntersection
Members
Member name | Value | Description
None | 0 |  No intersections.
Single | 1 |  One intersection.
Multiple | 2 |  Two intersections.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Geometry.Intersect Namespace