RhinoCommon SDK
CustomBrepObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.CustomBrepObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.BrepObject
 Rhino.DocObjects.Custom.CustomBrepObject
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class CustomBrepObject : BrepObject,
	IDisposable
Public MustInherit Class CustomBrepObject
	Inherits BrepObject
	Implements IDisposable
The CustomBrepObject type exposes the following members.
Constructors
Name | Description
CustomBrepObject()
Initializes a new instance of the CustomBrepObject class
CustomBrepObject(Brep)
Initializes a new instance of the CustomBrepObject class
Top
Properties
Name | Description
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
In Rhino for Windows 6.0, this member is inherited from .CommonObjectIsValid.
Top
Methods
Name | Description
Dispose()
Releases all resources used by the CustomBrepObject
In Rhino for Windows 6.0, this member is inherited from .CommonObjectDispose().
Dispose(Boolean)
Releases the unmanaged resources used by the CustomBrepObject and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
Rhino.DocObjects.Custom Namespace