RhinoCommon API
MouseCallbackEventArgs Class
[Missing <summary> documentation for "T:Rhino.UI.MouseCallbackEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 System.ComponentModel.CancelEventArgs
 Rhino.UI.MouseCallbackEventArgs
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class MouseCallbackEventArgs : CancelEventArgs
Public Class MouseCallbackEventArgs
	Inherits CancelEventArgs
The MouseCallbackEventArgs type exposes the following members.
Properties
Name | Description
Button
CtrlKeyDown
MouseButton
ShiftKeyDown
View
ViewportPoint
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.6
See Also
Reference
Rhino.UI Namespace