RhinoCommon SDK
DepthMode Enumeration
[Missing <summary> documentation for "T:Rhino.Display.DepthMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum DepthMode
Public Enumeration DepthMode
Members
Member name | Value | Description
Neutral | 0
AlwaysInFront | 1
AlwaysInBack | 2
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Display Namespace