RhinoCommon SDK
ShowMessageResult Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageResult"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ShowMessageResult
Public Enumeration ShowMessageResult
Members
Member name | Value | Description
None | 0
OK | 1
Cancel | 2
Abort | 3
Retry | 4
Ignore | 5
Yes | 6
No | 7
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.UI Namespace