RhinoCommon API
BackgroundStyle Enumeration
 Constants that define how the background of a viewport should be filled.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum BackgroundStyle
Public Enumeration BackgroundStyle
Members
Member name | Value | Description
SolidColor | 0 | Single solid color fill.
WallpaperImage | 1 | Simple image background wallpaper.
Gradient | 2 | Two color top/bottom color gradient.
Environment | 3 | Using a special environment.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
Rhino.Display Namespace