RhinoCommon API
AssignBys Enumeration
[Missing <summary> documentation for "T:Rhino.Render.DataSources.AssignBys"]
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum AssignBys
Public Enumeration AssignBys
Members
Member name | Value | Description
Unset | 0
Layer | 1
Parent | 2
Object | 3
Varies | 4
PlugIn | 5
Version Information
Rhino for Windows
Supported in: 6.11
See Also
Reference
Rhino.Render.DataSources Namespace