RhinoCommon SDK
ToolbarGroup Class
[Missing <summary> documentation for "T:Rhino.UI.ToolbarGroup"]
Inheritance Hierarchy
System.Object
 Rhino.UI.ToolbarGroup
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class ToolbarGroup
Public NotInheritable Class ToolbarGroup
The ToolbarGroup type exposes the following members.
Properties
Name | Description
Id
IsDocked
Name
Visible
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.0
See Also
Reference
Rhino.UI Namespace