RhinoCommon SDK
NurbsCurve.NurbsCurveEndConditionType Enumeration
 What end conditions to set
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum NurbsCurveEndConditionType
Public Enumeration NurbsCurveEndConditionType
Members
Member name | Value | Description
Nothing | 0 |  Set nothing
Position | 1 |  Set endpoint
Tangency | 2 |  Set tangent
Curvature | 3 |  Set curvature
Version Information
Rhino for Windows
Supported in: 6.0
See Also
Reference
Rhino.Geometry Namespace