RhinoCommon SDK
ShowMessageDefaultButton Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageDefaultButton"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ShowMessageDefaultButton
Public Enumeration ShowMessageDefaultButton
Members
Member name | Value | Description
Button1 | 0
Button2 | 256
Button3 | 512
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.UI Namespace