RhinoCommon SDK
IRhRdkThumbnailList_Shapes Enumeration
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Shapes"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum IRhRdkThumbnailList_Shapes
Public Enumeration IRhRdkThumbnailList_Shapes
Members
Member name | Value | Description
Square | 0 | Square thumbnails.
Wide | 1 | Wide thumbnails.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace