RhinoCommon SDK
DimensionStyle.ArrowType Enumeration
 Defines enumerated values for arrowhead shapes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ArrowType
Public Enumeration ArrowType
Members
Member name | Value | Description
None | 0
UserBlock | 1
SolidTriangle | 2
Dot | 3
Tick | 4
ShortTriangle | 5
OpenArrow | 6
Rectangle | 7
LongTriangle | 8
LongerTriangle | 9
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.DocObjects Namespace