RhinoCommon SDK
IPanelsService Interface
 For internal use, the IPanels service is implemented in RhinoWindows or RhinoMac as appropriate and handles the communication with core Rhino
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IPanelsService
Public Interface IPanelsService
The IPanelsService type exposes the following members.
Methods
Name | Description
ChangePanelIcon
ClosePanel
GetOpenPanelIds
GetPanel(Guid)
GetPanel(Guid, UInt32)
IsPanelVisible(Guid)
IsPanelVisible(Guid, Boolean)
OpenPanel(Guid)
OpenPanel(Guid, Guid)
OpenPanel(Guid, Boolean)
OpenPanel(Guid, Guid, Boolean)
OpenPanelAsSibling(Guid, Guid)
OpenPanelAsSibling(Guid, Guid, Boolean)
PanelDockBar
RegisterPanel
Top
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.UI Namespace