RhinoCommon SDK
HiddenLineDrawingObject Class
 Represents an object added to a HiddenLineDrawing
Inheritance Hierarchy
System.Object
 Rhino.Geometry.HiddenLineDrawingObject
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class HiddenLineDrawingObject
Public NotInheritable Class HiddenLineDrawingObject
The HiddenLineDrawingObject type exposes the following members.
Properties
Name | Description
Geometry
 Returns the geometry in world coordinates if UseXform is false. Otherwise, the geometry in object space coordinates is returned.
Tag
 Returns the extra data used to cross-reference the object specified in HiddenLineDrawing.AddObject.
Transform
 Returns the transformation passed into the Add... function when setting up the hidden line drawing parameters.
Top
Methods
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Geometry Namespace