RhinoCommon SDK
MouseButton Enumeration
[Missing <summary> documentation for "T:Rhino.UI.MouseButton"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[FlagsAttribute]
public enum MouseButton
<FlagsAttribute>
Public Enumeration MouseButton
Members
Member name | Value | Description
None | 0
Left | 1
Right | 2
Middle | 4
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.UI Namespace