RhinoCommon API
ProxyTypes Enumeration
 Defines the proxy type of the render content
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ProxyTypes
Public Enumeration ProxyTypes
Members
Member name | Value | Description
None | 0
Single | 1
Multi | 2
Version Information
Rhino for Windows
Supported in: 6.17
See Also
Reference
Rhino.Render Namespace