RhinoCommon SDK
RenderContent.ExtraRequirementsSetContexts Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderContent.ExtraRequirementsSetContexts"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ExtraRequirementsSetContexts
Public Enumeration ExtraRequirementsSetContexts
Members
Member name | Value | Description
UI | 0 |  Setting extra requirement as a result of user activity.
Drop | 1 |  Setting extra requirement as a result of drag and drop.
Program | 2 |  Setting extra requirement as a result of other (non-user) program activity.
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Render Namespace