RhinoCommon SDK
ZBiasMode Enumeration
 Baising applied to geometry to attempt to get coplanar items to draw on top of or below other geometry
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ZBiasMode
Public Enumeration ZBiasMode
Members
Member name | Value | Description
Neutral | 0
TowardsCamera | 1
AwayFromCamera | 2
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Display Namespace