RhinoCommon API
TextDot Class
 Represents a text dot, or an annotation entity with text that always faces the camera and always has the same size.
This class refers to the geometric element that is independent from the document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.TextDot
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class TextDot : GeometryBase
<SerializableAttribute>
Public Class TextDot
	Inherits GeometryBase
The TextDot type exposes the following members.
Constructors
Name | Description
TextDot(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
TextDot(String, Point3d)
 Initializes a new textdot based on the text and the location.
Top
Properties
Name | Description
FontFace
Font face used for displaying the dot
FontHeight
 Height of font used for displaying the dot
Point
 Gets or sets the position of the textdot.
SecondaryText
 Gets or sets the secondary text of the textdot.
Text
 Gets or sets the primiary text of the textdot.
Top
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.5
See Also
Reference
Rhino.Geometry Namespace