RhinoCommon API
ClippingPlane Class
 ChangeQueue clipping plane
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.ClippingPlane
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ClippingPlane
Public Class ClippingPlane
The ClippingPlane type exposes the following members.
Properties
Name | Description
Attributes
 Get the ClippingPlaneObject for this clipping plane
Id
 Get Guid for this clipping plane
IsEnabled
 True if clipping plane is enabled
Plane
 Get the plane that represents this clipping plane
ViewIds
 Get list of View IDs this clipping plane is supposed to clip.
Top
Methods
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 6.20
See Also
Reference
Rhino.Render.ChangeQueue Namespace