RhinoCommon SDK
IRhRdkThumbnailList Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IRhRdkThumbnailList
Public Interface IRhRdkThumbnailList
The IRhRdkThumbnailList type exposes the following members.
Methods
Name | Description
Add
Clear
Get
GetGridMetrics
GetSize
GetStatisticsHeaderHeight
Mode
SetClientText
SetCustomBitmapSize
SetMode
SetShowLabels
Shape
ShowLabels
UUID
Top
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.UI.Controls.ThumbnailUI Namespace