RhinoCommon API
LicenseNode Enumeration
License node types.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LicenseNode
Public Enumeration LicenseNode
Members
Member name | Value | Description
Standalone | 0 | An independent node.
Network | 1 | Network (obtains license from Zoo server)
NetworkCheckedOut | 2 | Network (has license checked out from Zoo server)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
Rhino.ApplicationSettings Namespace