RhinoCommon API
CurvatureAnalysisSettings Class
 Contains static methods and properties to modify curvature analysis-related commands.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.CurvatureAnalysisSettings
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class CurvatureAnalysisSettings
Public NotInheritable Class CurvatureAnalysisSettings
The CurvatureAnalysisSettings type exposes the following members.
Properties
Name | Description
GaussRange
 Gets or sets the Gaussian curvature range.
MaxRadiusRange
 Gets or sets the Maximum Radius curvature range.
MeanRange
 Gets or sets the Mean curvature range.
MinRadiusRange
 Gets or sets the Minimum Radius curvature range.
Style
 Gets or sets the curvature analysis style.
Top
Methods
Name | Description
CalculateCurvatureAutoRange
GetCurrentState
 Gets the current settings of the application.
GetDefaultState
 Gets the factory settings of the application.
RestoreDefaults
 Commits the default settings as the current settings.
UpdateFromState
 Sets all settings to a particular defined joined state.
Top
Version Information
Rhino for Windows
Supported in: 6.7
See Also
Reference
Rhino.ApplicationSettings Namespace