RhinoCommon SDK
GetString Class
Used to get strings.
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetBaseClass
 Rhino.Input.Custom.GetString
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetString : GetBaseClass
Public Class GetString
	Inherits GetBaseClass
The GetString type exposes the following members.
Constructors
Name | Description
GetString
 Constructs a new GetString.
Top
Methods
Name | Description
Get
Returns the string that the user typed. By default, space stops the string input.
GetLiteralString
Returns the string that the user typed. By default, space does not stop input.
Top
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Input.Custom Namespace