RhinoCommon SDK
Point Class
 Represents a geometric point.
This is fundamentally a class that derives from GeometryBase and contains a single Point3d location.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Point
 Rhino.Geometry.BrepVertex
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class Point : GeometryBase
<SerializableAttribute>
Public Class Point
	Inherits GeometryBase
The Point type exposes the following members.
Constructors
Name | Description
Point(Point3d)
 Initializes a new point instance with a location.
Point(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
Location
 Gets or sets the location (position) of this point.
Top
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Geometry Namespace