RhinoCommon SDK
TextureUvwWrapping Enumeration
 Defines Texture UVW wrapping modes
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextureUvwWrapping
Public Enumeration TextureUvwWrapping
Members
Member name | Value | Description
Repeat | 0 |  Repeat the texture
Clamp | 1 |  Clamp the texture
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.DocObjects Namespace