RhinoCommon SDK
Font Class
Defines a format for text.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Font
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Font
Public Class Font
The Font type exposes the following members.
Constructors
Name | Description
Font(String)
Initializes a new instance of the Font class
Font(String, Font.FontWeight, Font.FontStyle, Boolean, Boolean)
Initializes a new instance of the Font class
Top
Properties
Name | Description
Bold
FaceName
Italic
PointSize
Strikeout
Style
Underlined
Weight
Top
Methods
Name | Description
AvailableFontFaceNames
Top
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.DocObjects Namespace