RhinoCommon SDK
Material Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Material"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.Material
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class Material : CommonObject
<SerializableAttribute>
Public Class Material
	Inherits CommonObject
The Material type exposes the following members.
Constructors
Name | Description
Material()
Initializes a new instance of the Material class
Material(Material)
Initializes a new instance of the Material class
Material(SerializationInfo, StreamingContext)
Initializes a new instance of the Material class
Top
Properties
Name | Description
AlphaTransparency
AmbientColor
ComponentType
 Returns RenderMaterial.
 (Overrides ModelComponent.ComponentType.)
DefaultMaterial
DiffuseColor
DisableLighting
EmissionColor
FresnelIndexOfRefraction
 Gets or sets the Fresnel index of refraction of the material, default is 1.56
FresnelReflections
 Gets or sets if fresnel reflections are used.
Id
Gets or sets the ID of this material.
In Rhino for Windows 6.1 BETA, this member is inherited from .ModelComponentId.
IndexOfRefraction
 Gets or sets the index of refraction of the material, generally >= 1.0 (speed of light in vacuum)/(speed of light in material)
IsDefaultMaterial
 By default Rhino layers and objects are assigned the default rendering material.
IsDeleted
 Deleted materials are kept in the runtime material table so that undo will work with materials. Call IsDeleted to determine to determine if a material is deleted.
IsDocumentControlled
 If true this object may not be modified. Any properties or functions that attempt to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
 (Overrides CommonObject.IsDocumentControlled.)
IsReference
 Rhino allows multiple files to be viewed simultaneously. Materials in the document are "normal" or "reference". Reference materials are not saved.
IsSystemComponent
 True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
MaterialIndex
MaxShine
Name
ReflectionColor
ReflectionGlossiness
 Gets or sets the reflection glossiness.
Reflectivity
 Gets or sets how reflective a material is, 0f is no reflection 1f is 100% reflective.
RefractionGlossiness
 Gets or sets the refraction glossiness.
RenderMaterial
 Get the RenderMaterial related to this Material. Will create a new RenderMaterial if none exists. This can happen for older documents.
RenderMaterialInstanceId
RenderPlugInId
 The Id of the RenderPlugIn that is associated with this material.
Shine
 Gets or sets the shine factor of the material.
SpecularColor
Transparency
 Gets or sets the transparency of the material (0.0 = opaque to 1.0 = transparent)
TransparentColor
UseCount
 Number of objects and layers that use this material.
UserStringCount
Top
Methods
Name | Description
CommitChanges
CopyFrom
Default
 Set material to default settings.
GetBitmapTexture
GetBumpTexture
 Gets the bump texture of this material.
GetEnvironmentTexture
GetTextures
 Get array of textures that this material uses
GetTransparencyTexture
GetUserString
 Gets a user string.
GetUserStrings
 Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
OnSwitchToNonConst |  (Overrides CommonObject.OnSwitchToNonConst().)
SetBitmapTexture(String)
SetBitmapTexture(Texture)
SetBumpTexture(String)
SetBumpTexture(Texture)
SetEnvironmentTexture(String)
SetEnvironmentTexture(Texture)
SetTransparencyTexture(String)
SetTransparencyTexture(Texture)
SetUserString
 Attach a user string (key,value combination) to this geometry.
Top
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.1 BETA
See Also
Reference
Rhino.DocObjects Namespace