RhinoCommon SDK
PlaneFitResult Enumeration
 Enumerates all possible outcomes of a Least-Squares plane fitting operation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum PlaneFitResult
Public Enumeration PlaneFitResult
Members
Member name | Value | Description
Failure | -1 |  No plane could be found.
Success | 0 |  A plane was successfully fitted.
Inconclusive | 1 |  A valid plane was found, but it is an inconclusive result. This might happen with co-linear points for example.
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Geometry Namespace