RhinoCommon SDK
Font.FontStyle Enumeration
 Vertical angle of font Upright, Italic, or Oblique
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum FontStyle
Public Enumeration FontStyle
Members
Member name | Value | Description
Unset | 0 |  Not set.
Upright | 1 |  Default font style.
Italic | 2
Oblique | 3
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.DocObjects Namespace