RhinoCommon SDK
DimensionStyle.StackDisplayFormat Enumeration
 Format of stacked fractions
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum StackDisplayFormat
Public Enumeration StackDisplayFormat
Members
Member name | Value | Description
None | 0 |  No stacking
StackHorizontal | 1 |  Stack with horizontal line
StackDiagonal | 2 |  Stack with angled line
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.DocObjects Namespace