RhinoCommon API
CommandPromptPosition Enumeration
 Defines enumerated constant values for default positions of the command prompt inside the frame of the full editor window.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum CommandPromptPosition
Public Enumeration CommandPromptPosition
Members
Member name | Value | Description
Top | 0 | The command prompt is shown on top.
Bottom | 1 | The command prompt is shown at the bottom.
Floating | 2 | The command prompt is shown floating.
Hidden | 3 | The command prompt is shown hidden.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.12
See Also
Reference
Rhino.ApplicationSettings Namespace