RhinoCommon SDK
ClippingPlaneSurface Class
 Represents a planar surface that is used as clipping plane in viewports.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.PlaneSurface
 Rhino.Geometry.ClippingPlaneSurface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class ClippingPlaneSurface : PlaneSurface
<SerializableAttribute>
Public Class ClippingPlaneSurface
	Inherits PlaneSurface
The ClippingPlaneSurface type exposes the following members.
Constructors
Name | Description
ClippingPlaneSurface
 Protected constructor for internal use.
Top
Properties
Name | Description
Plane
 Gets or sets the clipping plane.
Top
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
In Rhino for Windows, this member is overridden by NonConstOperation().
ViewportIds
 Returns Ids of viewports that this clipping plane is supposed to clip.
Top
Version Information
Rhino for Mac
Supported in: 5.4 WIP
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.Geometry Namespace