RhinoCommon API
ObjectDecoration Enumeration
 Defines bit mask values to represent object decorations.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[FlagsAttribute]
public enum ObjectDecoration
<FlagsAttribute>
Public Enumeration ObjectDecoration
Members
Member name | Value | Description
None | 0 | There are no object decorations.
StartArrowhead | 8 | Arrow head at start.
EndArrowhead | 16 | Arrow head at end.
BothArrowhead | 24 | Arrow head at start and end.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.14
See Also
Reference
Rhino.DocObjects Namespace