RhinoCommon API
StatusBar Class
 Contains static methods to control the application status bar.
Inheritance Hierarchy
System.Object
 Rhino.UI.StatusBar
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class StatusBar
Public NotInheritable Class StatusBar
The StatusBar type exposes the following members.
Methods
Name | Description
ClearMessagePane
 Removes the message from the message pane.
HideProgressMeter
 Ends, or hides, Rhino's status bar progress meter.
SetDistancePane
 Sets the distance pane to a distance value.
SetMessagePane
 Sets the message pane to a message.
SetNumberPane
 Sets the number pane to a number value
SetPointPane
 Sets the point pane to a point value.
ShowProgressMeter
 Starts, or shows, Rhino's status bar progress meter.
UpdateProgressMeter
 Sets the current position of Rhino's status bar progress meter.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.7
See Also
Reference
Rhino.UI Namespace