RhinoCommon SDK
DimensionStyle.MaskType Enumeration
 Text mask drawn with background color or explicit color
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MaskType
Public Enumeration MaskType
Members
Member name | Value | Description
BackgroundColor | 0 |  Text mask drawn with background color
MaskColor | 1 |  Text mask drawn with explicit color
Version Information
Rhino for Windows
Supported in: 6.0 BETA
See Also
Reference
Rhino.DocObjects Namespace