RhinoCommon API
GetPointMouseEventArgs Class
 Arguments for mouse information during point getting.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Input.Custom.GetPointMouseEventArgs
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetPointMouseEventArgs : EventArgs
Public Class GetPointMouseEventArgs
	Inherits EventArgs
The GetPointMouseEventArgs type exposes the following members.
Properties
Name | Description
ControlKeyDown
LeftButtonDown
MiddleButtonDown
Point
RightButtonDown
ShiftKeyDown
Source
Viewport
WindowPoint
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 6.16
See Also
Reference
Rhino.Input.Custom Namespace